[
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`tips`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`city` = 'Goodyear')\nRETURN sum(`t2`.`likes`) AS `likes`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Sum up the likes get by short reviews on businesses located in City Goodyear.",
    "evidence": "short reviews refer to tip_length = 'Short';",
    "idx": 3089
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`business_hours`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`city` = 'El Mirage' AND `t1`.`state` = 'AZ')\nRETURN sum(toFloat(`t2`.`closing_time`) - toFloat(`t2`.`opening_time`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much time do businesses in El Mirage City, AZ State operate in average daily?",
    "evidence": "how much time does this business open refers to SUBTRACT(closing_time, opening_time); DIVIDE(SUM(SUBTRACT(closing_time, opening_time)), SUM(Business.business_id))",
    "idx": 3091
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`attributes`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t1`.`attribute_name` = 'ambience_romantic' AND `t2`.`attribute_value` = 'true')\nRETURN COUNT(`t2`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Sum up the number of business with \"ambience_romantic\" attribute.",
    "evidence": "\"ambience_romantic\" attribute refers to attribute_name = 'ambience_romantic' AND attribute_value = 'true'",
    "idx": 3094
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`stars` > 3 AND `business`.`city` = 'Paradise Valley' AND `business`.`review_count` = 'Low'\nRETURN `business`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List by ID the businesses with the reviews with the lowest veracity of Paradise Valley.",
    "evidence": "ID of businesses refers to business_id; reviews with the lowest veracity refers to review_count = 'Low' AND stars > 3; Paradise Valley is a city",
    "idx": 3098
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business_hours`)\nMATCH (`t2`:`days`)\nWHERE `t1`.`day_id` = `t2`.`day_id`\nAND (`t1`.`day_id` = 1)\nRETURN `t1`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List by their id all businesses that are open on Sunday.",
    "evidence": "day_of_week = 'Sunday'; open on Sunday refers to day_id = 1",
    "idx": 3103
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`review_count` = 'High' AND `business`.`city` = 'Tempe'\nRETURN `business`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the business ID with a high review count in Tempe.",
    "evidence": "Tempe is a city; high review count refers to review_count = 'High'",
    "idx": 3109
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`stars` >= 3 AND `business`.`stars` < 6 AND `business`.`city` = 'Chandler'\nRETURN `business`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the business ID with a star range from 3 to 5, located at Chandler.",
    "evidence": "businesses with a star range from 3 to 5 refers to stars BETWEEN 3 AND 5; Chandler is a city",
    "idx": 3111
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (`t1`:`paper`)-[has_content_0:has_content]->(`t2`:`content`)\nWHERE `t1`.`paper_id` = `t2`.`paper_id`\nAND (`t1`.`paper_id` = '315017')\nRETURN `t1`.`class_label` AS `class_label`, `t2`.`word_cited_id` AS `word_cited_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all words cited in paper ID 315017, state the other paper ID and class label which also cited those words.",
    "evidence": "",
    "idx": 3117
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (`t1`:`paper`)-[has_content_0:has_content]->(`t2`:`content`)\nWHERE `t1`.`paper_id` = `t2`.`paper_id`\nRETURN CASE WHEN COUNT(DISTINCT `t2`.`word_cited_id`)=0 THEN NULL ELSE toFloat(COUNT(DISTINCT CASE  WHEN `t1`.`class_label` = 'Agents' THEN `t2`.`word_cited_id` ELSE NULL END)) * 100 / COUNT(DISTINCT `t2`.`word_cited_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of words used in Agents class label.",
    "evidence": "percentage = (divide(count(word_cited_id where class_label = 'Agents')), (count(word_cited_id)))*100;",
    "idx": 3118
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (`t1`:`paper`)-[has_content_0:has_content]->(`t2`:`content`)\nWHERE `t1`.`paper_id` = `t2`.`paper_id`\nAND (`t2`.`word_cited_id` = 'word1002')\nRETURN `t1`.`paper_id` AS `paper_id`, `t1`.`class_label` AS `class_label`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the paper ID and its class type that cited the word 'word1002'.",
    "evidence": "class type refers to class_label;",
    "idx": 3119
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (`t1`:`paper`)-[has_content_0:has_content]->(`t2`:`content`)\nWHERE `t1`.`paper_id` = `t2`.`paper_id`\nAND (`t1`.`class_label` = 'AI')\nRETURN DISTINCT `t2`.`word_cited_id` AS `word_cited_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all words cited in the AI class label.",
    "evidence": "",
    "idx": 3120
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (`t1`:`paper`)-[has_content_0:has_content]->(`t2`:`content`)\nWHERE `t1`.`paper_id` = `t2`.`paper_id`\nAND (`t1`.`class_label` = 'AI' OR `t1`.`class_label` = 'IR')\nRETURN DISTINCT `t2`.`word_cited_id` AS `word_cited_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the words that are cited in both AI and IR class label.",
    "evidence": "",
    "idx": 3122
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE NOT `person`.`birthdate` IS NULL\nORDER BY `person`.`birthdate` IS NULL DESC, `person`.`birthdate`  \nRETURN `person`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which crew member of the simpson 20s is the oldest?",
    "evidence": "oldest refers to Min(birthdate)",
    "idx": 3128
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`name` = 'Dan Castellaneta'\nRETURN `person`.`nickname` AS `nickname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the nickname for Dan Castellaneta?",
    "evidence": "\"Dan Castellaneta\" is the name of Person",
    "idx": 3129
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`birth_region` = 'New York' AND CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`person`.`birthdate`,(case when size(`person`.`birthdate`)+1+(1-1)+4 < 0 then 0 else size(`person`.`birthdate`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`person`.`birthdate`,size(`person`.`birthdate`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`person`.`birthdate`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`person`.`birthdate`,1-1,4) END > '1970'\nRETURN COUNT(`person`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the crew members of the simpson 20s born in the New York city, how many of them were born after the year 1970?",
    "evidence": "born in New York city refers to birth_region = 'New York'; born after year 1970 refers to ('%Y', birthdate) > 1970",
    "idx": 3130
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`award` = 'Outstanding Voice-Over Performance' AND `t2`.`year` = 2009 AND `t2`.`result` = 'Winner')\nRETURN `t1`.`birth_country` AS `birth_country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which country was the winner of the Outstanding Voice-Over Performance award of 2009 born?",
    "evidence": "\"Outstanding Voice-Over Performance\" is the award; 2009 refers to year = 2009; 'Winner' is the result; country refers to birth_country",
    "idx": 3131
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t1`.`nickname` = 'Doofus' AND `t2`.`result` = 'Winner')\nRETURN `t2`.`award` AS `award`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the awards won by the crew member whose nickname is Doofus.",
    "evidence": "award won refers to result = 'Winner'",
    "idx": 3132
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t1`.`birth_country` = 'USA' AND `t2`.`result` = 'Nominee' AND `t2`.`award` = 'Outstanding Animated Program (For Programming Less Than One Hour)' AND `t2`.`year` = 2009)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crew members who were born in the USA were nominated for the Outstanding Animated Program (For Programming Less Than One Hour) award in 2009?",
    "evidence": "born in USA refers to birth_country = 'USA'; were nominated refers to result = 'Nominee'; 'Outstanding Animated Program (For Programming Less Than One Hour)' is the award; in 2009 refers to year = 2009",
    "idx": 3133
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`character_award`)-[for_award_0:for_award]->(`t2`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t2`.`award` = 'Outstanding Voice-Over Performance' AND `t2`.`year` = 2009 AND `t2`.`result` = 'Winner')\nRETURN DISTINCT `t1`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which character won the Outstanding Voice-Over Performance award in 2009?",
    "evidence": "won refers to result = 'Winner'",
    "idx": 3134
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Lost Verizon')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the keywords of the episode Lost Verizon.",
    "evidence": "\"Lost Verizon\" is the title of episode",
    "idx": 3135
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`air_date` = '2008-10-19')\nRETURN COUNT(`t2`.`keyword`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many keywords does the episode that was aired on 2008/10/19 have?",
    "evidence": "aired on 2008/10/19 refers to air_date = '2008-10-19'",
    "idx": 3136
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'Lost Verizon' AND `t2`.`stars` = 7)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many 7-star votes in star score did the episode Lost Verizon have?",
    "evidence": "7-stars vote refers to stars = 7; 'Lost Verizon' is the title of episode",
    "idx": 3137
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'Lost Verizon')\nORDER BY `t2`.`votes` IS NULL ASC, `t2`.`votes` DESC \nRETURN `t2`.`stars` AS `stars`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many stars did most of the voters give in star score for the episode Lost Verizon?",
    "evidence": "\"Lost Verizon\" is the title of episode; most voters refers to Max(votes)",
    "idx": 3138
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`votes` > 200 AND `t2`.`stars` = 10)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of the episodes that have over 200 voters voting a 10 in star score.",
    "evidence": "over 200 votes refers to votes > 200; 10 in star score refers to stars = 10",
    "idx": 3139
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`t1`.`air_date`,(case when size(`t1`.`air_date`)+1+(1-1)+4 < 0 then 0 else size(`t1`.`air_date`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`t1`.`air_date`,size(`t1`.`air_date`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`t1`.`air_date`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`t1`.`air_date`,1-1,4) END = '2009' AND `t2`.`stars` = 10 AND `t2`.`percent` > 15)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many episodes aired in the year 2009 have over 15% of voters giving 10 stars in star score?",
    "evidence": "aired in the year 2009 refers to air_date like '2009%'; 10 stars in star score refers to stars = 10; over 15% of voters refers to Votes.percent > 15",
    "idx": 3140
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = 7)\nORDER BY `t2`.`votes` IS NULL ASC, `t2`.`votes` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the title of the episode that got the most 7-star votes in star score?",
    "evidence": "7-stars vote refers to stars = 7;  most refers to Max(votes)",
    "idx": 3141
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'Lost Verizon')\nRETURN CASE WHEN sum(`t2`.`votes`)=0 THEN NULL ELSE toFloat(sum(`t2`.`votes` * `t2`.`stars`)) / sum(`t2`.`votes`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many stars on average does the episode Lost Verizon have?",
    "evidence": "\"Lost Verizon\" is the title of episode; stars on average = Divide( Sum (Multiply (votes, stars)), Sum(votes))",
    "idx": 3142
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`rating` > 7 AND `t1`.`result` = 'Nominee')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`award_category` = 'Primetime Emmy' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of Primetime Emmy nominated episodes with a rating over 7 to all the episodes that have a rating over 7?",
    "evidence": "\"Primetime Emmy' is the award_category;  rating over 7 refers to rating > 7; nominated refers to result = 'Nominee'; percentage = Divide(Count(episode_id(award_category = 'Primetime Emmy')), Count (episode_id)) * 100",
    "idx": 3143
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`person` = 'Pamela Hayden' AND `t2`.`role` = 'Ruthie')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the title of the episode where Pamela Hayden voiced the character 'Ruthie.'",
    "evidence": "\"Pamela Hayden\" is the person; voice the character 'Ruthie' refers to role = 'Ruthie'",
    "idx": 3144
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`person` = 'Matt Groening' AND `t1`.`title` = 'In the Name of the Grandfather')\nRETURN `t2`.`role` AS `role`, `t1`.`episode` AS `episode`, `t1`.`number_in_series` AS `number_in_series`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all the roles of Matt Groening on the episode titled 'In the Name of the Grandfather' along with the episode number and series number.",
    "evidence": "\"Matt Groening\" is the person; 'In the Name of the Grandfather' is the title of episode; episode number refers to episode; series number refers to number_in_series",
    "idx": 3145
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`keyword` = 'eviction')\nRETURN `t1`.`title` AS `title`, `t1`.`summary` AS `summary`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the title and summary of the episode with the keyword 'eviction.'",
    "evidence": "",
    "idx": 3146
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'Wedding for Disaster')\nRETURN avg(`t2`.`stars`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of stars received by the episode titled 'Wedding for Disaster.'",
    "evidence": "\"Wedding for Disaster\" is the title of episode; average number of stars = Divide(Sum(stars), Count(stars))",
    "idx": 3147
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`air_date` = '2009-03-22')\nRETURN `t1`.`title` AS `title`, `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the title and all the keywords of the episode that was aired on 3/22/2009.",
    "evidence": "aired on 3/22/2009 refers to air_date = '2009-03-22'",
    "idx": 3148
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`role` = 'Helen Lovejoy')\nRETURN DISTINCT `t1`.`birth_name` AS `birth_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the birth name of the person who voiced 'Helen Lovejoy?'",
    "evidence": "voiced refers to role; role = 'Helen Lovejoy\"",
    "idx": 3149
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nWHERE `episode`.`votes` > 1000\nRETURN COUNT(`episode`.`episode_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many episodes have more than 1000 votes?",
    "evidence": "more than 1000 votes refers to votes > 1000",
    "idx": 3150
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`birth_place` = 'New York City' AND `person`.`birth_country` = 'USA'\nRETURN COUNT(`person`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many persons were born in New York, USA?",
    "evidence": "\"New York\" is the birth_place; 'USA' is the birth_region",
    "idx": 3151
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`person` = 'Marc Wilmore'\nRETURN `award`.`award_id` AS `award_id`, `award`.`award_category` AS `award_category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of all awards along with the award category, nominated by Marc Wilmore.",
    "evidence": "\"Marc Wilmore\" is the name of person",
    "idx": 3152
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE NOT `person`.`nickname` IS NULL\nRETURN COUNT(`person`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crew have their own nickname? List their full name along with the nickname.",
    "evidence": "crew refers to Person; full name refers to name; have nickname refers to nickname IS NOT NULL",
    "idx": 3153
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nRETURN avg(`person`.`height_meters`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the average height for each person.",
    "evidence": "average high = Divide(Sum(height_meters), Count(name))",
    "idx": 3154
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`vote`:`vote`)\nRETURN MAX(`vote`.`votes`) - min(`vote`.`votes`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference between the highest votes for episode and the lowest votes for episode.",
    "evidence": "highest vote refers to Max(votes); lowest vote refers to Min(votes); difference = Subtract(Max(votes), Min(votes))",
    "idx": 3155
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t1`.`year` = 2009 AND `t1`.`award` = 'Outstanding Voice-Over Performance')\nRETURN `t2`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name character awarded for the Outstanding Voice-Over Performance award in 2009.",
    "evidence": "in 2009 refers to year = 2009",
    "idx": 3156
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`year` = 2009 AND `t2`.`award` = 'Comedy Series' AND `t1`.`birth_region` = 'California')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the person nominated for the Comedy Series Award in 2009, how many of them were born in California?",
    "evidence": "nominated refers to result = 'Nominee'; born in California refers to birth_place = 'California'; in 2009 refers to year = 2009",
    "idx": 3157
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'How the Test Was Won' AND `t2`.`credited` = 'false')\nRETURN `t2`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of persons who were not included in the credit for the 'How the Test Was Won' episode.",
    "evidence": "\"How the Test Was Won\" is the title of episode; not included in the credit refers to credited = ' '; name of person refers to person",
    "idx": 3158
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`keyword` IN ['riot', 'cake'])\nRETURN DISTINCT `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of episode that has a keyword of 'riot' and 'cake'?",
    "evidence": "\"riot\" and \"cake\" are both keyword",
    "idx": 3159
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = 10)\nORDER BY `t1`.`votes` IS NULL ASC, `t1`.`votes` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which episode has the most vote for 10 stars rating?",
    "evidence": "10 stars rating refers to stars = 10; most vote refers to Max(votes)",
    "idx": 3160
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (CASE  WHEN 6-1 < 0 AND 2 < 0  THEN substring(`t1`.`air_date`,(case when size(`t1`.`air_date`)+1+(6-1)+2 < 0 then 0 else size(`t1`.`air_date`)+1+(6-1)+2 end),-(2))  WHEN 6-1 < 0 AND 2 >= 0  THEN substring(`t1`.`air_date`,size(`t1`.`air_date`)+1+(6-1),2)  WHEN 6-1 >= 0 AND 2 < 0  THEN substring(`t1`.`air_date`,(case when 6-1+1+(2) < 0 then 0 else 6-1+1+(2) end),-(2))  ELSE substring(`t1`.`air_date`,6-1,2) END >= '10' AND CASE  WHEN 6-1 < 0 AND 2 < 0  THEN substring(`t1`.`air_date`,(case when size(`t1`.`air_date`)+1+(6-1)+2 < 0 then 0 else size(`t1`.`air_date`)+1+(6-1)+2 end),-(2))  WHEN 6-1 < 0 AND 2 >= 0  THEN substring(`t1`.`air_date`,size(`t1`.`air_date`)+1+(6-1),2)  WHEN 6-1 >= 0 AND 2 < 0  THEN substring(`t1`.`air_date`,(case when 6-1+1+(2) < 0 then 0 else 6-1+1+(2) end),-(2))  ELSE substring(`t1`.`air_date`,6-1,2) END <= '11')\nRETURN DISTINCT `t2`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all the person who involved in the making of simpson 20s episode that aired between October to November.",
    "evidence": "aired between October to November refers to strftime('%m', air_date) between '10' and '11';",
    "idx": 3161
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Treehouse of Horror XIX' AND `t2`.`role` = 'director')\nRETURN `t2`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of director for the 'Treehouse of Horror XIX' episode.",
    "evidence": "\"Treehouse of Horror XIX\" is the title of episode; 'director' is the role of person; name refers to person",
    "idx": 3162
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`episode` = 5)\nRETURN COUNT(DISTINCT `t2`.`role`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Based on the credits, state how many roles were played in the 5th episode of simpson 20.",
    "evidence": "5th episode refers to episode = 5",
    "idx": 3163
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Take My Life, Please')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the keyword for 'Take My Life, Please' episode.",
    "evidence": "\"Take My Life,Please\" is the title of episode",
    "idx": 3164
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`votes` > 950 AND `t1`.`year` = 2009)\nRETURN CASE WHEN COUNT(`t2`.`episode_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`award` = 'Outstanding Voice-Over Performance' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`episode_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the episode that get more than 950 votes, how many of the episodes were nominated for the 'Outstanding Voice-Over Performance Award in 2009'? Find the percentage of the episodes.",
    "evidence": "more than 950 votes refers to votes > 950; in 2009 refers to year = 2009; number of episode = Count(episode_id); nominated refers to result = 'Nominee'; percentage = Divide(Count(award = 'Outstanding Voice-Over Performance'), Count(episode_id)) * 100",
    "idx": 3165
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = 5)\nRETURN CASE WHEN sum(CASE  WHEN `t1`.`title` = 'Coming to Homerica' THEN `t1`.`votes` ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`title` = 'No Loan Again, Naturally' THEN `t1`.`votes` ELSE 0 END)) / sum(CASE  WHEN `t1`.`title` = 'Coming to Homerica' THEN `t1`.`votes` ELSE 0 END) END AS `ratio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ratio between the 5 stars votes for 'No Loan Again, Naturally' episode and 'Coming to Homerica' episode?",
    "evidence": "5 stars votes refers to stars = 5 ; 'No Loan Again, Naturally' and 'Coming to Homerica' are both the title of episode;  ratio = Divide (votes where title = 'No Loan Again, Naturally', votes where title = 'Coming to Homerica')",
    "idx": 3166
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`person` = 'Ian Maxtone-Graham' AND `award`.`organization` = 'Writers Guild of America, USA' AND `award`.`result` = 'Nominee'\nRETURN COUNT(`award`.`award_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times was Ian Maxtone-Graham nominated for an award in Writers Guild of America, USA?",
    "evidence": "\"Ian Maxtone-Graham\" is the person; nominated refers to result = 'Nominee'; 'Writers Guild of America, USA' is the organization",
    "idx": 3167
  }
]