[
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`rootbeer`)-[manufactured_by_0:manufactured_by]->(`t2`:`rootbeerbrand`)\nWHERE `t2`.`brandid` = `t1`.`brandid`\nAND (`t2`.`brandname` IN ['Bulldog', 'Bundaberg', 'Dad\\'s', 'Dog n Suds', 'Virgil\\'s'])\nRETURN `t1`.`rootbeerid` AS `rootbeerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the root beer ID for the brand Bulldog, Bundaberg, Dad's, Dog n Suds and Virgil's.",
    "evidence": "Bulldog, Bundaberg, Dad's, Dog n Suds and Virgil's refers to BrandName IN('Bulldog', 'Bundaberg', 'Dad''s', 'Dog n Suds', 'Virgil''s');",
    "idx": 4184
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`state` = 'CA'\nRETURN DISTINCT `customers`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please name all of the cities in California.",
    "evidence": "California refers to State = 'CA';",
    "idx": 4192
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:purchased]->()\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t2`.`transactionid` = '100016')\nRETURN `t1`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the email address of the customer who made a purchase in transaction 100016?",
    "evidence": "email address refers to Email; transaction 100016 refers to TransactionID = 100016;",
    "idx": 4201
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`sales`:`sales`)\nWHERE `sales`.`salesid` >= 1 AND `sales`.`salesid` <= 10\nRETURN sum(`sales`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the total quantity for sales from id 1 to 10.",
    "evidence": "sales from id 1 to 10 refers to SalesID BETWEEN 1 AND 10;",
    "idx": 4206
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`sales`:`sales`)\nWHERE `sales`.`salesid` >= 20 AND `sales`.`salesid` <= 30\nRETURN avg(`sales`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average quantity per sales from sales id 20 to 30.",
    "evidence": "average quantity = AVG(Quantity); SalesID BETWEEN 20 AND 30;",
    "idx": 4207
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "CALL(*) {\nMATCH (`sales_sub0`:`sales`)\nRETURN MAX(`sales_sub0`.`quantity`) AS `_col_0`  \n}\nMATCH (`sales`:`sales`)\nWHERE `sales`.`quantity` = `_col_0`\nRETURN DISTINCT `sales`.`productid` AS `productid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the product id for products with the highest quantity.",
    "evidence": "highest quantity refers to MAX(Quantity);",
    "idx": 4208
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`price` = 0\nRETURN `products`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down product names of free gifts.",
    "evidence": "free gifts refers to Price = 0;",
    "idx": 4210
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`productid` >= 1 AND `products`.`productid` <= 10\nRETURN `products`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the product name for products from id 1 to 10.",
    "evidence": "products from id 1 to 10 refers to ProductID BETWEEN 1 AND 10;",
    "idx": 4211
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t1`:`sales`)-[includes_0:includes]->(`t2`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`name` = 'Flat Washer 8')\nRETURN COUNT(`t1`.`salesid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total sales ids that were sales of Flat Washer 8.",
    "evidence": "Flat Washer 8' is name of product;",
    "idx": 4214
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`salespersonid` = 10)\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all of the product names that were placed by sales person with id 10.",
    "evidence": "id refers to SalesPersonID; SalesPersonID = 10",
    "idx": 4215
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t1`:`customers`)\nMATCH (`t2`:`sales`)-[includes_0:includes]->(`t3`:`products`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND `t2`.`productid` = `t3`.`productid`\nAND (`t2`.`productid` = 1)\nRETURN `t1`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the first name of customers who placed order for product id 1.",
    "evidence": "",
    "idx": 4216
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t1`:`sales`)-[sold_to_0:sold_to]->(`t2`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t2`.`firstname` = 'Abby')\nRETURN DISTINCT `t1`.`productid` AS `productid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down product ids that were purchased by customers called Abby.",
    "evidence": "",
    "idx": 4218
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[made_by_0:made_by]->(`t1`:`employees`)\nWHERE `t1`.`employeeid` = `t2`.`salespersonid`\nAND (`t1`.`firstname` = 'Meander')\nRETURN DISTINCT `t2`.`productid` AS `productid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down all of the product ids that were placed by Meander.",
    "evidence": "",
    "idx": 4219
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t1`:`sales`)-[made_by_0:made_by]->(`t2`:`employees`)\nWHERE `t1`.`salespersonid` = `t2`.`employeeid`\nAND (CASE  WHEN 1-1 < 0 AND 1 < 0  THEN substring(`t2`.`firstname`,(case when size(`t2`.`firstname`)+1+(1-1)+1 < 0 then 0 else size(`t2`.`firstname`)+1+(1-1)+1 end),-(1))  WHEN 1-1 < 0 AND 1 >= 0  THEN substring(`t2`.`firstname`,size(`t2`.`firstname`)+1+(1-1),1)  WHEN 1-1 >= 0 AND 1 < 0  THEN substring(`t2`.`firstname`,(case when 1-1+1+(1) < 0 then 0 else 1-1+1+(1) end),-(1))  ELSE substring(`t2`.`firstname`,1-1,1) END = 's')\nRETURN `t1`.`salesid` AS `salesid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all of the sales IDs for sales handled by sales people with first name starting with alphabet \"s\".",
    "evidence": "first name starting with alphabet \"s\" refers to FirstName LIKE 's%';",
    "idx": 4224
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t1`:`sales`)-[made_by_0:made_by]->(`t2`:`employees`)\nWHERE `t1`.`salespersonid` = `t2`.`employeeid`\nRETURN sum(CASE WHEN `t2`.`firstname` = 'Morningstar' THEN 1 ELSE 0 END) + sum(CASE WHEN `t2`.`firstname` = 'Heather' THEN 1 ELSE 0 END) + sum(CASE WHEN `t2`.`firstname` = 'Dean' THEN 1 ELSE 0 END) AS `num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Sum up the number sales ids handled by employees called Morningstar, Heather and Dean.",
    "evidence": "SUM = ADD(SUM(SalesID WHERE FirstName = 'Morningstar'), SUM(SalesID WHERE FirstName = 'Heather'), SUM(SalesID WHERE FirstName = 'Dean'));",
    "idx": 4227
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t1`:`customers`)\nMATCH (`t2`:`sales`)-[includes_0:includes]->(`t3`:`products`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND `t2`.`productid` = `t3`.`productid`\nAND (`t1`.`firstname` = 'Adam')\nRETURN sum(`t3`.`price` * `t2`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total price of products purchased by Adam.",
    "evidence": "total price = SUM(MULTIPLY(Price, Quantity));",
    "idx": 4229
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`productid` >= 400 AND `t1`.`productid` <= 500)\nRETURN sum(`t1`.`price` * `t2`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total price for products from id 400 to 500.",
    "evidence": "total price = SUM(MULTIPLY(Price, Quantity)); from id 400 to 500 refers to ProductID BETWEEN 400 AND 500;",
    "idx": 4230
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (CASE  WHEN 1-1 < 0 AND 1 < 0  THEN substring(`t1`.`name`,(case when size(`t1`.`name`)+1+(1-1)+1 < 0 then 0 else size(`t1`.`name`)+1+(1-1)+1 end),-(1))  WHEN 1-1 < 0 AND 1 >= 0  THEN substring(`t1`.`name`,size(`t1`.`name`)+1+(1-1),1)  WHEN 1-1 >= 0 AND 1 < 0  THEN substring(`t1`.`name`,(case when 1-1+1+(1) < 0 then 0 else 1-1+1+(1) end),-(1))  ELSE substring(`t1`.`name`,1-1,1) END = 'C')\nRETURN sum(`t2`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total quantity of products with name starting with alphabet \"c\".",
    "evidence": "name starting with alphabet \"c\" refers to Name LIKE 'C%';",
    "idx": 4231
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t1`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`firstname` = 'Adam')\nRETURN sum(`t2`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total quantity of products purchased by customer called Adrian.",
    "evidence": "",
    "idx": 4232
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`products`:`products`)\nORDER BY `products`.`price` IS NULL ASC, `products`.`price` DESC \nRETURN `products`.`productid` AS `productid`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the product ID of the top five products, by descending order, in terms of price.",
    "evidence": "top 5 products in terms of Price refers to MAX(Price) LIMIT 5;",
    "idx": 4233
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`quantity` > 950)\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the name of products whose sale quantity is more than 950.",
    "evidence": "quantity is more than 950 refers to Quantity > 950;",
    "idx": 4235
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t1`:`customers`)\nMATCH (`t2`:`sales`)-[includes_0:includes]->(`t3`:`products`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND `t2`.`productid` = `t3`.`productid`\nAND (`t2`.`salesid` >= 1 AND `t2`.`salesid` <= 10)\nRETURN `t3`.`name` AS `name`, `t2`.`quantity` AS `quantity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tally the product name and quantity of the first ten sales.",
    "evidence": "first ten sales refers to SalesID BETWEEN 1 AND 10;",
    "idx": 4237
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'HL Road Frame - Red, 56')\nRETURN sum(`t2`.`quantity` * `t1`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the revenue produced through sales of HL Road Frame - Red, 56.",
    "evidence": "revenue = MULTIPLY(SUM(Quantity, Price)); 'HL Road Frame - Red, 56' is name of product;",
    "idx": 4245
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t1`:`customers`)\nMATCH (`t2`:`sales`)-[includes_0:includes]->(`t3`:`products`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND `t2`.`productid` = `t3`.`productid`\nAND (`t3`.`name` = 'Touring Rim' AND `t3`.`price` = 0)\nRETURN DISTINCT `t1`.`firstname` AS `firstname`, `t1`.`middleinitial` AS `middleinitial`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the customers who received 'Touring Rim' as a free gift.",
    "evidence": "name of the customer = FirstName, MiddleInitial, LastName; 'Touring Rim' is name of product;",
    "idx": 4247
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`sales`:`sales`)\nWITH `sales`.`salespersonid` AS _groupby_col_0, COUNT(`sales`.`customerid`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the number of customers handled by each of the sales people.",
    "evidence": "",
    "idx": 4248
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`employeeid` = 7\nRETURN `employees`.`firstname` AS `firstname`, `employees`.`middleinitial` AS `middleinitial`, `employees`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the name of the sales person with employee ID 7.",
    "evidence": "name of the sales person = FirstName, MiddleInitial, LastName;",
    "idx": 4250
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'Blade')\nRETURN DISTINCT `t2`.`quantity` AS `quantity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the quantity of Blade products sold.",
    "evidence": "Blade' is name of product;",
    "idx": 4253
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[made_by_0:made_by]->(`t1`:`employees`)\nWHERE `t1`.`employeeid` = `t2`.`salespersonid`\nORDER BY `t2`.`quantity` IS NULL ASC, `t2`.`quantity` DESC \nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the full name of the employee who has sold the most quantity.",
    "evidence": "full name of the employee = FirstName, LastName; most quantity refers to MAX(Quantity);",
    "idx": 4254
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t1`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nORDER BY `t2`.`quantity` IS NULL ASC, `t2`.`quantity` DESC \nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name of the customer who purchased the most quantity of products.",
    "evidence": "full name of the customer = FirstName, LastName; most quantity refers to MAX(Quantity);",
    "idx": 4255
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[made_by_0:made_by]->(`t1`:`employees`)\nWHERE `t1`.`employeeid` = `t2`.`salespersonid`\nAND (`t2`.`quantity` > 500)\nRETURN DISTINCT `t1`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the first names of employees with trading quantity for more than 500.",
    "evidence": "trading quantity for more than 500 refers to Quantity > 500;",
    "idx": 4257
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t1`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t2`.`salespersonid` = 1)\nRETURN `t1`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the first names of customers who have purchased products from sale person id 1.",
    "evidence": "",
    "idx": 4258
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t1`:`customers`)\nMATCH (`t2`:`sales`)-[made_by_0:made_by]->(`t3`:`employees`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND `t2`.`salespersonid` = `t3`.`employeeid`\nAND (`t2`.`salespersonid` = 1 AND `t1`.`firstname` = 'Aaron' AND `t1`.`lastname` = 'Alexander' AND `t3`.`firstname` = 'Abraham')\nRETURN sum(`t2`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total trading quantity of Abraham sold to Aaron Alexander.",
    "evidence": "total trading quantity = SUM(Quantity WHERE Employees.FirstName = 'Abraham' AND Customers.FirstName = 'Aaron' AND Customers.LastName = 'Alexander');",
    "idx": 4259
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t1`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t2`.`quantity` > 600)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names of customers who have purchased products in quantity over 600.",
    "evidence": "full names of customers = FirstName, LastName; quantity over 600 refers to quantity > 600;",
    "idx": 4260
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` =~ '(?i)(?s)Hex Nut.*' AND `t1`.`price` > 100)\nRETURN `t2`.`salesid` AS `salesid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide sales ID for products named Hex Nut with a price greater than 100.",
    "evidence": "price greater than 100 refers to price > 100;",
    "idx": 4262
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`price` >= 1000 AND `t1`.`price` <= 2000)\nRETURN DISTINCT `t2`.`customerid` AS `customerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify customer IDs who bought products priced from 1000 to 2000.",
    "evidence": "priced from 1000 to 2000 refers to Price BETWEEN 1000 AND 2000;",
    "idx": 4263
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`price` = 0)\nRETURN sum(`t2`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total quantity of products that are gifts.",
    "evidence": "total quantity = SUM(Quantity); gifts refers to Price = 0;",
    "idx": 4264
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nRETURN CASE WHEN sum(`t2`.`quantity`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t1`.`price` = 0 THEN `t2`.`quantity` ELSE 0 END)) * 100 / sum(`t2`.`quantity`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the quantity percentage of the gift products in the total trading quantity.",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(Quantity WHERE Price = 0), SUM(Quantity)), 1.0); gift products refers to Price = 0;",
    "idx": 4265
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nRETURN CASE WHEN sum(`t2`.`quantity`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t1`.`name` = 'Blade' THEN `t2`.`quantity` ELSE 0 END)) * 100 / sum(`t2`.`quantity`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of sold blades in the total number of transactions.",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(Quantity WHERE Name = 'Blade'), SUM(Quantity)), 1.0); 'blades' refers to name of product;",
    "idx": 4266
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`lastname` = 'Ringer'\nRETURN COUNT(`employees`.`lastname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the employees have the last name \"Ringer\" ?",
    "evidence": "",
    "idx": 4267
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nMATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t3`:`customers`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t2`.`customerid` = `t3`.`customerid`\nAND (`t3`.`firstname` = 'Aaron' AND `t3`.`lastname` = 'Alexander')\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the product's name brought by Aaron Alexander.",
    "evidence": "",
    "idx": 4269
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`quantity` >= 400 AND `t2`.`quantity` <= 500)\nORDER BY `t1`.`price` IS NULL ASC, `t1`.`price` DESC \nRETURN `t1`.`productid` AS `productid`, `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the product ID and name of the product with the highest prices among the quantity ranges from 400 to 500.",
    "evidence": "highest prices refers to MAX(Price); quantity ranges from 400 to 500 refers to Quantity BETWEEN 400 AND 500;",
    "idx": 4270
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nMATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t3`:`customers`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t2`.`customerid` = `t3`.`customerid`\nAND (`t3`.`firstname` = 'Abigail' AND `t3`.`lastname` = 'Henderson')\nRETURN `t2`.`quantity` AS `quantity`, `t1`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the quantity and price of the product bought by Abigail Henderson.",
    "evidence": "",
    "idx": 4273
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t1`:`sales`)-[includes_0:includes]->(`t2`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`name` = 'External Lock Washer 7' AND `t1`.`quantity` = 590)\nRETURN `t1`.`salesid` AS `salesid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the sales ID of the product with a quantity of 590 and named \"External Lock Washer 7\".",
    "evidence": "External Lock Washer 7' is name of product;",
    "idx": 4279
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "CALL(*) {\nMATCH (`sales_sub0`:`sales`)\nRETURN avg(`sales_sub0`.`quantity`) AS `_col_0`  \n}\nMATCH (`t1`:`sales`)-[sold_to_0:sold_to]->(`t2`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`quantity` > `_col_0` * 0.9)\nRETURN `t2`.`customerid` AS `customerid`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the customer's ID and last name of the customer that purchased a product with a quantity greater than 90% of the average quantity of all listed products.",
    "evidence": "quantity greater than 90% of the average quantity = Quantity > MULTIPLY(AVG(Quantity), 0.9);",
    "idx": 4281
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`name` =~ '(?i)(?s).*HL Touring Frame.*'\nRETURN COUNT(`products`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many types of \"HL Touring Frames\" are there?",
    "evidence": "types of HL Touring Frames refers to Name like '%HL Touring Frame%';",
    "idx": 4285
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t1`:`sales`)-[sold_to_0:sold_to]->(`t2`:`customers`)\nMATCH (`t1`:`sales`)-[includes_0:includes]->(`t3`:`products`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND `t1`.`productid` = `t3`.`productid`\nWITH `t1`.`salesid` AS _groupby_col_0, `t1`.`quantity` AS _groupby_col_1, `t3`.`price` AS _groupby_col_2, `t2`.`firstname` AS _groupby_col_3, `t2`.`middleinitial` AS _groupby_col_4, `t2`.`lastname` AS _groupby_col_5\nORDER BY _groupby_col_1 * _groupby_col_2 IS NULL ASC, _groupby_col_1 * _groupby_col_2 DESC \nRETURN _groupby_col_3 AS `firstname`, _groupby_col_4 AS `middleinitial`, _groupby_col_5 AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the customer who purchased the highest amount of total price in a single purchase?",
    "evidence": "full name of the customer = FirstName, MiddleInitial, LastName; highest amount of total price refers to MAX(MULTIPLY(Quantity, Price));",
    "idx": 4287
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'ML Road Frame-W - Yellow, 40')\nRETURN COUNT(`t2`.`salespersonid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees sold \"ML Road Frame-W - Yellow, 40\"?",
    "evidence": "ML Road Frame-W - Yellow, 40' is name of product;",
    "idx": 4292
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "CALL (*) {\nWITH *, COLLECT { MATCH (`products_sub0_sub0`:`products`)\nWHERE `products_sub0_sub0`.`name` = 'Touring-2000 Blue, 50'\nRETURN `products_sub0_sub0`.`productid` AS `productid`   } AS in_collect_0\nMATCH (`sales_sub0`:`sales`)\nWHERE `sales_sub0`.`productid` IN in_collect_0\nWITH `sales_sub0`.`quantity` AS _groupby_col_0, `sales_sub0`.`salespersonid` AS _groupby_col_1, sum(`sales_sub0`.`quantity`) AS _groupby_col_2\nWHERE _groupby_col_2 > 20000\nRETURN _groupby_col_2 AS `_col_0`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees sold over 20,000 quantities of \"Touring-2000 Blue, 50\"?",
    "evidence": "over 20,000 quantities refers to Quantity > 20000; 'Touring-2000 Blue, 50' is name of product;",
    "idx": 4294
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`lastname` = 'Chen'\nRETURN `customers`.`firstname` AS `firstname`, `customers`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the first name of all the customers whose last name is Chen.",
    "evidence": "",
    "idx": 4296
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nMATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t3`:`customers`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t2`.`customerid` = `t3`.`customerid`\nORDER BY `t2`.`quantity` * `t1`.`price` IS NULL ASC, `t2`.`quantity` * `t1`.`price` DESC \nRETURN `t3`.`firstname` AS `firstname`, `t3`.`middleinitial` AS `middleinitial`, `t3`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the full name of the customer who bought the most amount of products.",
    "evidence": "full name of the customer = FirstName, MiddleInitial, LastName; most amount of products refers to MAX(MULTIPLY(Quantity, Price));",
    "idx": 4298
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t2`:`sales`)-[includes_0:includes]->(`t1`:`products`)\nMATCH (`t2`:`sales`)-[sold_to_0:sold_to]->(`t3`:`customers`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t2`.`customerid` = `t3`.`customerid`\nAND (`t2`.`quantity` * `t1`.`price` > 50000)\nRETURN DISTINCT `t3`.`firstname` AS `firstname`, `t3`.`middleinitial` AS `middleinitial`, `t3`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name of customers who spend more than 50,000 in descending order the amount spend.",
    "evidence": "full name of the customer = FirstName, MiddleInitial, LastName; more than 50,000 in the amount refers to MULTIPLY(Quantity, Price) > 50000;",
    "idx": 4300
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (`t1`:`sales`)-[includes_0:includes]->(`t2`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nORDER BY `t1`.`quantity` IS NULL ASC, `t1`.`quantity` DESC \nRETURN `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the product that sold the most quantity.",
    "evidence": "most quantity refers to MAX(Quantity);",
    "idx": 4301
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "CALL(*) {\nMATCH (`sales_sub0`:`sales`)\nRETURN avg(`sales_sub0`.`quantity`) AS `_col_0`  \n}\nMATCH (`t1`:`sales`)-[includes_0:includes]->(`t2`:`products`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`quantity` < `_col_0`)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find and list the products that sold below the average quantity.",
    "evidence": "below the average quantity refers to Quantity < AVG(Quantity);",
    "idx": 4302
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`menu`:`menu`)\nWHERE `menu`.`name` = 'Waldorf Astoria' AND `menu`.`page_count` = 4\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many menus with the name \"Waldorf Astoria\" have 4 pages?",
    "evidence": "4 pages refers to page_count = 4;",
    "idx": 4306
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[t2:has_dish]->(`t3`:`dish`)\nWHERE `t1`.`id` = `t2`.`menu_page_id`\nAND `t2`.`dish_id` = `t3`.`id`\nAND (`t3`.`name` = 'Clear green turtle')\nRETURN `t1`.`menu_id` AS `menu_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of all the menus in which the dish \"Clear green turtle\" had appeared.",
    "evidence": "Clear green turtle is a name of dish;",
    "idx": 4311
  }
]