[
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "{MATCH (host@`host`)\nWHERE host.`age` > '45'\nRETURN host.`nationality` AS `nationality` \n} \nINTERSECT DISTINCT\n{MATCH (host@`host`)\nWHERE host.`age` < '35'\nRETURN host.`nationality` AS `nationality` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which nations have both hosts of age above 45 and hosts of age below 35?",
    "evidence": "",
    "idx": 2899
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "{MATCH (film@`film`)\nWHERE film.`length` > 100 OR film.`rating` = 'PG'\nRETURN film.`title` AS `title` \n} \nEXCEPT DISTINCT\n{MATCH (film@`film`)\nWHERE film.`replacement_cost` > 200\nRETURN film.`title` AS `title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the titles of films that are either longer than 100 minutes or rated PG other than those that cost more than 200 to replace?",
    "evidence": "",
    "idx": 3086
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "{MATCH (t2@`teachers`)-[has_address_0:`has_address`]->(t1@`addresses`)\nWHERE t1.`address_id` = t2.`address_id`\nRETURN t1.`line_1` AS `line_1` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`teachers`)-[has_address_1:`has_address`]->(t1@`addresses`)\nWHERE t1.`address_id` = t2.`address_id`\nRETURN t1.`line_1` AS `line_1` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the line 1 of addresses shared by some students and some teachers?",
    "evidence": "",
    "idx": 3127
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "{MATCH (t2@`fault_log`)-[recorded_by_0:`recorded_by`]->(t1@`staff`)\nWHERE t1.`staff_id` = t2.`recorded_by_staff_id`\nRETURN t1.`staff_name` AS `staff_name`, t1.`staff_id` AS `staff_id` \n} \nEXCEPT DISTINCT\n{MATCH (t4@`engineer_visits`)-[contacted_0:`contacted`]->(t3@`staff`)\nWHERE t3.`staff_id` = t4.`contact_staff_id`\nRETURN t3.`staff_name` AS `staff_name`, t3.`staff_id` AS `staff_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What is the name and id of the staff who recorded the fault log but has not contacted any visiting engineers?",
    "evidence": "",
    "idx": 3130
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "{MATCH (employee@`employee`)\nWHERE employee.`emp_jobcode` = 'PROF'\nRETURN employee.`emp_fname` AS `emp_fname` \n} \nEXCEPT DISTINCT\n{MATCH (t2@`class`)-[taught_by_0:`taught_by`]->(t1@`employee`)\nWHERE t1.`emp_num` = t2.`prof_num`\nRETURN t1.`emp_fname` AS `emp_fname` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the first names of all professors not teaching any classes?",
    "evidence": "",
    "idx": 3246
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "{MATCH (t2@`class`)-[taught_by_0:`taught_by`]->(t1@`employee`)\nWHERE t1.`emp_num` = t2.`prof_num`\nAND (t2.`crs_code` = 'CIS-220')\nRETURN t1.`emp_fname` AS `emp_fname` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`class`)-[taught_by_1:`taught_by`]->(t1@`employee`)\nWHERE t1.`emp_num` = t2.`prof_num`\nAND (t2.`crs_code` = 'QM-261')\nRETURN t1.`emp_fname` AS `emp_fname` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What is the first name of the professor who is teaching CIS-220 and QM-261?",
    "evidence": "",
    "idx": 3262
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "{MATCH (t1@`student`)-[t2:`enrolled_in`]->(t3@`class`)-[belongs_to_course_0:`belongs_to_course`]->(t4@`course`)-[offered_by_0:`offered_by`]->(t5@`department`)\nWHERE t1.`stu_num` = t2.`stu_num`\nAND t2.`class_code` = t3.`class_code`\nAND t3.`crs_code` = t4.`crs_code`\nAND t5.`dept_code` = t4.`dept_code`\nAND (t5.`dept_name` = 'Accounting')\nRETURN t1.`stu_fname` AS `stu_fname` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`student`)-[t2:`enrolled_in`]->(t3@`class`)-[belongs_to_course_1:`belongs_to_course`]->(t4@`course`)-[offered_by_1:`offered_by`]->(t5@`department`)\nWHERE t1.`stu_num` = t2.`stu_num`\nAND t2.`class_code` = t3.`class_code`\nAND t3.`crs_code` = t4.`crs_code`\nAND t5.`dept_code` = t4.`dept_code`\nAND (t5.`dept_name` = 'Computer Info. Systems')\nRETURN t1.`stu_fname` AS `stu_fname` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the first names of all students taking accoutning and Computer Information Systems classes?",
    "evidence": "",
    "idx": 3264
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "{MATCH (player@`player`)\nWHERE player.`points` > 20\nRETURN player.`position` AS `position` \n} \nINTERSECT DISTINCT\n{MATCH (player@`player`)\nWHERE player.`points` < 10\nRETURN player.`position` AS `position` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the positions of both players that have more than 20 20 points and less than 10 points?",
    "evidence": "",
    "idx": 3320
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "{MATCH (competition@`competition`)\nWHERE competition.`competition_type` = 'Friendly'\nRETURN competition.`country` AS `country` \n} \nINTERSECT DISTINCT\n{MATCH (competition@`competition`)\nWHERE competition.`competition_type` = 'Tournament'\nRETURN competition.`country` AS `country` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the countries that participated in both friendly and tournament type competitions?",
    "evidence": "",
    "idx": 3330
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "{MATCH (competition@`competition`)\nRETURN competition.`country` AS `country` \n} \nEXCEPT DISTINCT\n{MATCH (competition@`competition`)\nWHERE competition.`competition_type` = 'Friendly'\nRETURN competition.`country` AS `country` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the countries that have never participated in any friendly-type competitions?",
    "evidence": "",
    "idx": 3332
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "{MATCH (t1@`channel`)-[t2:`broadcast_1`]->()\nWHERE t1.`channel_id` = t2.`channel_id`\nAND (t2.`time_of_day` = 'Morning')\nRETURN t1.`name` AS `name` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`channel`)-[t2:`broadcast_1`]->()\nWHERE t1.`channel_id` = t2.`channel_id`\nAND (t2.`time_of_day` = 'Night')\nRETURN t1.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "what are the names of the channels that broadcast in both morning and night?",
    "evidence": "",
    "idx": 3468
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "{MATCH (t1@`program`)-[t2:`broadcast_3`]->()\nWHERE t1.`program_id` = t2.`program_id`\nAND (t2.`time_of_day` = 'Morning')\nRETURN t1.`owner` AS `owner` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`program`)-[t2:`broadcast_3`]->()\nWHERE t1.`program_id` = t2.`program_id`\nAND (t2.`time_of_day` = 'Night')\nRETURN t1.`owner` AS `owner` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Who are the owners of the programs that broadcast both in the morning and at night?",
    "evidence": "",
    "idx": 3477
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "{MATCH (course_authors_and_tutors@`course_authors_and_tutors`)\nRETURN course_authors_and_tutors.`login_name` AS `login_name` \n} \nINTERSECT DISTINCT\n{MATCH (students@`students`)\nRETURN students.`login_name` AS `login_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the login names used both by some course authors and some students?",
    "evidence": "",
    "idx": 3547
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "{MATCH (course_authors_and_tutors@`course_authors_and_tutors`)\nRETURN course_authors_and_tutors.`personal_name` AS `personal_name` \n} \nINTERSECT DISTINCT\n{MATCH (students@`students`)\nRETURN students.`personal_name` AS `personal_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the personal names used both by some course authors and some students?",
    "evidence": "",
    "idx": 3549
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "{MATCH (procedures@`procedures`)\nWHERE procedures.`cost` > 1000\nRETURN procedures.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`physician`)-[t2:`involved_in_1`]->(t3@`procedures`)\nWHERE t1.`employeeid` = t2.`physician`\nAND t3.`code` = t2.`treatment`\nAND (t1.`name` = 'John Wen')\nRETURN t3.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Find the names of all procedures which cost more than 1000 but which physician John Wen was not trained in?",
    "evidence": "",
    "idx": 3640
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "{MATCH (procedures@`procedures`)\nWHERE procedures.`cost` > 1000\nRETURN procedures.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`physician`)-[t2:`involved_in_1`]->(t3@`procedures`)\nWHERE t1.`employeeid` = t2.`physician`\nAND t3.`code` = t2.`treatment`\nAND (t1.`name` = 'John Wen')\nRETURN t3.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Among the procedures that cost more than 1000, which were not specialized in by physician John Wen?",
    "evidence": "",
    "idx": 3641
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "{MATCH (procedures@`procedures`)\nWHERE procedures.`cost` < 5000\nRETURN procedures.`name` AS `name` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`physician`)-[t2:`involved_in_1`]->(t3@`procedures`)\nWHERE t1.`employeeid` = t2.`physician`\nAND t3.`code` = t2.`treatment`\nAND (t1.`name` = 'John Wen')\nRETURN t3.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What procedures cost less than 5000 and have John Wen as a trained physician?",
    "evidence": "",
    "idx": 3643
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "{MATCH (ship@`ship`)\nWHERE ship.`tonnage` > 6000\nRETURN ship.`type` AS `type_` \n} \nINTERSECT DISTINCT\n{MATCH (ship@`ship`)\nWHERE ship.`tonnage` < 4000\nRETURN ship.`type` AS `type_` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the types of the ships that have both shiips with tonnage more than 6000 and those with tonnage less than 4000?",
    "evidence": "",
    "idx": 3675
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "{MATCH (film@`film`)\nWHERE film.`director` = 'Nicholas Meyer'\nRETURN film.`studio` AS `studio` \n} \nINTERSECT DISTINCT\n{MATCH (film@`film`)\nWHERE film.`director` = 'Walter Hill'\nRETURN film.`studio` AS `studio` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of studios that have produced films with both Nicholas Meyer and Walter Hill?",
    "evidence": "",
    "idx": 3753
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "{MATCH (film@`film`)\nRETURN film.`studio` AS `studio` \n} \nEXCEPT DISTINCT\n{MATCH (film@`film`)\nWHERE film.`director` = 'Walter Hill'\nRETURN film.`studio` AS `studio` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which studios have never worked with the director Walter Hill?",
    "evidence": "",
    "idx": 3757
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "{MATCH (t1@`person`)-[t2:`friends_with`]->()\nWHERE t1.`name` = t2.`name`\nAND (t2.`friend` = 'Dan')\nRETURN t1.`name` AS `name`, t1.`age` AS `age` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`person`)-[t2:`friends_with`]->()\nWHERE t1.`name` = t2.`name`\nAND (t2.`friend` = 'Alice')\nRETURN t1.`name` AS `name`, t1.`age` AS `age` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names and ages of every person who is a friend of both Dan and Alice?",
    "evidence": "",
    "idx": 3947
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "{MATCH (person@`person`)\nRETURN person.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`person`)-[t2:`friends_with`]->()\nWHERE t1.`name` = t2.`friend`\nAND (t1.`job` = 'student')\nRETURN t2.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of the people who have no friends who are students?",
    "evidence": "",
    "idx": 3951
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "{MATCH (person@`person`)\nRETURN person.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH ()-[personfriend:`friends_with`]->()\nRETURN personfriend.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Who is the person that has no friend?",
    "evidence": "",
    "idx": 3976
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "{MATCH (person@`person`)\nRETURN person.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH ()-[personfriend:`friends_with`]->()\nRETURN personfriend.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of all people who do not have friends?",
    "evidence": "",
    "idx": 3977
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "{MATCH (documents@`documents`)\nRETURN documents.`document_name` AS `document_name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`documents`)-[contains_0:`contains`]->(t2@`document_sections`)-[t3:`has_image`]->()\nWHERE t1.`document_code` = t2.`document_code`\nAND t2.`section_id` = t3.`section_id`\nRETURN t1.`document_name` AS `document_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of documents that do not have any images?",
    "evidence": "",
    "idx": 4010
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "{MATCH (festival_detail@`festival_detail`)\nWHERE festival_detail.`location` = 'United States'\nRETURN festival_detail.`year` AS `year` \n} \nINTERSECT DISTINCT\n{MATCH (festival_detail@`festival_detail`)\nWHERE festival_detail.`location` <> 'United States'\nRETURN festival_detail.`year` AS `year` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "In which year are there festivals both inside the 'United States' and outside the 'United States'?",
    "evidence": "",
    "idx": 4075
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "{MATCH (department@`department`)\nRETURN department.`dname` AS `dname` \n} \nEXCEPT DISTINCT\n{MATCH ()-[t2:`minor_in`]->(t1@`department`)\nWHERE t1.`dno` = t2.`dno`\nRETURN t1.`dname` AS `dname` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Find the name of the department that has no students minored in?",
    "evidence": "",
    "idx": 4123
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "{MATCH (t2@`customer_orders`)-[placed_by_0:`placed_by`]->(t1@`customers`)\nWHERE t1.`customer_id` = t2.`customer_id`\nAND (t2.`order_status_code` = 'New')\nRETURN t1.`customer_name` AS `customer_name`, t1.`customer_address` AS `customer_address` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`customer_orders`)-[placed_by_1:`placed_by`]->(t1@`customers`)\nWHERE t1.`customer_id` = t2.`customer_id`\nAND (t2.`order_status_code` = 'Pending')\nRETURN t1.`customer_name` AS `customer_name`, t1.`customer_address` AS `customer_address` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names and addressed of customers who have both New and Pending orders?",
    "evidence": "",
    "idx": 4170
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "{MATCH (t1@`departments`)-[located_in_0:`located_in`]->(t2@`department_stores`)\nWHERE t1.`dept_store_id` = t2.`dept_store_id`\nAND (t1.`department_name` = 'marketing')\nRETURN t2.`dept_store_id` AS `dept_store_id`, t2.`store_name` AS `store_name` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`departments`)-[located_in_1:`located_in`]->(t2@`department_stores`)\nWHERE t1.`dept_store_id` = t2.`dept_store_id`\nAND (t1.`department_name` = 'managing')\nRETURN t2.`dept_store_id` AS `dept_store_id`, t2.`store_name` AS `store_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What is the id and name of the department store that has both marketing and managing department?",
    "evidence": "",
    "idx": 4173
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "{MATCH (t1@`departments`)-[located_in_0:`located_in`]->(t2@`department_stores`)\nWHERE t1.`dept_store_id` = t2.`dept_store_id`\nAND (t1.`department_name` = 'marketing')\nRETURN t2.`dept_store_id` AS `dept_store_id`, t2.`store_name` AS `store_name` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`departments`)-[located_in_1:`located_in`]->(t2@`department_stores`)\nWHERE t1.`dept_store_id` = t2.`dept_store_id`\nAND (t1.`department_name` = 'managing')\nRETURN t2.`dept_store_id` AS `dept_store_id`, t2.`store_name` AS `store_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids and names of department stores with both marketing and managing departments?",
    "evidence": "",
    "idx": 4174
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "{MATCH (t1@`staff`)-[t2:`assigned_to`]->()\nWHERE t1.`staff_id` = t2.`staff_id`\nAND (t2.`job_title_code` = 'Sales Person')\nRETURN t1.`staff_name` AS `staff_name`, t1.`staff_gender` AS `staff_gender` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`staff`)-[t2:`assigned_to`]->()\nWHERE t1.`staff_id` = t2.`staff_id`\nAND (t2.`job_title_code` = 'Clerical Staff')\nRETURN t1.`staff_name` AS `staff_name`, t1.`staff_gender` AS `staff_gender` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names and genders of staff who have held the title Sales Person, but never Clerical Staff?",
    "evidence": "",
    "idx": 4198
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "{MATCH (t1@`aircraft`)-[t2:`based_at`]->(t3@`airport`)\nWHERE t1.`aircraft_id` = t2.`aircraft_id`\nAND t2.`airport_id` = t3.`airport_id`\nAND (t3.`airport_name` = 'London Heathrow')\nRETURN t1.`aircraft` AS `aircraft` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`aircraft`)-[t2:`based_at`]->(t3@`airport`)\nWHERE t1.`aircraft_id` = t2.`aircraft_id`\nAND t2.`airport_id` = t3.`airport_id`\nAND (t3.`airport_name` = 'London Gatwick')\nRETURN t1.`aircraft` AS `aircraft` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of all aircrafts that are associated with both London Heathrow and Gatwick airports?",
    "evidence": "",
    "idx": 4232
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "{MATCH (school@`school`)\nWHERE school.`founded` < 1890\nRETURN school.`denomination` AS `denomination` \n} \nINTERSECT DISTINCT\n{MATCH (school@`school`)\nWHERE school.`founded` > 1900\nRETURN school.`denomination` AS `denomination` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the denominations used by both schools founded before 1890 and schools founded  after 1900?",
    "evidence": "",
    "idx": 4278
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "{MATCH (t1@`store`)-[t2:`located_in`]->(t3@`district`)\nWHERE t1.`store_id` = t2.`store_id`\nAND t2.`district_id` = t3.`district_id`\nAND (t1.`type` = 'City Mall')\nRETURN t3.`district_name` AS `district_name` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`store`)-[t2:`located_in`]->(t3@`district`)\nWHERE t1.`store_id` = t2.`store_id`\nAND t2.`district_id` = t3.`district_id`\nAND (t1.`type` = 'Village Store')\nRETURN t3.`district_name` AS `district_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of the districts that have both mall and village store style shops?",
    "evidence": "",
    "idx": 4316
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "{MATCH ()-[t2:`tried_out_for`]->(t1@`college`)\nWHERE t1.`cname` = t2.`cname`\nAND (t2.`ppos` = 'goalie')\nRETURN t1.`state` AS `state` \n} \nINTERSECT DISTINCT\n{MATCH ()-[t2:`tried_out_for`]->(t1@`college`)\nWHERE t1.`cname` = t2.`cname`\nAND (t2.`ppos` = 'mid')\nRETURN t1.`state` AS `state` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of the states that have some college students playing in the positions of goalie and mid-field?",
    "evidence": "",
    "idx": 4398
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "{MATCH ()-[tryout:`tried_out_for`]->()\nWHERE tryout.`ppos` = 'mid'\nRETURN tryout.`cname` AS `cname` \n} \nEXCEPT DISTINCT\n{MATCH ()-[tryout:`tried_out_for`]->()\nWHERE tryout.`ppos` = 'goalie'\nRETURN tryout.`cname` AS `cname` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of the schools with some players in the mid position but no goalies?",
    "evidence": "",
    "idx": 4400
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "{MATCH ()-[t2:`tried_out_for`]->(t1@`college`)\nWHERE t1.`cname` = t2.`cname`\nAND (t2.`ppos` = 'mid')\nRETURN t1.`state` AS `state` \n} \nEXCEPT DISTINCT\n{MATCH ()-[t2:`tried_out_for`]->(t1@`college`)\nWHERE t1.`cname` = t2.`cname`\nAND (t2.`ppos` = 'goalie')\nRETURN t1.`state` AS `state` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of all the states with college students playing in the mid position but no goalies?",
    "evidence": "",
    "idx": 4402
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "{MATCH (shop@`shop`)\nWHERE shop.`open_year` > 2012\nRETURN shop.`location` AS `location` \n} \nINTERSECT DISTINCT\n{MATCH (shop@`shop`)\nWHERE shop.`open_year` < 2008\nRETURN shop.`location` AS `location` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which locations contains both shops that opened after the year 2012 and shops that opened before 2008?",
    "evidence": "",
    "idx": 4440
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "{MATCH ()-[t1:`performs_in_2`]->(t2@`songs`)\nWHERE t1.`songid` = t2.`songid`\nRETURN DISTINCT t2.`title` AS `title` \n} \nEXCEPT DISTINCT\n{MATCH ()-[t1:`performs_in_2`]->(t2@`songs`)\nWHERE t1.`songid` = t2.`songid`\nAND (t1.`type` = 'lead')\nRETURN t2.`title` AS `title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of the songs without a lead vocal?",
    "evidence": "",
    "idx": 4490
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "{MATCH ()-[t1:`performs_in_2`]->(t2@`songs`)\nWHERE t1.`songid` = t2.`songid`\nRETURN DISTINCT t2.`title` AS `title` \n} \nEXCEPT DISTINCT\n{MATCH ()-[t1:`performs_in_2`]->(t2@`songs`)\nWHERE t1.`songid` = t2.`songid`\nAND (t1.`type` = 'back')\nRETURN t2.`title` AS `title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the different names of all songs without back vocals?",
    "evidence": "",
    "idx": 4508
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "{MATCH ()-[t1:`performs_in_2`]->(t2@`songs`)\nWHERE t1.`songid` = t2.`songid`\nRETURN DISTINCT t2.`title` AS `title` \n} \nEXCEPT DISTINCT\n{MATCH ()-[t1:`performs_in_2`]->(t2@`songs`)\nWHERE t1.`songid` = t2.`songid`\nAND (t1.`type` = 'back')\nRETURN t2.`title` AS `title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of the songs that do not have back vocals?",
    "evidence": "",
    "idx": 4514
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "{MATCH (t1@`products`)-[manufactured_by_0:`manufactured_by`]->(t2@`manufacturers`)\nWHERE t1.`manufacturer` = t2.`code`\nAND (t2.`name` = 'Creative Labs')\nRETURN t1.`name` AS `name` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`products`)-[manufactured_by_1:`manufactured_by`]->(t2@`manufacturers`)\nWHERE t1.`manufacturer` = t2.`code`\nAND (t2.`name` = 'Sony')\nRETURN t1.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of products produced by both Creative Labs and Sony?",
    "evidence": "",
    "idx": 4544
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "{MATCH (manufacturers@`manufacturers`)\nRETURN manufacturers.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`products`)-[manufactured_by_0:`manufactured_by`]->(t2@`manufacturers`)\nWHERE t1.`manufacturer` = t2.`code`\nAND (t1.`name` = 'DVD drive')\nRETURN t2.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of companies that do not make DVD drives?",
    "evidence": "",
    "idx": 4566
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "{MATCH (t1@`problems`)-[staff_involvement_1_0:`staff_involvement_1`]->(t2@`staff`)\nWHERE t1.`reported_by_staff_id` = t2.`staff_id`\nAND (t2.`staff_first_name` = 'Christop' AND t2.`staff_last_name` = 'Berge')\nRETURN t1.`product_id` AS `product_id` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`problems`)-[staff_involvement_2_0:`staff_involvement_2`]->(t2@`staff`)\nWHERE t1.`closure_authorised_by_staff_id` = t2.`staff_id`\nAND (t2.`staff_first_name` = 'Ashley' AND t2.`staff_last_name` = 'Medhurst')\nRETURN t1.`product_id` AS `product_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the product ids for the problems reported by Christop Berge with closure authorised by Ashley Medhurst?",
    "evidence": "",
    "idx": 4621
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "{MATCH (t1@`student`)-[t2:`voted_for_1`]->()\nWHERE t1.`stuid` = t2.`vice_president_vote`\nRETURN DISTINCT t1.`fname` AS `fname` \n} \nEXCEPT DISTINCT\n{MATCH (student@`student`)\nWHERE student.`city_code` = 'PIT'\nRETURN DISTINCT student.`fname` AS `fname` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the distinct first names of the students who have vice president votes and reside in a city whose city code is not PIT?",
    "evidence": "",
    "idx": 4674
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "{MATCH (characteristics_@`characteristics`)\nRETURN characteristics_.`characteristic_name` AS `characteristic_name`, characteristics_.`other_characteristic_details` AS `other_characteristic_details`, characteristics_.`characteristic_data_type` AS `characteristic_data_type` \n} \nEXCEPT DISTINCT\n{MATCH ()-[t2:`has_characteristic`]->(t1@`characteristics`)\nWHERE t1.`characteristic_id` = t2.`characteristic_id`\nRETURN t1.`characteristic_name` AS `characteristic_name`, t1.`other_characteristic_details` AS `other_characteristic_details`, t1.`characteristic_data_type` AS `characteristic_data_type` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names, details and data types of the characteristics which are never used by any product?",
    "evidence": "",
    "idx": 4749
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "{MATCH (stadium@`stadium`)\nWHERE stadium.`capacity` > 60000\nRETURN stadium.`country` AS `country` \n} \nINTERSECT DISTINCT\n{MATCH (stadium@`stadium`)\nWHERE stadium.`capacity` < 50000\nRETURN stadium.`country` AS `country` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which country has both stadiums with capacity greater than 60000 and stadiums with capacity less than 50000?",
    "evidence": "",
    "idx": 4759
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "{MATCH (stadium@`stadium`)\nRETURN stadium.`country` AS `country` \n} \nEXCEPT DISTINCT\n{MATCH (stadium@`stadium`)\nWHERE stadium.`opening_year` > 2006\nRETURN stadium.`country` AS `country` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which countries do not have a stadium that was opened after 2006?",
    "evidence": "",
    "idx": 4762
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "{MATCH (t1@`dorm`)-[t2:`has_amenity`]->(t3@`dorm_amenity`)\nWHERE t1.`dormid` = t2.`dormid`\nAND t2.`amenid` = t3.`amenid`\nAND (t3.`amenity_name` = 'TV Lounge')\nRETURN t1.`dorm_name` AS `dorm_name` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`dorm`)-[t2:`has_amenity`]->(t3@`dorm_amenity`)\nWHERE t1.`dormid` = t2.`dormid`\nAND t2.`amenid` = t3.`amenid`\nAND (t3.`amenity_name` = 'Study Room')\nRETURN t1.`dorm_name` AS `dorm_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What is the name of the dorm with both a TV Lounge and Study Room listed as amenities?",
    "evidence": "",
    "idx": 4838
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "{MATCH (t1@`dorm`)-[t2:`has_amenity`]->(t3@`dorm_amenity`)\nWHERE t1.`dormid` = t2.`dormid`\nAND t2.`amenid` = t3.`amenid`\nAND (t3.`amenity_name` = 'TV Lounge')\nRETURN t1.`dorm_name` AS `dorm_name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`dorm`)-[t2:`has_amenity`]->(t3@`dorm_amenity`)\nWHERE t1.`dormid` = t2.`dormid`\nAND t2.`amenid` = t3.`amenid`\nAND (t3.`amenity_name` = 'Study Room')\nRETURN t1.`dorm_name` AS `dorm_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What is the name of each dorm that has a TV Lounge but no study rooms?",
    "evidence": "",
    "idx": 4840
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "{MATCH (dorm@`dorm`)\nRETURN dorm.`dorm_name` AS `dorm_name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`dorm`)-[t2:`has_amenity`]->(t3@`dorm_amenity`)\nWHERE t1.`dormid` = t2.`dormid`\nAND t2.`amenid` = t3.`amenid`\nAND (t3.`amenity_name` = 'TV Lounge')\nRETURN t1.`dorm_name` AS `dorm_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of the dorm that does not have a TV Lounge?",
    "evidence": "",
    "idx": 4886
  }
]