[
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`movies_total_gross`)-[gross_info_for_0:`gross_info_for`]->(t1@`characters`)\nWHERE t1.`movie_title` = t2.`movie_title`\nRETURN cast (COUNT(CASE  WHEN NOT t1.`song` IS NULL THEN t2.`movie_title` ELSE NULL END) as float) * 100 / COUNT(t2.`movie_title`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What proportion of the total gross of all movies is from movies with songs?",
    "evidence": "Movies with songs refer song = 'not null'; DIVIDE(SUM(total_gross where song = 'not null'), sum(total_gross)) as percentage;",
    "idx": 2470
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (characters@`characters`)\nWHERE characters.`movie_title` = 'Little Mermaid'\nRETURN characters.`villian` AS `villian`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the villain in Little Mermaid?",
    "evidence": "Little Mermaid refers to movie_title = 'Little Mermaid';",
    "idx": 2472
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`director`)-[directed_0:`directed`]->(t1@`characters`)\nWHERE t1.`movie_title` = t2.`name`\nAND (t1.`hero` = 'Donald Duck')\nRETURN t1.`movie_title` AS `movie_title`, t2.`director` AS `director`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which movies had the main character named Donald Duck and who directed them?",
    "evidence": "Donald Duck is the main character of the movie which refers to hero = 'Donald Duck'; movies refer to movie_title; who directed refers director;",
    "idx": 2478
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t1@`voice-actors`)-[voiced_in_0:`voiced_in`]->(t2@`characters`)\nWHERE t1.`movie` = t2.`movie_title`\nAND (t2.`movie_title` = 'Lion King' AND t1.`character` = 'Lion King')\nRETURN t1.`voice-actor` AS `voice-actor`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the voice actor of the hero in Lion King?",
    "evidence": "Lion King refers to movie_title = 'Lion King';",
    "idx": 2483
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (voice_actors@`voice-actors`)\nWHERE voice_actors.`movie` = 'Aladdin'\nRETURN COUNT('voice-actor') AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many voice actors for the movie Aladdin?",
    "evidence": "Aladdin is the name of the movie which refers to movie = 'Aladdin';",
    "idx": 2486
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (director@`director`)\nWHERE director.`director` = 'Jack Kinney'\nRETURN director.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What movies did director Jack Kinney direct?",
    "evidence": "FALSE;",
    "idx": 2489
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (characters@`characters`)\nWHERE CASE  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1)+char_length(characters.`release_date`),-(char_length(characters.`release_date`)))  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) >= 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1),char_length(characters.`release_date`))  WHEN char_length(characters.`release_date`) - 1-1 >= 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1+1+(char_length(characters.`release_date`)),-(char_length(characters.`release_date`)))  ELSE substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1,char_length(characters.`release_date`)) END >= '37' AND CASE  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1)+char_length(characters.`release_date`),-(char_length(characters.`release_date`)))  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) >= 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1),char_length(characters.`release_date`))  WHEN char_length(characters.`release_date`) - 1-1 >= 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1+1+(char_length(characters.`release_date`)),-(char_length(characters.`release_date`)))  ELSE substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1,char_length(characters.`release_date`)) END <= '50'\nRETURN COUNT(characters.`movie_title`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies were released between 1937 and 1950?",
    "evidence": "released between 1937 and 1950 refers to substr(release_date, length(release_date) - 1,length(release_date)) between '37' and '50';",
    "idx": 2490
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`director`)-[directed_0:`directed`]->(t1@`characters`)\nWHERE t1.`movie_title` = t2.`name`\nAND (t2.`director` = 'Wolfgang Reitherman' AND t1.`villian` IS NULL)\nRETURN t1.`movie_title` AS `movie_title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which movies of director Wolfgang Reitherman do not have villain?",
    "evidence": "which movies do not have villain refer to movie_title where villian is null;",
    "idx": 2494
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t1@`movies_total_gross`)-[gross_info_for_0:`gross_info_for`]->(t2@`characters`)\nWHERE t1.`movie_title` = t2.`movie_title`\nAND (t2.`hero` = 'Taran')\nRETURN t1.`genre` AS `genre`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What genre of movie has Taran as the main character?",
    "evidence": "Taran is the main character of the movie which refers to hero = 'Taran';",
    "idx": 2498
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t1@`voice-actors`)-[voiced_in_0:`voiced_in`]->(t2@`characters`)\nMATCH (t3@`director`)-[directed_0:`directed`]->(t2@`characters`)\nWHERE t1.`movie` = t2.`movie_title`\nAND t2.`movie_title` = t3.`name`\nAND (t2.`hero` = 'Elsa')\nRETURN t1.`voice-actor` AS `voice-actor`, t3.`director` AS `director`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "The main character Elsa is voiced by which actor and who is the director of the movie?",
    "evidence": "Elsa is the main character of the movie which refers to hero = 'Elsa'; voiced by which actor refers to voice-actor;",
    "idx": 2499
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (characters@`characters`)\nWHERE CASE  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1)+char_length(characters.`release_date`),-(char_length(characters.`release_date`)))  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) >= 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1),char_length(characters.`release_date`))  WHEN char_length(characters.`release_date`) - 1-1 >= 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1+1+(char_length(characters.`release_date`)),-(char_length(characters.`release_date`)))  ELSE substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1,char_length(characters.`release_date`)) END >= '10' AND CASE  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1)+char_length(characters.`release_date`),-(char_length(characters.`release_date`)))  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) >= 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1),char_length(characters.`release_date`))  WHEN char_length(characters.`release_date`) - 1-1 >= 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1+1+(char_length(characters.`release_date`)),-(char_length(characters.`release_date`)))  ELSE substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1,char_length(characters.`release_date`)) END <= '16'\nRETURN COUNT(characters.`movie_title`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies were released by Disney between 2010 and 2016?",
    "evidence": "Movies refer to movie_title; released between 2010 and 2016 refers to substr(release_date, length(release_date) - 1, length(release_date)) between '10' and '16';",
    "idx": 2502
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (characters@`characters`)\nORDER BY CASE  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1)+char_length(characters.`release_date`),-(char_length(characters.`release_date`)))  WHEN char_length(characters.`release_date`) - 1-1 < 0 AND char_length(characters.`release_date`) >= 0  THEN substring(characters.`release_date`,length(characters.`release_date`)+1+(char_length(characters.`release_date`) - 1-1),char_length(characters.`release_date`))  WHEN char_length(characters.`release_date`) - 1-1 >= 0 AND char_length(characters.`release_date`) < 0  THEN substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1+1+(char_length(characters.`release_date`)),-(char_length(characters.`release_date`)))  ELSE substring(characters.`release_date`,char_length(characters.`release_date`) - 1-1,char_length(characters.`release_date`)) END DESC NULLS LAST \nRETURN characters.`villian` AS `villian` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who was the first ever Disney villain?",
    "evidence": "the first ever villian is villian that was released before all others in time which refers to substr(release_date, length(release_date) - 1, length(release_date)) desc limit 1;",
    "idx": 2503
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (voice_actors@`voice-actors`)\nWHERE voice_actors.`character` = 'Akela'\nRETURN voice_actors.`voice-actor` AS `voice-actor`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which actor voices Akela from The Jungle Book?",
    "evidence": "Akela refers character = 'Akela'; which actor voices refers to voice-actor;",
    "idx": 2504
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (voice_actors@`voice-actors`)\nWHERE voice_actors.`movie` = 'Bambi'\nRETURN COUNT(DISTINCT 'voice-actor') AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many voice-actors were involved in the Bambi movie?",
    "evidence": "Bambi is the name of the movie which refers to movie = 'Bambi';",
    "idx": 2507
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`full_name` = 'John Aalberg' AND t2.`age` = 31)\nRETURN t1.`games_name` AS `games_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the name of the Olympic game that John Aalberg took part in when he was 31?",
    "evidence": "when he was 31 refers to age = 31; name of the Olympic games refers to games_name;",
    "idx": 2509
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`full_name` = 'John Aalberg' AND t1.`games_name` = '1994 Winter')\nRETURN t2.`age` AS `age`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When John Aalberg took part in the 1994 Winter Olympic Game, how old was he?",
    "evidence": "how old was he refers to age; 1994 Winter refers to games_name = '1994 Winter';",
    "idx": 2510
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`from_region`]->(t2@`noc_region`)\nWHERE t1.`region_id` = t2.`id`\nAND (t2.`region_name` = 'Finland')\nRETURN COUNT(t1.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Olympic competitors are from Finland?",
    "evidence": "competitors refer to person_id; from Finland refers to region_name = 'Finland';",
    "idx": 2511
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`full_name` = 'John Aalberg')\nRETURN t1.`region_name` AS `region_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "The Olympic competitor John Aalberg is from which region?",
    "evidence": "from which region refers to region_name;",
    "idx": 2513
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`gender` = 'M')\nORDER BY t3.`height` DESC NULLS LAST \nRETURN t1.`noc` AS `noc` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the NOC code of the region where the tallest male Olympic competitor is from?",
    "evidence": "NOC code of the region refers to noc; male refers to gender = 'M'; the tallest refers to MAX(height);",
    "idx": 2514
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`region_name` = 'Finland' AND t3.`gender` = 'F')\nRETURN COUNT(t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the Olympic competitors from Finland, how many of them are female?",
    "evidence": "competitors from Finland refer to id where region_name = 'Finland'; female refers to gender = 'F';",
    "idx": 2515
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t3.`games_name` = '1992 Summer')\nRETURN t2.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which city was the 1992 Summer Olympic Games held?",
    "evidence": "In which city refers to city_name; 1992 Summer Olympic Games refer to games_name = '1992 Summer';",
    "idx": 2516
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t2.`city_name` = 'London')\nORDER BY t3.`games_year`  NULLS FIRST \nRETURN t3.`games_year` AS `games_year` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which year did London hold its earliest Olympic game?",
    "evidence": "In which year refers to games_year; London refers to city_name = 'London'; earliest Olympic game refers to MIN(games_year);",
    "idx": 2518
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`id`\nAND (t2.`city_name` = 'London')\nRETURN COUNT(t1.`games_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For how many times has London held the Olympic games?",
    "evidence": "London refers to city_name = 'London'; how many times refer to COUNT(games_id);",
    "idx": 2519
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`region_name` = 'Finland' AND t3.`gender` = 'M')\nRETURN avg(t3.`height`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average height of the male Olympic competitors from Finland?",
    "evidence": "DIVIDE(SUM(height), COUNT(id)) where region_name = 'Finland' and gender = 'M';",
    "idx": 2520
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)-[t4:`from_region`]->(t5@`noc_region`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND t3.`id` = t4.`person_id`\nAND t4.`region_id` = t5.`id`\nAND (t1.`games_name` = '1994 Winter')\nRETURN cast (COUNT(CASE  WHEN t5.`region_name` = 'Finland' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the competitors of the 1994 Winter Olympic Game, what is the percentage of those from Finland?",
    "evidence": "DIVIDE(COUNT(id where region_name = 'Finland'), COUNT(id)) as percentage where games_name = '1994 Winter';",
    "idx": 2521
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t3.`games_name` = '1936 Winter')\nRETURN t2.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city was the host of 1936 Winter Olympic Games?",
    "evidence": "Which city refers to city_name; 1936 Winter Olympic refers to games_name = '1936 Winter';",
    "idx": 2523
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t2.`city_name` = 'London')\nRETURN COUNT(t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Olympic Games has London hosted?",
    "evidence": "London refers to city_name = 'London';",
    "idx": 2524
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`from_region`]->(t2@`noc_region`)\nWHERE t1.`region_id` = t2.`id`\nAND (t2.`region_name` = 'Guatemala')\nRETURN COUNT(t1.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many athletes in the database are from Guatemala?",
    "evidence": "from Guatemala refers to region_name = 'Guatemala';",
    "idx": 2529
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nWHERE t1.`id` = t2.`person_id`\nAND (t1.`full_name` = 'Martina Kohlov')\nRETURN COUNT(t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many competitor ids does Martina Kohlov have?",
    "evidence": "",
    "idx": 2531
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`region_name` = 'Estonia')\nRETURN cast (COUNT(CASE  WHEN t3.`gender` = 'M' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of male athletes from Estonia?",
    "evidence": "DIVIDE(COUNT(id where gender = 'M'), COUNT(id)) as percentage where region_name = 'Estonia';",
    "idx": 2533
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nWHERE t1.`id` = t2.`person_id`\nORDER BY t2.`age`  NULLS FIRST \nRETURN t1.`full_name` AS `full_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the youngest person who participated in the Olympics?",
    "evidence": "Who is the youngest person refers to full_name where MIN(age);",
    "idx": 2534
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t2:`participated_in`]->()\nMATCH ()-[t1:`awarded_in`]->(t3@`event`)\nWHERE t1.`competitor_id` = t2.`id`\nAND t1.`event_id` = t3.`id`\nAND (like(t3.`event_name`,'Basketball Men%s Basketball') AND t2.`age` = 24)\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many 24 years old competitors competed in Men's Basketball?",
    "evidence": "24 years old competitors refer to id where age = 24; Men's Basketball refers to event_name = 'Basketball Men''s Basketball';",
    "idx": 2535
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t2@`event`)-[belongs_to_sport_0:`belongs_to_sport`]->(t1@`sport`)\nWHERE t1.`id` = t2.`sport_id`\nAND (t1.`sport_name` = 'Art Competitions')\nRETURN t2.`event_name` AS `event_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the events under Art Competitions?",
    "evidence": "Art Competitions refer to sport_name = 'Art Competitions'; names of events refers to event_name;",
    "idx": 2536
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nMATCH ()-[t3:`awards_medal`]->(t4@`medal`)\nWHERE t1.`id` = t2.`person_id`\nAND t2.`id` = t3.`competitor_id`\nAND t3.`medal_id` = t4.`id`\nAND (t1.`full_name` = 'Henk Jan Zwolle' AND t4.`medal_name` = 'Gold')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many gold medals does Henk Jan Zwolle have?",
    "evidence": "gold medals refer to medal_name = 'Gold';",
    "idx": 2537
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->()\nWHERE t1.`id` = t2.`region_id`\nAND (t1.`region_name` = 'Australia')\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many athletes are from Australia?",
    "evidence": "from Australia refer region_name = 'Australia';",
    "idx": 2538
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t2.`city_name` = 'Stockholm' AND t3.`season` = 'Summer')\nRETURN COUNT(t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Summer games were held in Stockholm?",
    "evidence": "Summer games refer to id where season = 'Summer'; in Stockholm refers to city_name = 'Stockholm';",
    "idx": 2539
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nORDER BY t3.`games_year`  NULLS FIRST \nRETURN t2.`city_name` AS `city_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Where was the first Olympic game held?",
    "evidence": "Where it was held refers to city_name; the first Olympic game refers to id where MIN(games_year);",
    "idx": 2540
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nORDER BY t2.`age`  NULLS FIRST \nRETURN t1.`games_name` AS `games_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the game in which the oldest Olympian has ever participated?",
    "evidence": "the oldest Olympian refers to id where MAX(age); name of the game refers to games_name;",
    "idx": 2541
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`games_name` = '1928 Summer')\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many athletes competed in the 1992 Summer Olympics?",
    "evidence": "1992 Summer Olympics refer to games_name = '1928 Summer';",
    "idx": 2542
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (city@`city`)\nWHERE like(city.`city_name`,'M%')\nRETURN city.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which cities beginning with the letter M have the Olympic Games been held?",
    "evidence": "cities beginning with the letter M refer to city_name LIKE 'M%';",
    "idx": 2543
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t3.`games_name` IN ['1976 Summer', '1976 Winter'])\nRETURN t2.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which cities were the 1976 winter and summer games held?",
    "evidence": "cities refer to city_name; 1976 winter and summer games refer to games_name IN ('1976 Winter', '1976 Summer');",
    "idx": 2544
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nMATCH ()-[t3:`awards_medal`]->(t4@`medal`)\nWHERE t1.`id` = t2.`person_id`\nAND t2.`id` = t3.`competitor_id`\nAND t3.`medal_id` = t4.`id`\nAND (t1.`full_name` = 'Coleen Dufresne (-Stewner)')\nRETURN t4.`medal_name` AS `medal_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the medal that Coleen Dufresne got?",
    "evidence": "What medal refers to medal_name;",
    "idx": 2545
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`full_name` = 'Estelle Nze Minko')\nRETURN t1.`region_name` AS `region_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Where is competitor Estelle Nze Minko from?",
    "evidence": "Where competitor is from refers to region_name;",
    "idx": 2546
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nWHERE t1.`id` = t2.`person_id`\nORDER BY t2.`age` DESC NULLS LAST \nRETURN t1.`full_name` AS `full_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the oldest person who participated in the Olympic Games?",
    "evidence": "the oldest person refers to person_id where MAX(age); name refers to full_name;",
    "idx": 2547
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`region_name` = 'Belgium' AND t3.`gender` = 'M')\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many males from Belgium have participated in an Olympic Games?",
    "evidence": "males refer to gender = 'M'; Belgium refers to region_name = 'Belgium';",
    "idx": 2548
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t2:`held_in`]->(t3@`city`)\nMATCH ()-[t1:`participated_in`]->()\nWHERE t1.`games_id` = t2.`games_id`\nAND t2.`city_id` = t3.`id`\nAND (t3.`city_name` = 'Sapporo')\nRETURN COUNT(t1.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many persons participated in the Sapporo Olympics?",
    "evidence": "the Sapporo Olympics refer to games_id where city_name = 'Sapporo';",
    "idx": 2549
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`full_name` = 'Morten Aleksander Djupvik')\nRETURN t1.`games_name` AS `games_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which Olympic Games has Morten Aleksander Djupvik participated?",
    "evidence": "In which Olympic Games refer to games_year;",
    "idx": 2550
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`awarded_in`]->(t2@`event`)-[belongs_to_sport_0:`belongs_to_sport`]->(t3@`sport`)\nWHERE t1.`event_id` = t2.`id`\nAND t2.`sport_id` = t3.`id`\nAND (t2.`event_name` = 'Sailing Mixed 12 metres')\nRETURN COUNT(t1.`competitor_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many persons in total have participated in 12 meter Mixed Sailing competitions?",
    "evidence": "12 meter Mixed Sailing competitions refer to event_name = 'Sailing Mixed 12 metres';",
    "idx": 2551
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t2@`event`)-[belongs_to_sport_0:`belongs_to_sport`]->(t1@`sport`)\nWHERE t1.`id` = t2.`sport_id`\nAND (t1.`sport_name` = 'Modern Pentathlon')\nRETURN COUNT(DISTINCT t2.`event_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many different events are there of Modern Pentathlon?",
    "evidence": "Modern Pentathlon refers to sport_name = 'Modern Pentathlon';",
    "idx": 2552
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`games_name` = '2014 Winter')\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many athletes participated in the 2014 Winter Olympics?",
    "evidence": "athletes refer to person_id; 2014 Winter Olympics refer to games_name = '2014 Winter';",
    "idx": 2555
  }
]