[
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`t2`:`subjects`)-[involved_in_0:involved_in]->(`t1`:`incidents`)\nWHERE `t1`.`case_number` = `t2`.`case_number`\nAND (`t2`.`gender` = 'M')\nRETURN `t1`.`case_number` AS `case_number`, `t1`.`location` AS `location`, `t1`.`subject_statuses` AS `subject_statuses`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From the cases where the subject are male, list the case number and the location and subject status.",
    "evidence": "male refers to gender = 'M'",
    "idx": 1795
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`t2`:`officers`)-[involved_in_0:involved_in]->(`t1`:`incidents`)\nWHERE `t1`.`case_number` = `t2`.`case_number`\nAND (`t1`.`case_number` = '134472-2015')\nRETURN `t2`.`last_name` AS `last_name`, `t1`.`subject_statuses` AS `subject_statuses`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For case number '134472-2015', list the last name of the officers involved and state the subject statuses.",
    "evidence": "",
    "idx": 1796
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`t2`:`subjects`)-[involved_in_0:involved_in]->(`t1`:`incidents`)\nWHERE `t1`.`case_number` = `t2`.`case_number`\nAND (`t1`.`subject_statuses` = 'Deceased')\nRETURN `t2`.`last_name` AS `last_name`, `t2`.`gender` AS `gender`, `t2`.`race` AS `race`, `t2`.`case_number` AS `case_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From the cases where the subject were deceased, list the subject's last name, gender, race and case number.",
    "evidence": "subject were deceased refers to subject_statuses = 'Deceased'",
    "idx": 1797
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`t2`:`subjects`)-[involved_in_0:involved_in]->(`t1`:`incidents`)\nWHERE `t1`.`case_number` = `t2`.`case_number`\nAND (`t2`.`gender` = 'F')\nRETURN CASE WHEN COUNT(`t1`.`case_number`)=0 THEN NULL ELSE toFloat(sum(toInteger(`t1`.`subject_weapon` = 'Vehicle'))) * 100 / COUNT(`t1`.`case_number`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of subject who are female used the Vehicle as weapon?",
    "evidence": "female refers to gender = 'F'; use Vehicle as weapon refers to subject_weapon = 'Vehicle'; percentage = divide(count(case_number where subject_weapon = 'Vehicle'), count(case_number)) where gender = 'F' * 100%",
    "idx": 1798
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`t2`:`subjects`)-[involved_in_0:involved_in]->(`t1`:`incidents`)\nWHERE `t1`.`case_number` = `t2`.`case_number`\nAND (`t1`.`subject_statuses` = 'Injured')\nRETURN CASE WHEN toInteger(sum(toInteger(`t1`.`subject_weapon` = 'Handgun')))=0 THEN NULL ELSE toFloat(sum(toInteger(`t1`.`subject_weapon` = 'Knife'))) * 100 / toInteger(sum(toInteger(`t1`.`subject_weapon` = 'Handgun'))) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From the 'Injured' statuses of the subject, what is the ratio of weapons used are knife against handgun?",
    "evidence": "the 'Shoot and Miss' status refers to subject_statuses = 'Shoot and Miss'; knife refers to subject_weapon = 'knife'; toy handgun refers to subject_weapon = 'toy handgun'; ratio = divide(count(case_number where subject_weapon = 'knife'), count(case_number where subject_weapon = 'toy handgun')) where subject_statuses = 'Shoot and Miss'",
    "idx": 1799
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`incidents`:`incidents`)\nWHERE CASE WHEN `incidents`.`date` is not NULL THEN apoc.temporal.format(`incidents`.`date`,'yyyy') ELSE NULL END > '2011' AND `incidents`.`subject_statuses` = 'Deceased'\nRETURN `incidents`.`case_number` AS `case_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all cases from the year 2012 in which the subject was deceased",
    "evidence": "case refers to case_number; year 2012 refers to date between '2012-01-01' and '2012-12-31'; subject was deceased refers to subject_statuses = 'Deceased'",
    "idx": 1800
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`officers`:`officers`)\nWHERE `officers`.`gender` = 'M'\nRETURN CASE WHEN COUNT(`officers`.`case_number`)=0 THEN NULL ELSE toFloat(sum(toInteger(`officers`.`race` = 'B'))) * 100 / COUNT(`officers`.`case_number`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Of all male officers, what percentage are black officers?",
    "evidence": "male refers to gender = 'M'; black refers to race = 'B'; percentage = divide(count(officers where race = 'B'), count(officers)) where gender = 'M' * 100%",
    "idx": 1801
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`officers`:`officers`)\nWHERE `officers`.`race` = 'W'\nRETURN CASE WHEN toInteger(sum(toInteger(`officers`.`gender` = 'F')))=0 THEN NULL ELSE toFloat(sum(toInteger(`officers`.`gender` = 'M'))) / toInteger(sum(toInteger(`officers`.`gender` = 'F'))) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the proportion of white males and females in the police force?",
    "evidence": "white refers to race = 'W'; male refers to gender = 'M'; female refers to gender = 'F'; proportion of white males = divide(count(officers where race = 'W' and gender = 'M'), count(officers)) * 100%; proportion of white females = divide(count(officers where race = 'W' and gender = 'F'), count(officers)) * 100%",
    "idx": 1807
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`subjects`:`subjects`)\nWHERE `subjects`.`gender` = 'F'\nRETURN toInteger(sum(toInteger(`subjects`.`race` = 'B'))) - toInteger(sum(toInteger(`subjects`.`race` = 'W'))) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many more black female victims than white female victims were discovered?",
    "evidence": "black refers to race = 'B'; female refers to gender = 'F'; white refers to race = 'W'; result = subtract(count(victims where race = 'B'), count(victims where race = 'W')) where gender = 'F'",
    "idx": 1808
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`incidents`:`incidents`)\nWHERE `incidents`.`subject_weapon` = 'Rifle'\nRETURN CASE WHEN COUNT(`incidents`.`case_number`)=0 THEN NULL ELSE toFloat(sum(toInteger(`incidents`.`subject_statuses` = 'Deceased'))) * 100 / COUNT(`incidents`.`case_number`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of deaths were caused by rifles?",
    "evidence": "rifle refers to subject_weapon = 'rifles'; death refers to subject_statuses = 'Deceased'; percentage = divide(count(incidents where subject_weapon = 'rifles'), count(incidents)) where subject_statuses = 'Deceased' * 100%",
    "idx": 1809
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`t2`:`officers`)-[involved_in_0:involved_in]->(`t1`:`incidents`)\nWHERE `t1`.`case_number` = `t2`.`case_number`\nAND (`t1`.`subject_statuses` = 'Injured')\nRETURN CASE WHEN COUNT(`t1`.`case_number`)=0 THEN NULL ELSE toFloat(sum(toInteger(`t2`.`gender` = 'M'))) * 100 / COUNT(`t1`.`case_number`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What proportion of male police officers looked into events where people were injured?",
    "evidence": "male refers to gender = 'M'; people were injured refers to subject_statuses = 'Injured'; proportion = divide(count(case_number where gender = 'M'), count(case_number)) where subject_statuses = 'Injured' * 100%",
    "idx": 1812
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (`t1`:`genes`)-[has_classification_0:has_classification]->(`t2`:`classification`)\nWHERE `t1`.`geneid` = `t2`.`geneid`\nAND (`t2`.`localization` = 'plasma membrane')\nRETURN `t1`.`chromosome` AS `chromosome`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the genes that are located in the plasma membrane, please list their number of chromosomes.",
    "evidence": "",
    "idx": 1813
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (`t1`:`genes`)-[has_classification_0:has_classification]->(`t2`:`classification`)\nWHERE `t1`.`geneid` = `t2`.`geneid`\nORDER BY `t1`.`chromosome` IS NULL ASC, `t1`.`chromosome` DESC \nRETURN `t2`.`localization` AS `localization`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the location of the genes that have the most chromosomes.",
    "evidence": "",
    "idx": 1816
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (`t1`:`genes`)-[t2:interacts_with]->()\nWHERE `t1`.`geneid` = `t2`.`geneid1`\nORDER BY `t2`.`expression_corr` IS NULL DESC, `t2`.`expression_corr`  \nRETURN `t1`.`function` AS `function`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the functions of the pair of genes that have the lowest expression correlation score?a",
    "evidence": "",
    "idx": 1818
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (`t1`:`genes`)-[t2:interacts_with]->()\nWHERE `t1`.`geneid` = `t2`.`geneid1`\nAND (`t1`.`localization` = 'cytoplasm' AND `t1`.`chromosome` = 7)\nRETURN `t2`.`geneid1` AS `geneid1`, `t2`.`geneid2` AS `geneid2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the motif of the genes that are located in the cytoplasm and have 7 chromosomes.",
    "evidence": "",
    "idx": 1821
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (`genes`:`genes`)\nWHERE `genes`.`localization` = 'cytoplasm' AND `genes`.`function` = 'METABOLISM'\nRETURN DISTINCT `genes`.`geneid` AS `geneid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Lists all genes by identifier number located in the cytoplasm and whose function is metabolism.",
    "evidence": "",
    "idx": 1826
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH ()-[interactions:interacts_with]->()\nWHERE `interactions`.`type` = 'Physical'\nRETURN `interactions`.`expression_corr` AS `expression_corr`   \nUNION ALL\nMATCH ()-[interactions:interacts_with]->()\nWHERE `interactions`.`type` = 'Physical'\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(toInteger(`interactions`.`expression_corr` < 0))) * 100 / COUNT(*) END AS `expression_corr`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What kind of expression correlation occurs in physical type interacting gene pairs and what percentage of these are negatively correlated?",
    "evidence": "If the Expression_Corr value is negative then it's negatively correlated. Percentage of Negative Correlation = count(negative Expression_Corr physical type) / count(Expression_Corr physical type) * 100%",
    "idx": 1828
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (`genes`:`genes`)\nRETURN sum(toInteger(`genes`.`localization` = 'cytoskeleton' AND `genes`.`phenotype` = 'Conditional phenotypes')) AS `_col_0`, CASE WHEN COUNT(`genes`.`geneid`)=0 THEN NULL ELSE toFloat(sum(toInteger(`genes`.`localization` = 'cytoskeleton'))) * 100 / COUNT(`genes`.`geneid`) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of genes located in the cytoskeleton are of unknown class? And of these, how many are not conditional phenotypes?",
    "evidence": "Percentage = count(genes located in the cytoskeleton unknown class) / count(genes located in the cytoskeleton) * 100%",
    "idx": 1829
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (`t1`:`genes`)-[t2:interacts_with]->()\nWHERE `t1`.`geneid` = `t2`.`geneid1`\nAND (`t2`.`expression_corr` > 0 AND `t1`.`localization` = 'nucleus')\nRETURN `t1`.`geneid` AS `geneid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all genes whose interaction is with genes located in the nucleus in which it is positively correlated.",
    "evidence": "If the Expression_Corr value is positive then it's positively correlated",
    "idx": 1831
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (`t1`:`genes`)-[t2:interacts_with]->()\nWHERE `t1`.`geneid` = `t2`.`geneid1`\nAND (`t1`.`localization` = 'nucleus' AND `t1`.`class` = 'Transcription factors' AND `t1`.`essential` = 'Essential' AND `t2`.`expression_corr` <> 0)\nRETURN `t2`.`geneid1` AS `geneid1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Taking all the essential genes of the transcription factors class located in the nucleus as a reference, how many of them carry out a genetic-type interaction with another gene? List them.",
    "evidence": "",
    "idx": 1832
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`app` = 'HTC Weather' AND `t2`.`sentiment` = 'Neutral')\nRETURN COUNT(`t1`.`rating`) AS `_col_0`, `t1`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many users holds neutral attitude towards the HTC Weather app? Indicate the app's rating on the Google Play Store.",
    "evidence": "user holds neutral attitude refers to Sentiment = 'Neutral';",
    "idx": 1835
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`app` = 'Cooking Fever')\nRETURN avg(toFloat(`t2`.`sentiment_polarity`)) AS `_col_0`, `t1`.`content rating` AS `content rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average sentiment polarity score of the Cooking Fever app? Indicate the age group that the app is targeted at.",
    "evidence": "average sentiment polarity score = AVG(Sentiment_Polarity); age group the app is target at refers to Content Rating;",
    "idx": 1837
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`app` = 'Basketball Stars')\nRETURN min(`t2`.`sentiment_polarity`) AS `_col_0`, `t1`.`installs` AS `installs`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the lowest sentiment polarity score of the Basketball Stars app for people who dislikes the app pretty much and how many downloads does it have?",
    "evidence": "lowest sentiment polarity score refers to MIN(Sentiment_Polarity); user dislike the app pretty much refers to Sentiment_Polarity<-0.5; number of downloads it has refers to installs;",
    "idx": 1838
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`playstore`:`playstore`)\nWHERE `playstore`.`price` = '0'\nORDER BY toInteger(replace(replace(`playstore`.`installs`,',',''),'+','')) IS NULL ASC, toInteger(replace(replace(`playstore`.`installs`,',',''),'+','')) DESC \nRETURN `playstore`.`app` AS `app`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the top 5 installed free apps?",
    "evidence": "free app refers to price = 0; most installed app refers to MAX(Installs);",
    "idx": 1840
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`playstore`:`playstore`)\nORDER BY `playstore`.`reviews` IS NULL ASC, `playstore`.`reviews` DESC \nRETURN DISTINCT `playstore`.`app` AS `app`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the top 10 most reviewed apps.",
    "evidence": "most reviewed app refers to MAX(Reviews);",
    "idx": 1841
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`rating` = 3.9)\nRETURN `t1`.`app` AS `app`, `t2`.`translated_review` AS `translated_review`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List apps whose rating is 3.9 and state the translated review of each app.",
    "evidence": "lowest rating refers to Rating = 1;",
    "idx": 1844
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "WITH *, COLLECT { MATCH (`playstore_sub0`:`playstore`)\nWHERE toInteger(CASE  WHEN -4-1 < 0 AND 4 < 0  THEN substring('Last Updated',(case when size('Last Updated')+1+(-4-1)+4 < 0 then 0 else size('Last Updated')+1+(-4-1)+4 end),-(4))  WHEN -4-1 < 0 AND 4 >= 0  THEN substring('Last Updated',size('Last Updated')+1+(-4-1),4)  WHEN -4-1 >= 0 AND 4 < 0  THEN substring('Last Updated',(case when -4-1+1+(4) < 0 then 0 else -4-1+1+(4) end),-(4))  ELSE substring('Last Updated',-4-1,4) END) < 2015\nRETURN `playstore_sub0`.`app` AS `app_1`   } AS in_collect_0\nMATCH (`user_reviews`:`user_reviews`)\nWHERE `user_reviews`.`app` IN in_collect_0\nRETURN DISTINCT `user_reviews`.`app` AS `app`, `user_reviews`.`sentiment` AS `sentiment`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which apps have not been updated since year 2015 and what kind of sentiment users hold on it?",
    "evidence": "since year 2015 refers to \"Last Updated\"<'January 1, 2015';",
    "idx": 1845
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nORDER BY toFloat(`t1`.`price`) * toInteger(replace(replace(`t1`.`installs`,',',''),'+','')) IS NULL ASC, toFloat(`t1`.`price`) * toInteger(replace(replace(`t1`.`installs`,',',''),'+','')) DESC \nRETURN `t1`.`app` AS `app`, `t2`.`sentiment_polarity` AS `sentiment_polarity`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which of the app is the best selling app and what is the sentiments polarity of it?",
    "evidence": "best selling app = MAX(MULTIPLY(Price, Installs));",
    "idx": 1846
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`playstore`:`playstore`)\nWHERE `playstore`.`app` = 'Draw A Stickman'\nRETURN `playstore`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the rating for \"Draw A Stickman\"?",
    "evidence": "Draw A Stickman refers to App = 'Draw A Stickman';",
    "idx": 1848
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`user_reviews`:`user_reviews`)\nWHERE `user_reviews`.`app` = 'Brit + Co' AND NOT `user_reviews`.`translated_review` IS NULL\nRETURN COUNT(`user_reviews`.`app`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the reviews for the app \"Brit + Co\" have a comment?",
    "evidence": "Brit + Co refers to App = 'Brit + Co'; comment refers to Translated Review NOT null;",
    "idx": 1849
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`user_reviews`:`user_reviews`)\nWHERE `user_reviews`.`app` = 'Dino War: Rise of Beasts' AND `user_reviews`.`sentiment` = 'Neutral'\nRETURN COUNT(`user_reviews`.`app`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many neutral reviews does the app \"Dino War: Rise of Beasts\" have?",
    "evidence": "neutral reviews refers to Sentiment = 'Neutral';",
    "idx": 1850
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`user_reviews`:`user_reviews`)\nWHERE `user_reviews`.`app` = 'Dog Run - Pet Dog Simulator' AND `user_reviews`.`sentiment` = 'Negative'\nRETURN `user_reviews`.`translated_review` AS `translated_review`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the negative comments on the \"Dog Run - Pet Dog Simulator\" app.",
    "evidence": "negative comment refers to Sentiment = 'Negative';",
    "idx": 1852
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t2`.`translated_review` =~ '(?i)(?s).*gr8.*')\nRETURN DISTINCT `t1`.`content rating` AS `content rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the content ratings for the apps that have \"gr8\" in their comments?",
    "evidence": "app with gr8 in their comments refers to Translated_Review LIKE '%gr8%';",
    "idx": 1854
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`app` = 'Garden Coloring Book')\nRETURN `t1`.`rating` AS `rating`, `t2`.`translated_review` AS `translated_review`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the rating for \"Garden Coloring Book\"? List all of its reviews.",
    "evidence": "Golfshot Plus: Golf GPS refers to App = 'Golfshot Plus: Golf GPS'; review refers to Translated_Review;",
    "idx": 1855
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`content rating` = 'Mature 17+')\nORDER BY `t1`.`rating` IS NULL DESC, `t1`.`rating`  \nRETURN `t2`.`translated_review` AS `translated_review`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the comments on the lowest rated Mature 17+ app.",
    "evidence": "comments refers to Translated_Review; lowest rated refers to Rating = 1; Mature 17+ refers to Content Rating = 'Mature 17+ ';",
    "idx": 1856
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`app` = 'Onefootball - Soccer Scores')\nRETURN `t1`.`rating` AS `rating`, sum(`t2`.`sentiment_subjectivity`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the rating and the total Sentiment subjectivity score of \"Onefootball - Soccer Scores\"?",
    "evidence": "Onefootball - Soccer Scores refers to App = 'Onefootball - Soccer Scores';",
    "idx": 1858
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`playstore`:`playstore`)\nWHERE `playstore`.`rating` = 5\nRETURN DISTINCT `playstore`.`app` AS `app`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which apps have 5 rating? List out then application name.",
    "evidence": "application name refers to App;",
    "idx": 1860
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`playstore`:`playstore`)\nWHERE `playstore`.`installs` = '1,000,000,000+'\nWITH `playstore`.`genres` AS _groupby_col_0\nRETURN _groupby_col_0 AS `genres`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out genre that have downloads more than 1000000000.",
    "evidence": "downloads and installs are synonyms; Installs = '1,000,000,000+';",
    "idx": 1862
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`playstore`:`playstore`)\nWHERE `playstore`.`genres` = 'Dating'\nRETURN avg(toFloat(`playstore`.`price`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average price for a dating application?",
    "evidence": "average price = AVG(Price where Genre = 'Dating'); dating application refers to Genre = 'Dating';",
    "idx": 1863
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`playstore`:`playstore`)\nWHERE `playstore`.`category` = 'ENTERTAINMENT' AND `playstore`.`size` < '1.0M'\nRETURN avg(toInteger(replace(replace(`playstore`.`installs`,',',''),'+',''))) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average download for entertainment apps with size no more than 1.0 M?",
    "evidence": "downloads and installs are synonyms; entertainment apps refers to Category = 'ENTERTAINMENT';",
    "idx": 1864
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "WITH *, COLLECT { MATCH (`user_reviews_sub0`:`user_reviews`)\nWHERE `user_reviews_sub0`.`sentiment` = 'Positive' AND `user_reviews_sub0`.`sentiment_polarity` > '0.5'\nORDER BY `user_reviews_sub0`.`sentiment_polarity` IS NULL ASC, `user_reviews_sub0`.`sentiment_polarity` DESC \nRETURN `user_reviews_sub0`.`app` AS `app`  LIMIT 3\n} AS in_collect_0\nMATCH (`playstore`:`playstore`)\nWHERE `playstore`.`app` IN in_collect_0\nRETURN `playstore`.`genres` AS `genres`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the top 3 genre for application with a sentiment review greater than 0.5.",
    "evidence": "sentiment review refers to Sentiment_Polarity; Sentiment_Polarity>0.5;",
    "idx": 1866
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "CALL(*) {\nMATCH (`user_reviews_sub0`:`user_reviews`)\nWITH `user_reviews_sub0`.`app` AS _groupby_col_0, COUNT(CASE  WHEN `user_reviews_sub0`.`sentiment` = 'Positive' THEN 1 ELSE NULL END) - COUNT(CASE  WHEN `user_reviews_sub0`.`sentiment` = 'Negative' THEN 1 ELSE NULL END) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0_1`  \n}\nMATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`rating` = 4.7)\nRETURN CASE WHEN COUNT(`t2`.`sentiment`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `_col_0_1` > 0 THEN 1 ELSE NULL END)) * 100 / COUNT(`t2`.`sentiment`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of application with 4.7 rating having more positives sentiment than negative sentiment?",
    "evidence": "percentage = DIVIDE(SUBTRACT(SUM(Sentiment = 'Positive')), (SUM(Sentiment = 'Negative')), SUM(Sentiment = 'Negative')) as percentage; having more positive sentiment than negative sentiment refers to Sentiment = 'Positive'>Sentiment = 'Negative';",
    "idx": 1867
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t2`.`sentiment` <> 'Negative')\nWITH `t1`.`app` AS _groupby_col_0, avg(toFloat(`t2`.`sentiment_polarity`)) AS _groupby_col_1\nRETURN _groupby_col_0 AS `app`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down app that does not have negative sentiment and give their average rating?",
    "evidence": "doest not have negative sentiment refers to Sentiment! = 'Negative'; average = AVG(Sentiment_Polarity);",
    "idx": 1868
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`playstore`:`playstore`)\nWHERE `playstore`.`app` = 'Learn C++'\nRETURN DISTINCT `playstore`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the rating for the App Learn C++.",
    "evidence": "FALSE;",
    "idx": 1871
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t2`.`sentiment_polarity` = '0.3')\nRETURN DISTINCT `t1`.`app` AS `app`, `t1`.`installs` AS `installs`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the Apps with a sentiment objectivity of 0.3 and include their number of installs.",
    "evidence": "FALSE;",
    "idx": 1874
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`app` = 'FREEDOME VPN Unlimited anonymous Wifi Security')\nRETURN `t1`.`installs` AS `installs`, toFloat(CASE WHEN sum(CASE  WHEN NOT `t2`.`sentiment` IS NULL THEN 1.0 ELSE 0 END)=0 THEN NULL ELSE sum(CASE  WHEN `t2`.`sentiment` = 'Positive' THEN 1 ELSE 0 END) * 100 / sum(CASE  WHEN NOT `t2`.`sentiment` IS NULL THEN 1.0 ELSE 0 END) END) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the number of installs and include the percentage of positive sentiments of FREEDOME VPN Unlimited anonymous Wifi Security.",
    "evidence": "FREEDOME VPN Unlimited anonymous Wifi Security is the App; percentage = MULTIPLY(DIVIDE((SUM(Sentiment = 'Positive')), (COUNT(*))), 100)",
    "idx": 1876
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`app` = 'Honkai Impact 3rd' AND `t2`.`sentiment_polarity` > '0.5')\nWITH `t1`.`genres` AS _groupby_col_0, MAX(`t2`.`sentiment_polarity`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `genres`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the Honkai Impact 3rd App, what is the highest sentiment polarity score and what genre does it belong to?",
    "evidence": "highest sentiment polarity score refers to MAX(Sentiment_Polarity);",
    "idx": 1877
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`app` = 'Dragon Ball Legends' AND toInteger(`t2`.`sentiment_polarity`) < -0.5)\nRETURN `t1`.`rating` AS `rating`, COUNT(`t2`.`sentiment_polarity`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the rating of Dragon Ball Legends and how many users dislike this App?",
    "evidence": "Dragon Ball Legends is the app; users who dislikes the app refers to Sentiment_Polarity<-0.5;",
    "idx": 1878
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`category` = 'EDUCATION')\nWITH `t1`.`app` AS _groupby_col_0, `t2`.`translated_review` AS _groupby_col_1\nORDER BY `t1`.`rating` IS NULL DESC, `t1`.`rating`  \nRETURN _groupby_col_0 AS `app`, _groupby_col_1 AS `translated_review`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which education App has the worst rating and state the translated review if available.",
    "evidence": "education App refers to Category = 'EDUCATION'; worst rated app refers to Rating = 1;",
    "idx": 1879
  }
]