[
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "WITH *, COLLECT { MATCH (`projects_sub0`:`projects`)\nWITH `projects_sub0`.`organisation_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `organisation_id`  LIMIT 1\n} AS in_collect_0\nMATCH (`projects`:`projects`)\nWHERE `projects`.`organisation_id` IN in_collect_0\nRETURN `projects`.`project_details` AS `project_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the details for the projects which were launched by the organization with the most projects?",
    "evidence": "",
    "idx": 4848
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`research_staff`:`research_staff`)\nRETURN `research_staff`.`staff_details` AS `staff_details` ORDER BY `staff_details` IS NULL DESC, `staff_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the research staff details, and order in ascending order.",
    "evidence": "",
    "idx": 4849
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`research_staff`:`research_staff`)\nRETURN `research_staff`.`staff_details` AS `staff_details` ORDER BY `staff_details` IS NULL DESC, `staff_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What details are there on the research staff? List the result in ascending alphabetical order.",
    "evidence": "",
    "idx": 4850
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`project_staff`:`project_staff`)\nWHERE `project_staff`.`date_from` > localdatetime('2003-04-19T15:06:20') AND `project_staff`.`date_to` < localdatetime('2016-03-15T00:33:18')\nRETURN `project_staff`.`role_code` AS `role_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the staff roles of the staff who",
    "evidence": "",
    "idx": 4853
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`project_staff`:`project_staff`)\nWHERE `project_staff`.`date_from` > localdatetime('2003-04-19T15:06:20') AND `project_staff`.`date_to` < localdatetime('2016-03-15T00:33:18')\nRETURN `project_staff`.`role_code` AS `role_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What roles did staff members play between '2003-04-19 15:06:20' and '2016-03-15 00:33:18'?",
    "evidence": "",
    "idx": 4854
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`job` = 'student'\nRETURN MAX(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`person`:`person`)\nWHERE `person`.`job` = 'student' AND `person`.`age` = `_col_0`\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the oldest person whose job is student?",
    "evidence": "",
    "idx": 4869
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`job` = 'student'\nRETURN MAX(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`person`:`person`)\nWHERE `person`.`job` = 'student' AND `person`.`age` = `_col_0`\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the oldest student?",
    "evidence": "",
    "idx": 4870
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`gender` = 'male'\nRETURN min(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`person`:`person`)\nWHERE `person`.`gender` = 'male' AND `person`.`age` = `_col_0`\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the youngest male?",
    "evidence": "",
    "idx": 4871
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`gender` = 'male'\nRETURN min(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`person`:`person`)\nWHERE `person`.`gender` = 'male' AND `person`.`age` = `_col_0`\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the youngest male?",
    "evidence": "",
    "idx": 4872
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`age` < 40\nWITH `person`.`gender` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of people who is under 40 for each gender.",
    "evidence": "",
    "idx": 4887
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`job` = 'engineer'\nRETURN min(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`person`:`person`)\nWHERE `person`.`age` > `_col_0`\nORDER BY `person`.`age` IS NULL DESC, `person`.`age`  \nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of people whose age is greater than any engineer sorted by their age.",
    "evidence": "",
    "idx": 4889
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`job` = 'engineer'\nRETURN min(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`person`:`person`)\nWHERE `person`.`age` > `_col_0`\nORDER BY `person`.`age` IS NULL DESC, `person`.`age`  \nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of all the people who are older than at least one engineer? Order them by age.",
    "evidence": "",
    "idx": 4890
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`job` = 'engineer'\nRETURN MAX(`person_sub0`.`age`) AS `_col_0_1`  \n}\nMATCH (`person`:`person`)\nWHERE `person`.`age` > `_col_0_1`\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of people whose age is greater than all engineers.",
    "evidence": "",
    "idx": 4891
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`job` = 'engineer'\nRETURN MAX(`person_sub0`.`age`) AS `_col_0_1`  \n}\nMATCH (`person`:`person`)\nWHERE `person`.`age` > `_col_0_1`\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many people are older than every engineer?",
    "evidence": "",
    "idx": 4892
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`person`:`person`)\nRETURN `person`.`name` AS `name`, `person`.`job` AS `job` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list the name, job title of all people ordered by their names.",
    "evidence": "",
    "idx": 4893
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`person`:`person`)\nORDER BY `person`.`age` IS NULL ASC, `person`.`age` DESC \nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all person sorted in the descending order using age.",
    "evidence": "",
    "idx": 4895
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`gender` = 'male'\nORDER BY `person`.`age` IS NULL DESC, `person`.`age`  \nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and age of all males in order of their age.",
    "evidence": "",
    "idx": 4897
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`gender` = 'male'\nORDER BY `person`.`age` IS NULL DESC, `person`.`age`  \nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name and age of every male? Order the results by age.",
    "evidence": "",
    "idx": 4898
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`friend` = 'Dan' OR `t2`.`friend` = 'Alice')\nRETURN DISTINCT `t1`.`name` AS `name`, `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and age of the person who is a friend of Dan or Alice.",
    "evidence": "",
    "idx": 4899
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`friend` = 'Dan' OR `t2`.`friend` = 'Alice')\nRETURN DISTINCT `t1`.`name` AS `name`, `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different names and ages of every friend of either Dan or alice?",
    "evidence": "",
    "idx": 4900
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`name` = 'Bob')\nRETURN `t2`.`friend` AS `friend`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who are the friends of Bob?",
    "evidence": "",
    "idx": 4903
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`name` = 'Bob')\nRETURN `t2`.`friend` AS `friend`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who are Bob's friends?",
    "evidence": "",
    "idx": 4904
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`friend` = 'Bob')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of persons who are friends with Bob.",
    "evidence": "",
    "idx": 4905
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`friend` = 'Bob')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all of Bob's friends?",
    "evidence": "",
    "idx": 4906
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`friend` = 'Zach' AND `t1`.`gender` = 'female')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of females who are friends with Zach",
    "evidence": "",
    "idx": 4907
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nAND (`t2`.`name` = 'Alice' AND `t1`.`gender` = 'female')\nRETURN `t2`.`friend` AS `friend`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the female friends of Alice.",
    "evidence": "",
    "idx": 4909
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nAND (`t1`.`city` = 'new york city')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who has a friend that is from new york city?",
    "evidence": "",
    "idx": 4913
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nAND (`t1`.`city` = 'new york city')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all friends who are from New York?",
    "evidence": "",
    "idx": 4914
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nRETURN avg(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nAND (`t1`.`age` < `_col_0`)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who has friends that are younger than the average age?",
    "evidence": "",
    "idx": 4915
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nRETURN avg(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nAND (`t1`.`age` < `_col_0`)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different names of friends who are younger than the average age for a friend?",
    "evidence": "",
    "idx": 4916
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nRETURN avg(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nAND (`t1`.`age` > `_col_0`)\nRETURN DISTINCT `t2`.`name` AS `name`, `t2`.`friend` AS `friend`, `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who has friends that are older than the average age? Print their friends and their ages as well",
    "evidence": "",
    "idx": 4917
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nRETURN avg(`person_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nAND (`t1`.`age` > `_col_0`)\nRETURN DISTINCT `t2`.`name` AS `name`, `t2`.`friend` AS `friend`, `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Whare the names, friends, and ages of all people who are older than the average age of a person?",
    "evidence": "",
    "idx": 4918
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH ()-[personfriend_sub0:friends_with]->()\nWHERE `personfriend_sub0`.`name` = 'Zach'\nRETURN MAX(`personfriend_sub0`.`year`) AS `_col_0`  \n}\nMATCH ()-[personfriend:friends_with]->()\nWHERE `personfriend`.`name` = 'Zach' AND `personfriend`.`year` = `_col_0`\nRETURN `personfriend`.`friend` AS `friend`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the friend of Zach with longest year relationship?",
    "evidence": "",
    "idx": 4919
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH ()-[personfriend_sub0:friends_with]->()\nWHERE `personfriend_sub0`.`name` = 'Zach'\nRETURN MAX(`personfriend_sub0`.`year`) AS `_col_0`  \n}\nMATCH ()-[personfriend:friends_with]->()\nWHERE `personfriend`.`name` = 'Zach' AND `personfriend`.`year` = `_col_0`\nRETURN `personfriend`.`friend` AS `friend`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which friend of Zach has the longest-lasting friendship?",
    "evidence": "",
    "idx": 4920
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH ()-[personfriend_sub0:friends_with]->()\nWHERE `personfriend_sub0`.`name` = 'Zach'\nRETURN MAX(`personfriend_sub0`.`year`) AS `_col_0`  \n}\nMATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nAND (`t2`.`name` = 'Zach' AND `t2`.`year` = `_col_0`)\nRETURN `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the age of the friend of Zach with longest year relationship?",
    "evidence": "",
    "idx": 4921
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH ()-[personfriend_sub0:friends_with]->()\nWHERE `personfriend_sub0`.`name` = 'Zach'\nRETURN MAX(`personfriend_sub0`.`year`) AS `_col_0`  \n}\nMATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nAND (`t2`.`name` = 'Zach' AND `t2`.`year` = `_col_0`)\nRETURN `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ages of all of Zach's friends who are in the longest relationship?",
    "evidence": "",
    "idx": 4922
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH ()-[personfriend_sub0:friends_with]->()\nWHERE `personfriend_sub0`.`friend` = 'Alice'\nRETURN min(`personfriend_sub0`.`year`) AS `_col_0`  \n}\nMATCH ()-[personfriend:friends_with]->()\nWHERE `personfriend`.`friend` = 'Alice' AND `personfriend`.`year` = `_col_0`\nRETURN `personfriend`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all people who are friends with Alice for the shortest amount of time?",
    "evidence": "",
    "idx": 4924
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH ()-[personfriend_sub0:friends_with]->()\nWHERE `personfriend_sub0`.`friend` = 'Alice'\nRETURN MAX(`personfriend_sub0`.`year`) AS `_col_0`  \n}\nMATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`friend` = 'Alice' AND `t2`.`year` = `_col_0`)\nRETURN `t1`.`name` AS `name`, `t1`.`age` AS `age`, `t1`.`job` AS `job`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, age, and job title of persons who are friends with Alice for the longest years.",
    "evidence": "",
    "idx": 4925
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "CALL(*) {\nMATCH ()-[personfriend_sub0:friends_with]->()\nWHERE `personfriend_sub0`.`friend` = 'Alice'\nRETURN MAX(`personfriend_sub0`.`year`) AS `_col_0`  \n}\nMATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`friend` = 'Alice' AND `t2`.`year` = `_col_0`)\nRETURN `t1`.`name` AS `name`, `t1`.`age` AS `age`, `t1`.`job` AS `job`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names, ages, and jobs of all people who are friends with Alice for the longest amount of time?",
    "evidence": "",
    "idx": 4926
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`age`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which person whose friends have the oldest average age?",
    "evidence": "",
    "idx": 4927
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:friends_with]->()\nWHERE `t1`.`name` = `t2`.`friend`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`age`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the person who has the oldest average age for their friends, and what is that average age?",
    "evidence": "",
    "idx": 4928
  },
  {
    "filename": "train_spider.json",
    "db_id": "network_2",
    "gql_statement": "WITH *, COLLECT { MATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`city` = 'Austin'\nRETURN `person_sub0`.`name` AS `name`   } AS in_collect_0\nMATCH ()-[personfriend:friends_with]->()\nWHERE NOT `personfriend`.`friend` IN in_collect_0\nRETURN COUNT(DISTINCT `personfriend`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of people who has no friend living in the city of Austin.",
    "evidence": "",
    "idx": 4929
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`member`:`member`)\nRETURN `member`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of members in ascending alphabetical order.",
    "evidence": "",
    "idx": 4932
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`member`:`member`)\nWHERE `member`.`country` = 'United States' OR `member`.`country` = 'Canada'\nRETURN `member`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of members whose country is \"United States\" or \"Canada\".",
    "evidence": "",
    "idx": 4934
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`member`:`member`)\nWITH `member`.`country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the different countries and the number of members from each.",
    "evidence": "",
    "idx": 4935
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`college`:`college`)\nRETURN `college`.`leader_name` AS `leader_name`, `college`.`college_location` AS `college_location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the leader names and locations of colleges.",
    "evidence": "",
    "idx": 4937
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`t2`:`member`)-[belongs_to_0:belongs_to]->(`t1`:`college`)\nWHERE `t1`.`college_id` = `t2`.`college_id`\nRETURN `t2`.`name` AS `name`, `t1`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of members and names of colleges they go to.",
    "evidence": "",
    "idx": 4938
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`t2`:`member`)-[belongs_to_0:belongs_to]->(`t1`:`college`)\nWHERE `t1`.`college_id` = `t2`.`college_id`\nRETURN `t2`.`name` AS `name`, `t1`.`college_location` AS `college_location` ORDER BY `t2`.`name` IS NULL DESC, `t2`.`name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of members and the locations of colleges they go to in ascending alphabetical order of member names.",
    "evidence": "",
    "idx": 4939
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`t2`:`member`)-[belongs_to_0:belongs_to]->(`t1`:`college`)\nWHERE `t1`.`college_id` = `t2`.`college_id`\nAND (`t2`.`country` = 'Canada')\nRETURN DISTINCT `t1`.`leader_name` AS `leader_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the distinct leader names of colleges associated with members from country \"Canada\".",
    "evidence": "",
    "idx": 4940
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`t1`:`member`)-[participated_in_0:participated_in]->(`t2`:`round`)\nWHERE `t1`.`member_id` = `t2`.`member_id`\nRETURN `t1`.`name` AS `name`, `t2`.`decoration_theme` AS `decoration_theme`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of members and the decoration themes they have.",
    "evidence": "",
    "idx": 4941
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`t1`:`member`)-[participated_in_0:participated_in]->(`t2`:`round`)\nWHERE `t1`.`member_id` = `t2`.`member_id`\nAND (`t2`.`rank_in_round` > 3)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of members that have a rank in round higher than 3.",
    "evidence": "",
    "idx": 4942
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "MATCH (`t1`:`member`)-[participated_in_0:participated_in]->(`t2`:`round`)\nWHERE `t1`.`member_id` = `t2`.`member_id`\nORDER BY `t2`.`rank_in_round` IS NULL DESC, `t2`.`rank_in_round`  \nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of members in ascending order of their rank in rounds.",
    "evidence": "",
    "idx": 4943
  },
  {
    "filename": "train_spider.json",
    "db_id": "decoration_competition",
    "gql_statement": "WITH *, COLLECT { MATCH (`round_sub0`:`round`)\nRETURN `round_sub0`.`member_id` AS `member_id`   } AS in_collect_0\nMATCH (`member`:`member`)\nWHERE NOT `member`.`member_id` IN in_collect_0\nRETURN `member`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of members who did not participate in any round.",
    "evidence": "",
    "idx": 4944
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`documents`:`documents`)\nRETURN `documents`.`document_name` AS `document_name`, `documents`.`access_count` AS `access_count` ORDER BY `document_name` IS NULL DESC, `document_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and access counts of all documents, in alphabetic order of the document name.",
    "evidence": "",
    "idx": 4945
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`documents`:`documents`)\nWITH `documents`.`document_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 4\nRETURN _groupby_col_0 AS `document_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the types of documents with more than 4 documents.",
    "evidence": "",
    "idx": 4949
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`documents`:`documents`)\nWHERE `documents`.`document_name` = 'David CV'\nRETURN `documents`.`document_type_code` AS `document_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the type of the document named \"David CV\"?",
    "evidence": "",
    "idx": 4953
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`documents`:`documents`)\nWHERE `documents`.`document_name` = 'David CV'\nRETURN `documents`.`document_type_code` AS `document_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the type code of the document named \"David CV\".",
    "evidence": "",
    "idx": 4954
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`documents`:`documents`)\nWITH `documents`.`document_type_code` AS _groupby_col_0, sum(`documents`.`access_count`) AS _groupby_col_1\nWHERE _groupby_col_1 > 10000\nRETURN _groupby_col_0 AS `document_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What document types do have more than 10000 total access number.",
    "evidence": "",
    "idx": 4955
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`t1`:`documents`)-[contains_0:contains]->(`t2`:`document_sections`)\nWHERE `t1`.`document_code` = `t2`.`document_code`\nAND (`t1`.`document_name` = 'David CV')\nRETURN `t2`.`section_title` AS `section_title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the section titles of the document named \"David CV\"?",
    "evidence": "",
    "idx": 4957
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "WITH *, COLLECT { MATCH (`document_sections_sub0`:`document_sections`)\nRETURN `document_sections_sub0`.`document_code` AS `document_code`   } AS in_collect_0\nMATCH (`documents`:`documents`)\nWHERE NOT `documents`.`document_code` IN in_collect_0\nRETURN `documents`.`document_name` AS `document_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the name of documents without any sections.",
    "evidence": "",
    "idx": 4959
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`t1`:`documents`)-[t2:belongs_to_functional_area]->(`t3`:`functional_areas`)\nWHERE `t1`.`document_code` = `t2`.`document_code`\nAND `t2`.`functional_area_code` = `t3`.`functional_area_code`\nAND (`t3`.`functional_area_description` = 'Acknowledgement')\nRETURN avg(`t1`.`access_count`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average access counts of documents with functional area \"Acknowledgement\".",
    "evidence": "",
    "idx": 4961
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`documents`:`documents`)\nWHERE `documents`.`document_name` =~ '(?i)(?s).*CV.*'\nRETURN `documents`.`document_name` AS `document_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the document names which contains \"CV\".",
    "evidence": "",
    "idx": 4963
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`documents`:`documents`)\nWHERE `documents`.`document_name` =~ '(?i)(?s).*CV.*'\nRETURN `documents`.`document_name` AS `document_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of documents that contain the substring \"CV\"?",
    "evidence": "",
    "idx": 4964
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_login` = 1\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many users are logged in?",
    "evidence": "",
    "idx": 4965
  }
]