[
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t2`.`date` = localdatetime('2013-04-28T00:00:00') AND `t2`.`total_supply` > 10000000)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the crytocurrencies that have a total amount of existence of over 10000000 on 2013/4/28.",
    "evidence": "a total amount of existence of over 10000000 refers to total_supply>10000000; on 2013/4/28 refers to date = '2013-04-28'",
    "idx": 4897
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy') ELSE NULL END = '2013' AND `t1`.`name` = 'Bitcoin')\nRETURN avg(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the average price of a Bitcoin in the year 2013?",
    "evidence": "average price refers SUM(price)/COUNT(named = 'Bitcoin'); in the year 2013 refers to year(date) = 2013",
    "idx": 4901
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`coins`:`coins`)\nWHERE `coins`.`status` = 'extinct'\nRETURN `coins`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of coins that has been disappeared.",
    "evidence": "has disappeared refers to status = 'extinct'",
    "idx": 4903
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`coins`:`coins`)\nWHERE CASE WHEN `coins`.`date_added` is not NULL THEN apoc.temporal.format(`coins`.`date_added`,'yyyy-MM') ELSE NULL END = '2013-05'\nRETURN COUNT(`coins`.`id`) AS `num`   \nUNION ALL\nMATCH (`coins`:`coins`)\nWHERE CASE WHEN `coins`.`date_added` is not NULL THEN apoc.temporal.format(`coins`.`date_added`,'yyyy-MM') ELSE NULL END = '2013-05'\nRETURN `coins`.`name` AS `num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many coins were added in May 2013? Please list the names of coins.",
    "evidence": "in May 2013 refers to year(date_added) = 2013 and month(date_added) = 5",
    "idx": 4905
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`coins`:`coins`)\nWHERE `coins`.`date_added` =~ '(?i)(?s)2013-06-14.*'\nRETURN `coins`.`name` AS `name`, `coins`.`symbol` AS `symbol`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names and symbols of the coins that were added on June 14, 2013.",
    "evidence": "added on June 14, 2013 refers to date_added like '2013-06-14%'",
    "idx": 4906
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`coins`:`coins`)\nWHERE `coins`.`date_added` =~ '(?i)(?s)2014.*' AND `coins`.`status` = 'untracked'\nRETURN `coins`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of coins that cannot be traded in 2014.",
    "evidence": "cannot be tracked refers to status = 'untracked'; in 2014 refers to year(date_added) = '2014'",
    "idx": 4907
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`coins`:`coins`)\nWHERE char_length(`coins`.`tag_names`) - char_length(replace(`coins`.`tag_names`,',','')) = 2\nRETURN `coins`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the coins that have three tags.",
    "evidence": "have three tags refers to length(tag_names)-length(replace(tag_names,',','')) = 2",
    "idx": 4908
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t2`.`date` = localdatetime('2013-04-29T00:00:00') AND `t2`.`cmc_rank` = 1)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please name the coin that ranked first among the coins traded on April 29, 2013.",
    "evidence": "ranked first refers to cmc_rank = 1; on April 29, 2013 refers to date = '2013-04-29'",
    "idx": 4909
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy-MM') ELSE NULL END = '2013-05' AND `t2`.`open` IS NULL)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the coins that were not opened on May 2013.",
    "evidence": "not opened refers to open IS NULL; on May 2013 refers to year(date) = 2019 AND month(date) = 5",
    "idx": 4911
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t2`.`date` = localdatetime('2014-01-01T00:00:00') AND `t2`.`cmc_rank` <= 5)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of the top five coins traded on January 1, 2014.",
    "evidence": "the top five coins refers to cmc_rank< = 5; on January 1, 2014 refers to date = '2014-01-01'",
    "idx": 4913
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t1`.`name` = 'Bytecoin' AND CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy-MM') ELSE NULL END = '2013-06')\nRETURN COUNT(`t2`.`coin_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times was Bytecoin traded in June 2013?",
    "evidence": "in June 2013 refers to year(date) = 2013 AND month(date) = 6",
    "idx": 4915
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t2`.`date` = localdatetime('2013-05-29T00:00:00') AND `t2`.`percent_change_1h` > 0)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the percentage of coins that is higher than the price 1 hour ago in May 29,2013? List the names of these coins.",
    "evidence": "percentage that is higher than the price 1 hour ago refers to percent_change_1h>0; in May 29,2013 refers to date = '2013-05-29'",
    "idx": 4916
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t1`:`products`)-[supplied_by_0:supplied_by]->(`t2`:`suppliers`)\nWHERE `t1`.`supplierid` = `t2`.`supplierid`\nAND (`t2`.`country` = 'Japan')\nRETURN `t1`.`productname` AS `productname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the products whose supplier is in Japan.",
    "evidence": "names of the products refers to ProductName; Japan refers to Country = 'Japan';",
    "idx": 4917
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nRETURN MAX(`employees_sub0`.`birthdate`) AS `_col_0`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`birthdate` = `_col_0`\nRETURN `employees`.`firstname` AS `firstname`, `employees`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the full name of the youngest employee.",
    "evidence": "full name = FirstName, LastName; youngest refers to latest BirthDate;",
    "idx": 4918
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[handled_by_0:handled_by]->(`t1`:`employees`)\nWHERE `t1`.`employeeid` = `t2`.`employeeid`\nAND (`t1`.`firstname` = 'Michael' AND `t1`.`lastname` = 'Suyama')\nRETURN COUNT(`t2`.`orderid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of orders that were handled by Michael Suyama.",
    "evidence": "",
    "idx": 4919
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t1`:`products`)-[in_category_0:in_category]->(`t2`:`categories`)\nWHERE `t1`.`categoryid` = `t2`.`categoryid`\nAND (`t2`.`categoryname` = 'Dairy Products')\nRETURN COUNT(`t1`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many kinds of products are there in the the category of \"dairy products\"?",
    "evidence": "kinds of products refers to ProductID; category refers to CategoryName;",
    "idx": 4920
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t1`:`products`)-[in_category_0:in_category]->(`t2`:`categories`)\nWHERE `t1`.`categoryid` = `t2`.`categoryid`\nAND (`t1`.`productname` = 'Tofu')\nRETURN `t2`.`categoryname` AS `categoryname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which category does \"tofu\" belong to?",
    "evidence": "category refers to CategoryName; tofu refers to ProductName = 'Tofu';",
    "idx": 4921
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t1`:`products`)-[supplied_by_0:supplied_by]->(`t2`:`suppliers`)\nWHERE `t1`.`supplierid` = `t2`.`supplierid`\nAND (`t1`.`productname` = 'Gudbrandsdalsost')\nRETURN `t2`.`contactname` AS `contactname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the contact name of the supplier for the product \"Gudbrandsdalsost\".",
    "evidence": "product refers to ProductName",
    "idx": 4922
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t1`:`products`)-[supplied_by_0:supplied_by]->(`t2`:`suppliers`)\nWHERE `t1`.`supplierid` = `t2`.`supplierid`\nAND (`t1`.`productname` = 'Scottish Longbreads')\nRETURN `t2`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the country name of the supplier for \"Scottish Longbreads\".",
    "evidence": "\"Scottish Longbreads\" refers to ProductName = 'Scottish Longbreads'",
    "idx": 4923
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`customers`:`customers`)\nWITH `customers`.`country` AS _groupby_col_0, COUNT(`customers`.`customerid`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many customers are there in the country with the highest number of customers?",
    "evidence": "highest number refers to max(count(CustomerID))",
    "idx": 4924
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[handled_by_0:handled_by]->(`t1`:`employees`)\nWHERE `t1`.`employeeid` = `t2`.`employeeid`\nAND (`t2`.`orderid` = 10521 AND `t2`.`customerid` = 'CACTU')\nRETURN `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the family name of the employee who shipped the order 10521 to CACTU?",
    "evidence": "order 10521 refers to OrderID = 10521; CustomerID = 'CACTU'; family name refers to LastName;",
    "idx": 4927
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[handled_by_0:handled_by]->(`t1`:`employees`)\nWHERE `t1`.`employeeid` = `t2`.`employeeid`\nAND (`t1`.`firstname` = 'Michael' AND `t1`.`lastname` = 'Suyama')\nRETURN `t2`.`customerid` AS `customerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the customer ids who placed order with Michael Suyama.",
    "evidence": "",
    "idx": 4931
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t1`:`products`)-[supplied_by_0:supplied_by]->(`t2`:`suppliers`)\nWHERE `t1`.`supplierid` = `t2`.`supplierid`\nAND (`t2`.`country` = 'Japan')\nRETURN COUNT(`t1`.`supplierid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total products that are supplied by Japan suppliers.",
    "evidence": "Japan Supplier refers to Country = 'Japan'; total product refers to Count (ProductName)",
    "idx": 4933
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (CASE WHEN `t2`.`orderdate` is not NULL THEN apoc.temporal.format(`t2`.`orderdate`,'yyyy') ELSE NULL END = 1996)\nRETURN CASE WHEN COUNT(`t1`.`city`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`city` = 'Madrid' THEN 1 ELSE NULL END)) * 100 / COUNT(`t1`.`city`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of orders were placed by customers in Madrid city in 1996?",
    "evidence": "\"Madrid\" is the City; in 1996 refers to YEAR (OrderDate) = 1996; percentage = Divide (Count (CustomerID where City = 'Madrid'), Count (CustomerID)) * 100",
    "idx": 4936
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (CASE WHEN `t2`.`orderdate` is not NULL THEN apoc.temporal.format(`t2`.`orderdate`,'yyyy') ELSE NULL END = '1996' AND `t1`.`country` = 'UK')\nRETURN COUNT(`t1`.`customerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 1996, how many orders were from customers in the UK?",
    "evidence": "in 1996 refers to YEAR (OrderDate) = 1996; 'UK' is the Country;",
    "idx": 4937
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (CASE WHEN `t2`.`orderdate` is not NULL THEN apoc.temporal.format(`t2`.`orderdate`,'yyyy') ELSE NULL END = '1996')\nWITH `t1`.`country` AS _groupby_col_0, COUNT(`t2`.`customerid`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the number of orders from customers by country in 1996.",
    "evidence": "in 1996 refer to YEAR(OrderDate) = 1996; number of order = Count(OrderID)",
    "idx": 4938
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`orders`:`orders`)\nWHERE toString(`orders`.`orderdate`) =~ '(?i)(?s)1996-08.*'\nWITH `orders`.`customerid` AS _groupby_col_0, COUNT(`orders`.`orderid`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In August of 1996, how many orders were placed by the customer with the highest amount of orders?",
    "evidence": "August of 1996 refers to OrderDate = '1996-8'; highest amount of orders refers to MAX(COUNT(OrderID))",
    "idx": 4939
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`country` = 'Ireland')\nRETURN COUNT(`t2`.`orderid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were made by the customers in Ireland.",
    "evidence": "in Ireland refers to Country = 'Ireland';",
    "idx": 4942
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[handled_by_0:handled_by]->(`t1`:`employees`)\nWHERE `t1`.`employeeid` = `t2`.`employeeid`\nAND (`t2`.`orderid` = 10274)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the full name of the employee who processed the sales order with ID 10274.",
    "evidence": "full name refers to FirstName, LastName; sales order with ID 10274 refers to OrderID = 10274",
    "idx": 4943
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`categories`:`categories`)\nWHERE `categories`.`description` = 'Soft drinks, coffees, teas, beers, and ales'\nRETURN `categories`.`categoryname` AS `categoryname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate category name of soft drinks, coffees, teas, beers, and ales in description list.",
    "evidence": "Soft drinks, coffees, teas, beers, and ales' is Description of CategoryName",
    "idx": 4946
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t1`:`products`)-[in_category_0:in_category]->(`t2`:`categories`)\nWHERE `t1`.`categoryid` = `t2`.`categoryid`\nAND (`t2`.`categoryname` = 'Confections')\nRETURN `t1`.`productname` AS `productname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all product names under Confections.",
    "evidence": "'Confections' is a CompanyName;",
    "idx": 4947
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t1`:`products`)-[supplied_by_0:supplied_by]->(`t2`:`suppliers`)\nWHERE `t1`.`supplierid` = `t2`.`supplierid`\nAND (`t2`.`country` = 'Finland')\nRETURN `t1`.`productname` AS `productname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the products where the suppliers come from Finland.",
    "evidence": "'Finland' is a Country; product refers to ProductName; suppliers refers to SupplierID",
    "idx": 4948
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t1`:`products`)-[in_category_0:in_category]->(`t2`:`categories`)\nWHERE `t1`.`categoryid` = `t2`.`categoryid`\nAND (`t1`.`productname` = 'Mozzarella di Giovanni')\nRETURN `t2`.`categoryname` AS `categoryname`, `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "The product 'Mozzarella di Giovanni' belongs in which category? Include the category's description as well.",
    "evidence": "Mozzarella di Giovanni' is a ProductName; category refers to CategoryName;",
    "idx": 4949
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`birthdate` = localdatetime('1955-03-04T00:00:00')\nRETURN `employees`.`firstname` AS `firstname`, `employees`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the full name of employee who has birth day on \"3/4/1955 12:00:00 AM\".",
    "evidence": "full name refers to FirstName, LastName; brith day refers to BirthDate",
    "idx": 4954
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[handled_by_0:handled_by]->(`t1`:`employees`)\nWHERE `t1`.`employeeid` = `t2`.`employeeid`\nAND (`t2`.`orderid` = 10250)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the first name of employee who took care the order id 10250.",
    "evidence": "",
    "idx": 4955
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (`t2`:`orders`)-[handled_by_0:handled_by]->(`t1`:`employees`)\nWHERE `t1`.`employeeid` = `t2`.`employeeid`\nAND (`t2`.`orderid` = 10280)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the full name of employee who handled the order id 10280.",
    "evidence": "full name refers to FirstName, LastName",
    "idx": 4956
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nWHERE `lineitem`.`l_orderkey` = 1\nRETURN MAX(`lineitem`.`l_shipdate`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was the latest date the items of order no.1 were shipped?",
    "evidence": "order no.1 refers to l_orderkey = 1; the latest date shipped refers to MAX(l_shipdate);",
    "idx": 4958
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t2`.`c_mktsegment` = 'HOUSEHOLD')\nRETURN `t1`.`o_comment` AS `o_comment`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the order comments of all the orders made by customers in the household segment.",
    "evidence": "orders in household segment refer to o_orderkey where c_mktsegment = 'HOUSEHOLD'; order comments refer to o_comment;",
    "idx": 4964
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nORDER BY `t1`.`o_totalprice` IS NULL ASC, `t1`.`o_totalprice` DESC \nRETURN `t2`.`c_name` AS `c_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the name of the customer who has made the single order with the highest total price.",
    "evidence": "name of the customer refers to c_name; single order with the highest total price refers to MAX(o_totalprice) LIMIT 1;",
    "idx": 4965
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t2`.`c_acctbal` < 0)\nRETURN `t1`.`o_orderkey` AS `o_orderkey`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the order keys of all the orders made by a customer whose account is in debt.",
    "evidence": "account is in debt if c_acctbal < 0;",
    "idx": 4966
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`customer`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`c_nationkey` = `t2`.`n_nationkey`\nAND (`t1`.`c_mktsegment` = 'HOUSEHOLD' AND `t2`.`n_name` = 'BRAZIL')\nRETURN `t1`.`c_phone` AS `c_phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the phone numbers of all the customers in the household segment and are in Brazil.",
    "evidence": "phone numbers refer to c_phone; Brazil is the name of the nation which refers to n_name = 'BRAZIL'; household segment refers to c_mktsegment = 'HOUSEHOLD';",
    "idx": 4969
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t3`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)-[located_in_0:located_in]->(`t1`:`nation`)\nWHERE `t1`.`n_nationkey` = `t2`.`c_nationkey`\nAND `t2`.`c_custkey` = `t3`.`o_custkey`\nAND (`t1`.`n_name` = 'GERMANY')\nORDER BY `t3`.`o_orderdate` IS NULL DESC, `t3`.`o_orderdate`  \nRETURN `t3`.`o_orderkey` AS `o_orderkey`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the orders made by customers in Germany, which one of them has the highest priority in delivery? Please give its order key.",
    "evidence": "orders refer to o_orderkey; Germany is the name of the nation which refers to n_name = 'GERMANY'; earlier orderdate have higher priority in delivery therefore MIN(o_orderdate);",
    "idx": 4973
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`customer`)-[located_in_0:located_in]->(`t1`:`nation`)-[in_region_0:in_region]->(`t3`:`region`)\nWHERE `t1`.`n_nationkey` = `t2`.`c_nationkey`\nAND `t1`.`n_regionkey` = `t3`.`r_regionkey`\nAND (`t2`.`c_custkey` = 106936)\nRETURN `t3`.`r_name` AS `r_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give customer No.106936's region name.",
    "evidence": "\"Customer#000000055\" is the name of the customer which refers to c_name; region name refers to r_name;",
    "idx": 4978
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`customer`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`c_nationkey` = `t2`.`n_nationkey`\nAND (`t2`.`n_name` = 'MOROCCO' AND `t1`.`c_acctbal` < 0)\nRETURN COUNT(`t1`.`c_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of Moroccan customers whose account is in debt.",
    "evidence": "account is in debt if c_acctbal < 0; Moroccan customers refer to c_name WHERE n_name = 'MOROCCO';",
    "idx": 4979
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`lineitem`)-[belongs_to_order_0:belongs_to_order]->(`t1`:`orders`)\nWHERE `t1`.`o_orderkey` = `t2`.`l_orderkey`\nAND (`t1`.`o_totalprice` = 218195.43 AND `t2`.`l_returnflag` = 'R')\nRETURN `t2`.`l_suppkey` AS `l_suppkey`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the order with the total price of 218195.43, which supplier handled the returned item? Give the supplier id.",
    "evidence": "returned item refers to l_returnflag = 'R'; supplier id refers to l_suppkey; order with the total price of 218195.43 refers to o_totalprice = 218195.43;",
    "idx": 4981
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t1`.`o_orderdate` = localdatetime('1997-12-10T00:00:00') AND `t1`.`o_clerk` = 'Clerk#000000803')\nRETURN `t2`.`c_name` AS `c_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the customer who made an order with Clerk#000000803 on 1997/12/10.",
    "evidence": "name of the customer refers to c_name; o_clerk = 'Clerk#000000803'; order on 1997/12/10 refers to o_orderdate = '1997-12-10';",
    "idx": 4983
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`lineitem`)\nMATCH ()-[t2:supplied_by]->()\nWHERE `t1`.`l_suppkey` = `t2`.`ps_suppkey`\nAND (`t1`.`l_suppkey` = 7414 AND `t1`.`l_orderkey` = 817154)\nRETURN `t1`.`l_extendedprice` * (1 - `t1`.`l_discount`) - `t2`.`ps_supplycost` * `t1`.`l_quantity` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculates the profit processed by Supplier No. 7414 on order No. 817154.",
    "evidence": "SUBTRACT(MULTIPLY(l_extendedprice, (SUBTRACT(1, l_discount)), MULTIPLY(ps_supplycost, l_quantity))) WHERE l_suppkey = 7414 AND l_orderkey = 817154;",
    "idx": 4984
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`supplier`)-[located_in_1:located_in]->(`t2_sub0`:`nation`)\nWHERE `t1_sub0`.`s_nationkey` = `t2_sub0`.`n_nationkey`\nAND (`t1_sub0`.`s_acctbal` < 0)\nWITH `t2_sub0`.`n_name` AS _groupby_col_0, sum(`t1_sub0`.`s_acctbal`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `n_name`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL DESC, `num`  \nRETURN `n_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country has the most number of suppliers whose account is in debt?",
    "evidence": "country refers to n_name; the most number of suppliers whose account is in debt refers to MAX(SUM(s_acctbal < 0));",
    "idx": 4985
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`supplier`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`s_nationkey` = `t2`.`n_nationkey`\nAND (`t1`.`s_acctbal` < 0)\nRETURN CASE WHEN COUNT(`t1`.`s_name`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`n_name` = 'JAPAN' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`s_name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the percentage of Japanese suppliers whose account is in debt.",
    "evidence": "account is in debt if s_acctbal < 0; DIVIDE(COUNT(s_acctbal < 0 where n_name = 'JAPAN'), COUNT(s_name where n_name = 'JAPAN')) as percentage;",
    "idx": 4987
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nWHERE CASE WHEN `lineitem`.`l_shipdate` is not NULL THEN apoc.temporal.format(`lineitem`.`l_shipdate`,'yyyy') ELSE NULL END = '1998'\nRETURN COUNT(`lineitem`.`l_orderkey`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were shipped in 1998?",
    "evidence": "orders refer to l_orderkey; shipped in 1998 refers to year(l_shipdate) = 1998;",
    "idx": 4989
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nWHERE `lineitem`.`l_returnflag` = 'R' AND `lineitem`.`l_shipmode` = 'AIR' AND CASE WHEN `lineitem`.`l_shipdate` is not NULL THEN apoc.temporal.format(`lineitem`.`l_shipdate`,'yyyy') ELSE NULL END = '1994'\nRETURN COUNT(`lineitem`.`l_linenumber`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many items that were shipped via air were returned in 1994?",
    "evidence": "items refer to l_linenumber; shipped via air in 1994 refers to year(l_shipdate) = 1994 where l_shipmode = 'AIR'; returned refer to l_returnflag = 'R';",
    "idx": 4991
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`customer`)-[located_in_1:located_in]->(`t2_sub0`:`nation`)\nWHERE `t1_sub0`.`c_nationkey` = `t2_sub0`.`n_nationkey`\nWITH `t2_sub0`.`n_name` AS _groupby_col_0, COUNT(`t1_sub0`.`c_custkey`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `n_name`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `n_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which country do most of the customers come from?",
    "evidence": "country refers to n_name; most of the customers refer to MAX(COUNT(c_custkey));",
    "idx": 4995
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`customer`)-[located_in_1:located_in]->(`t2_sub0`:`nation`)\nWHERE `t1_sub0`.`c_nationkey` = `t2_sub0`.`n_nationkey`\nAND (`t2_sub0`.`n_name` = 'UNITED STATES')\nWITH `t1_sub0`.`c_mktsegment` AS _groupby_col_0, COUNT(`t1_sub0`.`c_custkey`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `c_mktsegment`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `c_mktsegment`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the customers from the United States, which market segment has the highest number of customers?",
    "evidence": "the highest number of customers refer to MAX(COUNT(c_custkey)); the United States is the name of the nation which refers to n_name = 'UNITED STATES'; market segment refers to c_mktsegment;",
    "idx": 4999
  }
]