[
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`t2`:`publication`)-[belongs_to_0:belongs_to]->(`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nORDER BY `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the titles of books in descending order of publication price.",
    "evidence": "",
    "idx": 1546
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`publication`:`publication`)\nWITH `publication`.`publisher` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `publisher`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show publishers that have more than one publication.",
    "evidence": "",
    "idx": 1547
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`publication`:`publication`)\nWITH `publication`.`publisher` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `publisher`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different publishers together with the number of publications they have.",
    "evidence": "",
    "idx": 1548
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`book`:`book`)\nWITH `book`.`writer` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `writer`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the writers who have written more than one book.",
    "evidence": "",
    "idx": 1549
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "WITH *, COLLECT { MATCH (`publication_sub0`:`publication`)\nRETURN `publication_sub0`.`book_id` AS `book_id`   } AS in_collect_0\nMATCH (`book`:`book`)\nWHERE NOT `book`.`book_id` IN in_collect_0\nRETURN `book`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the titles of books that are not published.",
    "evidence": "",
    "idx": 1550
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`publisher` = 'Person' OR `publication`.`publisher` = 'Wiley'\nRETURN `publication`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the prices of publications whose publisher is either \"Person\" or \"Wiley\"",
    "evidence": "",
    "idx": 1553
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`actor`:`actor`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of actors.",
    "evidence": "",
    "idx": 1555
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`actor`:`actor`)\nRETURN `actor`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of actors in ascending alphabetical order.",
    "evidence": "",
    "idx": 1556
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`actor`:`actor`)\nRETURN `actor`.`character` AS `character`, `actor`.`duration` AS `duration`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the characters and durations for each actor.",
    "evidence": "",
    "idx": 1559
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`age` <> 20\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of actors whose age is not 20.",
    "evidence": "",
    "idx": 1560
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`actor`:`actor`)\nORDER BY `actor`.`age` IS NULL ASC, `actor`.`age` DESC \nRETURN `actor`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the characters for actors, ordered by age descending.",
    "evidence": "",
    "idx": 1563
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`actor`:`actor`)\nORDER BY `actor`.`age` IS NULL ASC, `actor`.`age` DESC \nRETURN `actor`.`duration` AS `duration`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the duration of the actor with the greatest age.",
    "evidence": "",
    "idx": 1565
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`musical`:`musical`)\nWHERE `musical`.`nominee` = 'Bob Fosse'\nRETURN `musical`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of musicals with nominee \"Bob Fosse\"?",
    "evidence": "",
    "idx": 1566
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`musical`:`musical`)\nWHERE `musical`.`nominee` = 'Bob Fosse'\nRETURN `musical`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of musicals who have the nominee Bob Fosse.",
    "evidence": "",
    "idx": 1567
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`musical`:`musical`)\nWHERE `musical`.`award` <> 'Tony Award'\nRETURN DISTINCT `musical`.`nominee` AS `nominee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct nominees of the musicals with the award that is not \"Tony Award\"?",
    "evidence": "",
    "idx": 1568
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`musical`:`musical`)\nWHERE `musical`.`award` <> 'Tony Award'\nRETURN DISTINCT `musical`.`nominee` AS `nominee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the different nominees of musicals that have an award that is not the Tony Award.",
    "evidence": "",
    "idx": 1569
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`t1`:`actor`)\nMATCH (`t2`:`musical`)\nWHERE `t1`.`musical_id` = `t2`.`musical_id`\nRETURN `t1`.`name` AS `name`, `t2`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of actors and names of musicals they are in.",
    "evidence": "",
    "idx": 1570
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`t1`:`actor`)\nMATCH (`t2`:`musical`)\nWHERE `t1`.`musical_id` = `t2`.`musical_id`\nAND (`t2`.`name` = 'The Phantom of the Opera')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of actors that have appeared in musical with name \"The Phantom of the Opera\".",
    "evidence": "",
    "idx": 1572
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`t1`:`actor`)\nMATCH (`t2`:`musical`)\nWHERE `t1`.`musical_id` = `t2`.`musical_id`\nORDER BY `t2`.`year` IS NULL ASC, `t2`.`year` DESC \nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of actors in descending order of the year their musical is awarded.",
    "evidence": "",
    "idx": 1574
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`musical`:`musical`)\nWITH `musical`.`nominee` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `nominee`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different nominees and the number of musicals they have been nominated.",
    "evidence": "",
    "idx": 1576
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`musical`:`musical`)\nWITH `musical`.`nominee` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `nominee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the nominees that have been nominated more than two musicals.",
    "evidence": "",
    "idx": 1578
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "WITH *, COLLECT { MATCH (`actor_sub0`:`actor`)\nRETURN `actor_sub0`.`musical_id` AS `musical_id`   } AS in_collect_0\nMATCH (`musical`:`musical`)\nWHERE NOT `musical`.`musical_id` IN in_collect_0\nRETURN `musical`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of musicals that do not have actors.",
    "evidence": "",
    "idx": 1580
  },
  {
    "filename": "train_spider.json",
    "db_id": "musical",
    "gql_statement": "MATCH (`musical`:`musical`)\nWHERE `musical`.`award` = 'Tony Award' OR `musical`.`award` = 'Cleavant Derricks'\nRETURN `musical`.`nominee` AS `nominee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the musical nominee with award \"Bob Fosse\" or \"Cleavant Derricks\".",
    "evidence": "",
    "idx": 1582
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nWHERE `user_profiles`.`name` = 'Mary'\nRETURN `user_profiles`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the emails of the user named \"Mary\".",
    "evidence": "",
    "idx": 1584
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nWHERE `user_profiles`.`name` = 'Iron Man'\nRETURN `user_profiles`.`partitionid` AS `partitionid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the partition id of the user named \"Iron Man\".",
    "evidence": "",
    "idx": 1585
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH ()-[follows:follows]->()\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many followers does each user have?",
    "evidence": "",
    "idx": 1587
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`tweets`:`tweets`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of tweets in record.",
    "evidence": "",
    "idx": 1589
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`tweets`:`tweets`)\nRETURN COUNT(DISTINCT `tweets`.`uid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of users who posted some tweets.",
    "evidence": "",
    "idx": 1590
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nWHERE `user_profiles`.`name` =~ '(?i)(?s).*Swift.*'\nRETURN `user_profiles`.`name` AS `name`, `user_profiles`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and email of the user whose name contains the word ‘Swift’.",
    "evidence": "",
    "idx": 1591
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nWHERE `user_profiles`.`email` =~ '(?i)(?s).*superstar.*' OR `user_profiles`.`email` =~ '(?i)(?s).*edu.*'\nRETURN `user_profiles`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of users whose emails contain ‘superstar’ or ‘edu’.",
    "evidence": "",
    "idx": 1592
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`tweets`:`tweets`)\nWHERE `tweets`.`text` =~ '(?i)(?s).*intern.*'\nRETURN `tweets`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the text of tweets about the topic 'intern'.",
    "evidence": "",
    "idx": 1593
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nWHERE `user_profiles`.`followers` > 1000\nRETURN `user_profiles`.`name` AS `name`, `user_profiles`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and email of the users who have more than 1000 followers.",
    "evidence": "",
    "idx": 1594
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`t1`:`user_profiles`)-[t2:follows]->()\nWHERE `t1`.`uid` = `t2`.`f2`\nAND (`t1`.`name` = 'Mary' OR `t1`.`name` = 'Susan')\nRETURN `t2`.`f1` AS `f1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id of users who are followed by Mary or Susan.",
    "evidence": "",
    "idx": 1595
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nORDER BY `user_profiles`.`followers` IS NULL ASC, `user_profiles`.`followers` DESC \nRETURN `user_profiles`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the user who has the largest number of followers.",
    "evidence": "",
    "idx": 1596
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nORDER BY `user_profiles`.`followers` IS NULL DESC, `user_profiles`.`followers`  \nRETURN `user_profiles`.`name` AS `name`, `user_profiles`.`email` AS `email`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and email of the user followed by the least number of people.",
    "evidence": "",
    "idx": 1597
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nRETURN `user_profiles`.`name` AS `name`, `user_profiles`.`followers` AS `followers` ORDER BY `followers` IS NULL ASC, `followers` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name and number of followers for each user, and sort the results by the number of followers in descending order.",
    "evidence": "",
    "idx": 1598
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nORDER BY `user_profiles`.`followers` IS NULL ASC, `user_profiles`.`followers` DESC \nRETURN `user_profiles`.`name` AS `name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of 5 users followed by the largest number of other users.",
    "evidence": "",
    "idx": 1599
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`tweets`:`tweets`)\nORDER BY `tweets`.`createdate` IS NULL DESC, `tweets`.`createdate`  \nRETURN `tweets`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the text of all tweets in the order of date.",
    "evidence": "",
    "idx": 1600
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`tweets_sub0`:`tweets`)\nRETURN `tweets_sub0`.`uid` AS `uid`   } AS in_collect_0\nMATCH (`user_profiles`:`user_profiles`)\nWHERE NOT `user_profiles`.`uid` IN in_collect_0\nRETURN avg(`user_profiles`.`followers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average number of followers for the users who do not have any tweet.",
    "evidence": "",
    "idx": 1601
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`tweets_sub0`:`tweets`)\nRETURN `tweets_sub0`.`uid` AS `uid`   } AS in_collect_0\nMATCH (`user_profiles`:`user_profiles`)\nWHERE `user_profiles`.`uid` IN in_collect_0\nRETURN avg(`user_profiles`.`followers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average number of followers for the users who had some tweets.",
    "evidence": "",
    "idx": 1602
  },
  {
    "filename": "train_spider.json",
    "db_id": "twitter_1",
    "gql_statement": "MATCH (`user_profiles`:`user_profiles`)\nRETURN MAX(`user_profiles`.`followers`) AS `_col_0`, sum(`user_profiles`.`followers`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the maximum and total number of followers of all users.",
    "evidence": "",
    "idx": 1603
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nRETURN DISTINCT (`catalog_contents`.`catalog_entry_name`) AS `catalog_entry_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all the catalog entries.",
    "evidence": "",
    "idx": 1604
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`attribute_definitions`:`attribute_definitions`)\nWITH `attribute_definitions`.`attribute_data_type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `attribute_data_type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the list of attribute data types possessed by more than 3 attribute definitions.",
    "evidence": "",
    "idx": 1606
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`attribute_definitions`:`attribute_definitions`)\nWHERE `attribute_definitions`.`attribute_name` = 'Green'\nRETURN `attribute_definitions`.`attribute_data_type` AS `attribute_data_type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the attribute data type of the attribute with name \"Green\"?",
    "evidence": "",
    "idx": 1608
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_structure`:`catalog_structure`)\nWHERE `catalog_structure`.`catalog_level_number` >= 5 AND `catalog_structure`.`catalog_level_number` <= 10\nRETURN `catalog_structure`.`catalog_level_name` AS `catalog_level_name`, `catalog_structure`.`catalog_level_number` AS `catalog_level_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and level of catalog structure with level between 5 and 10.",
    "evidence": "",
    "idx": 1610
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalogs`:`catalogs`)\nWHERE `catalogs`.`catalog_publisher` =~ '(?i)(?s).*Murray.*'\nRETURN DISTINCT (`catalogs`.`catalog_publisher`) AS `catalog_publisher`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the catalog publishers whose name contains \"Murray\"",
    "evidence": "",
    "idx": 1612
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalogs`:`catalogs`)\nWHERE `catalogs`.`catalog_publisher` =~ '(?i)(?s).*Murray.*'\nRETURN DISTINCT (`catalogs`.`catalog_publisher`) AS `catalog_publisher`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which catalog publishers have substring \"Murray\" in their names?",
    "evidence": "",
    "idx": 1613
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`t2`:`catalog_structure`)-[belongs_to_0:belongs_to]->(`t1`:`catalogs`)\nWHERE `t1`.`catalog_id` = `t2`.`catalog_id`\nAND (`t2`.`catalog_level_number` > 5)\nRETURN `t1`.`catalog_name` AS `catalog_name`, `t1`.`date_of_publication` AS `date_of_publication`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names and publication dates of all catalogs that have catalog level number greater than 5.",
    "evidence": "",
    "idx": 1614
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "CALL(*) {\nMATCH (`catalog_contents_additional_attributes_sub0`:`catalog_contents_additional_attributes`)\nWITH `catalog_contents_additional_attributes_sub0`.`attribute_value` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `attribute_value`  LIMIT 1\n}\nMATCH (`t2`:`catalog_contents_additional_attributes`)-[describes_entry_0:describes_entry]->(`t1`:`catalog_contents`)\nWHERE `t1`.`catalog_entry_id` = `t2`.`catalog_entry_id`\nAND (`t2`.`attribute_value` = `attribute_value`)\nRETURN `t1`.`catalog_entry_name` AS `catalog_entry_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the entry names of catalog with the attribute possessed by most entries.",
    "evidence": "",
    "idx": 1616
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nORDER BY `catalog_contents`.`price_in_dollars` IS NULL ASC, `catalog_contents`.`price_in_dollars` DESC \nRETURN `catalog_contents`.`catalog_entry_name` AS `catalog_entry_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the entry name of the catalog with the highest price (in USD).",
    "evidence": "",
    "idx": 1619
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`t1`:`catalog_contents`)-[at_level_0:at_level]->(`t2`:`catalog_structure`)\nWHERE `t1`.`catalog_level_number` = `t2`.`catalog_level_number`\nORDER BY `t1`.`price_in_dollars` IS NULL DESC, `t1`.`price_in_dollars`  \nRETURN `t2`.`catalog_level_name` AS `catalog_level_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the level name of the catalog with the lowest price (in USD).",
    "evidence": "",
    "idx": 1621
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nRETURN avg(`catalog_contents`.`price_in_euros`) AS `_col_0`, min(`catalog_contents`.`price_in_euros`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average and minimum price (in Euro) of all products?",
    "evidence": "",
    "idx": 1622
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nRETURN avg(`catalog_contents`.`price_in_euros`) AS `_col_0`, min(`catalog_contents`.`price_in_euros`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the average and minimum price (in Euro) of the products.",
    "evidence": "",
    "idx": 1623
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nORDER BY `catalog_contents`.`height` IS NULL ASC, `catalog_contents`.`height` DESC \nRETURN `catalog_contents`.`catalog_entry_name` AS `catalog_entry_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the product with the highest height? Give me the catalog entry name.",
    "evidence": "",
    "idx": 1624
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nORDER BY `catalog_contents`.`capacity` IS NULL DESC, `catalog_contents`.`capacity`  \nRETURN `catalog_contents`.`catalog_entry_name` AS `catalog_entry_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the product that has the smallest capacity.",
    "evidence": "",
    "idx": 1626
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nWHERE `catalog_contents`.`product_stock_number` =~ '(?i)(?s)2.*'\nRETURN `catalog_contents`.`catalog_entry_name` AS `catalog_entry_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all the products whose stock number starts with \"2\".",
    "evidence": "",
    "idx": 1628
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`t2`:`catalog_contents_additional_attributes`)-[describes_entry_0:describes_entry]->(`t1`:`catalog_contents`)\nWHERE `t1`.`catalog_entry_id` = `t2`.`catalog_entry_id`\nAND (`t2`.`catalog_level_number` = '8')\nRETURN `t1`.`catalog_entry_name` AS `catalog_entry_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of catalog entries with level number 8.",
    "evidence": "",
    "idx": 1630
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nWHERE `catalog_contents`.`length` < 3 OR `catalog_contents`.`width` > 5\nRETURN `catalog_contents`.`catalog_entry_name` AS `catalog_entry_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the products with length smaller than 3 or height greater than 5.",
    "evidence": "",
    "idx": 1632
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`t1`:`attribute_definitions`)\nMATCH (`t2`:`catalog_contents_additional_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t2`.`attribute_value` = 0)\nRETURN `t1`.`attribute_name` AS `attribute_name`, `t1`.`attribute_id` AS `attribute_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and attribute ID of the attribute definitions with attribute value 0.",
    "evidence": "",
    "idx": 1634
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nWHERE `catalog_contents`.`price_in_dollars` > 700\nRETURN `catalog_contents`.`catalog_entry_name` AS `catalog_entry_name`, `catalog_contents`.`capacity` AS `capacity`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and capacity of products with price greater than 700 (in USD).",
    "evidence": "",
    "idx": 1636
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalogs`:`catalogs`)\nWITH `catalogs`.`date_of_latest_revision` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `date_of_latest_revision`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the dates on which more than one revisions were made.",
    "evidence": "",
    "idx": 1638
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of catalog contents.",
    "evidence": "",
    "idx": 1641
  },
  {
    "filename": "train_spider.json",
    "db_id": "product_catalog",
    "gql_statement": "MATCH (`catalog_contents`:`catalog_contents`)\nWHERE `catalog_contents`.`next_entry_id` > 8\nRETURN `catalog_contents`.`catalog_entry_name` AS `catalog_entry_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Name all the products with next entry ID greater than 8.",
    "evidence": "",
    "idx": 1642
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`aircraft`:`aircraft`)\nRETURN `aircraft`.`name` AS `name`, `aircraft`.`distance` AS `distance`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show name and distance for all aircrafts.",
    "evidence": "",
    "idx": 1646
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`aircraft`:`aircraft`)\nWHERE `aircraft`.`distance` > 1000\nRETURN `aircraft`.`aid` AS `aid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show ids for all aircrafts with more than 1000 distance.",
    "evidence": "",
    "idx": 1648
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`aircraft`:`aircraft`)\nRETURN min(`aircraft`.`distance`) AS `_col_0`, avg(`aircraft`.`distance`) AS `_col_1`, MAX(`aircraft`.`distance`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the minimum, average, and maximum distance of all aircrafts.",
    "evidence": "",
    "idx": 1654
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`aircraft`:`aircraft`)\nRETURN min(`aircraft`.`distance`) AS `_col_0`, avg(`aircraft`.`distance`) AS `_col_1`, MAX(`aircraft`.`distance`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the minimum, average and maximum distances traveled across all aircrafts.",
    "evidence": "",
    "idx": 1655
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`aircraft`:`aircraft`)\nORDER BY `aircraft`.`distance` IS NULL ASC, `aircraft`.`distance` DESC \nRETURN `aircraft`.`aid` AS `aid`, `aircraft`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the id and name of the aircraft with the maximum distance.",
    "evidence": "",
    "idx": 1656
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`aircraft`:`aircraft`)\nORDER BY `aircraft`.`distance` IS NULL DESC, `aircraft`.`distance`  \nRETURN `aircraft`.`name` AS `name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of aircrafts with top three lowest distances.",
    "evidence": "",
    "idx": 1658
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`aircraft`:`aircraft`)\nORDER BY `aircraft`.`distance` IS NULL DESC, `aircraft`.`distance`  \nRETURN `aircraft`.`name` AS `name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the aircrafts with top 3 shortest lengthes? List their names.",
    "evidence": "",
    "idx": 1659
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "CALL(*) {\nMATCH (`aircraft_sub0`:`aircraft`)\nRETURN avg(`aircraft_sub0`.`distance`) AS `_col_0`  \n}\nMATCH (`aircraft`:`aircraft`)\nWHERE `aircraft`.`distance` > `_col_0`\nRETURN `aircraft`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names for all aircrafts with distances more than the average.",
    "evidence": "",
    "idx": 1660
  }
]