[
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies2directors`)\nMATCH (`t1`:`directors`)\nWHERE `t1`.`directorid` = `t2`.`directorid`\nAND (`t1`.`d_quality` >= 3)\nWITH `t1`.`directorid` AS _groupby_col_0, COUNT(`t2`.`movieid`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `directorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list director IDs who have the quality of at least 3 and have made at least 2 different genres of movies.",
    "evidence": "",
    "idx": 1665
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies`)\nMATCH (`t1`:`movies2directors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t2`.`runningtime` >= 2 AND `t1`.`genre` = 'Horror')\nRETURN `t1`.`movieid` AS `movieid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What horror movies have a running time of at least 2? Please list movie IDs.",
    "evidence": "Higher value of running time means running time is longer",
    "idx": 1668
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies`)\nMATCH (`t1`:`u2base`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t2`.`country` = 'USA')\nRETURN CASE WHEN COUNT(`t1`.`movieid`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t1`.`rating` = '1' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`movieid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate negative critical reception of American movies",
    "evidence": "'negative critical reception' refers to percentage of movies with a rating of 1, which = [count(rating = 1) / count(all movies)] * 100% ",
    "idx": 1669
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`u2base`)\nMATCH (`t1`:`users`)\nWHERE `t1`.`userid` = `t2`.`userid`\nAND (`t2`.`movieid` = '2409051' AND `t2`.`rating` = '2')\nRETURN `t1`.`userid` AS `userid`, `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the user ids and ages who gave the rate 2 to the movie No. 2409051.",
    "evidence": "",
    "idx": 1672
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies`)\nMATCH (`t1`:`u2base`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`rating` = '5' AND `t2`.`year` = 1)\nRETURN DISTINCT `t1`.`movieid` AS `movieid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the ids of the oldest films that got the most ratings.",
    "evidence": "Films and movies share the same meaning; oldest film refers to the movie with year = 1",
    "idx": 1673
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`u2base`)\nMATCH (`t1`:`users`)\nWHERE `t1`.`userid` = `t2`.`userid`\nAND (`t2`.`rating` = '3' AND `t2`.`movieid` = '1711133' AND `t1`.`age` = '35' AND `t1`.`u_gender` = 'F')\nRETURN COUNT(`t1`.`userid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many 35-year-old female users gave the movie 1711133 a rating of 3?",
    "evidence": "Female users mean that u_gender = 'F'",
    "idx": 1677
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies2directors`)\nMATCH (`t1`:`directors`)\nWHERE `t1`.`directorid` = `t2`.`directorid`\nAND (`t1`.`d_quality` = 3 AND `t1`.`avg_revenue` = 2 AND `t2`.`genre` <> 'Comedy')\nRETURN DISTINCT `t1`.`directorid` AS `directorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many unique directors with an average earnings of 2 and a quality of 3 have not made comedy films? List them.",
    "evidence": "",
    "idx": 1679
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies2actors`)\nMATCH (`t1`:`actors`)\nWHERE `t1`.`actorid` = `t2`.`actorid`\nAND (`t2`.`movieid` = 1672580 AND `t1`.`a_gender` = 'F')\nRETURN CASE WHEN COUNT(`t1`.`actorid`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`cast_num` = 2 AND `t1`.`a_quality` = 2 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`actorid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of female actors and quality 2 who have appeared twice at the casting of the film 1672580.",
    "evidence": "Female actors mean that a_gender = 'F'; percentage can be computed by [cast_num = 2 AND a_quality = 2 in female) / (all female actors)] * 100%",
    "idx": 1680
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`actors`:`actors`)\nWHERE `actors`.`a_quality` = 0\nRETURN CASE WHEN sum(CASE WHEN `actors`.`a_gender` = 'F' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `actors`.`a_gender` = 'M' THEN 1 ELSE 0 END)) / sum(CASE WHEN `actors`.`a_gender` = 'F' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the worst actors are men and how many of the worst actors are women? Indicate your answer in ratio form.",
    "evidence": "The worst actors means a_quality = 0; Men and male share the same meaning; men actors refers to a_gender = 'M'",
    "idx": 1681
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t1`:`movies`)\nMATCH (`t2`:`u2base`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`isenglish` = 'F' AND `t1`.`country` = 'USA')\nORDER BY `t2`.`rating` IS NULL DESC, `t2`.`rating`  \nRETURN `t2`.`movieid` AS `movieid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What non-English American film/s has received the lowest user ratings? Mention the movie's I.D.",
    "evidence": "USA is a country; non-English means isEnglish = 'F'",
    "idx": 1682
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t1`:`movies`)\nMATCH (`t2`:`movies2directors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`runningtime` <= 2 AND `t1`.`isenglish` = 'T' AND `t1`.`country` = 'other')\nRETURN `t2`.`genre` AS `genre`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the genres of all the English-language foreign films having a runtime of two hours or less? List each one.",
    "evidence": "isEnglish = 'T' means films in English; Film and movie share the same meaning",
    "idx": 1684
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t2`.`product id`\nAND (`t3`.`category` = 'Furniture' AND `t1`.`customer name` = 'Aimee Bixby')\nRETURN COUNT(DISTINCT `t2`.`order id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the orders made by Aimee Bixby, how many of them included at least one kind of product under the category \"Furniture\"?",
    "evidence": "made by Aimee Bixby refers to \"Customer Name\" = 'Aimee Bixby';",
    "idx": 1689
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t2`.`product id`\nAND (`t1`.`customer name` = 'Aimee Bixby' AND CASE WHEN `t2`.`ship date` is not NULL THEN apoc.temporal.format(`t2`.`ship date`,'yyyy') ELSE NULL END = '2016')\nRETURN DISTINCT `t3`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the products ordered by Aimee Bixby in 2016.",
    "evidence": "ordered by Aimee Bixby refers to \"Customer Name\" = 'Aimee Bixby'; ordered n 2016 refers to strftime('%Y', \"Order Date\") = '2016';",
    "idx": 1690
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t2`.`product id`\nAND (`t3`.`product name` = 'Telescoping Adjustable Floor Lamp')\nRETURN DISTINCT `t1`.`customer name` AS `customer name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the customers who had ordered the product \"Telescoping Adjustable Floor Lamp\".",
    "evidence": "\"Telescoping Adjustable Floor Lamp\" is a product name; names of all the customers refers to \"Customer Name\"",
    "idx": 1692
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:purchased]->(`t2`:`product`)\nWHERE `t1`.`product id` = `t2`.`product id`\nAND (`t2`.`sub-category` = 'Art' AND `t1`.`region` = 'East' AND CASE WHEN `t1`.`order date` is not NULL THEN apoc.temporal.format(`t1`.`order date`,'yyyy') ELSE NULL END = '2013')\nRETURN COUNT(DISTINCT `t1`.`product id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many art products were ordered in 2013 in the east superstore?",
    "evidence": "ordered in 2013 refers to strftime('%Y', \"Order Date\") = '2013'; art products refers to \"Sub-Category\" = 'Art'",
    "idx": 1698
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t2`.`product id`\nAND (`t1`.`customer name` = 'Becky Martin' AND `t3`.`region` = 'Central')\nRETURN DISTINCT `t3`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the products ordered by Becky Martin around the Central region.",
    "evidence": "ordered by Becky Martin refers to \"Customer Name\" = 'Becky Martin'; Region = 'Central'; products refers to \"Product Name\"",
    "idx": 1706
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t1`.`region` = 'West' AND `t1`.`ship mode` = 'Second Class')\nRETURN DISTINCT `t2`.`customer name` AS `customer name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List 5 customers in the West region who had their item shipped 'Second Class.'",
    "evidence": "shipped 'Second Class.' refers to \"Ship Mode\" = 'Second Class'; customers refers to \"Customer Name\"; Region = 'West'",
    "idx": 1707
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t1`.`customer name` = 'Patrick Gardner' AND `t1`.`region` = 'Central')\nRETURN sum(`t2`.`profit`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Add the total profit of Patrick Gardner in the Central region.",
    "evidence": "Patrick Gardner is the \"Customer Name\"; Region = 'Central'",
    "idx": 1708
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t1`.`product id`\nAND (`t2`.`customer name` = 'Jonathan Doherty' AND `t2`.`region` = 'East')\nORDER BY `t1`.`quantity` IS NULL ASC, `t1`.`quantity` DESC \nRETURN `t3`.`product name` AS `product name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the item ordered by Jonathan Doherty with the highest quantity in the East region.",
    "evidence": "Jonathan Doherty is the \"Customer Name\"; highest quantity refers to MAX(Quantity); Region = 'East'",
    "idx": 1711
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t1`.`region` = 'West' AND `t1`.`order id` = 'CA-2011-108189')\nRETURN DISTINCT `t2`.`segment` AS `segment`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the customer segment from the West region that orders the order ID CA-2011-108189.",
    "evidence": "Region = 'West'",
    "idx": 1717
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t2`.`region` = 'South' AND `t2`.`customer name` = 'Frank Olsen')\nRETURN `t1`.`order id` AS `order id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the order ID of Frank Olsen of the South region.",
    "evidence": "Frank Olsen' is the \"Customer Name\"; Region = 'South'",
    "idx": 1719
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t1`.`product id`\nAND (`t1`.`region` = 'South' AND `t3`.`product name` = 'Xerox 23')\nRETURN DISTINCT `t2`.`customer name` AS `customer name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the customers that purchased the product named Xerox 23 in the South region.",
    "evidence": "product named Xerox 23 refers to \"Product Name\" = 'Xerox 23'; customers refers to \"Customer Name\"",
    "idx": 1723
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t1`.`region` = 'East' AND CASE WHEN (1 - `t1`.`discount`)=0 THEN NULL ELSE `t1`.`sales` / (1 - `t1`.`discount`) END * `t1`.`quantity` - `t1`.`profit` > 80000)\nRETURN DISTINCT `t2`.`customer name` AS `customer name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the customers from the Eastern region whose orders cost above 80000.",
    "evidence": "cost above 80000 refers to SUTRACT(MULTIPLY(DIVIDE(Sales, SUTRACT(1, discount)), Quantity), Profit) > 80000",
    "idx": 1727
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t2`.`customer name` = 'Maxwell Schwartz' AND CASE WHEN `t1`.`order date` is not NULL THEN apoc.temporal.format(`t1`.`order date`,'yyyy') ELSE NULL END = '2015')\nRETURN COUNT(DISTINCT `t1`.`order id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were made by Maxwell Schwartz in 2015?",
    "evidence": "Maxwell Schwartz' is the \"Customer Name\"; in 2015 refers to strftime('%Y', \"Order Date\") = '2015';",
    "idx": 1728
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t1`.`product id`\nAND (`t2`.`customer name` = 'Anne McFarland')\nRETURN DISTINCT `t3`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the products that were ordered by Anne McFarland from the Western store.",
    "evidence": "Anne McFarland' is the \"Customer Name\"; Western store refers to west_superstore; products refers to \"Product Name\"",
    "idx": 1730
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t1`.`product id`\nAND (`t2`.`city` = 'Coachella')\nRETURN DISTINCT `t3`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the products ordered by customers in Coachella.",
    "evidence": "in Coachella refers to City = 'Coachella'; products refers to \"Product Name\"",
    "idx": 1731
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t1`.`product id`\nAND (`t2`.`customer name` = 'Matt Abelman' AND CASE WHEN `t1`.`order date` is not NULL THEN apoc.temporal.format(`t1`.`order date`,'yyyy') ELSE NULL END = '2013')\nRETURN DISTINCT `t3`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the products ordered by Matt Abelman from the Western store in 2013.",
    "evidence": "ordered by Matt Abelman refers to \"Customer Name\" = 'Matt Abelman'; in 2013 refers to \"Order Date\" like '2013%'",
    "idx": 1733
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t3`:`product`)\nMATCH (`t2`:`people`)-[t1:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t1`.`product id` = `t3`.`product id` AND `t1`.`region` = `t3`.`region`\nAND (`t1`.`region` = 'East' AND `t2`.`customer name` = 'Brad Thomas' AND CASE WHEN `t1`.`order date` is not NULL THEN apoc.temporal.format(`t1`.`order date`,'yyyy') ELSE NULL END = '2016')\nRETURN sum((CASE WHEN (1 - `t1`.`discount`)=0 THEN NULL ELSE `t1`.`sales` / (1 - `t1`.`discount`) END) * `t1`.`quantity` - `t1`.`profit`) AS `cost`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total cost of the orders by Brad Thomas in 2016.",
    "evidence": "Brad Thomas is the \"Customer Name\"; in 2016 refers to strftime('%Y', \"Order Date\") = '2016'; total cost refers to SUM(SUTRACT(MULTIPLY(DIVIDE(Sales, SUTRACT(1, discount)), Quantity), Profit))",
    "idx": 1734
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t1`.`product id`\nAND (`t3`.`product name` = 'Plantronics Single Ear Headset')\nRETURN DISTINCT `t2`.`customer name` AS `customer name`, `t2`.`city` AS `city`, `t2`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names, cities, and countries of the customers who ordered the Plantronics single ear headset.",
    "evidence": "Plantronics Single Ear Headset' is the \"Product Name\"; name refers to \"Customer Name\";",
    "idx": 1735
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t2`.`product id`\nAND (`t1`.`customer name` = 'Gene Hale')\nRETURN DISTINCT `t2`.`ship date` AS `ship date`, `t3`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the shipping dates and products of the orders by Gene Hale.",
    "evidence": "Gene Hale' refers to \"Customer Name\"; shipping date refers to \"Ship Date\"; products refers to \"Product Name\"",
    "idx": 1736
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t1`.`product id`\nAND (`t2`.`customer name` = 'Cindy Stewart')\nRETURN `t3`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of all products that Cindy Stewart ordered in the east superstore.",
    "evidence": "name of all products refers to Product Name; Cindy Stewart is the Customer Name;",
    "idx": 1740
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:purchased]->(`t2`:`product`)\nWHERE `t1`.`product id` = `t2`.`product id`\nWITH `t2`.`product name` = 'Memorix Froggy Flash Drive 8 GB' AS _groupby_col_0, sum(`t1`.`profit`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total profit of \"Memorex Froggy Flash Drive 8 GB in south superstore?",
    "evidence": "\"Memorix Froggy Flash Drive 8 GB\" is the \"Product Name\"",
    "idx": 1746
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t1`.`product id`\nAND (`t3`.`product name` = 'Sharp AL-1530CS Digital Copier')\nRETURN avg(`t1`.`sales`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average sales of \"\"Sharp AL-1530CS Digital Copier in the east and the west superstore.",
    "evidence": "Sharp AL-1530CS Digital Copier' is the \"Product Name\"; average sales = AVG(Sales)",
    "idx": 1748
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t2`.`product id`\nRETURN CASE WHEN COUNT(`t3`.`category`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t3`.`category` = 'Office Supplies' THEN 1 ELSE 0 END)) * 100 / COUNT(`t3`.`category`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of ordered office supplies products in the central and the south superstore.",
    "evidence": "office supplies products refers to Category = 'Office Supplies'; central refers to Region = 'Central'; south superstore refers to Region = 'South'; percentage = divide(SUM(Product ID where Category = 'Office Supplies'), count(Product ID)) * 100 where Region = 'Central' OR Region = 'South'",
    "idx": 1749
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (CASE WHEN `t1`.`order date` is not NULL THEN apoc.temporal.format(`t1`.`order date`,'yyyy') ELSE NULL END = '2015')\nWITH `t2`.`customer name` AS _groupby_col_0, COUNT(`t2`.`customer name`) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN DISTINCT _groupby_col_0 AS `customer name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the customers in South superstore, which customers ordered more than 3 times in 2015? State the name of the customers.",
    "evidence": "name of the customers refers to Customer_Name; in 2015 refers to \"Order Date\" BETWEEN '2015-01-01' AND '2015-12-31'; more than 3 times refers to count(Order_ID) > 3",
    "idx": 1751
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t1`.`customer name` = 'Anna Chung')\nRETURN MAX(`t2`.`profit`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the highest profit made by Anna Chung's orders in the Central Superstore.",
    "evidence": "highest profit refers to max(Profit)",
    "idx": 1752
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t1`.`customer name` = 'Corey Roper' AND CASE WHEN `t2`.`ship date` is not NULL THEN apoc.temporal.format(`t2`.`ship date`,'yyyy') ELSE NULL END = '2015')\nRETURN COUNT(`t2`.`customer id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were made by Corey Roper in 2015?",
    "evidence": "",
    "idx": 1753
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:purchased]->(`t2`:`product`)\nWHERE `t1`.`product id` = `t2`.`product id`\nAND (CASE WHEN `t1`.`ship date` is not NULL THEN apoc.temporal.format(`t1`.`ship date`,'yyyy-MM') ELSE NULL END = '2013-03')\nRETURN DISTINCT `t2`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the products that had been shipped in March 2013 at central superstore?",
    "evidence": "names of the products refers to Product Name; shipped in March 2013 refers to \"Ship Date\" = '2013-03%'",
    "idx": 1772
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t1`.`customer name` = 'Alan Barnes' AND CASE WHEN `t2`.`order date` is not NULL THEN apoc.temporal.format(`t2`.`order date`,'yyyy') ELSE NULL END = '2015')\nRETURN COUNT(DISTINCT `t2`.`order id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were made by Alan Barnes in 2015 at the Central superstore?",
    "evidence": "in 2015 refers to \"Order Date\" = '2015%'",
    "idx": 1774
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:purchased]->(`t2`:`product`)\nWHERE `t1`.`product id` = `t2`.`product id`\nAND (`t2`.`category` = 'Furniture' AND CASE WHEN `t1`.`ship date` is not NULL THEN apoc.temporal.format(`t1`.`ship date`,'yyyy') ELSE NULL END = '2013')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`ship mode` = 'First Class' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of furniture orders that were shipped through first class in 2013 at the Central superstore?",
    "evidence": "furniture refers to Category = 'Furniture'; shipped through first class in 2013 refers to ship mode = 'first class' and \"Ship Date\" = '2013%'; percentage = divide(sum(Order ID) when Category = 'Furniture' and \"Ship Date\" = '2013%', sum(Order ID)) as percentage",
    "idx": 1777
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t1`:`people`)-[t2:purchased]->(`t3`:`product`)\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND `t3`.`product id` = `t2`.`product id`\nAND (`t1`.`customer name` = 'Bill Shonely' AND `t2`.`region` = 'Central')\nRETURN DISTINCT `t3`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the product's name bought by the customer named Bill Shonely from the Central region.",
    "evidence": "",
    "idx": 1780
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t1`.`quantity` = 8 AND `t1`.`region` = 'West')\nRETURN DISTINCT `t2`.`customer name` AS `customer name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the name of customers from the West region that bought exactly 8 items in their purchase.",
    "evidence": "name of customers refers to \"Customer Name\"; bought exactly 8 items refers to Quantity = 8",
    "idx": 1781
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:purchased]->(`t2`:`product`)\nWHERE `t1`.`product id` = `t2`.`product id`\nAND (`t2`.`region` = 'Central' AND CASE WHEN `t1`.`order date` is not NULL THEN apoc.temporal.format(`t1`.`order date`,'yyyy') ELSE NULL END = '2016')\nORDER BY `t1`.`profit` IS NULL DESC, `t1`.`profit`  \nRETURN `t2`.`product name` AS `product name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the orders from 2016 in the Central region, what is the product with the lowest profit?",
    "evidence": "orders from 2016 refers to \"Order Date\" = '2016%'; product refers to \"Product Name\"; lowest profit refers to min(Profit)",
    "idx": 1784
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "CALL(*) {\nMATCH ()-[south_superstore_sub0:purchased]->()\nRETURN avg(`south_superstore_sub0`.`sales`) AS `_col_0`  \n}\nMATCH (`t2`:`people`)-[t1:purchased]->()\nWHERE `t1`.`customer id` = `t2`.`customer id`\nAND (`t2`.`region` = 'South' AND `t1`.`ship mode` = 'Standard Class' AND CASE WHEN `_col_0`=0 THEN NULL ELSE 100 * `t1`.`sales` / `_col_0` END > 88)\nRETURN DISTINCT `t2`.`customer name` AS `customer name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the customer's name from the South region with a standard class ship mode and sales greater than the 88% of the average sales of all orders.",
    "evidence": "sales greater than the 88% of the average sales of all orders refers to Sales > avg(Sales) * 0.88; South region refers to south_superstore",
    "idx": 1789
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`incidents`:`incidents`)\nWHERE `incidents`.`subject_weapon` = 'Vehicle'\nRETURN sum(CASE WHEN CASE WHEN `incidents`.`date` is not NULL THEN apoc.temporal.format(`incidents`.`date`,'yyyy') ELSE NULL END = '2007' THEN 1 ELSE 0 END) - sum(CASE WHEN CASE WHEN `incidents`.`date` is not NULL THEN apoc.temporal.format(`incidents`.`date`,'yyyy') ELSE NULL END = '2008' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Did the number of cases with Vehicle as subject weapon increase or decrease from year 2007 to 2008. State the difference.",
    "evidence": "number of cases refers to count(case_number); with Vehicle as subject weapon refers to subject_weapon = 'Vehicle'; year 2007 refers to date between '2007-01-01' and '2007-12-31'; year 2008 refers to date between '2008-01-01' and '2008-12-31'",
    "idx": 1792
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`incidents`:`incidents`)\nWHERE `incidents`.`subject_weapon` = 'Handgun'\nRETURN CASE WHEN COUNT(`incidents`.`case_number`)=0 THEN NULL ELSE toFloat(sum(toInteger(`incidents`.`subject_statuses` = 'Shoot and Miss'))) * 100 / COUNT(`incidents`.`case_number`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the 'Handgun' weapon used by subject, how many percent were 'Shoot and Miss'?",
    "evidence": "'Handgun' weapon refers to subject_weapon = 'Handgun'; 'Shoot and Miss' refers to subject_statuses = 'Shoot and Miss'; percent = divide(count(incidents where subject_statuses = 'Shoot and Miss'), count(incidents)) where subject_weapon = 'Handgun' * 100%",
    "idx": 1793
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (`t2`:`subjects`)-[involved_in_0:involved_in]->(`t1`:`incidents`)\nWHERE `t1`.`case_number` = `t2`.`case_number`\nAND (`t2`.`gender` = 'F')\nRETURN `t1`.`case_number` AS `case_number`, `t1`.`subject_statuses` AS `subject_statuses`, `t1`.`subject_weapon` AS `subject_weapon`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which are the cases where the subject are female. List the case number, subject status and weapon.",
    "evidence": "female refers to gender = 'F'; weapon refers to subject_weapon",
    "idx": 1794
  }
]