[
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`food_type` = 'chicken'\nORDER BY generalinfo.`review` DESC NULLS LAST \nRETURN generalinfo.`label` AS `label` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which chicken restaurant has the highest review?",
    "evidence": "chicken restaurant refers to food_type = 'chicken'; the highest review refers to max(review)",
    "idx": 918
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (geographic@`geographic`)\nWHERE geographic.`city` = 'el cerrito'\nRETURN geographic.`county` AS `county`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which county is El Cerrito from?",
    "evidence": "El Cerrito refers to city = 'el cerrito'",
    "idx": 919
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (location@`location`)\nWHERE location.`street_name` = 'irving'\nRETURN COUNT(location.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants are on Irving Street?",
    "evidence": "Irving Street refers to street_name = 'irving'",
    "idx": 920
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`label` = 'peking duck restaurant')\nRETURN t2.`street_name` AS `street_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the address of the Peking Duck restaurant?",
    "evidence": "address refers to street_num, street_name; Peking Duck restaurant refers to label = 'peking duck restaurant'",
    "idx": 922
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t1@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t2.`food_type` = 'greek')\nRETURN DISTINCT t1.`region` AS `region`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the regions with Greek restaurants?",
    "evidence": "Greek restaurant refers to food_type = 'greek'",
    "idx": 923
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`street_name` = 'murray ave' AND t1.`street_num` = 8440)\nRETURN t2.`review` AS `review`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the review of the restaurant at 8440 Murray Ave?",
    "evidence": "8440 Murray Ave refers to street_num = 8440 and street_name = 'murray ave'",
    "idx": 925
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[located_in_2_0:`located_in_2`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`street_num` = 1149 AND t1.`street_name` = 'el camino real')\nRETURN t2.`region` AS `region`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the region of 1149 El Camino Real?",
    "evidence": "1149 El Camino Real refers to street_num = 1149 and street_name = 'el camino real'",
    "idx": 926
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`label` = 'sankee')\nRETURN t2.`county` AS `county`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the county of the Sankee restaurant?",
    "evidence": "Sankee restaurant refers to label = 'sankee'",
    "idx": 927
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[located_in_2_0:`located_in_2`]->(t1@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`region` = 'northern california')\nRETURN COUNT(t1.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many streets with restaurants are there in the Northern California region?",
    "evidence": "",
    "idx": 928
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[located_in_2_0:`located_in_2`]->(t1@`geographic`)\nWHERE t1.`city` = t2.`city`\nRETURN cast (sum(CASE WHEN t1.`region` = 'bay area' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of restaurants are from the Bay Area?",
    "evidence": "Bay Area refers to region = 'bay area'; percentage = divide(count(id_restaurant where region = 'bay area'), count(id_restaurant)) * 100%",
    "idx": 930
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (geographic@`geographic`)\nWHERE geographic.`region` = 'bay area'\nRETURN COUNT(geographic.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities are located in the Bay Area?",
    "evidence": "the Bay Area refers to region = 'bay area'",
    "idx": 933
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t2.`county` = 'unknown')\nRETURN COUNT(t1.`label`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many labels of the restaurant have an unknown country?",
    "evidence": "unknown county refers to county = 'unknown'",
    "idx": 934
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (geographic@`geographic`)\nWHERE geographic.`region` = 'bay area'\nRETURN COUNT(geographic.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the cities are in a Bay Area?",
    "evidence": "Bay Area refers to region = 'bay area'",
    "idx": 940
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (geographic@`geographic`)\nWHERE geographic.`region` = 'bay area' AND geographic.`county` = 'santa clara county'\nRETURN geographic.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the city located in Bay Area of Santa Clara?",
    "evidence": "Bay Area refers to region = 'bay area'; Santa Clara refers to county = 'santa clara county'",
    "idx": 942
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (location@`location`)\nWHERE location.`street_name` = 'railroad' AND location.`street_num` < 1000\nRETURN COUNT(location.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the restaurants on street number below 1000, how many of them are in Railroad St.?",
    "evidence": "street number below 1000 refers to street_num < 1000; Railroad St. refers to street_name = 'railroad'",
    "idx": 944
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`food_type` = '24 hour diner' AND generalinfo.`city` = 'san francisco'\nRETURN generalinfo.`label` AS `label`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the 24 hour diner at San Francisco?",
    "evidence": "name refers to label; 24 hour diner refers to food_type = '24 hour diner'; San Francisco refers to city = 'san francisco'",
    "idx": 945
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t2.`food_type` = 'bakery' AND t2.`city` = 'palo alto' AND t1.`street_name` = 'university ave.')\nRETURN COUNT(t1.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the bakeries, what is total number of bakery located at University Avenue, Palo Alto?",
    "evidence": "bakery refers to food_type = 'bakery'; University Avenue refers to street_name = 'university ave.'; Palo Alto refers to city = 'palo alto'",
    "idx": 948
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`street_name` = 'castro st' AND t1.`city` = 'mountain view' AND t2.`food_type` = 'indian' AND like(t2.`label`,'%cookhouse%'))\nRETURN COUNT(t1.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all indian restaurants in Castro St., Mountainview, how many of them is about cookhouse in their label?",
    "evidence": "indian restaurant refers to food_type = 'indian'; Castro St. refers to street_name = 'castro st'; Mountainview refers to city = 'mountainview'; have the word \"Indian\" in label refers to label = 'indian'",
    "idx": 951
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t2.`review` = 2 AND t1.`street_num` < 500)\nRETURN COUNT(t1.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In restaurants with a review of 2, how many restaurants have a street number below 500?",
    "evidence": "review of 2 refers to review = 2; street number below 500 refers to street_num < 500",
    "idx": 952
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t2.`city` = 'milpitas' AND t2.`food_type` = 'asian' AND t1.`street_name` = 'n milpitas blvd' AND t1.`id_restaurant` > 385)\nRETURN COUNT(t1.`id_restaurant`) AS `num`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all asian restaurants in N. Milpitas Blvd., Milpitas, how many of them have restaurant ID greater than 385?",
    "evidence": "asian restaurant refers to food_type = 'asian'; N. Milpitas Blvd. refers to street_name = 'n milpitas blvd'; Milpitas refers to city = 'milpitas'; restaurant ID greater than 385 refers to id_restaurant > 385",
    "idx": 953
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`city` = 'san francisco' AND t1.`street_name` = 'ocean avenue')\nRETURN t2.`label` AS `label`, t1.`id_restaurant` AS `id_restaurant`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the restaurant's name and ID located at Ocean Avenue, San Francisco?",
    "evidence": "restaurant's name refers to label; Ocean Avenue refers to street_name = 'ocean avenue'; San Francisco refers to city = 'san francisco'",
    "idx": 954
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`city` = 'san francisco' AND t1.`street_name` = 'front')\nRETURN COUNT(t2.`food_type` = 'american') AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many American restaurants are located in Front, San Francisco?",
    "evidence": "American restaurant refers to food_type = 'american'; Front refers to street_name = 'front'; San Francisco refers to city = 'san francisco'",
    "idx": 957
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "CALL {\nMATCH (generalinfo_sub0@`generalinfo`)\nWHERE generalinfo_sub0.`food_type` = 'asian' AND generalinfo_sub0.`city` = 'san francisco'\nRETURN MAX(generalinfo_sub0.`review`) AS `_col_0` \n}\nMATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`food_type` = 'asian' AND generalinfo.`city` = 'san francisco' AND generalinfo.`review` = _col_0\nRETURN generalinfo.`label` AS `label`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the most popular restaurant serving Asian foods in San Francisco?",
    "evidence": "the most popular refers to max(review); Asian food refers to food_type = 'asian'; San Francisco refers to city = 'san francisco'",
    "idx": 958
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (geographic@`geographic`)\nWHERE geographic.`region` = 'monterey'\nRETURN COUNT(DISTINCT geographic.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities are there in Monterey?",
    "evidence": "Monterey refers to region = 'monterey'",
    "idx": 959
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`city` = 'belmont' AND generalinfo.`review` > 2 AND generalinfo.`food_type` = 'deli'\nRETURN COUNT(generalinfo.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many deli in Belmont have a review rating of 2 or more?",
    "evidence": "deli ris a food type; Belmont refers to city = 'belmont'; review rating of 2 or more refers to review > 2",
    "idx": 960
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (location@`location`)\nWHERE location.`city` = 'concord'\nRETURN COUNT(location.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants can you find in Concord?",
    "evidence": "Concord refers to city = 'concord'",
    "idx": 961
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nORDER BY t1.`review` DESC NULLS LAST \nRETURN t2.`region` AS `region` \nLIMIT 4",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which region can you find the top 4 most popular restaurants?",
    "evidence": "the top 4 most popular restaurant refers to top 4 max(review)",
    "idx": 962
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`city` = 'livermore' AND t1.`food_type` = 'chinese' AND t2.`street_name` = '1st st')\nRETURN COUNT(t1.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Chinese restaurants are there on 1st st, Livermore?",
    "evidence": "Chinese restaurant refers to food_type = 'chinese'; 1st st refers to street_name = '1st st'; Livermore refers to city = 'livermore'",
    "idx": 963
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t1@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t2.`food_type` = 'indian' AND t1.`region` = 'los angeles area')\nRETURN COUNT(t1.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Indian restaurants are there in the Los Angeles area?",
    "evidence": "Indian restaurant refers to food_type = 'indian'; the Los Angeles area refers to region = 'los angeles area'",
    "idx": 964
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)\nMATCH (t2@`generalinfo`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`street_name` = 'broadway' AND t2.`review` < 3 AND t1.`city` = 'oakland')\nRETURN COUNT(t1.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants in Broadway, Oakland received a review of no more than 3?",
    "evidence": "Broadway refers to street_name = 'broadway';  Oakland refers to city = 'oakland'; a review of no more than 3 refers to review < 3",
    "idx": 965
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t1@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`region` = 'yosemite and mono lake area')\nRETURN COUNT(t2.`food_type`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many types of restaurants are there in the Yosemite and Mono Lake area?",
    "evidence": "",
    "idx": 967
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nORDER BY t1.`review` DESC NULLS LAST \nRETURN t2.`street_name` AS `street_name`, t2.`street_num` AS `street_num`, t2.`city` AS `city` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full address of the most popular restaurant among the diners?",
    "evidence": "full address refers to street_num, street_name, city; the most popular refers to max(review)",
    "idx": 968
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)\nMATCH (t2@`generalinfo`)\nWHERE t1.`city` = t2.`city`\nAND (t2.`review` >= 4)\nRETURN t1.`street_num` AS `street_num`, t1.`street_name` AS `street_name`, t1.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List the full address of all the American restaurants with a review of 4 or more?",
    "evidence": "full address refers to street_num, street_name, city; American restaurant refers to food_type = 'american'; a review of 4 or more refers to review > 4",
    "idx": 969
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (torrents@`torrents`)\nWHERE like(torrents.`artist`,'ron hunt & ronnie g & the sm crew') AND torrents.`groupyear` = 1979 AND like(torrents.`releasetype`,'single') AND torrents.`totalsnatched` = 239\nRETURN torrents.`groupname` AS `groupname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the release title of the single that was released by Ron Hunt in 1979 that was downloaded 239 times?",
    "evidence": "release title refers to groupName; Ron Hunt is an artist; groupYear = 1979; releaseType = 'single'; downloaded 239 times refer to totalSnatched = 239;",
    "idx": 970
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (torrents@`torrents`)\nWHERE like(torrents.`artist`,'blowfly') AND torrents.`groupyear` = 1980\nRETURN torrents.`totalsnatched` AS `totalsnatched`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times was the album released by blowfly in 1980 downloaded?",
    "evidence": "blowfly is an artist; groupYear = 1980; album refers to releaseType; downloaded refers to totalSnatched;",
    "idx": 971
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t1.`releasetype` = 'album')\nORDER BY t1.`totalsnatched` DESC NULLS LAST \nRETURN t2.`tag` AS `tag` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the tag of the album with the highest amount of downloads?",
    "evidence": "album refers to releaseType; the highest amount of downloads refers to MAX(totalSnatched);",
    "idx": 972
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t1.`releasetype` = 'album')\nORDER BY t1.`totalsnatched` DESC NULLS LAST \nRETURN t2.`tag` AS `tag` \nLIMIT 5",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the top 5 tags with the highest amount of downloads?",
    "evidence": "the highest amount of downloads refers to MAX(totalSnatched);",
    "idx": 973
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (like(t2.`tag`,'funk') AND t1.`releasetype` = 'single')\nORDER BY t1.`groupyear`  NULLS FIRST \nRETURN t1.`groupname` AS `groupname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the release title of the single under the \"funk\" tag that was released the oldest?",
    "evidence": "release title of single refers to groupName where releaseType = 'single'; the oldest means coming before all others in time and refers to MIN(groupYear);",
    "idx": 974
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t1.`releasetype` = 'album')\nORDER BY t1.`totalsnatched`  NULLS FIRST \nRETURN t2.`tag` AS `tag` \nLIMIT 5",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the tags of the top 5 least downloaded live albums?",
    "evidence": "least downloaded album refers to MIN(totalSnatched where releaseType = 'album');",
    "idx": 976
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t1.`releasetype` = 'single')\nORDER BY t1.`totalsnatched` DESC NULLS LAST \nRETURN t2.`tag` AS `tag`, t1.`artist` AS `artist` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the tag and the artist of the most downloaded single?",
    "evidence": "the most downloaded single refers to MAX(totalSnatched where releaseType = 'single');",
    "idx": 977
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "CALL {\nMATCH (torrents_sub0@`torrents`)\nWHERE torrents_sub0.`groupyear` >= 2010 AND torrents_sub0.`groupyear` <= 2015 AND like(torrents_sub0.`artist`,'50 cent') AND like(torrents_sub0.`releasetype`,'album')\nRETURN COUNT(torrents_sub0.`id`) AS `_col_0` \n}\nMATCH (torrents@`torrents`)\nWHERE torrents.`groupyear` >= 2010 AND torrents.`groupyear` <= 2015 AND like(torrents.`artist`,'50 cent') AND like(torrents.`releasetype`,'Single')\nRETURN COUNT(torrents.`id`) AS `_col_0`, _col_0 AS _col_1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many albums and Single-Tables were released by the artist named '50 cent' between 2010 and 2015?",
    "evidence": "albums refer to releaseType = 'album'; releaseType = 'single'; between 2010 and 2015 refers to groupYear between 2010 and 2015;",
    "idx": 990
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "CALL {\nMATCH (torrents_sub0@`torrents`)\nWHERE like(torrents_sub0.`artist`,'2Pac') AND like(torrents_sub0.`releasetype`,'album')\nORDER BY torrents_sub0.`groupyear`  NULLS FIRST \nRETURN torrents_sub0.`groupyear` AS `groupyear` \nSKIP 1\nLIMIT 1\n}\nMATCH (torrents@`torrents`)\nWHERE like(torrents.`artist`,'2Pac') AND like(torrents.`releasetype`,'album') AND torrents.`groupyear` = 1991\nRETURN groupyear - torrents.`groupyear` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "An American rapper '2Pac' released his first solo album in 1991, how many years have passed until his next album was released?",
    "evidence": "2Pac is an artist; album refers to releaseType; groupYear = 1991; SUBTRACT(groupYear = 1991, groupYear where releaseType = 'album' LIMIT 1 OFFSET 1);",
    "idx": 991
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t1.`releasetype` = 'live album')\nORDER BY t1.`totalsnatched` DESC NULLS LAST \nRETURN t1.`groupname` AS `groupname`, t1.`groupyear` AS `groupyear`, t2.`tag` AS `tag` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Provide the title, release year and the tag associated with the live album that has the highest number of downloads?",
    "evidence": "release year refers to groupYear; title of live album refers to groupName where releaseType = 'live album'; the highest number of downloads refers to MAX(totalSnatched);",
    "idx": 993
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (torrents@`torrents`)\nWHERE torrents.`groupyear` >= 1980 AND torrents.`groupyear` <= 1982 AND like(torrents.`releasetype`,'single')\nRETURN torrents.`artist` AS `artist`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which artist released singles between 1980 to 1982?",
    "evidence": "releaseType = 'single'; between 1980 to 1982 refers to groupYear between 1980 and 1982;",
    "idx": 994
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t1.`id` >= 10 AND t1.`id` <= 50 AND like(t2.`tag`,'new.york'))\nORDER BY t1.`totalsnatched` DESC NULLS LAST \nRETURN t1.`artist` AS `artist` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among id from 10 to 50. Which artist tagged as \"new.york\" has the most downloads?",
    "evidence": "Among id from 10 to 50 refers to id between 10 and 50; tag = 'new.york'; the most downloads refer to MAX(totalSnatched);",
    "idx": 1001
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (torrents@`torrents`)\nWHERE like(torrents.`releasetype`,'single') AND torrents.`groupyear` = 1979\nRETURN COUNT(torrents.`releasetype`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many singles were released in 1979?",
    "evidence": "releaseType = 'single'; groupYear = 1979;",
    "idx": 1004
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (torrents@`torrents`)\nWHERE like(torrents.`artist`,'sugar daddy') AND like(torrents.`releasetype`,'Single') AND torrents.`groupyear` = 1980\nRETURN COUNT(torrents.`releasetype`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In 1980, how many singles were released by sugar daddy?",
    "evidence": "sugar daddy is an artist; releaseType = 'single'; groupYear = 1980;",
    "idx": 1005
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t2.`tag` = 'christmas' AND t1.`groupyear` = 2004 AND like(t1.`releasetype`,'album'))\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many christmas albums were released in 2004?",
    "evidence": "album refers to releaseType; groupYear = 2004; tag = 'christmas';",
    "idx": 1006
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t1.`groupyear` = 1980 AND like(t1.`artist`,'millie jackson') AND like(t1.`releasetype`,'album'))\nRETURN t1.`groupname` AS `groupname`, t2.`tag` AS `tag`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which album title and tag that millie jackson released in 1980?",
    "evidence": "millie jackson is an artist; album title refers to groupName where releaseType = 'album'; groupYear = 1980;",
    "idx": 1008
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t1.`releasetype` = 'single' AND like(t2.`tag`,'1970s'))\nRETURN t1.`artist` AS `artist`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which artists have released singles with the tag 1970s?",
    "evidence": "releaseType = 'single';",
    "idx": 1010
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (t1@`torrents`)\nMATCH (t2@`tags`)\nWHERE t1.`id` = t2.`id`\nAND (t1.`groupyear` >= 1979 AND t1.`groupyear` <= 1982 AND like(t1.`releasetype`,'album'))\nRETURN cast (sum(CASE  WHEN like(t2.`tag`,'united.states') THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`releasetype`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From 1979 to 1982, what was the percentage of united.states albums out of total albums were released?",
    "evidence": "From 1979 to 1982 refers to groupYear between 1979 and 1982; United States refer to tag; albums refer to releaseType; DIVIDE(COUNT(releaseType = 'album' where tag = 'united.states' and groupYear between 1979 and 1982), COUNT(releaseType = 'album' where groupYear between 1979 and 1982)) as percentage;",
    "idx": 1011
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`users`)\nMATCH (t1@`u2base`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`rating` = '5' AND t2.`u_gender` = 'M')\nRETURN COUNT(t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the users who gave a rating of 5, how many of them are male?",
    "evidence": "Male users mean that u_gender = 'M'",
    "idx": 1013
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies`)\nMATCH (t1@`u2base`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`country` = 'USA' AND t1.`rating` < '3')\nRETURN COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies from the USA which user rating is less than 3?",
    "evidence": "",
    "idx": 1014
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`movies2directors`)\nMATCH (t2@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`country` = 'France' AND t1.`genre` = 'drama')\nRETURN COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the movies from France, how many of them are drama?",
    "evidence": "France a one country",
    "idx": 1015
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`users`)\nMATCH (t1@`u2base`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`rating` < '2')\nRETURN avg(cast (t2.`occupation` as float)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average occupation of users whose ratings are not more than 2 ?",
    "evidence": "",
    "idx": 1016
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`movies`)\nMATCH (t2@`movies2actors`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`country` = 'USA')\nRETURN avg(t2.`cast_num`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of casts of movies that are from the USA?",
    "evidence": "USA is a country",
    "idx": 1017
  }
]