[
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`departments_sub0`:`departments`)\nWHERE `departments_sub0`.`manager_id` >= 100 AND `departments_sub0`.`manager_id` <= 200\nRETURN `departments_sub0`.`department_id` AS `department_id_1`   } AS in_collect_0\nMATCH (`employees`:`employees`)\nWHERE NOT `employees`.`department_id` IN in_collect_0\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids for employees who do not work in departments with managers that have ids between 100 and 200?",
    "evidence": "",
    "idx": 4162
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Clara'\nRETURN `employees`.`department_id` AS `department_id`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`department_id` = `department_id`\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the employee name ( first name and last name ) and hire date for all employees in the same department as Clara.",
    "evidence": "",
    "idx": 4163
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Clara'\nRETURN `employees`.`department_id` AS `department_id`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`department_id` = `department_id`\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full names and hire dates for employees in the same department as someone with the first name Clara?",
    "evidence": "",
    "idx": 4164
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Clara'\nRETURN `employees`.`department_id` AS `department_id`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`department_id` = `department_id` AND `employees`.`first_name` <> 'Clara'\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the employee name ( first name and last name ) and hire date for all employees in the same department as Clara excluding Clara.",
    "evidence": "",
    "idx": 4165
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Clara'\nRETURN `employees`.`department_id` AS `department_id`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`department_id` = `department_id` AND `employees`.`first_name` <> 'Clara'\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full names and hire dates for employees in the same department as someone with the first name Clara, not including Clara?",
    "evidence": "",
    "idx": 4166
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`first_name` =~ '(?i)(?s).*T.*'\nRETURN `employees_sub0`.`department_id` AS `department_id`   } AS in_collect_0\nMATCH (`employees`:`employees`)\nWHERE `employees`.`department_id` IN in_collect_0\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the employee number and name( first name and last name ) for all employees who work in a department with any employee whose name contains a ’T’.",
    "evidence": "",
    "idx": 4167
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`first_name` =~ '(?i)(?s).*T.*'\nRETURN `employees_sub0`.`department_id` AS `department_id`   } AS in_collect_0\nMATCH (`employees`:`employees`)\nWHERE `employees`.`department_id` IN in_collect_0\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids and full names for employees who work in a department that has someone with a first name that contains the letter T?",
    "evidence": "",
    "idx": 4168
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`job_id` = 'MK_MAN'\nRETURN min(`employees_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` < `_col_0`\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`job_id` AS `job_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the employee number and job id for all employees whose salary is smaller than any salary of those employees whose job title is MK_MAN.",
    "evidence": "",
    "idx": 4169
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`job_id` = 'MK_MAN'\nRETURN min(`employees_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` < `_col_0`\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`job_id` AS `job_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the employee ids and job ids for employees who make less than the lowest earning employee with title MK_MAN?",
    "evidence": "",
    "idx": 4170
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`job_id` = 'PU_MAN'\nRETURN MAX(`employees_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` > `_col_0`\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`job_id` AS `job_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the employee number, name( first name and last name ) and job title for all employees whose salary is more than any salary of those employees whose job title is PU_MAN.",
    "evidence": "",
    "idx": 4171
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`job_id` = 'PU_MAN'\nRETURN MAX(`employees_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` > `_col_0`\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`job_id` AS `job_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the employee ids, full names, and job ids for employees who make more than the highest earning employee with title PU_MAN?",
    "evidence": "",
    "idx": 4172
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWITH `employees`.`department_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, sum(`employees`.`salary`) AS _groupby_col_2\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `department_id`, _groupby_col_2 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the department id and the total salary for those departments which contains at least two employees.",
    "evidence": "",
    "idx": 4173
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWITH `employees`.`department_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, sum(`employees`.`salary`) AS _groupby_col_2\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `department_id`, _groupby_col_2 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are total salaries and department id for each department that has more than 2 employees?",
    "evidence": "",
    "idx": 4174
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[job_history_sub0:has_job]->()\nRETURN `job_history_sub0`.`employee_id` AS `employee_id_1`   } AS in_collect_0\nMATCH (`employees`:`employees`)\nWHERE NOT `employees`.`employee_id` IN in_collect_0\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display all the information of those employees who did not have any job in the past.",
    "evidence": "",
    "idx": 4175
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[job_history_sub0:has_job]->()\nRETURN `job_history_sub0`.`employee_id` AS `employee_id_1`   } AS in_collect_0\nMATCH (`employees`:`employees`)\nWHERE NOT `employees`.`employee_id` IN in_collect_0\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information about employees who have never had a job in the past?",
    "evidence": "",
    "idx": 4176
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t3`:`locations`)\nMATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t2`.`department_name` AS `department_name`, `t3`.`city` AS `city`, `t3`.`state_province` AS `state_province`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the first and last name, department, city, and state province for each employee.",
    "evidence": "",
    "idx": 4177
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t3`:`locations`)\nMATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t2`.`department_name` AS `department_name`, `t3`.`city` AS `city`, `t3`.`state_province` AS `state_province`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full names, departments, cities, and state provinces for each employee?",
    "evidence": "",
    "idx": 4178
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t3`:`locations`)\nMATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nAND (`t1`.`first_name` =~ '(?i)(?s).*z.*')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t3`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display those employees who contain a letter z to their first name and also display their last name, city.",
    "evidence": "",
    "idx": 4179
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t3`:`locations`)\nMATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nAND (`t1`.`first_name` =~ '(?i)(?s).*z.*')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t3`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full names and cities of employees who have the letter Z in their first names?",
    "evidence": "",
    "idx": 4180
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t2`:`locations`)\nMATCH (`t1`:`departments`)\nWHERE `t2`.`location_id` = `t1`.`location_id`\nRETURN `t1`.`department_name` AS `department_name`, `t2`.`city` AS `city`, `t2`.`state_province` AS `state_province`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the department name, city, and state province for each department.",
    "evidence": "",
    "idx": 4181
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t2`:`locations`)\nMATCH (`t1`:`departments`)\nWHERE `t2`.`location_id` = `t1`.`location_id`\nRETURN `t1`.`department_name` AS `department_name`, `t2`.`city` AS `city`, `t2`.`state_province` AS `state_province`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the department names, cities, and state provinces for each department?",
    "evidence": "",
    "idx": 4182
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nMATCH (`t3`:`locations`)-[located_in_0:located_in]->(`t4`:`countries`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nAND `t3`.`country_id` = `t4`.`country_id`\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t1`.`employee_id` AS `employee_id`, `t4`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the full name (first and last name ) of employee with ID and name of the country presently where (s)he is working.",
    "evidence": "",
    "idx": 4183
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nMATCH (`t3`:`locations`)-[located_in_0:located_in]->(`t4`:`countries`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nAND `t3`.`country_id` = `t4`.`country_id`\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t1`.`employee_id` AS `employee_id`, `t4`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What the full names, ids of each employee and the name of the country they are in?",
    "evidence": "",
    "idx": 4184
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nWITH `t2`.`department_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `department_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the department names and how many employees work in each of them?",
    "evidence": "",
    "idx": 4186
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t3`:`locations`)\nMATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nAND (`t3`.`city` = 'London')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t1`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the full name (first and last name), and salary of those employees who working in any department located in London.",
    "evidence": "",
    "idx": 4187
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t3`:`locations`)\nMATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nAND (`t3`.`city` = 'London')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t1`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are full names and salaries of employees working in the city of London?",
    "evidence": "",
    "idx": 4188
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`files`:`files`)\nORDER BY `files`.`duration` IS NULL ASC, `files`.`duration` DESC \nRETURN `files`.`f_id` AS `f_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id of the song that lasts the longest.",
    "evidence": "",
    "idx": 4192
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`song`:`song`)\nWHERE `song`.`languages` = 'english'\nRETURN `song`.`song_name` AS `song_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all English songs.",
    "evidence": "",
    "idx": 4193
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`files`:`files`)\nWHERE `files`.`formats` = 'mp3'\nRETURN `files`.`f_id` AS `f_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the id of songs whose format is mp3.",
    "evidence": "",
    "idx": 4195
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[created_by_0:created_by]->(`t1`:`artist`)\nWHERE `t1`.`artist_name` = `t2`.`artist_name`\nAND (`t2`.`rating` > 9)\nRETURN DISTINCT `t1`.`artist_name` AS `artist_name`, `t1`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name and country of origin for all singers who have produced songs with rating above 9.",
    "evidence": "",
    "idx": 4197
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[has_file_0:has_file]->(`t1`:`files`)\nWHERE `t1`.`f_id` = `t2`.`f_id`\nAND (`t2`.`resolution` < 800)\nRETURN DISTINCT `t1`.`file_size` AS `file_size`, `t1`.`formats` AS `formats`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the file size and format for all songs that have resolution lower than 800.",
    "evidence": "",
    "idx": 4199
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[created_by_0:created_by]->(`t1`:`artist`)\nWHERE `t1`.`artist_name` = `t2`.`artist_name`\nORDER BY `t2`.`rating` IS NULL ASC, `t2`.`rating` DESC \nRETURN `t1`.`artist_name` AS `artist_name`, `t1`.`country` AS `country`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and countries of origin for the artists who produced the top three highly rated songs.",
    "evidence": "",
    "idx": 4203
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`files`:`files`)\nWHERE `files`.`duration` =~ '(?i)(?s)4:.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many songs have 4 minute duration?",
    "evidence": "",
    "idx": 4205
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`files`:`files`)\nWHERE `files`.`duration` =~ '(?i)(?s)4:.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the count of the songs that last approximately 4 minutes?",
    "evidence": "",
    "idx": 4206
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[created_by_0:created_by]->(`t1`:`artist`)\nWHERE `t1`.`artist_name` = `t2`.`artist_name`\nORDER BY `t2`.`resolution` IS NULL DESC, `t2`.`resolution`  \nRETURN `t1`.`gender` AS `gender`, `t1`.`artist_name` AS `artist_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the gender and name of artist who produced the song with the lowest resolution.",
    "evidence": "",
    "idx": 4217
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`files`:`files`)\nWITH `files`.`formats` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `formats`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each file format, return the number of artists who released songs in that format.",
    "evidence": "",
    "idx": 4219
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "CALL(*) {\nMATCH (`song`:`song`)\nWHERE `song`.`languages` = 'english'\nRETURN min(`song`.`resolution`) AS `_col_0`  \n}\nMATCH (`song`:`song`)\nWHERE `song`.`resolution` > `_col_0`\nRETURN DISTINCT `song`.`song_name` AS `song_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct names of all songs that have a higher resolution than some songs in English.",
    "evidence": "",
    "idx": 4221
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "CALL(*) {\nMATCH (`song`:`song`)\nWHERE `song`.`languages` = 'english'\nRETURN min(`song`.`resolution`) AS `_col_0`  \n}\nMATCH (`song`:`song`)\nWHERE `song`.`resolution` > `_col_0`\nRETURN DISTINCT `song`.`song_name` AS `song_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different names for all songs that have a higher resolution than English songs?",
    "evidence": "",
    "idx": 4222
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "CALL(*) {\nMATCH (`song`:`song`)\nWHERE `song`.`genre_is` = 'blues'\nRETURN MAX(`song`.`rating`) AS `_col_0`  \n}\nMATCH (`song`:`song`)\nWHERE `song`.`rating` < `_col_0`\nRETURN `song`.`song_name` AS `song_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all songs that have a lower rating than some song of blues genre?",
    "evidence": "",
    "idx": 4223
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "CALL(*) {\nMATCH (`song`:`song`)\nWHERE `song`.`genre_is` = 'blues'\nRETURN MAX(`song`.`rating`) AS `_col_0`  \n}\nMATCH (`song`:`song`)\nWHERE `song`.`rating` < `_col_0`\nRETURN `song`.`song_name` AS `song_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the songs that have a lower rating than at least one blues song?",
    "evidence": "",
    "idx": 4224
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[created_by_0:created_by]->(`t1`:`artist`)\nWHERE `t1`.`artist_name` = `t2`.`artist_name`\nAND (`t2`.`song_name` =~ '(?i)(?s).*love.*')\nRETURN `t1`.`artist_name` AS `artist_name`, `t1`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name and country of origin of the artist who released a song that has \"love\" in its title?",
    "evidence": "",
    "idx": 4225
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[created_by_0:created_by]->(`t1`:`artist`)\nWHERE `t1`.`artist_name` = `t2`.`artist_name`\nAND (`t2`.`song_name` =~ '(?i)(?s).*love.*')\nRETURN `t1`.`artist_name` AS `artist_name`, `t1`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the artists who released a song that has the word love in its title, and where are the artists from?",
    "evidence": "",
    "idx": 4226
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[created_by_0:created_by]->(`t1`:`artist`)\nWHERE `t1`.`artist_name` = `t2`.`artist_name`\nAND (`t2`.`releasedate` =~ '(?i)(?s).*Mar.*')\nRETURN `t1`.`artist_name` AS `artist_name`, `t1`.`gender` AS `gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name and gender for all artists who released songs in March.",
    "evidence": "",
    "idx": 4227
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[created_by_0:created_by]->(`t1`:`artist`)\nWHERE `t1`.`artist_name` = `t2`.`artist_name`\nAND (`t2`.`releasedate` =~ '(?i)(?s).*Mar.*')\nRETURN `t1`.`artist_name` AS `artist_name`, `t1`.`gender` AS `gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and genders of all artists who released songs in the month of March?",
    "evidence": "",
    "idx": 4228
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`genre`:`genre`)\nRETURN `genre`.`g_name` AS `g_name`, `genre`.`rating` AS `rating` ORDER BY `g_name` IS NULL DESC, `g_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all genres in alphabetical oder, together with its ratings.",
    "evidence": "",
    "idx": 4229
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`song`:`song`)\nORDER BY `song`.`resolution` IS NULL DESC, `song`.`resolution`  \nRETURN `song`.`song_name` AS `song_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me a list of the names of all songs ordered by their resolution.",
    "evidence": "",
    "idx": 4231
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`files`:`files`)\nWHERE `files`.`formats` = 'mp4'\nRETURN `files`.`f_id` AS `f_id`   \nUNION DISTINCT\nMATCH (`song`:`song`)\nWHERE `song`.`resolution` > 720\nRETURN `song`.`f_id` AS `f_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of songs that are available in either mp4 format or have resolution above 720?",
    "evidence": "",
    "idx": 4233
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`files`:`files`)\nWHERE `files`.`formats` = 'mp4'\nRETURN `files`.`f_id` AS `f_id`   \nUNION DISTINCT\nMATCH (`song`:`song`)\nWHERE `song`.`resolution` > 720\nRETURN `song`.`f_id` AS `f_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of all songs that are available on mp4 or have a higher resolution than 720?",
    "evidence": "",
    "idx": 4234
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[has_file_0:has_file]->(`t1`:`files`)\nWHERE `t1`.`f_id` = `t2`.`f_id`\nAND (`t1`.`duration` =~ '(?i)(?s)4:.*')\nRETURN `t2`.`song_name` AS `song_name`   \nUNION DISTINCT\nMATCH (`song`:`song`)\nWHERE `song`.`languages` = 'english'\nRETURN `song`.`song_name` AS `song_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all songs that have 4 minute duration or are in English.",
    "evidence": "",
    "idx": 4235
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[has_file_0:has_file]->(`t1`:`files`)\nWHERE `t1`.`f_id` = `t2`.`f_id`\nAND (`t1`.`duration` =~ '(?i)(?s)4:.*')\nRETURN `t2`.`song_name` AS `song_name`   \nUNION DISTINCT\nMATCH (`song`:`song`)\nWHERE `song`.`languages` = 'english'\nRETURN `song`.`song_name` AS `song_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all songs that are approximately 4 minutes long or are in English?",
    "evidence": "",
    "idx": 4236
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`song`:`song`)\nWHERE `song`.`genre_is` = 'modern' OR `song`.`languages` = 'english'\nRETURN `song`.`song_name` AS `song_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of songs whose genre is modern or language is English.",
    "evidence": "",
    "idx": 4239
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[has_file_0:has_file]->(`t1`:`files`)\nWHERE `t1`.`f_id` = `t2`.`f_id`\nAND (`t1`.`duration` =~ '(?i)(?s)3:.*')\nRETURN MAX(`t2`.`resolution`) AS `_col_0`, min(`t2`.`resolution`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum and minimum resolution of songs whose duration is 3 minutes?",
    "evidence": "",
    "idx": 4243
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[has_file_0:has_file]->(`t1`:`files`)\nWHERE `t1`.`f_id` = `t2`.`f_id`\nAND (`t1`.`duration` =~ '(?i)(?s)3:.*')\nRETURN MAX(`t2`.`resolution`) AS `_col_0`, min(`t2`.`resolution`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum and minimum resolution of all songs that are approximately 3 minutes long?",
    "evidence": "",
    "idx": 4244
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[has_file_0:has_file]->(`t1`:`files`)\nWHERE `t1`.`f_id` = `t2`.`f_id`\nWITH `t2`.`languages` AS _groupby_col_0, MAX(`t1`.`duration`) AS _groupby_col_1, MAX(`t2`.`resolution`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `languages` ORDER BY `languages` IS NULL DESC, `languages`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum duration and resolution of songs grouped and ordered by languages?",
    "evidence": "",
    "idx": 4245
  }
]