[
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Data source : Human Mortality Database by University of California, Berkeley, and Max Planck Institute for Demographic Research.' AND `t1`.`lendingcategory` <> '')\nRETURN DISTINCT `t1`.`wb2code` AS `wb2code`, `t1`.`lendingcategory` AS `lendingcategory`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the World Bank code of the countries whose country note has described \"Data source : Human Mortality Database by University of California, Berkeley, and Max Planck Institute for Demographic Research.\"? Please include their lending category.",
    "evidence": "World Bank code refers to Wb2code; Data source refers to Description",
    "idx": 1501
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`indicators`)\nMATCH (`t2`:`series`)\nWHERE `t1`.`indicatorname` = `t2`.`indicatorname`\nAND (`t1`.`year` = 1961 AND `t1`.`countryname` = 'Haiti' AND `t1`.`indicatorname` = 'Total reserves minus gold (current US$)' AND `t1`.`value` = 3000000)\nRETURN `t2`.`topic` AS `topic`, `t2`.`seriescode` AS `seriescode`, `t2`.`licensetype` AS `licensetype`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the topic of the series when the Total reserves minus gold (current US$) indicator of Haiti hit the value of 3,000,000 in 1961? Please include its series code and license type.",
    "evidence": "Total reserves minus gold (current US$) is the IndicatorName; Haiti is the CountryName; Year = 1961",
    "idx": 1502
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`indicatorname` = 'Adjusted net national income per capita (constant 2005 US$)' AND `t1`.`externaldebtreportingstatus` = 'Preliminary' AND `t2`.`value` > 1000)\nRETURN COUNT(`t1`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries have reached their Adjusted net national income per capita (constant 2005 US$) indicator value to more than 1,000 but have not finished their external debt reporting?",
    "evidence": "Adjusted net national income per capita (constant 2005 US$) is the IndicatorName; have not finished their external debt reporting means ExternalDebtReportingStatus = 'Preliminary'",
    "idx": 1503
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`year` = 1979 AND `indicators`.`indicatorname` = 'Fertility rate, total (births per woman)' AND `indicators`.`value` >= 4 AND `indicators`.`value` <= 5\nRETURN `indicators`.`countryname` AS `countryname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which countries have a fertility rate between 4 and 5 in 1979? List their names.",
    "evidence": "Year = 1979; fertility rate refers to IndicatorName = 'Fertility rate, total (births per woman)'; Value is between 4 and 5;",
    "idx": 1504
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`region` = 'South Asia' AND `country`.`incomegroup` = 'Low income'\nRETURN `country`.`tablename` AS `tablename`, `country`.`sourceofmostrecentincomeandexpendituredata` AS `sourceofmostrecentincomeandexpendituredata`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the countries in south Asia which are in the low-income group. What is the source of their recent income and expenditure data? List it alongside the table name of the countries.",
    "evidence": "South Asia is the name of the region; IncomeGroup = 'Low income';",
    "idx": 1505
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH ()-[t1:note]->(`t2`:`series`)\nMATCH ()-[t1:note]->(`t3`:`country`)\nWHERE `t1`.`seriescode` = `t2`.`seriescode`\nAND `t1`.`countrycode` = `t3`.`countrycode`\nAND (`t3`.`region` = 'Latin America & Caribbean' AND `t2`.`indicatorname` = 'Children out of school, primary')\nRETURN DISTINCT `t2`.`source` AS `source`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the sources for the data of children who finished primary school education in Latin America & Caribbean countries?",
    "evidence": "Latin America & Caribbean is the name of the region; children who finished primary school education refer to IndicatorName = 'Out-of-school children of primary school age, both sexes (number)'; sources refer to Description;",
    "idx": 1506
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nMATCH ()-[t3:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND `t2`.`countrycode` = `t3`.`countrycode`\nAND (`t1`.`region` = 'North America' AND `t2`.`indicatorname` = 'Out-of-school children of primary school age, both sexes (number)')\nRETURN DISTINCT `t3`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the sources for the data of children who finished primary school education in North American countries?",
    "evidence": "North American is the name of the region; sources refer to Description; children who finished primary school education refer to IndicatorName = 'Out-of-school children of primary school age, both sexes (number)';",
    "idx": 1508
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`latesttradedata` = 2013 AND `t2`.`indicatorname` =~ '(?i)(?s)GDP growth (annual .*)' AND `t2`.`year` = 2014 AND `t2`.`value` > 0)\nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`, `t2`.`value` AS `value` ORDER BY `t2`.`value` IS NULL DESC, `t2`.`value`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the countries for which the latest trade data are from 2013, what was the GDP growth in 2014? List them in the ascending order of GDP.",
    "evidence": "IndicatorName = 'GDP growth (annual %)'; Year = 2014;",
    "idx": 1509
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nMATCH (`t1`:`country`)-[t3:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND `t1`.`countrycode` = `t3`.`countrycode`\nAND (`t2`.`indicatorname` = 'Out-of-pocket health expenditure (% of private expenditure on health)' AND `t2`.`value` > 0 AND `t2`.`year` = 2005)\nORDER BY `t2`.`value` IS NULL ASC, `t2`.`value` DESC \nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`, `t3`.`description` AS `description`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which European countries had the highest private expenditure on health in 2005? List the top ten countries in descending order and find the source of the data.",
    "evidence": "Year = 2005; private expenditure on health refers to IndicatorName = 'Out-of-pocket health expenditure (% of private expenditure on health)'; the highest refers to MAX(Value); source refers to Description;",
    "idx": 1510
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`region` = 'South Asia' AND `country`.`incomegroup` = 'Low income'\nRETURN COUNT(`country`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many low income countries are there in South Asia?",
    "evidence": "South Asia is the name of the region; IncomeGroup = 'Low income';",
    "idx": 1511
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`latesttradedata` > 2010\nRETURN `country`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the short name of countries which have the latest trade data after 2010.",
    "evidence": "the latest trade data after 2010 implies LatestTradeData > 2010;",
    "idx": 1512
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`systemoftrade` = 'Special trade system'\nRETURN CASE WHEN COUNT(`country`.`countrycode`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `country`.`region` = 'Sub-Saharan Africa' THEN 1 ELSE 0 END)) * 100 / COUNT(`country`.`countrycode`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the percentage of Sub-Saharan African countries which are in the Special trade system.",
    "evidence": "Sub-Saharan African is the name of the region; SystemOfTrade = 'Special trade system'; countries refer to CountryCode; DIVIDE(COUNT (CountryCode where SystemOfTrade = 'Special trade system' and Region = 'Sub-Saharan Africa'), COUNT(CountryCode where Region = 'Sub-Saharan Africa')) as percentage;",
    "idx": 1513
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`region` = 'Europe & Central Asia' AND `t2`.`indicatorname` = 'Arms imports (SIPRI trend indicator values)')\nRETURN CASE WHEN COUNT(`t1`.`countrycode`)=0 THEN NULL ELSE toFloat(sum(`t2`.`value`)) / COUNT(`t1`.`countrycode`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the average of Arms imports (SIPRI trend indicator values) of the European & Central Asian countries.",
    "evidence": "European & Central Asian is the name of the region; IndicatorName = 'Arms imports (SIPRI trend indicator values)'; countries refer to CountryCode; DIVIDE(Sum(Value), Count(CountryCode));",
    "idx": 1514
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`incomegroup` = 'Upper middle income' AND `t2`.`indicatorname` = 'CO2 emissions (kt)')\nORDER BY `t2`.`value` IS NULL DESC, `t2`.`value`  \nRETURN `t1`.`countrycode` AS `countrycode`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which upper middle income country has the lowest value of CO2 emissions (kt)?",
    "evidence": "IncomeGroup = 'Upper middle income'; IndicatorName = 'CO2 emissions (kt); the lowest value refers to MIN(Value);",
    "idx": 1515
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`othergroups` = 'HIPC' AND `t2`.`indicatorname` = 'International migrant stock, total')\nRETURN min(`t2`.`value`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the minimum of International migrant stock, total of heavily indebted poor countries?",
    "evidence": "IndicatorName = 'International migrant stock, total'; heavily indebted poor countries referred to by its abbreviated 'HIPC' = OtherGroups; MIN(Value);",
    "idx": 1516
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH ()-[t1:note]->(`t2`:`series`)\nWHERE `t1`.`seriescode` = `t2`.`seriescode`\nAND (`t1`.`year` IN ['YR2001', 'YR2002', 'YR2003'] AND `t2`.`periodicity` = 'Annual' AND `t2`.`aggregationmethod` = 'Sum')\nRETURN COUNT(DISTINCT `t2`.`seriescode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many annual indicators use the Sum aggregation method from 2001 to 2003?",
    "evidence": "Annual refers to Periodicity; from 2001 to 2003 implies Year = 'YR2001', Year = 'YR2002' , Year = 'YR2003';",
    "idx": 1518
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH ()-[t1:note]->(`t2`:`series`)\nWHERE `t1`.`seriescode` = `t2`.`seriescode`\nAND (`t1`.`year` =~ '(?i)(?s).*2005.*' AND `t2`.`source` =~ '(?i)(?s)International Monetary Fund.*')\nRETURN `t1`.`seriescode` AS `seriescode`, `t2`.`source` AS `source`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2005, which series codes use the International Monetary Fund, Balance of Payments Statistics Yearbook and data files source?",
    "evidence": "Year contains '2005'; series codes contain 'International Monetary Fund'",
    "idx": 1519
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`region` = 'South Asia' AND `t2`.`indicatorname` = 'Life expectancy at birth, female (years)')\nRETURN CASE WHEN COUNT(`t1`.`countrycode`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`value` > 50 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`countrycode`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of countries in South Asia have the Life expectancy at birth, female (years) greater than 50?",
    "evidence": "South Asia is the name of the region; IndicatorName = 'Life expectancy at birth, female (years)'; greater than 50 refers to Value>50; DIVIDE(COUNT(CountryCode where IndicatorName = 'Life expectancy at birth, female (years)'; Value>50; Region = 'South Asia'), COUNT(CountryCode where Region = 'South Asia')) as percentage;",
    "idx": 1520
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`year` >= 1960 AND `indicators`.`year` <= 1965 AND `indicators`.`indicatorname` = 'Death rate, crude (per 1,000 people)'\nORDER BY `indicators`.`value` IS NULL ASC, `indicators`.`value` DESC \nRETURN `indicators`.`countryname` AS `countryname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 1960 to 1965, which country had the highest Death rate, crude (per 1,000 people)?",
    "evidence": "IndicatorName = 'Death rate, crude (per 1,000 people)'; the highest refers to MAX(Value); from 1960 to 1965 refers to Year between '1960' and '1965'; country refers to CountryName;",
    "idx": 1521
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`countryname` = 'Arab World' AND `indicators`.`year` = 1960 AND `indicators`.`value` > 50\nRETURN `indicators`.`indicatorname` AS `indicatorname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the indicator names of Arab World whose values are higher than 50 in 1960.",
    "evidence": "Arab World refers to CountryName; Year = '1960'; values are higher than 50 refers to Value>50;",
    "idx": 1522
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`indicatorname` = 'Merchandise imports by the reporting economy (current US$)'\nORDER BY `indicators`.`value` IS NULL ASC, `indicators`.`value` DESC \nRETURN `indicators`.`countryname` AS `countryname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country has the highest value of Merchandise imports by the reporting economy (current US$)?",
    "evidence": "country refers to CountryName; the highest value implies MAX(Value); IndicatorName = 'Merchandise imports by the reporting economy (current US$)';",
    "idx": 1523
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`indicators`)\nMATCH (`t2`:`series`)\nWHERE `t1`.`indicatorname` = `t2`.`indicatorname`\nAND (`t1`.`year` = 1965 AND `t1`.`value` > 100 AND `t2`.`periodicity` = 'Annual')\nRETURN DISTINCT `t2`.`indicatorname` AS `indicatorname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list annual indicator names which have values of more than 100 in 1965.",
    "evidence": "Annual refers to Periodicity; values of more than 100 implies Value>100; Year = '1965';",
    "idx": 1524
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`indicators`)\nMATCH (`t2`:`series`)\nWHERE `t1`.`indicatorname` = `t2`.`indicatorname`\nAND (`t1`.`year` >= 1968 AND `t1`.`year` < 1971 AND `t2`.`licensetype` = 'Open' AND `t1`.`value` < 100)\nRETURN DISTINCT `t1`.`indicatorname` AS `indicatorname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 1968 to 1970, what are indicator names whose license type is open and values are less than 100?",
    "evidence": "From 1968 to 1970 refers to Year between '1968' and '1970'; values are less than 100 imply Value<100;",
    "idx": 1525
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`indicators`)\nMATCH (`t2`:`series`)\nWHERE `t1`.`indicatorname` = `t2`.`indicatorname`\nAND (`t2`.`topic` = 'Private Sector & Trade: Exports')\nORDER BY `t1`.`value` IS NULL ASC, `t1`.`value` DESC \nRETURN `t1`.`countryname` AS `countryname`, `t1`.`indicatorname` AS `indicatorname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country had the highest value of indicator belongs to Private Sector & Trade: Exports topic? Please list the country name and indicator name.",
    "evidence": "country refers to CountryName;",
    "idx": 1526
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`indicators`)\nMATCH (`t2`:`series`)\nWHERE `t1`.`indicatorname` = `t2`.`indicatorname`\nAND (`t2`.`aggregationmethod` = 'Weighted average')\nRETURN `t1`.`indicatorname` AS `indicatorname`, min(`t1`.`value`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which indicator name uses the Weighted average method and has the lowest value?",
    "evidence": "AggregationMethod = 'Weighted average'; the lowest value implies MIN(Value);",
    "idx": 1527
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`indicators`)\nMATCH (`t2`:`series`)\nWHERE `t1`.`indicatorname` = `t2`.`indicatorname`\nAND (`t1`.`countryname` = 'Sudan' AND `t1`.`year` = 1961 AND `t2`.`periodicity` = 'Annual')\nRETURN `t1`.`indicatorname` AS `indicatorname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list out all annual indicator names of Sudan in 1961?",
    "evidence": "Sudan is the name of the country; Periodicity = 'Annual'; Year = '1961'",
    "idx": 1528
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`incomegroup` = 'Upper middle income')\nRETURN CASE WHEN COUNT(`t1`.`countrycode`)=0 THEN NULL ELSE sum(CASE  WHEN `t2`.`indicatorname` = 'CO2 emissions FROM liquid fuel consumption (% of total)' AND `t2`.`value` < 80 THEN 1 ELSE 0 END) * 1.0 / COUNT(`t1`.`countrycode`) END AS `persent`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of upper middle income countries which have the CO2 emissions from liquid fuel consumption (% of total)\n\nless than 80%?",
    "evidence": "IndicatorName = 'CO2 emissions from liquid fuel consumption (% of total)'; less than 80% implies Value<80%; IncomeGroup = 'Upper middle income'; DIVIDE(COUNT(CountryCode where IndicatorName = 'CO2 emissions from liquid fuel consumption (% of total)'; Value<80%; IncomeGroup = 'Upper middle income'), COUNT(CountryCode where IncomeGroup = 'Upper middle income'));",
    "idx": 1529
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`indicatorname` = 'Rural population'\nRETURN DISTINCT `indicators`.`indicatorcode` AS `indicatorcode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is indicator code of Rural population?",
    "evidence": "IndicatorName = 'Rural population';",
    "idx": 1530
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`systemofnationalaccounts` = 'Country uses the 2008 System of National Accounts methodology.'\nRETURN `country`.`tablename` AS `tablename`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many country uses the 2008 System of National Accounts methodology? List our their table name.",
    "evidence": "",
    "idx": 1531
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`currencyunit` = 'Euro')\nRETURN DISTINCT `t2`.`seriescode` AS `seriescode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the series code of countries using Euro as their currency unit.",
    "evidence": "",
    "idx": 1532
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`seriescode` = 'DT.DOD.DSTC.CD')\nRETURN `t1`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the long name of countries using series code as DT.DOD.DSTC.CD",
    "evidence": "",
    "idx": 1533
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`currencyunit` = 'Hong Kong dollar')\nRETURN `t2`.`seriescode` AS `seriescode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the series code of countries using Hong Kong dollar as their currency unit.",
    "evidence": "",
    "idx": 1534
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`seriescode` = 'SP.DYN.TO65.MA.ZS')\nRETURN `t1`.`tablename` AS `tablename`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the table name of countries using series code as SP.DYN.TO65.MA.ZS",
    "evidence": "",
    "idx": 1535
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`incomegroup` = 'Low income')\nRETURN DISTINCT `t2`.`countryname` AS `countryname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the country name of lower earning countries",
    "evidence": "lower earning countries refer to IncomeGroup = 'Low income';",
    "idx": 1536
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`region` = 'Latin America & Caribbean' AND `t1`.`incomegroup` = 'Low income')\nRETURN `t2`.`seriescode` AS `seriescode`, `t2`.`countrycode` AS `countrycode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the series code and country code of the poor countries that located in Latin American & Carribbean.",
    "evidence": "Latin American & Carribbean is the name of the region; poor countries refers to IncomeGroup = 'Low income';",
    "idx": 1537
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`currencyunit` = 'Australian dollar' AND `t1`.`incomegroup` = 'Lower middle income')\nRETURN `t1`.`countrycode` AS `countrycode`, `t2`.`seriescode` AS `seriescode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the series code of countries using Australian dollar as their currency unit. Which country belongs to middle income group among them.",
    "evidence": "middle income group refers to IncomeGroup = 'Low middle income';",
    "idx": 1538
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`incomegroup` = 'Upper middle income')\nRETURN DISTINCT `t1`.`countryname` AS `countryname`   \nUNION DISTINCT\nCALL (*) {\nMATCH (`country_sub0`:`country`)\nWHERE `country_sub0`.`nationalaccountsbaseyear` <> ''\nORDER BY `country_sub0`.`nationalaccountsbaseyear` IS NULL DESC, `country_sub0`.`nationalaccountsbaseyear`  \nRETURN `country_sub0`.`longname` AS `longname`  LIMIT 1\n}\nWITH *\nRETURN `longname` AS `countryname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the country name of upper middle income group. Which country has the earliest national account base year? List out the region where this country locates.",
    "evidence": "IncomeGroup = 'Upper middle income'; the earliest national account base year refers to MIN(NationalAccountsBaseYear); \n",
    "idx": 1539
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`currencyunit` = 'Euro' AND (`t1`.`incomegroup` = 'High income: OECD' OR `t1`.`incomegroup` = 'High income: nonOECD'))\nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`, `t2`.`countryname` AS `countryname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the country code and country name of the rich countries using Euro as their currency unit",
    "evidence": "Non-OECD and OECD countries can be regarded as rich countries for those that are part of the High Income Group;",
    "idx": 1540
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`seriescode` = 'FP.CPI.TOTL')\nRETURN `t1`.`tablename` AS `tablename`, `t1`.`currencyunit` AS `currencyunit`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the table name and currency unit of countries using series code as FP.CPI.TOTL",
    "evidence": "",
    "idx": 1541
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`incomegroup` = 'High income: nonOECD')\nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`, `t2`.`countryname` AS `countryname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the name and indicator code of high income: nonOECD countries",
    "evidence": "high income: non-OECD' refer to IncomeGroup;",
    "idx": 1542
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`currencyunit` = 'Pound sterling' AND `t1`.`incomegroup` =~ '(?i)(?s).*high income.*')\nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`, `t1`.`currencyunit` AS `currencyunit`, `t1`.`incomegroup` AS `incomegroup`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the series code of countries using pound sterling as their currency unit. Which country belongs to high income group among them.",
    "evidence": "",
    "idx": 1543
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nRETURN `country`.`countrycode` AS `countrycode`, `country`.`shortname` AS `shortname`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down 10 country codes and it's short names.",
    "evidence": "",
    "idx": 1544
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`shortname` =~ '(?i)(?s)A.*'\nRETURN COUNT(`country`.`shortname`) AS `_col_0`   \nUNION DISTINCT\nMATCH (`country`:`country`)\nWHERE `country`.`shortname` =~ '(?i)(?s)A.*'\nRETURN `country`.`alpha2code` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the countries name start with alphabet A? List down the Alpha2Code of them.",
    "evidence": "countries name starts with alphabet A refers to shortname like 'A%';",
    "idx": 1545
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`currencyunit` = 'Euro'\nRETURN `country`.`tablename` AS `tablename`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which countries use Euro as their currency? List down the table name.",
    "evidence": "CurrencyUnit = 'Euro';",
    "idx": 1546
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`specialnotes` = ''\nRETURN COUNT(`country`.`longname`) AS `_col_0`   \nUNION DISTINCT\nMATCH (`country`:`country`)\nWHERE `country`.`specialnotes` = ''\nRETURN `country`.`longname` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the countries do not have special notes? List the long name.",
    "evidence": "do not have special notes implies SpecialNotes are NULL;",
    "idx": 1547
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE (`country`.`incomegroup` = 'High income: OECD' OR `country`.`incomegroup` = 'High income: nonOECD') AND `country`.`region` =~ '(?i)(?s).*Asia.*'\nRETURN `country`.`countrycode` AS `countrycode`, `country`.`region` AS `region`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which high income group countries are from Asia?",
    "evidence": "Asia is the name of the region;",
    "idx": 1548
  }
]