[
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t2`.`homepage` = 'http://www.irma-international.org/')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the paper that were under the conference homepage URL \"http://www.irma-international.org/\".",
    "evidence": "paper refers to Paper.Title; http://www.irma-international.org/ is the HomePage",
    "idx": 2786
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t2`.`fullname` = 'Information and Knowledge Engineering' AND `t1`.`year` >= 2002 AND `t1`.`year` <= 2010)\nRETURN CASE WHEN COUNT(DISTINCT `t1`.`year`)=0 THEN NULL ELSE toFloat(COUNT(`t1`.`id`)) / COUNT(DISTINCT `t1`.`year`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total average number of papers published from 2002 to 2010 under the conference \"Information and Knowledge Engineering\".",
    "evidence": "average number of papers refers to DIVIDE(count(id), 9); published from 2002 to 2010 refers to Year BETWEEN 2002 AND 2010; 'Information and Knowledge Engineering' is the FullName of conference;",
    "idx": 2787
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`year` > 1990 AND `t1`.`year` < 2001)\nRETURN sum(CASE  WHEN `t2`.`fullname` = 'Informatik & Schule' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t2`.`fullname` = 'International Conference on Supercomputing' THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From year 1991 to 2000, calculate the difference betweeen the total number of papers published under the conference \"International Conference on Supercomputing \" and \"Informatik & Schule\"?",
    "evidence": "From year 1991 to 2000 refers to Year BETWEEN 1991 AND 2000; papers refers to Paper.Id; 'International Conference on Supercomputing' AND 'Informatik & Schule' are the FullName of conference; calculate the difference between the total number of papers of these two conferences refers to SUBTRACT(SUM(Paper.Id where FullName = 'International Conference on Supercomputing'), SUM(Paper.Id where FullName = 'Informatik & Schule'))",
    "idx": 2788
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`journal`:`journal`)\nWHERE `journal`.`fullname` = 'Software - Concepts and Tools / Structured Programming'\nRETURN `journal`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the short name for \"Software - Concepts and Tools / Structured Programming\"?",
    "evidence": "'Software - Concepts and Tools / Structured Programming' is the FullName;",
    "idx": 2789
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t2`.`title` = 'Education, democracy and growth')\nRETURN `t1`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which journal was the paper \"Education, democracy and growth\" published on? Give the full name of the journal.",
    "evidence": "'Education, democracy and growth' is the title of a paper",
    "idx": 2790
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`fullname` = 'IEEE Transactions on Nuclear Science' AND `t2`.`year` = 1999)\nRETURN COUNT(`t2`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of papers that were published on \"IEEE Transactions on Nuclear Science\" in 1999.",
    "evidence": "'IEEE Transactions on Nuclear Science' is the FullName of journal; 1999 refers to Year = '1999'; papers refers to Paper.Id",
    "idx": 2791
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`fullname` = 'IEEE Transactions on Pattern Analysis and Machine Intelligence' AND `t2`.`year` = 2011 AND `t2`.`title` <> '')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the name of the paper that was published on \"IEEE Transactions on Pattern Analysis and Machine Intelligence\" in 2011?",
    "evidence": "'IEEE Transactions on Pattern Analysis and Machine Intelligence' is the FullName of journal; 2011 refers to Year = '2011'; name of the paper refers to Title of paper",
    "idx": 2792
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`fullname` = 'Modeling Identification and Control' AND `t2`.`year` = 1994)\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the keywords for the paper which was published on \"Modeling Identification and Control\" in 1994?",
    "evidence": "'Modeling Identification and Control' is the FullName of the journal; 1994 refers to Year = '1994'; if the year is \"0\", it means this paper is preprint, or not published",
    "idx": 2793
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`title` = 'Skew-Circulant Preconditioners for Systems of LMF-Based ODE Codes')\nRETURN `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "At which conference was the paper \"Skew-Circulant Preconditioners for Systems of LMF-Based ODE Codes\" presented?",
    "evidence": "'Skew-Circulant Preconditioners for Systems of LMF-Based ODE Codes' is the Title of the paper; conference refers to Conference.FullName",
    "idx": 2795
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t2`.`fullname` = 'International Symposium on Software Testing and Analysis')\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of papers that were presented at \"International Symposium on Software Testing and Analysis\" conference.",
    "evidence": "'International Symposium on Software Testing and Analysis' is the FullName of the conference; papers refers to Paper.Id",
    "idx": 2796
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`title` = 'Increasing the Concurrency in Estelle')\nRETURN DISTINCT `t2`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Gives the home page of the conference where the paper \"Increasing the Concurrency in Estelle\" is presented.",
    "evidence": "'Increasing the Concurrency in Estelle' is the Title of the paper; home page of the conference refers to HomePage;",
    "idx": 2797
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`title` = 'An Improved Active Suspension Model for Attitude Control of Electric Vehicles')\nRETURN COUNT(`t2`.`authorid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many authors finished the paper \"An Improved Active Suspension Model for Attitude Control of Electric Vehicles\" together?",
    "evidence": "authors refers to AuthorId; 'An Improved Active Suspension Model for Attitude Control of Electric Vehicles' is the Title of a paper; A paper can have more than one author. Co-authorship can be derived from (paper ID, author ID) pair.",
    "idx": 2798
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t2`.`shortname` = 'ECSQARU' AND `t1`.`year` = '2003')\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many papers were presented at 'ECSQARU' in 2003?",
    "evidence": "Papers refers to Paper.Id; ECSQARU is the ShortName of the conference; 2003 refers to Year = '2003'",
    "idx": 2799
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t2`.`fullname` = 'International Radar Symposium' AND `t1`.`year` = 2012)\nRETURN `t1`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the keywords of the paper that was presented at \"International Radar Symposium\" in 2012.",
    "evidence": "'International Radar Symposium' is the FullName of the conference; 2012 refers to Year = '2012'",
    "idx": 2800
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t1`.`title` = 'A Case of Unilateral Ashy Dermatosis')\nRETURN `t2`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the short name for the journal that published the paper \"A Case of Unilateral Ashy Dermatosis\"?",
    "evidence": "A Case of Unilateral Ashy Dermatosis refer to Title",
    "idx": 2811
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`title` = 'Determination of Planetary Meteorology FROM Aerobot Flight Sensors')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who are the authors of the paper \"Determination of Planetary Meteorology from Aerobot Flight Sensors\"?",
    "evidence": "'Determination of Planetary Meteorology from Aerobot Flight Sensors' refer to title of the paper",
    "idx": 2813
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t1`.`year` >= 1960 AND `t1`.`year` <= 1970)\nRETURN `t1`.`title` AS `title`, `t1`.`journalid` AS `journalid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the titles and their publishing journals from the 60's.",
    "evidence": "from the 60’s refer to Year 1960 BETWEEN 1970\n\n",
    "idx": 2814
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`year` = 2008)\nRETURN DISTINCT `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of the conferences where a paper was published in 2008.",
    "evidence": "Published in 2008 refer to Year = 2008\n\n",
    "idx": 2816
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nRETURN CASE WHEN COUNT(`t1`.`id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`keyword` = 'cancer' THEN 1 ELSE 0 END)) / COUNT(`t1`.`id`) END AS `_col_0`, `t2`.`name` AS `name`, `t2`.`affiliation` AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the proportion of the papers that have the keyword \"cancer\"? Please provide a list of authors and their affiliations.",
    "evidence": "Proportion refer to DIVIDE(COUNT(Keyword = ’cancer’), COUNT(PaperID))",
    "idx": 2817
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`paper`:`paper`)\nRETURN sum(CASE  WHEN `paper`.`year` = 2005 THEN 1 ELSE 0 END) AS `_col_0`, sum(CASE  WHEN `paper`.`year` = 2005 THEN 1 ELSE 0 END) - sum(CASE  WHEN `paper`.`year` = 2004 THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many papers were published in 2005. Calculate the difference between the number of paper published in 2005 and the number of paper published in the previous year.",
    "evidence": "published in 2005 refer to Year = 2005; Difference refer to SUBTRACT(SUM(Year = 2005). SUM(Year = 2004))",
    "idx": 2821
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`fullname` = 'Ibm Journal of Research and Development')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the title of papers published in the Ibm Journal of Research and Development.",
    "evidence": "Ibm Journal of Research and Development refer to FullName\n\n'Ibm Journal of Research and Development' is the full name of paper",
    "idx": 2822
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`title` = 'A context-based navigation paradigm for accessing Web data')\nRETURN `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where was the 'A context-based navigation paradigm for accessing Web data' paper published? State the name of the conference.",
    "evidence": "A context-based navigation paradigm for accessing Web data' is the title of paper; name of conference refer to FullName\n",
    "idx": 2825
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`year` >= 1990 AND `t1`.`year` <= 2000)\nRETURN CASE WHEN COUNT(DISTINCT `t1`.`title`)=0 THEN NULL ELSE toFloat(COUNT(DISTINCT `t2`.`authorid`)) / COUNT(DISTINCT `t1`.`title`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average of authors for each paper from the year of 1990 to 2000.",
    "evidence": "Average refer to DIVIDE(COUNT(AuthorID where Year = 1990 BETWEEN 2000), COUNT(Title where Year = 1990 BETWEEN 2000))",
    "idx": 2827
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t1`.`title` = 'Area Effects in Cepaea')\nRETURN `t1`.`year` AS `year`, `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the year and a full name of the journal in which the publication named 'Area Effects in Cepaea' was published.",
    "evidence": "'Area Effects in Cepaea' is the title of paper",
    "idx": 2828
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`author`:`author`)\nWHERE `author`.`affiliation` = 'ABB Electrical Machines'\nRETURN `author`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of the author who is affiliated with the organization named 'ABB Electrical Machines'.",
    "evidence": "'ABB Electrical Machines' is an affiliation",
    "idx": 2830
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`fullname` = 'Academic Medicine' AND `t2`.`year` >= 2005 AND `t2`.`year` <= 2010)\nRETURN COUNT(`t2`.`journalid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of publications published in the journal named 'Academic Medicine' between 2005 and 2010.",
    "evidence": "'Academic Medicine' is the FullName of journal; between 2005 and 2010 refer to Year 2005 BETWEEN 2010",
    "idx": 2831
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`fullname` = 'Information Sciences')\nRETURN CASE WHEN COUNT(DISTINCT `t2`.`year`)=0 THEN NULL ELSE toFloat(COUNT(`t2`.`journalid`)) / COUNT(DISTINCT `t2`.`year`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the average number of papers that are published in the journal named 'Information Sciences' annually.",
    "evidence": "'Information Sciences' is the FullName of journal; average = DIVIDE(COUNT(JournalId = 48), COUNT(Years))",
    "idx": 2834
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`author`:`author`)\nWHERE `author`.`affiliation` = 'Arizona State University'\nRETURN COUNT(`author`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the number of authors affiliated with the organization named 'Arizona State University'.",
    "evidence": "'Arizona State University' is an affiliation",
    "idx": 2837
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t2`.`name` = 'Joe Lograsso')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the titile of paper writen by Joe Lograsso.",
    "evidence": "'Joe Lograsso' is name of paper author",
    "idx": 2839
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t2`.`name` = 'Barrasa')\nRETURN `t1`.`year` AS `year`, `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the year and title of papers written by Barrasa.",
    "evidence": "'Barassa' is name of paper author",
    "idx": 2841
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`author`)-[t2:authored]->(`t3`:`paper`)\nWHERE `t1`.`id` = `t2`.`authorid`\nAND `t2`.`paperid` = `t3`.`id`\nAND (`t2`.`paperid` = 5)\nRETURN `t1`.`name` AS `name`, `t3`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the name of author for paper id 5 and state the keyword of this page.",
    "evidence": "",
    "idx": 2843
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[presented_at_0:presented_at]->(`t1`:`conference`)\nWHERE `t1`.`id` = `t2`.`conferenceid`\nAND (`t2`.`title` = '2004 YD5')\nRETURN `t1`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the conference in which the paper \"2004 YD5\" was published?",
    "evidence": "'2004 YD5' is the title of paper",
    "idx": 2844
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[aggregated_from_institutions_0:aggregated_from_institutions]->(`t1`:`institution_details`)\nWHERE `t1`.`state` = `t2`.`state`\nAND (`t2`.`year` = 2011 AND `t2`.`grad_cohort` = '209')\nRETURN `t1`.`chronname` AS `chronname`, `t1`.`site` AS `site`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name and website of the institutes from the state with 209 graduate cohort in 2011.",
    "evidence": "name of the institutes refers to chronname; website refers to site; graduate cohort refers to grad_cohort; in 2011 refers to year = '2011';",
    "idx": 2845
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[aggregated_from_institutions_0:aggregated_from_institutions]->(`t1`:`institution_details`)\nWHERE `t1`.`state` = `t2`.`state`\nAND (`t2`.`year` >= 2011 AND `t2`.`year` <= 2013 AND `t1`.`chronname` = 'Gateway Community College' AND `t2`.`gender` = 'F')\nRETURN COUNT(`t2`.`grad_cohort`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the number of female graduates between 2011 to 2013 from the state where 'Gateway Community College' is located?",
    "evidence": "female refers to gender = 'F'; graduates refers to grad_cohort; between 2011 to 2013 refers to year BETWEEN 2011 AND 2013; Gateway Community College refers to chronname = 'Gateway Community College';",
    "idx": 2846
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[aggregated_from_institutions_0:aggregated_from_institutions]->(`t1`:`institution_details`)\nWHERE `t1`.`state` = `t2`.`state`\nAND (`t2`.`year` = 2012 AND `t2`.`gender` = 'M')\nORDER BY `t1`.`aid_value` IS NULL ASC, `t1`.`aid_value` DESC \nRETURN COUNT(`t2`.`grad_cohort`) AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total male graduates in 2012 in the state whereby the institute with the highest average amount of student aid going to undergraduate recipients is located?",
    "evidence": "male refers to gender = 'M'; graduates refers to grad_cohort; in 2012 refers to year = 2012; highest average amount of student aid going to undergraduate recipients refers to MAX(aid_value);",
    "idx": 2847
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[aggregated_from_institutions_0:aggregated_from_institutions]->(`t1`:`institution_details`)\nWHERE `t1`.`state` = `t2`.`state`\nAND (`t2`.`year` = 2013 AND `t1`.`control` = 'Public')\nORDER BY `t2`.`grad_cohort` IS NULL DESC, `t2`.`grad_cohort`  \nRETURN `t1`.`chronname` AS `chronname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the public institutes from the state with the least number of graduate cohort in 2013.",
    "evidence": "public refers to control = 'Public'; institutes refers to chronname; least number of graduate cohort refers to MIN(grad_cohort); in 2013 refers to year = 2013;",
    "idx": 2848
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t1`.`unitid` = `t2`.`unitid`\nAND (`t2`.`year` = 2013 AND `t2`.`gender` = 'B' AND `t2`.`race` = 'X' AND `t2`.`grad_cohort` < '200')\nRETURN `t1`.`chronname` AS `chronname`, `t2`.`grad_cohort` AS `grad_cohort`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the institute name with less than 200 graduate cohort of all races and genders in 2013. Also, please state the total number of full-time equivalent undergraduates for the institute.",
    "evidence": "institute name refers to chronname; less than 200 graduate cohort refers to grad_cohort < 200; all races refers to race = 'X'; all genders refers to gender = 'B'; in 2013 refers to year = 2013; total number of full-time equivalent undergraduates refers to fte_value;",
    "idx": 2849
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t1`.`unitid` = `t2`.`unitid`\nAND (`t2`.`year` = 2013 AND `t2`.`gender` = 'F' AND `t2`.`race` = 'X' AND `t1`.`chronname` = 'Oakwood University')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the number of female graduate for all students cohort from Oakwood University in 2013?",
    "evidence": "female refers to gender = 'F'; graduates refers to grad_cohort; Oakwood University refers to chronname = 'Oakwood University'; in 2013 refers to year = 2013; all sutdents refer to rae = 'X';",
    "idx": 2850
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t1`.`unitid` = `t2`.`unitid`\nAND (`t2`.`gender` = 'F' AND `t2`.`race` = 'A' AND `t1`.`chronname` = 'University of Alaska at Anchorage' AND `t2`.`cohort` = '4y other')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2012, how many Asian female graduates were seeking another type of degree or certificate at the 4-year institution at University of Alaska at Anchorage?",
    "evidence": "In 2012 refers to year = 2012; Asian refers to race = 'A'; female refers to gender = 'F'; graduates refers to grad_cohort; seeking another type of degree or certificate at a 4-year institution refers to cohort = '4y other'; University of Alaska at Anchorage refers to chronname = 'University of Alaska at Anchorage';",
    "idx": 2851
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`institution_details`:`institution_details`)\nWHERE `institution_details`.`chronname` IN ['Amridge University', 'Auburn University']\nORDER BY `institution_details`.`grad_100_value` IS NULL DESC, `institution_details`.`grad_100_value`  \nRETURN `institution_details`.`chronname` AS `chronname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From which institute is harder to graduate for a bachelor, Amridge University or Auburn University?",
    "evidence": "institute refers to chronname; harder to graduate for a bachelor refers to MIN(grad_100_value); Amridge University refers to chronname = 'Amridge University'; Auburn University refers to chronname = 'Auburn University';",
    "idx": 2852
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`institution_details`:`institution_details`)\nWHERE `institution_details`.`control` = 'Private not-for-profit'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many institutes are private and not-for profit?",
    "evidence": "private and not for profit refers to control = 'Private not-for-profit';",
    "idx": 2853
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t1`.`unitid` = `t2`.`unitid`\nAND (`t1`.`chronname` = 'Lincoln College' AND `t2`.`year` = 2011 AND `t2`.`cohort` = '4y bach')\nRETURN COUNT(`t1`.`unitid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many students that graduated from Lincoln College in 2011 belong to the cohort type of Bachelor's/equivalent seeking cohort at 4-year institutions?",
    "evidence": "Lincoln College refers to chronname = 'Lincoln College'; in 2011 refers to year = 2011; Bachelor's/equivalent seeking cohort at 4-year institutions refers to cohort = '4y bach';",
    "idx": 2854
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t1`.`unitid` = `t2`.`unitid`\nAND (`t1`.`chronname` = 'Central Alabama Community College' AND `t2`.`year` = 2011)\nRETURN `t2`.`grad_cohort` AS `grad_cohort`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many students graduated from Central Alabama Community College in 2011 in total?",
    "evidence": "Central Alabama Community College refers to chronname = 'Central Alabama Community College'; in 2011 refers to year = 2011;",
    "idx": 2855
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`institution_details`)-[has_graduation_data_1:has_graduation_data]->(`t2_sub0`:`institution_grads`)\nWHERE `t2_sub0`.`unitid` = `t1_sub0`.`unitid`\nAND (`t2_sub0`.`year` = 2011 AND `t2_sub0`.`gender` = 'M' AND `t2_sub0`.`race` = 'W')\nRETURN MAX(`t2_sub0`.`grad_150`) AS `_col_0`  \n}\nMATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t2`.`year` = 2011 AND `t2`.`gender` = 'M' AND `t2`.`race` = 'W' AND `t2`.`grad_150` = `_col_0`)\nRETURN `t1`.`chronname` AS `chronname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which institute has the highest percentage of male White students graduating in 2011 within 150 percent of normal/expected time?",
    "evidence": "male refers to gender = 'M'; white refers to race = 'w'; in 2011 refers to year = 2011; graduating within 150 percent of normal/expected time refers to grad_150;",
    "idx": 2856
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`institution_details`)-[has_graduation_data_1:has_graduation_data]->(`t2_sub0`:`institution_grads`)\nWHERE `t2_sub0`.`unitid` = `t1_sub0`.`unitid`\nAND (`t2_sub0`.`year` = 2011 AND `t2_sub0`.`gender` = 'M' AND `t2_sub0`.`race` = 'W')\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`grad_150` > '20' THEN `t1_sub0`.`chronname` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the institutes with the percentage of male White students graduating in 2011 within 150 percent of normal/expected time over 20.",
    "evidence": "names of the institutes refers to chronname; male refers to gender = 'M'; white refers to race = 'w'; in 2011 refers to year = 2011; percentage of students graduating within 150 percent of normal/expected time over 20 refers to grad_150>20;",
    "idx": 2857
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`state` = 'Alabama' AND `t1`.`med_sat_percentile` = '100' AND `t2`.`year` = 2011 AND `t2`.`grad_cohort` > '500')\nRETURN COUNT(DISTINCT `t1`.`chronname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the institutes in the state of Alabama whose percent rank for median SAT value within sector is 77, how many of them have over 500 graduates in total in 2011?",
    "evidence": "percent rank for median SAT value within sector refers to med_sat_percentile; over 500 graduates refers to grad_cohort > 500; in 2011 refers to year = 2011;",
    "idx": 2858
  }
]