[
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[arrives_at_0:arrives_at]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`dest`\nAND (`t2`.`fl_date` = '2018/8/1')\nORDER BY `t2`.`dep_delay` IS NULL ASC, `t2`.`dep_delay` DESC \nRETURN `t1`.`description` AS `description`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the flight on 2018/8/1 that was delayed for the longest time, which was the destination airport of this flight?",
    "evidence": "on 2018/8/1 refers to FL_DATE = '2018/8/1';  delayed for the longest time refers to MAX(DEP_DELAY); destination airport refers to DEST;",
    "idx": 4512
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND (`t1`.`description` = 'New York, NY: John F. Kennedy International')\nRETURN sum(CASE  WHEN `t2`.`arr_delay` < 0 THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the flights departing from John F. Kennedy International, how many of them arrived earlier than scheduled?",
    "evidence": "departing from refers to ORIGIN; John F. Kennedy International refers to Description = 'New York, NY: John F. Kennedy International'; arrived earlier than scheduled refers to ARR_DELAY < 0;",
    "idx": 4513
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND (`t2`.`fl_date` = '2018/8/1' AND `t1`.`description` = 'New York, NY: John F. Kennedy International' AND NOT `t2`.`dep_time` IS NULL)\nRETURN `t2`.`dep_time` AS `dep_time` ORDER BY `t2`.`dep_time` IS NULL DESC, `t2`.`dep_time`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the flights scheduled to depart from John F. Kennedy International on 2018/8/1, when was the earliest one scheduled to depart?",
    "evidence": "depart from refers to ORIGIN; John F. Kennedy International refers to Description = 'New York, NY: John F. Kennedy International'; on 2018/8/1 refers to FL_DATE = '2018/8/1'; earliest one scheduled to depart refers to MIN(DEP_TIME);",
    "idx": 4514
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nMATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t3`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND `t2`.`op_carrier_airline_id` = `t3`.`code`\nAND (`t2`.`fl_date` = '2018/8/1' AND `t3`.`description` = 'American Airlines Inc.: AA')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights on 2018/8/1 were operated by American Airlines Inc.?",
    "evidence": "on 2018/8/1 refers to FL_DATE = '2018/8/1'; American Airlines Inc. refers to Description = 'American Airlines Inc.: AA';",
    "idx": 4515
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nMATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t3`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND `t2`.`op_carrier_airline_id` = `t3`.`code`\nAND (`t3`.`description` = 'American Airlines Inc.: AA' AND `t1`.`description` = 'New York, NY: John F. Kennedy International' AND `t2`.`fl_date` = '2018/8/1')\nRETURN `t2`.`op_carrier_fl_num` AS `op_carrier_fl_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the flight numbers of all the flights operated by American Airlines Inc. that were scheduled to depart from John F. Kennedy International.",
    "evidence": "flight numbers refers to OP_CARRIER_FL_NUM; American Airlines Inc. refers to Description = 'American Airlines Inc.: AA'; depart from refers to ORIGIN; John F. Kennedy International refers to Description = 'New York, NY: John F. Kennedy International';",
    "idx": 4516
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nMATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t3`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND `t2`.`op_carrier_airline_id` = `t3`.`code`\nAND (`t2`.`fl_date` = '2018/8/1' AND `t3`.`description` = 'American Airlines Inc.: AA')\nRETURN sum(CASE  WHEN `t2`.`actual_elapsed_time` < `t2`.`crs_elapsed_time` THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights operated by American Airlines Inc. on 2018/8/1 were faster than scheduled?",
    "evidence": "American Airlines Inc. refers to Description = 'American Airlines Inc.: AA'; on 2018/8/1 refers to FL_DATE = '2018/8/1'; faster than scheduled refers to ACTUAL_ELAPSED_TIME < CRS_ELAPSED_TIME;",
    "idx": 4517
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[departs_from_0:departs_from]->(`t2`:`airports`)\nMATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t3`:`air carriers`)\nWHERE `t2`.`code` = `t1`.`origin`\nAND `t1`.`op_carrier_airline_id` = `t3`.`code`\nAND (`t3`.`description` = 'American Airlines Inc.: AA')\nORDER BY `t1`.`dep_time` IS NULL ASC, `t1`.`dep_time` DESC \nRETURN `t1`.`op_carrier_fl_num` AS `op_carrier_fl_num`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the flight number of the flight operated by American Airlines Inc. that had the longest delay in departure?",
    "evidence": "flight numbers refers to OP_CARRIER_FL_NUM; American Airlines Inc. refers to Description = 'American Airlines Inc.: AA'; longest delay in departure refers to MAX(DEP_DELAY);",
    "idx": 4518
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[arrives_at_0:arrives_at]->(`t1`:`airports`)\nMATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t3`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`dest`\nAND `t2`.`op_carrier_airline_id` = `t3`.`code`\nAND (`t3`.`description` = 'American Airlines Inc.: AA')\nRETURN sum(CASE  WHEN `t2`.`dest` = 'JFK' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the flights operated by American Airlines Inc., how many of them were scheduled to land in New York?",
    "evidence": "American Airlines Inc. refers to Description = 'American Airlines Inc.: AA'; land in New York refers to DEST = 'JFK';",
    "idx": 4519
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nMATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t3`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND `t2`.`op_carrier_airline_id` = `t3`.`code`\nAND (`t2`.`fl_date` = '2018/8/1' AND `t3`.`description` = 'American Airlines Inc.: AA')\nRETURN sum(CASE  WHEN `t2`.`cancelled` = 1 THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the flights operated by American Airlines Inc. on 2018/8/1, how many of them were cancelled?",
    "evidence": "American Airlines Inc. refers to Description = 'American Airlines Inc.: AA'; on 2018/8/1 refers to FL_DATE = '2018/8/1'; cancelled refers to CANCELLED = 1;",
    "idx": 4520
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nMATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t3`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND `t2`.`op_carrier_airline_id` = `t3`.`code`\nAND (`t2`.`fl_date` = '2018/8/1')\nRETURN CASE  WHEN COUNT(CASE  WHEN `t3`.`description` = 'American Airlines Inc.: AA' THEN 1 ELSE NULL END) > COUNT(CASE  WHEN `t3`.`description` = 'Endeavor Air Inc.: 9E' THEN 1 ELSE NULL END) THEN 'American Airlines Inc.: AA' ELSE 'Endeavor Air Inc.: 9E' END AS `result`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which airline operated more flights on 2018/8/1, American Airlines Inc. or Endeavor Air Inc.?",
    "evidence": "SUM(Description = 'American Airlines Inc.: AA') > SUM(Description = 'Endeavor Air Inc.: 9E') means American Airlines Inc. operated more flights than  Endeavor Air Inc; SUM(Description = 'American Airlines Inc.: AA') < SUM(Description = 'Endeavor Air Inc.: 9E') means Endeavor Air Inc. operated more flights than American Airlines Inc.; on 2018/8/1 refers to FL_DATE = '2018/8/1';",
    "idx": 4521
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[departs_from_0:departs_from]->(`t2`:`airports`)\nMATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t3`:`air carriers`)\nWHERE `t2`.`code` = `t1`.`origin`\nAND `t1`.`op_carrier_airline_id` = `t3`.`code`\nAND (`t3`.`description` = 'American Airlines Inc.: AA')\nRETURN avg(`t1`.`dep_delay`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average departure delay time of flights operated by American Airlines Inc.?",
    "evidence": "average departure delay time = DIVIDE(SUM(DEP_DELAY), COUNT(Code)); American Airlines Inc. refers to Description = 'American Airlines Inc.: AA';",
    "idx": 4522
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nMATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t3`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND `t2`.`op_carrier_airline_id` = `t3`.`code`\nAND (`t3`.`description` = 'American Airlines Inc.: AA')\nRETURN CASE WHEN 31=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`fl_date` =~ '(?i)(?s)2018/8.*' THEN 1 ELSE 0 END)) / 31 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights on average does American Airlines Inc. operate every day in August, 2018?",
    "evidence": "flights on average = DIVIDE(COUNT(Code), 31); American Airlines Inc. refers to Description = 'American Airlines Inc.: AA'; every day in August, 2018 refers to FL_DATE like '2018/8%';",
    "idx": 4523
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`air carriers`:`air carriers`)\nRETURN COUNT(`air carriers`.`code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the number of air carriers in the database?",
    "evidence": "",
    "idx": 4524
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND (`t1`.`description` = 'Los Angeles, CA: Los Angeles International')\nRETURN sum(CASE  WHEN `t2`.`fl_date` = '2018/8/27' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of planes that took off from Los Angeles International airport on 2018/8/27.",
    "evidence": "took off from refers to ORIGIN; Los Angeles International airport refers to Description = 'Los Angeles, CA: Los Angeles International'; on 2018/8/27 refers to FL_DATE = '2018/8/27';",
    "idx": 4525
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[arrives_at_0:arrives_at]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`dest`\nAND (`t2`.`fl_date` = '2018/8/7')\nRETURN sum(CASE  WHEN `t1`.`description` =~ '(?i)(?s).*Oakland.*' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of airplanes that landed on Oakland Airport on 2018/8/7.",
    "evidence": "landed on refers to DEST; Oakland Airport refers to Description which contains 'Oakland'; on 2018/8/7 refers to FL_DATE = '2018/8/7';",
    "idx": 4526
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND (`t1`.`fl_date` = '2018/8/2' AND `t2`.`description` = 'Alaska Airlines Inc.: AS' AND `t1`.`dep_delay` > 0)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights of Alaska Airlines were delayed on 2018/8/2?",
    "evidence": "Alaska Airlines refers to Description = 'Alaska Airlines Inc.: AS'; delayed refers to DEP_DELAY > 0; on 2018/8/2 refers to FL_DATE = '2018/8/2';",
    "idx": 4527
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[arrives_at_0:arrives_at]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`dest`\nAND (`t2`.`fl_date` = '2018/8/12' AND `t2`.`dest` = 'MIA' AND `t2`.`arr_delay` < 0)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of fights landed earlier on Miami Airport on 2018/8/12.",
    "evidence": "landed on refers to DEST; landed earlier refers to ARR_DELAY < 0; Miami Airport refers to DEST = 'MIA'; on 2018/8/12 refers to FL_DATE = '2018/8/12';",
    "idx": 4528
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND (`t1`.`cancellation_code` = 'A' AND `t2`.`description` = 'American Airlines Inc.: AA' AND `t1`.`cancelled` = 1)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights from American Airlines were cancelled due to a type A cancellation code?",
    "evidence": "American Airlines refers to Description = 'American Airlines Inc.: AA'; cancelled refers to Cancelled = 1; cancelled due to type A cancellation code refers to CANCELLATION_CODE = 'A';",
    "idx": 4529
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND (`t1`.`fl_date` = '2018/8/31' AND `t2`.`description` = 'Endeavor Air Inc.: 9E')\nRETURN sum(CASE  WHEN `t1`.`actual_elapsed_time` < `t1`.`crs_elapsed_time` THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights of Endeavor Air Inc. were faster than scheduled on 2018/8/31?",
    "evidence": "Endeavor Air Inc. refers to Description = 'Endeavor Air Inc.: 9E'; faster than scheduled refers to ACTUAL_ELAPSED_TIME < CRS_ELAPSED_TIME; on 2018/8/31 refers to FL_DATE = '2018/8/31';",
    "idx": 4530
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND (`t1`.`fl_date` = '2018/8/7' AND `t2`.`description` = 'Spirit Air Lines: NK')\nRETURN COUNT(`t2`.`code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many planes of Spirit Air Lines took off on 2018/8/7?",
    "evidence": "Spirit Air Lines refers to Description = 'Spirit Air Lines: NK'; on 2018/8/7 refers to FL_DATE = '2018/8/7';",
    "idx": 4531
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND (`t1`.`tail_num` = 'N702SK')\nWITH `t2`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the flight with the tail number 'N702SK', which air carrier does it belong to?",
    "evidence": "tail number refers to TAIL_NUM; TAIL_NUM = 'N702SK';",
    "idx": 4532
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[arrives_at_0:arrives_at]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`dest`\nAND (`t2`.`fl_date` = '2018/8/15')\nORDER BY `t2`.`dest` IS NULL ASC, `t2`.`dest` DESC \nRETURN `t1`.`description` AS `description`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of the airport which landed the most number of flights on 2018/8/15.",
    "evidence": "name of the airport refers to Description; airport that landed the most number of flights refers to MAX(COUNT(DEST)); on 2018/8/15 refers to FL_DATE = '2018/8/15';",
    "idx": 4533
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND (`t1`.`fl_date` = '2018/8/1' AND `t1`.`origin` = 'ATL' AND `t1`.`dest` = 'PHL' AND `t1`.`crs_dep_time` = '2040')\nWITH `t2`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the flight from ATL to PHL on 2018/8/1 that scheduled local departure time as \"2040\", which air carrier does this flight belong to?",
    "evidence": "flight from ATL refers to ORIGIN = 'ATL'; flight to PHL refers to DEST = 'PHL'; on 2018/8/1 refers to FL_DATE = '2018/8/1'; local departure time refers to CRS_DEP_TIME; CRS_DEP_TIME = '2040';",
    "idx": 4534
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[arrives_at_0:arrives_at]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`dest`\nAND (`t2`.`fl_date` = '2018/8/15' AND `t1`.`description` = 'Lake Charles, LA: Lake Charles Regional')\nRETURN COUNT(`t1`.`code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of flights that landed at Lake Charles Regional Airport on 2018/8/15.",
    "evidence": "landed at refers to DEST; Lake Charles Regional Airport refers to Description = 'Lake Charles, LA: Lake Charles Regional'; on 2018/8/15 refers to FL_DATE = '2018/8/15';",
    "idx": 4535
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND (`t2`.`fl_date` = '2018/8/15' AND NOT `t2`.`cancellation_code` IS NULL AND `t1`.`description` = 'Los Angeles, CA: Los Angeles International')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`cancellation_code` = 'C' THEN 1.0 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of flights from Los Angeles International airport that were cancelled due to a type C cancellation code?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(CANCELLATION_CODE = 'C'), COUNT(Code)), 100); flights from refers to ORIGIN; Los Angeles International airport refers to Description = 'Los Angeles, CA: Los Angeles International'; cancelled refers to Cancelled = 1; cancelled due to a type C cancellation code refers to CANCELLATION_CODE = 'C';",
    "idx": 4536
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[arrives_at_0:arrives_at]->(`t2`:`airports`)\nWHERE `t2`.`code` = `t1`.`dest`\nAND (`t2`.`description` =~ '(?i)(?s).*Pittsburgh.*' AND NOT `t1`.`crs_elapsed_time` IS NULL AND NOT `t1`.`actual_elapsed_time` IS NULL)\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`actual_elapsed_time` < `t1`.`crs_elapsed_time` THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of flights which landed at Pittsburgh were faster than scheduled?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(ACTUAL_ELAPSED_TIME < T2.CRS_ELAPSED_TIME), COUNT(Code)), 100); landed at refers to DEST; Pittsburgh refers to Description which contains 'Pittsburgh'; faster than scheduled refers to ACTUAL_ELAPSED_TIME < CRS_ELAPSED_TIME;",
    "idx": 4537
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`air carriers`:`air carriers`)\nWHERE `air carriers`.`code` = 19049\nRETURN `air carriers`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the description of the airline code 19049?",
    "evidence": "",
    "idx": 4538
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`fl_date` = '2018/8/1' AND `airlines`.`dep_delay` <= 0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights departed on time on 8/1/2018?",
    "evidence": "departed on time refers to DEP_DELAY < = 0; on 8/1/2018 refers to FL_DATE = '2018/8/1';",
    "idx": 4539
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`description` =~ '(?i)(?s).*Ankara, Turkey.*'\nRETURN `airports`.`code` AS `code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the codes of the airport found in Ankara, Turkey?",
    "evidence": "airport found in Ankara, Turkey refers to Description like '%Ankara, Turkey%';",
    "idx": 4540
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`origin_airport_id` = 12264\nRETURN `airlines`.`weather_delay` AS `weather_delay` ORDER BY `weather_delay` IS NULL ASC, `weather_delay` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How long was the longest minute delay caused by a weather problem in airport id 12264?",
    "evidence": "longest minute delay caused by a weather problem refers to MAX(WEATHER_DELAY); airport id refers to ORIGIN_AIRPORT_ID; ORIGIN_AIRPORT_ID = 12264;",
    "idx": 4541
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`description` = 'Anita Bay, AK: Anita Bay Airport'\nRETURN `airports`.`code` AS `code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the IATA code of the Anita Bay Airport in Anita Bay, Alaska?",
    "evidence": "IATA code refers to Code; Anita Bay Airport in Anita Bay, Alaska refers to Description = 'Anita Bay, AK: Anita Bay Airport';",
    "idx": 4542
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nORDER BY `airlines`.`late_aircraft_delay` IS NULL ASC, `airlines`.`late_aircraft_delay` DESC \nRETURN `airlines`.`origin_airport_id` AS `origin_airport_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the origin airport id that recorded the longest delay due to a late aircraft?",
    "evidence": "origin airport id refers to ORIGIN_AIRPORT_ID; longest delay due to a late aircraft refers to MAX(LATE_AIRCRAFT_DELAY);",
    "idx": 4543
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`airlines`)-[operated_by_1:operated_by]->(`t2_sub0`:`air carriers`)\nWHERE `t1_sub0`.`op_carrier_airline_id` = `t2_sub0`.`code`\nAND (`t2_sub0`.`description` = 'Southwest Airlines Co.: WN')\nWITH `t1_sub0`.`tail_num` AS _groupby_col_0\nRETURN _groupby_col_0 AS `tail_num`  \n}\nWITH *\nRETURN COUNT(`tail_num`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many planes does Southwest Airlines Co. have?",
    "evidence": "planes refers to TAIL_NUM; Southwest Airlines Co. refers to Description = 'Southwest Airlines Co.: WN';",
    "idx": 4544
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[arrives_at_0:arrives_at]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`dest`\nAND (`t2`.`fl_date` =~ '(?i)(?s)2018/8.*' AND `t1`.`description` = 'Bakersfield, CA: Meadows Field' AND `t2`.`dest` = 'BFL' AND `t2`.`arr_delay` <= 0)\nWITH `t2`.`tail_num` AS _groupby_col_0\nRETURN _groupby_col_0 AS `tail_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the tail numbers of all the aircraft that arrived on time at Meadows Field airport in August of 2018?",
    "evidence": "tail number refers to TAIL_NUM; arrived on time refers to ARR_DELAY < = 0; Meadows Field airport refers to Description = 'Bakersfield, CA: Meadows Field'; in August of 2018 refers to FL_DATE like '2018/8%';",
    "idx": 4545
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[arrives_at_0:arrives_at]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`dest`\nAND (`t1`.`description` = 'Boston, MA: Logan International' AND `t2`.`dest` = 'BOS')\nORDER BY `t2`.`security_delay` IS NULL ASC, `t2`.`security_delay` DESC \nRETURN `t2`.`op_carrier_airline_id` AS `op_carrier_airline_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the airports whose destination is Logan International, what is the airline id of the carrier operator with the highest delay in minutes due to security?",
    "evidence": "destination refers to DEST; Logan International refers to Description = 'Boston, MA: Logan International'; airline id of the carrier operator refers to OP_CARRIER_AIRLINE_ID; highest delay in minutes due to security refers to MAX(SECURITY_DELAY);",
    "idx": 4546
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nWITH `t2`.`description` AS _groupby_col_0\nORDER BY `t1`.`tail_num` IS NULL ASC, `t1`.`tail_num` DESC \nRETURN _groupby_col_0 AS `description`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the top 5 airlines with the highest number of aircraft?",
    "evidence": "names of the airlines refers to Description; highest number of aircraft refers to MAX(COUNT(TAIL_NUM));",
    "idx": 4547
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND (`t1`.`tail_num` = 'N202NN')\nWITH `t2`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the airline to which tail number N202NN belongs to.",
    "evidence": "name of the airline refers to Description; tail number refers to TAIL_NUM; TAIL_NUM = 'N202NN';",
    "idx": 4548
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[departs_from_0:departs_from]->(`t2`:`airports`)\nWHERE `t1`.`origin` = `t2`.`code`\nAND (NOT `t1`.`actual_elapsed_time` IS NULL AND NOT `t1`.`crs_elapsed_time` IS NULL)\nORDER BY `t1`.`actual_elapsed_time` - `t1`.`crs_elapsed_time` IS NULL DESC, `t1`.`actual_elapsed_time` - `t1`.`crs_elapsed_time`  \nRETURN `t1`.`op_carrier_airline_id` AS `op_carrier_airline_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which airline does the aircraft with the fastest flight belong to?",
    "evidence": "fastest flight refers to MIN(SUBTRACT(ACTUAL_ELAPSED_TIME, CRS_ELAPSED_TIME));",
    "idx": 4549
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t2`.`code` = `t1`.`op_carrier_airline_id`\nAND (`t1`.`fl_date` =~ '(?i)(?s)2018/8/.*' AND `t2`.`description` = 'Delta Air Lines Inc.: DL')\nRETURN `t1`.`tail_num` AS `tail_num`, sum(CASE WHEN 60=0 THEN NULL ELSE toFloat(`t1`.`late_aircraft_delay`) / 60 END) AS `delay` ORDER BY `delay` IS NULL ASC, `delay` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many hours in total did all of the Delta Air Lines aircraft were delayed due to a late aircraft in August of 2018? Identify the plane number of the aircraft with the highest delayed hours.",
    "evidence": "hours in total = DIVIDE(SUM(LATE_AIRCRAFT_DELAY), 60); Delta Air Lines refers to Description = 'Delta Air Lines Inc.: DL'; delayed due to a late aircraft refers to LATE_AIRCRAFT_DELAY; in August of 2018 refers to FL_DATE like '2018/8/%'; plane number refers to TAIL_NUM; highest delayed hours refers to MAX(DIVIDE(SUM(LATE_AIRCRAFT_DELAY),60));",
    "idx": 4550
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airports`:`airports`)\nRETURN `airports`.`code` AS `code`, `airports`.`description` AS `description`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any three airports with their codes.",
    "evidence": "",
    "idx": 4551
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`air carriers`:`air carriers`)\nWHERE `air carriers`.`description` =~ '(?i)(?s)Mississippi Valley Airlines.*'\nRETURN `air carriers`.`code` AS `code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the code of Mississippi Valley Airlines?",
    "evidence": "Mississippi Valley Airlines refers to Description like 'Mississippi Valley Airlines%';",
    "idx": 4552
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`origin` = 'PHL' AND `airlines`.`dest` = 'MDT' AND `airlines`.`tail_num` = 'N627AE' AND `airlines`.`fl_date` = '2018/8/13'\nRETURN `airlines`.`crs_dep_time` AS `crs_dep_time`, `airlines`.`dep_time` AS `dep_time`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the scheduled local departure time and the actual departure time of the flight from Philadelphia to Harrisburg with the plane's tail number N627AE on the 13th of August 2018?",
    "evidence": "scheduled local departure time refers to CRS_DEP_TIME; actual departure time refers to DEP_TIME; from Philadelphia refers to ORIGIN = 'PHL'; to Harrisburg refers to DEST = 'MDT'; tail number refers to TAIL_NUM; TAIL_NUM = 'N627AE'; on the 13th of August 2018 refers to FL_DATE = '2018/8/13';",
    "idx": 4553
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`fl_date` = '2018/8/1' AND `airlines`.`origin` = 'ABE'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights on the 1st of August 2018 were coming from Allentown, Pennsylvania?",
    "evidence": "1st of August 2018 refers to FL_DATE = '2018/8/1'; coming from Allentown, Pennsylvania refers to ORIGIN = 'ABE';",
    "idx": 4554
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`origin` = 'ABY'\nWITH `airlines`.`dest` AS _groupby_col_0\nRETURN _groupby_col_0 AS `dest`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the only flight destination for flights from Albany?",
    "evidence": "flight destination refers to DEST; from Albany refers to ORIGIN = 'ABY';",
    "idx": 4555
  }
]