[
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'Greenland'\nRETURN COUNT(DISTINCT `airports`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many different cities do have some airport in the country of Greenland?",
    "evidence": "",
    "idx": 6790
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'Greenland'\nRETURN COUNT(DISTINCT `airports`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "In how many cities are there airports in the country of Greenland?",
    "evidence": "",
    "idx": 6791
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH ()-[t2:operated_by]->(`t1`:`airlines`)\nWHERE `t1`.`alid` = `t2`.`alid`\nAND (`t1`.`name` = 'American Airlines')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many routes does American Airlines operate?",
    "evidence": "",
    "idx": 6793
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`t1`:`airports`)-[t2:operated_by]->()\nWHERE `t1`.`apid` = `t2`.`dst_apid`\nAND (`t1`.`country` = 'Canada')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of routes whose destination airports are in Canada.",
    "evidence": "",
    "idx": 6794
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`t1`:`airports`)-[t2:operated_by]->()\nWHERE `t1`.`apid` = `t2`.`dst_apid`\nAND (`t1`.`country` = 'Canada')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many routes end in a Canadian airport?",
    "evidence": "",
    "idx": 6795
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nORDER BY `airports`.`elevation` IS NULL DESC, `airports`.`elevation`  \nRETURN `airports`.`name` AS `name`, `airports`.`city` AS `city`, `airports`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, city, and country of the airport that has the lowest altitude.",
    "evidence": "",
    "idx": 6796
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nORDER BY `airports`.`elevation` IS NULL DESC, `airports`.`elevation`  \nRETURN `airports`.`name` AS `name`, `airports`.`city` AS `city`, `airports`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name, city, and country of the airport with the lowest altitude?",
    "evidence": "",
    "idx": 6797
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nORDER BY `airports`.`elevation` IS NULL ASC, `airports`.`elevation` DESC \nRETURN `airports`.`name` AS `name`, `airports`.`city` AS `city`, `airports`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, city, and country of the airport that has the highest latitude.",
    "evidence": "",
    "idx": 6798
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nORDER BY `airports`.`elevation` IS NULL ASC, `airports`.`elevation` DESC \nRETURN `airports`.`name` AS `name`, `airports`.`city` AS `city`, `airports`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name, city, and country of the airport with the highest elevation?",
    "evidence": "",
    "idx": 6799
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH ()-[t2:operated_by]->(`t1`:`airlines`)\nWHERE `t1`.`alid` = `t2`.`alid`\nAND (`t1`.`name` = 'American Airlines')\nRETURN COUNT(DISTINCT `t2`.`dst_apid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of different different airports that are destinations for American Airlines?",
    "evidence": "",
    "idx": 6801
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWITH `airlines`.`country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all countries and their number of airlines in the descending order of number of airlines.",
    "evidence": "",
    "idx": 6802
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWITH `airlines`.`country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many airlines operate out of each country in descending order?",
    "evidence": "",
    "idx": 6803
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWITH `airports`.`country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `country` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many airports are there per country? Order the countries by decreasing number of airports.",
    "evidence": "",
    "idx": 6804
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWITH `airports`.`country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `country` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of airports per country, ordered from most to least?",
    "evidence": "",
    "idx": 6805
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'United States'\nWITH `airports`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `city` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many airports are there per city in the United States? Order the cities by decreasing number of airports.",
    "evidence": "",
    "idx": 6806
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'United States'\nWITH `airports`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `city` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many airports are there per city in the US ordered from most to least?",
    "evidence": "",
    "idx": 6807
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'United States'\nWITH `airports`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the cities with more than 3 airports in the United States.",
    "evidence": "",
    "idx": 6808
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'United States'\nWITH `airports`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of cities in the United States with more than 3 airports?",
    "evidence": "",
    "idx": 6809
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWITH `airports`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `city`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the cities which have more than one airport and number of airports.",
    "evidence": "",
    "idx": 6810
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWITH `airports`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `city`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all cities with more than one airport and how many airports do they have?",
    "evidence": "",
    "idx": 6811
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`t1`:`airports`)-[t2:operated_by]->()\nWHERE `t1`.`apid` = `t2`.`src_apid`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of routes for each source airport and the airport name.",
    "evidence": "",
    "idx": 6812
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`t1`:`airports`)-[t2:operated_by]->()\nWHERE `t1`.`apid` = `t2`.`src_apid`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each airport name, how many routes start at that airport?",
    "evidence": "",
    "idx": 6813
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`t1`:`airports`)-[t2:operated_by]->()\nWHERE `t1`.`apid` = `t2`.`src_apid`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of routes and airport name for each source airport, order the results by decreasing number of routes.",
    "evidence": "",
    "idx": 6814
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`t1`:`airports`)-[t2:operated_by]->()\nWHERE `t1`.`apid` = `t2`.`src_apid`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each  airport name, how many routes start at that airport, ordered from most to least?",
    "evidence": "",
    "idx": 6815
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWITH `airports`.`country` AS _groupby_col_0, avg(`airports`.`elevation`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average elevation of all airports for each country.",
    "evidence": "",
    "idx": 6816
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWITH `airports`.`country` AS _groupby_col_0, avg(`airports`.`elevation`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each country, what is the average elevation of that country's airports?",
    "evidence": "",
    "idx": 6817
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWITH `airports`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 = 2\nRETURN _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the cities which have exactly two airports.",
    "evidence": "",
    "idx": 6818
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWITH `airports`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 = 2\nRETURN _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the cities with exactly two airports?",
    "evidence": "",
    "idx": 6819
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH ()-[t2:operated_by]->(`t1`:`airlines`)\nWHERE `t1`.`alid` = `t2`.`alid`\nWITH `t1`.`country` AS _groupby_col_0, `t1`.`name` AS _groupby_col_1, COUNT(*) AS _groupby_col_2\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `name`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each country and airline name, how many routes are there?",
    "evidence": "",
    "idx": 6820
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH ()-[t2:operated_by]->(`t1`:`airlines`)\nWHERE `t1`.`alid` = `t2`.`alid`\nWITH `t1`.`country` AS _groupby_col_0, `t1`.`name` AS _groupby_col_1, COUNT(*) AS _groupby_col_2\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `name`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of routes for each country and airline in that country?",
    "evidence": "",
    "idx": 6821
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH ()-[t1:connects_to]->(`t2`:`airports`)\nWHERE `t1`.`dst_apid` = `t2`.`apid`\nAND (`t2`.`country` = 'Italy')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of routes whose destinations are Italian airports?",
    "evidence": "",
    "idx": 6823
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH ()-[t1:connects_to]->(`t2`:`airports`)\nMATCH ()-[t1:operated_by]->(`t3`:`airlines`)\nWHERE `t1`.`dst_apid` = `t2`.`apid`\nAND `t1`.`alid` = `t3`.`alid`\nAND (`t2`.`country` = 'Italy' AND `t3`.`name` = 'American Airlines')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of routes operated by the airline American Airlines whose destinations are in Italy?",
    "evidence": "",
    "idx": 6825
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`t1`:`airports`)-[t2:operated_by]->()\nWHERE `t1`.`apid` = `t2`.`dst_apid`\nAND (`t1`.`name` = 'John F Kennedy International Airport')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of routes that have destination John F Kennedy International Airport.",
    "evidence": "",
    "idx": 6826
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`t1`:`airports`)-[t2:operated_by]->()\nWHERE `t1`.`apid` = `t2`.`dst_apid`\nAND (`t1`.`name` = 'John F Kennedy International Airport')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of routes that end at John F Kennedy International Airport?",
    "evidence": "",
    "idx": 6827
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`orders`:`orders`)\nORDER BY `orders`.`date_order_placed` IS NULL ASC, `orders`.`date_order_placed` DESC \nRETURN `orders`.`order_id` AS `order_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id of the order made most recently.",
    "evidence": "",
    "idx": 6829
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`orders`:`orders`)\nORDER BY `orders`.`date_order_placed` IS NULL DESC, `orders`.`date_order_placed`  \nRETURN `orders`.`order_id` AS `order_id`, `orders`.`customer_id` AS `customer_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the order id and customer id associated with the oldest order.",
    "evidence": "",
    "idx": 6831
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`shipments`:`shipments`)\nWHERE `shipments`.`shipment_tracking_number` = '3452'\nRETURN `shipments`.`order_id` AS `order_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id of the order whose shipment tracking number is \"3452\".",
    "evidence": "",
    "idx": 6832
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`shipments`:`shipments`)\nWHERE `shipments`.`shipment_tracking_number` = '3452'\nRETURN `shipments`.`order_id` AS `order_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which order's shipment tracking number is \"3452\"? Give me the id of the order.",
    "evidence": "",
    "idx": 6833
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`order_status` = 'Packing')\nRETURN DISTINCT `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of all the distinct customers who have orders with status \"Packing\".",
    "evidence": "",
    "idx": 6836
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`order_status` = 'On Road')\nRETURN DISTINCT `t1`.`customer_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the details of all the distinct customers who have orders with status \"On Road\".",
    "evidence": "",
    "idx": 6838
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`customer_name` = 'Jeramie')\nRETURN `t2`.`order_id` AS `order_id`, `t2`.`order_status` AS `order_status`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me a list of id and status of orders which belong to the customer named \"Jeramie\".",
    "evidence": "",
    "idx": 6840
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`customer_name` = 'Jeramie')\nRETURN `t2`.`date_order_placed` AS `date_order_placed`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the dates of orders which belong to the customer named \"Jeramie\".",
    "evidence": "",
    "idx": 6842
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`date_order_placed` >= '2009-01-01' AND `t2`.`date_order_placed` <= '2010-01-01')\nRETURN `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the names of customers who have placed orders between 2009-01-01 and 2010-01-01.",
    "evidence": "",
    "idx": 6844
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`t2`:`shipments`)-[ships_order_0:ships_order]->(`t1`:`orders`)\nWHERE `t1`.`order_id` = `t2`.`order_id`\nAND (`t2`.`shipment_tracking_number` = 3452)\nRETURN `t1`.`date_order_placed` AS `date_order_placed`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When was the order placed whose shipment tracking number is 3452? Give me the date.",
    "evidence": "",
    "idx": 6848
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`t2`:`shipments`)-[ships_order_0:ships_order]->(`t1`:`orders`)\nWHERE `t1`.`order_id` = `t2`.`order_id`\nAND (`t2`.`shipment_tracking_number` = 3452)\nRETURN `t1`.`date_order_placed` AS `date_order_placed`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "On which day was the order placed whose shipment tracking number is 3452?",
    "evidence": "",
    "idx": 6849
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`t1`:`orders`)-[t2:contains]->(`t3`:`products`)\nWHERE `t1`.`order_id` = `t2`.`order_id` AND `t2`.`product_id` = `t3`.`product_id`\nWITH `t3`.`product_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `product_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the count and id of each product in all the orders.",
    "evidence": "",
    "idx": 6852
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`shipments`:`shipments`)\nWHERE `shipments`.`shipment_date` > '2000-01-01'\nRETURN `shipments`.`order_id` AS `order_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the ids of orders which are shipped after 2000-01-01.",
    "evidence": "",
    "idx": 6854
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`shipments`:`shipments`)\nWHERE `shipments`.`shipment_date` > '2000-01-01'\nRETURN `shipments`.`order_id` AS `order_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which orders have shipment after 2000-01-01? Give me the order ids.",
    "evidence": "",
    "idx": 6855
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "CALL(*) {\nMATCH (`shipments_sub0`:`shipments`)\nRETURN MAX(`shipments_sub0`.`shipment_date`) AS `_col_0`  \n}\nMATCH (`shipments`:`shipments`)\nWHERE `shipments`.`shipment_date` = `_col_0`\nRETURN `shipments`.`order_id` AS `order_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id of the order which is shipped most recently.",
    "evidence": "",
    "idx": 6856
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "CALL(*) {\nMATCH (`shipments_sub0`:`shipments`)\nRETURN MAX(`shipments_sub0`.`shipment_date`) AS `_col_0`  \n}\nMATCH (`shipments`:`shipments`)\nWHERE `shipments`.`shipment_date` = `_col_0`\nRETURN `shipments`.`order_id` AS `order_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which order has the most recent shipment? Give me the order id.",
    "evidence": "",
    "idx": 6857
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN DISTINCT `products`.`product_name` AS `product_name` ORDER BY `product_name` IS NULL DESC, `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all distinct products in alphabetical order.",
    "evidence": "",
    "idx": 6858
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN DISTINCT `products`.`product_name` AS `product_name` ORDER BY `product_name` IS NULL DESC, `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort all the distinct products in alphabetical order.",
    "evidence": "",
    "idx": 6859
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`orders`:`orders`)\nORDER BY `orders`.`date_order_placed` IS NULL DESC, `orders`.`date_order_placed`  \nRETURN DISTINCT `orders`.`order_id` AS `order_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the ids of all distinct orders ordered by placed date.",
    "evidence": "",
    "idx": 6860
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`orders`:`orders`)\nORDER BY `orders`.`date_order_placed` IS NULL DESC, `orders`.`date_order_placed`  \nRETURN DISTINCT `orders`.`order_id` AS `order_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are ids of the all distinct orders, sorted by placement date?",
    "evidence": "",
    "idx": 6861
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`invoice_date` < '1989-09-03' OR `invoices`.`invoice_date` > '2007-12-25'\nRETURN `invoices`.`invoice_number` AS `invoice_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the invoice numbers which are created before 1989-09-03 or after 2007-12-25.",
    "evidence": "",
    "idx": 6862
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_orders",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`invoice_date` < '1989-09-03' OR `invoices`.`invoice_date` > '2007-12-25'\nRETURN DISTINCT `invoices`.`invoice_details` AS `invoice_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct details of invoices which are created before 1989-09-03 or after 2007-12-25.",
    "evidence": "",
    "idx": 6864
  },
  {
    "filename": "train_spider.json",
    "db_id": "architecture",
    "gql_statement": "MATCH (`architect`:`architect`)\nWHERE `architect`.`gender` = 'male'\nRETURN `architect`.`name` AS `name`, `architect`.`nationality` AS `nationality`, `architect`.`id` AS `id` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name, nationality and id of all male architects ordered by their names lexicographically.",
    "evidence": "",
    "idx": 6867
  },
  {
    "filename": "train_spider.json",
    "db_id": "architecture",
    "gql_statement": "MATCH (`t1`:`bridge`)-[designed_by_0:designed_by]->(`t2`:`architect`)\nWHERE `t1`.`architect_id` = `t2`.`id`\nRETURN MAX(`t1`.`length_meters`) AS `_col_0`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum length in meters for the bridges and what are the architects' names?",
    "evidence": "",
    "idx": 6868
  },
  {
    "filename": "train_spider.json",
    "db_id": "architecture",
    "gql_statement": "MATCH (`t2`:`mill`)-[designed_by_0:designed_by]->(`t1`:`architect`)\nWHERE `t1`.`id` = `t2`.`architect_id`\nRETURN DISTINCT `t1`.`name` AS `name`, `t1`.`nationality` AS `nationality`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct names and nationalities of the architects who have ever built a mill?",
    "evidence": "",
    "idx": 6871
  },
  {
    "filename": "train_spider.json",
    "db_id": "architecture",
    "gql_statement": "MATCH (`t1`:`mill`)-[designed_by_0:designed_by]->(`t2`:`architect`)\nWHERE `t1`.`architect_id` = `t2`.`id`\nAND (`t2`.`nationality` = 'American' OR `t2`.`nationality` = 'Canadian')\nRETURN DISTINCT `t1`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct types of mills that are built by American or Canadian architects?",
    "evidence": "",
    "idx": 6873
  },
  {
    "filename": "train_spider.json",
    "db_id": "architecture",
    "gql_statement": "MATCH (`t1`:`mill`)-[designed_by_0:designed_by]->(`t2`:`architect`)\nMATCH (`t3`:`bridge`)-[designed_by_1:designed_by]->(`t2`:`architect`)\nWHERE `t1`.`architect_id` = `t2`.`id`\nAND `t3`.`architect_id` = `t2`.`id`\nAND (`t3`.`length_meters` > 80)\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct name of the mills built by the architects who have also built a bridge longer than 80 meters?",
    "evidence": "",
    "idx": 6876
  },
  {
    "filename": "train_spider.json",
    "db_id": "architecture",
    "gql_statement": "WITH *, COLLECT { MATCH (`mill_sub0`:`mill`)\nWHERE `mill_sub0`.`built_year` < 1850\nRETURN `mill_sub0`.`architect_id` AS `architect_id`   } AS in_collect_0\nMATCH (`architect`:`architect`)\nWHERE NOT `architect`.`id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many architects haven't built a mill before year 1850?",
    "evidence": "",
    "idx": 6878
  },
  {
    "filename": "train_spider.json",
    "db_id": "architecture",
    "gql_statement": "MATCH (`t1`:`bridge`)-[designed_by_0:designed_by]->(`t2`:`architect`)\nWHERE `t1`.`architect_id` = `t2`.`id`\nAND (`t2`.`nationality` = 'American')\nORDER BY `t1`.`length_feet` IS NULL DESC, `t1`.`length_feet`  \nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "show the name of all bridges that was designed by american archtect, and sort the result by the bridge feet length.",
    "evidence": "",
    "idx": 6879
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`book_club`:`book_club`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of book clubs.",
    "evidence": "",
    "idx": 6881
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`book_club`:`book_club`)\nWHERE `book_club`.`year` > 1989\nRETURN `book_club`.`book_title` AS `book_title`, `book_club`.`author_or_editor` AS `author_or_editor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "show the titles, and authors or editors for all books made after the year 1989.",
    "evidence": "",
    "idx": 6882
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`book_club`:`book_club`)\nRETURN DISTINCT `book_club`.`publisher` AS `publisher`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all distinct publishers for books.",
    "evidence": "",
    "idx": 6884
  }
]