[
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`lgid` = 'NHL' AND NOT `goalies`.`sa` IS NULL\nRETURN DISTINCT `goalies`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the years in which the NHL League had shots recorded while the goalie was on the ice.",
    "evidence": "shots recorded while the goalie was on the ice refers to SA IS NOT NULL; NHL League refers to lgID = 'NHL'",
    "idx": 5829
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`postw` = `goalies`.`postl`\nRETURN DISTINCT COUNT(`goalies`.`tmid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many teams have the same total number of postseason wins and postseason loses?",
    "evidence": "same total number of postseason wins and postseason loses refers to PostW = PostL",
    "idx": 5830
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`hof`:`hof`)\nWHERE `hof`.`year` = 1978\nRETURN `hof`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the name of the person who was in the Hall of Fame in the year 1978.",
    "evidence": "",
    "idx": 5831
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`hof`:`hof`)\nWHERE `hof`.`category` = 'Builder'\nRETURN COUNT(`hof`.`hofid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many people were in the Hall of Fame's Builder category?",
    "evidence": "",
    "idx": 5832
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`hof`:`hof`)\nWHERE `hof`.`year` > 1980 AND `hof`.`category` = 'Player'\nRETURN COUNT(`hof`.`hofid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the people who got into the Hall of Fame after the year 1980, how many of them belong to the category of \"Player\"?",
    "evidence": "after the year 1980 refers to year>1980",
    "idx": 5833
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`hof`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`hofid` = `t2`.`hofid`\nAND (`t2`.`year` = 2007)\nRETURN DISTINCT `t1`.`namenick` AS `namenick`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the Nicknames of the players who got in the Hall of Fame in 2007.",
    "evidence": "nicknames refers to nameNick",
    "idx": 5834
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardscoaches`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t1`.`birthcountry` = 'Canada')\nRETURN DISTINCT `t2`.`award` AS `award`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the awards the coaches who are born in Canada have won.",
    "evidence": "born in Canada refers to birthCountry = 'Canada'",
    "idx": 5835
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`master`)-[coach_profile_0:coach_profile]->(`t2`:`coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`w` > 30 AND `t1`.`birthcountry` = 'USA')\nRETURN COUNT(`t2`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches whose team has over 30 wins in a year, how many of them are born in the USA?",
    "evidence": "over 30 wins refers to w>30; born in the USA refers to birthCountry = 'USA'",
    "idx": 5836
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`master`)-[coach_profile_0:coach_profile]->(`t2`:`coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`lgid` = 'NHL' AND `t1`.`birthcountry` = 'Canada')\nRETURN COUNT(`t2`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who have taught teams from the NHL League, how many of them are from Canada?",
    "evidence": "from Canada refers to birthCountry = 'Canada'; NHL league refers to lgID = 'NHL'",
    "idx": 5837
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardscoaches`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t1`.`birthyear` = '1952')\nRETURN `t2`.`award` AS `award`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the awards won by coaches who were born in 1952.",
    "evidence": "born in 1977 refers to birthYear = '1977'",
    "idx": 5838
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardscoaches`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`year` = 1940 AND `t1`.`birthcity` = 'Toronto')\nRETURN COUNT(`t1`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who have received an award in 1940, how many of them are born in Toronto?",
    "evidence": "born in Toronto refers to birthCountry = 'Toronto'",
    "idx": 5839
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardscoaches`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (NOT `t1`.`deathyear` IS NULL AND `t2`.`year` > 1940)\nRETURN COUNT(`t1`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who have received an award after the year 1940, how many of them have already died?",
    "evidence": "after the year 1940 refers to year>1940; have already died refers to deathYear IS NOT NULL",
    "idx": 5840
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardscoaches`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (NOT `t1`.`deathyear` IS NULL AND `t2`.`lgid` = 'NHL')\nRETURN DISTINCT `t2`.`award` AS `award`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the awards won by coaches who taught the NHL League and have already died.",
    "evidence": "have already died refers to deathYear IS NOT NULL; NHL league refers to lgID = 'NHL'",
    "idx": 5841
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`hof`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`hofid` = `t2`.`hofid`\nAND (`t1`.`weight` > '195')\nRETURN COUNT(DISTINCT `t1`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who have gotten in the Hall of Fame, how many of them have a weight of over 195?",
    "evidence": "weight of over 195 refers to weight>195",
    "idx": 5842
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`hof`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`hofid` = `t2`.`hofid`\nAND (`t1`.`shootcatch` IS NULL)\nRETURN DISTINCT `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the first name of the players who are good at both left hands and right hands for goalie and have gotten in the Hall of Fame.",
    "evidence": "good at both left hands and right hands for goalie refers to shootCatch IS NULL",
    "idx": 5843
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`hof`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`hofid` = `t2`.`hofid`\nAND (NOT `t1`.`playerid` IS NULL AND NOT `t1`.`coachid` IS NULL)\nRETURN COUNT(`t1`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players who became coaches, how many of them have gotten in the Hall of Fame?",
    "evidence": "players who became coaches refers to playerID IS NOT NULL AND coachID IS NOT NULL",
    "idx": 5844
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardsplayers`)-[received_by_0:received_by]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`year` = 1970)\nRETURN DISTINCT `t1`.`birthcity` AS `birthcity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the birth cities of the players who have won an award in the year 1970.",
    "evidence": "",
    "idx": 5845
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardsplayers`)-[received_by_0:received_by]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`award` = 'All-Rookie' AND `t1`.`birthcity` = 'Toronto')\nRETURN COUNT(`t1`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players born in Toronto have won the All-Rookie award?",
    "evidence": "born in Toronto refers to birthCity = 'Toronto'",
    "idx": 5846
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardsplayers`)-[received_by_0:received_by]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`award` = 'All-Rookie' AND NOT `t1`.`deathyear` IS NULL)\nRETURN COUNT(`t1`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players who have won the All-Rookie award, how many of them have died?",
    "evidence": "have died refers to deathYear IS NOT NULL",
    "idx": 5847
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardsplayers`)-[received_by_0:received_by]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`deathstate` = 'MA')\nRETURN COUNT(DISTINCT `t1`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players who died in Massachussets, how many of them have won an award?",
    "evidence": "died in Massachussets refers to deathState = 'Massachussets'",
    "idx": 5848
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardsplayers`)-[received_by_0:received_by]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`deathcity` = 'Kemptville')\nRETURN `t2`.`award` AS `award`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the awards the players who died in Arlington have won.",
    "evidence": "died in Arlington refers to deathCity = 'Arlington'",
    "idx": 5849
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardsplayers`)-[received_by_0:received_by]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`award` = 'All-Rookie' AND `t1`.`birthmon` = '3')\nRETURN DISTINCT `t1`.`namenick` AS `namenick`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the nicknames of the players who have won the All-Rookie award and are born in March.",
    "evidence": "born in March refers to birthMon = '3'; nicknames refers to nameNick",
    "idx": 5850
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`hof`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`hofid` = `t2`.`hofid`\nAND (`t1`.`birthmon` IN [7, 8])\nRETURN COUNT(`t1`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players who were born in July and August, how many of them got in the Hall of Fame?",
    "evidence": "born in July and August refers to birthMon IN('7','8')",
    "idx": 5851
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardsplayers`)-[received_by_0:received_by]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`birthcountry` = 'Canada' AND `t2`.`award` = 'All-Rookie')\nRETURN DISTINCT `t1`.`pos` AS `pos`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the positions of the players who were born in Canada and have won the All-Rookie award.",
    "evidence": "born in Canada refers to birthCountry = 'Canada'; pos = 'LW' refers to left winger; pos = 'RW' refers to right winger; pos = 'C' refers to center; pos = 'G' refers to goalie; pos = 'D' refers to defenceman; pos = 'W' refers to winger; pos = 'F' refers to forward",
    "idx": 5852
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`hof`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`hofid` = `t2`.`hofid`\nRETURN CASE WHEN COUNT(`t1`.`coachid`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN toFloat((toFloat(`t1`.`height`) * toFloat(`t1`.`height`)))=0 THEN NULL ELSE toFloat(`t1`.`weight`) / toFloat((toFloat(`t1`.`height`) * toFloat(`t1`.`height`))) END)) / COUNT(`t1`.`coachid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average BMI of all the coaches who have gotten in the Hall of Fame?",
    "evidence": "average BMI = divide(sum(divide(weight, multiply(height, height))), count(coachID))",
    "idx": 5853
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`hof`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`hofid` = `t2`.`hofid`\nRETURN CASE WHEN COUNT(`t1`.`playerid`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`birthcountry` = 'USA' THEN `t1`.`playerid` ELSE NULL END)) * 100 / COUNT(`t1`.`playerid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of American players among all the players who have gotten in the Hall of Fame?",
    "evidence": "percentage of American players = divide(count(hofID where birthCountry = 'USA'), count(hofID))*100%",
    "idx": 5854
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`playerid` = 'healygl01'\nRETURN COUNT(`goalies`.`year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many years did player Id \"healygl01\" play?",
    "evidence": "years of playing = MAX(year)-MIN(year)",
    "idx": 5855
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`playerid` = 'roypa01' AND `goalies`.`year` = 1992\nRETURN `goalies`.`tmid` AS `tmid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team did player Id \"roypa01\" play in 1992? Give the team id.",
    "evidence": "team id refers to tmID",
    "idx": 5856
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`playerid` = 'rutlewa01' AND `goalies`.`year` = 1967\nRETURN `goalies`.`gp` AS `gp`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the total number of the games that player Id \"rutlewa01\" played in 1967?",
    "evidence": "total number of the games refers to GP",
    "idx": 5857
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`playerid` = 'valiqst01' AND `goalies`.`year` = 2007\nRETURN `goalies`.`min` AS `min`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show me how many minutes player Id \"valiqst01\" played in the game in 2007 season.",
    "evidence": "show me how many minutes refers to Min",
    "idx": 5858
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`playerid` = 'vanbijo01' AND `goalies`.`year` = 1990\nRETURN `goalies`.`w` AS `w`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many games did player Id \"vanbijo01\" win in the 1990 season?",
    "evidence": "the number of wins refers to W",
    "idx": 5859
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`playerid` = 'vernomi01' AND `goalies`.`year` = 1998\nRETURN `goalies`.`t/ol` AS `t/ol`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In how many games did player Id \"vernomi01\" end up with a tie or an overtime loss in the 1998 season?",
    "evidence": "end up with a tie or an overtime loss refers to T/OL",
    "idx": 5860
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardscoaches`)-[received_by_0:received_by]->(`t1`:`coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`year` = 1933 AND `t2`.`award` = 'Second Team All-Star')\nRETURN sum(`t1`.`w`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the coach who won Second Team All-Star in 1933, how many wins did he have that year?",
    "evidence": "the number of wins refers to count(w)",
    "idx": 5861
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`master`)\nOPTIONAL MATCH (`t1`:`awardsmisc`)\nWHERE `t2`.`legendsid` = 'P194502'\nAND `t1`.`id` = `t2`.`playerid`\nRETURN CASE WHEN `t1`.`note` = 'posthumous' THEN 'YES' ELSE 'NO' END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Did legendsID \"P194502\" personally attend his Hall of Fame dedication?",
    "evidence": "note = 'posthumous'refers to \"didn't personally attend\"",
    "idx": 5862
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardsplayers`)-[received_by_0:received_by]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`firstname` = 'Mike' AND `t1`.`lastname` = 'Antonovich')\nRETURN `t1`.`pos` AS `pos`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which position did Mike Antonovich play?",
    "evidence": "pos = 'LW' refers to left winger; pos = 'RW' refers to right winger; pos = 'C' refers to center; pos = 'G' refers to goalie; pos = 'D' refers to defenceman; pos = 'W' refers to winger; pos = 'F' refers to forward",
    "idx": 5863
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`master`)-[coach_profile_0:coach_profile]->(`t2`:`coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`year` = 1998 AND `t2`.`notes` = 'co-coach with Dave Lewis')\nRETURN `t1`.`birthcountry` AS `birthcountry`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the coach who co-coached with Dave Lewis in 1998, where was his birth place?",
    "evidence": "co-coached refers to notes = 'co-coach'; birth place refers to 'birthCountry-birthState-birthCity'",
    "idx": 5864
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`stint` = 3)\nORDER BY `t1`.`weight` IS NULL ASC, `t1`.`weight` DESC \nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which player who showed as the third goalie in a game has the biggest weight? Give the full name of the player.",
    "evidence": "the third goalie refers to stint = 3; the biggest weight refers to max(weight)",
    "idx": 5865
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`master`)-[coach_profile_0:coach_profile]->(`t2`:`coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`year` = 2009)\nORDER BY CASE WHEN (`t2`.`w` + `t2`.`l`)=0 THEN NULL ELSE toFloat(`t2`.`w`) / (`t2`.`w` + `t2`.`l`) END IS NULL ASC, CASE WHEN (`t2`.`w` + `t2`.`l`)=0 THEN NULL ELSE toFloat(`t2`.`w`) / (`t2`.`w` + `t2`.`l`) END DESC \nRETURN `t2`.`coachid` AS `coachid`, `t1`.`namenick` AS `namenick`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which coach had the highest winning rates in the 2009 season? What's coach's nickname.",
    "evidence": "the highest winning rate refer to divide(W, sum(W, L))",
    "idx": 5866
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`coaches`)\nMATCH (`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid`\nAND (`t2`.`year` = 2011)\nORDER BY CASE WHEN toFloat(toFloat(`t2`.`ppc`))=0 THEN NULL ELSE toFloat(toFloat(`t2`.`ppg`)) / toFloat(toFloat(`t2`.`ppc`)) END IS NULL ASC, CASE WHEN toFloat(toFloat(`t2`.`ppc`))=0 THEN NULL ELSE toFloat(toFloat(`t2`.`ppg`)) / toFloat(toFloat(`t2`.`ppc`)) END DESC \nRETURN `t1`.`coachid` AS `coachid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the team had the biggest power play percentage in 2011, who was their coach that season? Give the full name.",
    "evidence": "the biggest power play percentage = max(divide(PPG, PPC))",
    "idx": 5867
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH ()-[scoringsc:played_for]->()\nWHERE `scoringsc`.`playerid` = 'cleghsp01'\nRETURN COUNT(`scoringsc`.`year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many years did player Id \"cleghsp01\" make to the Stanley Cup finals?",
    "evidence": "the number of years refers to count(year)",
    "idx": 5869
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH ()-[scoringsc:played_for]->()\nWHERE `scoringsc`.`playerid` = 'dyeba01' AND `scoringsc`.`year` = 1921\nRETURN `scoringsc`.`g` AS `g`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the number of goals did player Id \"dyeba01\" make in the 1921 Stanley Cup finals?",
    "evidence": "the number of goals refers to G",
    "idx": 5870
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH ()-[scoringsc:played_for]->()\nORDER BY `scoringsc`.`a` IS NULL ASC, `scoringsc`.`a` DESC \nRETURN `scoringsc`.`playerid` AS `playerid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who made the most assists in a single game in the Stanley Cup finals ?",
    "evidence": "the most assists refers to max(A)",
    "idx": 5871
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH ()-[scoringsc:played_for]->()\nWHERE `scoringsc`.`playerid` = 'hartgi01'\nRETURN DISTINCT `scoringsc`.`pos` AS `pos`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What position did player id \"hartgi01\" play in his Stanley Cup finals performance?",
    "evidence": "position refers to pos",
    "idx": 5873
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`goalies`)\nMATCH (`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid`\nAND (`t2`.`year` = 2011)\nWITH `t1`.`tmid` AS _groupby_col_0, COUNT(DISTINCT `t1`.`playerid`) AS _groupby_col_1, sum(`t2`.`w`) AS _groupby_col_2\nWHERE _groupby_col_1 = 3\nRETURN _groupby_col_2 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the team which had three different goalies in the 2011 postseason games, how many games did they win in the regular season?",
    "evidence": "three different goalies refer to count(playerID) = 3; game won refers to W",
    "idx": 5874
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`year` = 2008)\nORDER BY `t2`.`postsa` IS NULL ASC, `t2`.`postsa` DESC \nRETURN `t1`.`birthyear` AS `birthyear`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which year was the goalie who had the most postseaon shots Against in 2008 born?",
    "evidence": "the most postseason shots Against refers to max(PostSA); year born refers to birthYear",
    "idx": 5875
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`master`)-[coach_profile_0:coach_profile]->(`t2`:`coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t1`.`firstname` = 'Don' AND `t1`.`lastname` = 'Waddell')\nRETURN MAX(`t2`.`year`) - min(`t2`.`year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many years were there after Don Waddell retired and became a coach in NHL?",
    "evidence": "after retired and became a coach refers to max(subtract(year, lastNHL))",
    "idx": 5876
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`year` = 1996)\nORDER BY `t2`.`sho` IS NULL ASC, `t2`.`sho` DESC \nRETURN `t1`.`shootcatch` AS `shootcatch`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which is the catching hand for the goaltender who had the most shutouts in 1996?",
    "evidence": "the most shutouts refers to max(SHO); catching hand for the goaltender refers to shootCatch; shootCatch = 'L' refers to lefthand; shootCatch = 'R' refers to righthand; shootCatch = 'null' or 'empty' means this player is good at both left and right hand",
    "idx": 5877
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`year` = 1965)\nORDER BY `t2`.`ga` IS NULL ASC, `t2`.`ga` DESC \nRETURN `t1`.`birthyear` AS `birthyear`, `t1`.`birthmon` AS `birthmon`, `t1`.`birthday` AS `birthday`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was the birthday for the goalie who had most goal againsts in 1965 season?",
    "evidence": "Birthday refers to CONCAT(birthYear / birthMon / birthDate);most goal against refers to MAX(GA);1965 season refers to year = '1965'\n\n",
    "idx": 5878
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`scoring`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`firstname` = 'Cam' AND `t1`.`lastname` = 'Neely' AND `t2`.`year` = '1990')\nRETURN `t2`.`sog` AS `sog`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many shots on goal did Cam Neely had in the year of 1990?",
    "evidence": "1990 refers to the year played; Shot on goal refers to SOG\n",
    "idx": 5879
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`goalies`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`year` = '1978' AND `t2`.`weight` > '190')\nORDER BY `t1`.`ga` IS NULL ASC, `t1`.`ga` DESC \nRETURN `t1`.`playerid` AS `playerid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the goalies whose weight are above 190, who had most goal againsts in 1978 season?",
    "evidence": "Weight of above 190 refers to weight >190; 1978 season refers to the year played",
    "idx": 5880
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`goalies`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`year` = 2011)\nORDER BY 1 - CASE WHEN toFloat(toFloat(`t1`.`postsa`))=0 THEN NULL ELSE toFloat(toFloat(`t1`.`postga`)) / toFloat(toFloat(`t1`.`postsa`)) END IS NULL ASC, 1 - CASE WHEN toFloat(toFloat(`t1`.`postsa`))=0 THEN NULL ELSE toFloat(toFloat(`t1`.`postga`)) / toFloat(toFloat(`t1`.`postsa`)) END DESC \nRETURN `t2`.`legendsid` AS `legendsid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the goalie who had the highest defensive success rate in the postseason of 2011, what's his legends ID ?",
    "evidence": "Post season of 2011 refers to year = ’2011’\ndefensive success rate refers to (SUBTRACT(1 (DIVIDE(PostGA/PostSA)), *100%)\n",
    "idx": 5881
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE NOT `master`.`playerid` IS NULL AND NOT `master`.`coachid` IS NULL\nRETURN COUNT(`master`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many former athletes go on to become coaches after retiring?",
    "evidence": "",
    "idx": 5882
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`teams`:`teams`)\nORDER BY `teams`.`t` IS NULL ASC, `teams`.`t` DESC \nRETURN `teams`.`benchminor` AS `benchminor`, `teams`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the teams with the most number of ties, how many penalty was committed by a player or coach that is not on the ice? Indicate the name of the team.",
    "evidence": "penalty refers to BenchMinor; Ties refer to T",
    "idx": 5883
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`hof`:`hof`)\nWHERE `hof`.`year` >= 1950 AND `hof`.`year` <= 1980 AND `hof`.`category` = 'Player'\nRETURN CASE WHEN 30=0 THEN NULL ELSE toFloat(COUNT(`hof`.`name`)) / 30 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players were included in the Hall of Fame on average between 1950 and 1980?",
    "evidence": "year BETWEEN 1950 and 1980; average = DIVIDE(COUNT(hofID)), 30)\n\n",
    "idx": 5884
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`teamsplits`:`teamsplits`)\nWHERE `teamsplits`.`year` = '2005'\nORDER BY `teamsplits`.`rw` IS NULL ASC, `teamsplits`.`rw` DESC \nRETURN `teamsplits`.`tmid` AS `tmid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team recorded the most number of road victories in 2005? Indicate the team ID.",
    "evidence": "road victories refers to rW; team id refers to tmID; victories and wins are synonyms\n\n",
    "idx": 5885
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE NOT `master`.`birthyear` IS NULL\nORDER BY `master`.`birthyear` IS NULL DESC, `master`.`birthyear` , `master`.`birthmon` IS NULL DESC, `master`.`birthmon` , `master`.`birthday` IS NULL DESC, `master`.`birthday`  \nRETURN `master`.`pos` AS `pos`  LIMIT 8",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the position of the 9th oldest hockey player?",
    "evidence": "position refers to pos; date of birth refers to birthDay + birthMon + birthYear",
    "idx": 5886
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`lgid` = 'WCHL' AND `goalies`.`year` = '1924'\nWITH `goalies`.`playerid` AS _groupby_col_0, sum(`goalies`.`postga`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many goals were scored while the goalkeeper was on the ice in the 1924 WCHL by the goalie with the most goals scored?",
    "evidence": "WCHL is the league's abbreviated name which refers to lgID = 'WCHL'; most goals scored referst to MAX(PostGA); GA is abbreviation for Post Against which means number of goals recorded while the goalie is on the ice. Include all goals against during regulation and overtime play.",
    "idx": 5887
  }
]