[
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t2`:`staff`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`staff_address_id`\nWITH `t1`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `city`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which city lives most of staffs? List the city name and number of staffs.",
    "evidence": "",
    "idx": 6670
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t2`:`staff`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`staff_address_id`\nWITH `t1`.`state_province_county` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2 AND _groupby_col_1 <= 4\nRETURN _groupby_col_0 AS `state_province_county`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the states which have between 2 to 4 staffs living there.",
    "evidence": "",
    "idx": 6672
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t2`:`staff`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`staff_address_id`\nWITH `t1`.`state_province_county` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2 AND _groupby_col_1 <= 4\nRETURN _groupby_col_0 AS `state_province_county`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the states that have 2 to 4 employees living there?",
    "evidence": "",
    "idx": 6673
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`first_name` AS `first_name`, `customers`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the first name and last name of all customers.",
    "evidence": "",
    "idx": 6674
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`first_name` = 'Carole'\nRETURN `customers`.`email_address` AS `email_address`, `customers`.`date_of_birth` AS `date_of_birth`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List email address and birthday of customer whose first name as Carole.",
    "evidence": "",
    "idx": 6676
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`amount_outstanding` > 2000\nRETURN `customers`.`phone_number` AS `phone_number`, `customers`.`email_address` AS `email_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List phone number and email address of customer with more than 2000 outstanding balance.",
    "evidence": "",
    "idx": 6678
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`customers`:`customers`)\nWITH `customers`.`customer_status_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `customer_status_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all customer status codes and the number of customers having each status code.",
    "evidence": "",
    "idx": 6688
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN MAX(`customers`.`amount_outstanding`) AS `_col_0`, min(`customers`.`amount_outstanding`) AS `_col_1`, avg(`customers`.`amount_outstanding`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is maximum, minimum and average amount of outstanding of customer?",
    "evidence": "",
    "idx": 6692
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN MAX(`customers`.`amount_outstanding`) AS `_col_0`, min(`customers`.`amount_outstanding`) AS `_col_1`, avg(`customers`.`amount_outstanding`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum, minimum, and average amount of money outsanding for all customers?",
    "evidence": "",
    "idx": 6693
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`amount_outstanding` >= 1000 AND `customers`.`amount_outstanding` <= 3000\nRETURN `customers`.`first_name` AS `first_name`, `customers`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the first name and last name of customers have the amount of outstanding between 1000 and 3000.",
    "evidence": "",
    "idx": 6694
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t1`:`customers`)-[has_address_0:has_address]->(`t2`:`addresses`)\nWHERE `t1`.`customer_address_id` = `t2`.`address_id`\nAND (`t2`.`city` = 'Lockmanfurt')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List first name and last name of customers lived in city Lockmanfurt.",
    "evidence": "",
    "idx": 6696
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t1`:`customer_payments`)-[made_by_0:made_by]->(`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'Carole' AND `t2`.`last_name` = 'Bernhard')\nRETURN sum(`t1`.`amount_payment`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How much in total does customer with first name as Carole and last name as Bernhard paid?",
    "evidence": "",
    "idx": 6702
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t1`:`customer_payments`)-[made_by_0:made_by]->(`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'Carole' AND `t2`.`last_name` = 'Bernhard')\nRETURN sum(`t1`.`amount_payment`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of moeny paid by the customer Carole Bernhard?",
    "evidence": "",
    "idx": 6703
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "WITH *, COLLECT { MATCH (`customer_payments_sub0`:`customer_payments`)\nRETURN `customer_payments_sub0`.`customer_id` AS `customer_id`   } AS in_collect_0\nMATCH (`customers`:`customers`)\nWHERE NOT `customers`.`customer_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the number of customers that did not have any payment history.",
    "evidence": "",
    "idx": 6704
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`customer_payments`:`customer_payments`)\nWITH `customer_payments`.`payment_method_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `payment_method_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all payment methods and number of payments using each payment methods.",
    "evidence": "",
    "idx": 6706
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t1`:`lessons`)-[instructed_by_0:instructed_by]->(`t2`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`first_name` = 'Janessa' AND `t2`.`last_name` = 'Sawayn' AND `t2`.`nickname` =~ '(?i)(?s).*s.*')\nRETURN `t1`.`lesson_id` AS `lesson_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List lesson id of all lessons taught by staff with first name as Janessa, last name as Sawayn and nickname containing letter 's'.",
    "evidence": "",
    "idx": 6710
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t1`:`lessons`)-[instructed_by_0:instructed_by]->(`t2`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`first_name` = 'Janessa' AND `t2`.`last_name` = 'Sawayn' AND `t2`.`nickname` =~ '(?i)(?s).*s.*')\nRETURN `t1`.`lesson_id` AS `lesson_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the the lesson ids of all staff taught by Janessa Sawayn whose nickname has the letter s?",
    "evidence": "",
    "idx": 6711
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t1`:`lessons`)-[instructed_by_0:instructed_by]->(`t2`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`first_name` =~ '(?i)(?s).*a.*')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many lessons taught by staff whose first name has letter 'a' in it?",
    "evidence": "",
    "idx": 6712
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t1`:`lessons`)-[instructed_by_0:instructed_by]->(`t2`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`first_name` =~ '(?i)(?s).*a.*')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many lessons were taught by a staff member whose first name has the letter 'a' in it?",
    "evidence": "",
    "idx": 6713
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nRETURN DISTINCT `faculty`.`rank` AS `rank`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the list of distinct ranks for faculty.",
    "evidence": "",
    "idx": 6721
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nRETURN DISTINCT `faculty`.`building` AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the distinct buildings that have faculty rooms.",
    "evidence": "",
    "idx": 6722
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nRETURN `faculty`.`rank` AS `rank`, `faculty`.`fname` AS `fname`, `faculty`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the rank, first name, and last name for all the faculty.",
    "evidence": "",
    "idx": 6724
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nRETURN `faculty`.`rank` AS `rank`, `faculty`.`fname` AS `fname`, `faculty`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the rank, first name, and last name of the faculty members?",
    "evidence": "",
    "idx": 6725
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`sex` = 'F'\nRETURN `faculty`.`fname` AS `fname`, `faculty`.`lname` AS `lname`, `faculty`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the first name, last name, and phone number for all female faculty members.",
    "evidence": "",
    "idx": 6726
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`sex` = 'M'\nRETURN `faculty`.`facid` AS `facid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show ids for all the male faculty.",
    "evidence": "",
    "idx": 6728
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`sex` = 'F' AND `faculty`.`rank` = 'Professor'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of female Professors we have.",
    "evidence": "",
    "idx": 6731
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`fname` = 'Jerry' AND `faculty`.`lname` = 'Prince'\nRETURN `faculty`.`phone` AS `phone`, `faculty`.`room` AS `room`, `faculty`.`building` AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the phone, room, and building for the faculty named Jerry Prince.",
    "evidence": "",
    "idx": 6732
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`rank` = 'Professor' AND `faculty`.`building` = 'NEB'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of Professors who have office in building NEB.",
    "evidence": "",
    "idx": 6735
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`rank` = 'Instructor'\nRETURN `faculty`.`fname` AS `fname`, `faculty`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the first name and last name for all the instructors.",
    "evidence": "",
    "idx": 6736
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWITH `faculty`.`building` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `building`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the buildings along with the number of faculty members the buildings have.",
    "evidence": "",
    "idx": 6738
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWITH `faculty`.`building` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `building`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many faculty members does each building have? List the result with the name of the building.",
    "evidence": "",
    "idx": 6739
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`rank` = 'Professor'\nWITH `faculty`.`building` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 10\nRETURN _groupby_col_0 AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the buildings that have at least 10 professors.",
    "evidence": "",
    "idx": 6740
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWITH `faculty`.`rank` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `rank`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each faculty rank, show the number of faculty members who have it.",
    "evidence": "",
    "idx": 6742
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWITH `faculty`.`rank` AS _groupby_col_0, `faculty`.`sex` AS _groupby_col_1, COUNT(*) AS _groupby_col_2\nRETURN _groupby_col_0 AS `rank`, _groupby_col_1 AS `sex`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the ranks and the number of male and female faculty for each rank.",
    "evidence": "",
    "idx": 6744
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`rank` = 'AsstProf'\nWITH `faculty`.`sex` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `sex`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of male and female assistant professors.",
    "evidence": "",
    "idx": 6746
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nAND (`t2`.`fname` = 'Linda' AND `t2`.`lname` = 'Smith')\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first name and last name of Linda Smith's advisor?",
    "evidence": "",
    "idx": 6748
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nAND (`t2`.`fname` = 'Linda' AND `t2`.`lname` = 'Smith')\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the advisor of Linda Smith? Give me the first name and last name.",
    "evidence": "",
    "idx": 6749
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nAND (`t1`.`rank` = 'Professor')\nRETURN `t2`.`stuid` AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ids of students whose advisors are professors.",
    "evidence": "",
    "idx": 6750
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nAND (`t1`.`rank` = 'Professor')\nRETURN `t2`.`stuid` AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which students have professors as their advisors? Find their student ids.",
    "evidence": "",
    "idx": 6751
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nAND (`t1`.`fname` = 'Michael' AND `t1`.`lname` = 'Goodrich')\nRETURN `t2`.`fname` AS `fname`, `t2`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show first name and last name for all the students advised by Michael Goodrich.",
    "evidence": "",
    "idx": 6752
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nAND (`t1`.`fname` = 'Michael' AND `t1`.`lname` = 'Goodrich')\nRETURN `t2`.`fname` AS `fname`, `t2`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which students are advised by Michael Goodrich? Give me their first and last names.",
    "evidence": "",
    "idx": 6753
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nWITH `t1`.`facid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `facid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the faculty id of each faculty member, along with the number of students he or she advises.",
    "evidence": "",
    "idx": 6754
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nWITH `t1`.`facid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `facid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the faculty id and the number of students each faculty has?",
    "evidence": "",
    "idx": 6755
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nWITH `t1`.`rank` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `rank`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the faculty ranks and the number of students advised by each rank.",
    "evidence": "",
    "idx": 6756
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nWITH `t1`.`rank` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `rank`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students are advised by each rank of faculty? List the rank and the number of students.",
    "evidence": "",
    "idx": 6757
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nWITH `t1`.`facid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `facid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ids for all the faculty members who have at least 2 students.",
    "evidence": "",
    "idx": 6758
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t2`:`student`)\nMATCH (`t1`:`faculty`)\nWHERE `t1`.`facid` = `t2`.`advisor`\nWITH `t1`.`facid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `facid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which faculty members advise two ore more students? Give me their faculty ids.",
    "evidence": "",
    "idx": 6759
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`activity`:`activity`)\nRETURN `activity`.`activity_name` AS `activity_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the activities we have.",
    "evidence": "",
    "idx": 6761
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`activity`:`activity`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of activities available.",
    "evidence": "",
    "idx": 6763
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t1`:`faculty`)-[t2:participates_in]->()\nWHERE `t1`.`facid` = `t2`.`facid`\nAND (`t1`.`fname` = 'Mark' AND `t1`.`lname` = 'Giuliano')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many activities does Mark Giuliano participate in?",
    "evidence": "",
    "idx": 6766
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t1`:`faculty`)-[t2:participates_in]->()\nWHERE `t1`.`facid` = `t2`.`facid`\nAND (`t1`.`fname` = 'Mark' AND `t1`.`lname` = 'Giuliano')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of activities Mark Giuliano is involved in.",
    "evidence": "",
    "idx": 6767
  },
  {
    "filename": "train_spider.json",
    "db_id": "activity_1",
    "gql_statement": "MATCH (`t1`:`faculty`)-[t2:participates_in]->(`t3`:`activity`)\nWHERE `t1`.`facid` = `t2`.`facid`\nAND `t3`.`actid` = `t2`.`actid`\nAND (`t1`.`fname` = 'Mark' AND `t1`.`lname` = 'Giuliano')\nRETURN `t3`.`activity_name` AS `activity_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of all the activities Mark Giuliano participates in.",
    "evidence": "",
    "idx": 6768
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`city` = 'Goroka'\nRETURN `airports`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the airport in the city of Goroka.",
    "evidence": "",
    "idx": 6770
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`city` = 'Goroka'\nRETURN `airports`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the airports in the city of Goroka?",
    "evidence": "",
    "idx": 6771
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`city` = 'New York'\nRETURN `airports`.`name` AS `name`, `airports`.`city` AS `city`, `airports`.`country` AS `country`, `airports`.`elevation` AS `elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, city, country, and altitude (or elevation) of the airports in the city of New York.",
    "evidence": "",
    "idx": 6772
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`city` = 'New York'\nRETURN `airports`.`name` AS `name`, `airports`.`city` AS `city`, `airports`.`country` AS `country`, `airports`.`elevation` AS `elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name, city, country, and elevation for every airport in the city of New York?",
    "evidence": "",
    "idx": 6773
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`country` = 'Russia'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many airlines does Russia has?",
    "evidence": "",
    "idx": 6776
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`country` = 'Russia'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of airlines based in Russia?",
    "evidence": "",
    "idx": 6777
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'Iceland'\nRETURN MAX(`airports`.`elevation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum elevation of all airports in the country of Iceland?",
    "evidence": "",
    "idx": 6778
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'Iceland'\nRETURN MAX(`airports`.`elevation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the highest elevation of an airport in the country of Iceland?",
    "evidence": "",
    "idx": 6779
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'Cuba' OR `airports`.`country` = 'Argentina'\nRETURN `airports`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the airports located in Cuba or Argentina.",
    "evidence": "",
    "idx": 6780
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`country` = 'Cuba' OR `airports`.`country` = 'Argentina'\nRETURN `airports`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all airports in Cuba or Argentina?",
    "evidence": "",
    "idx": 6781
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`name` =~ '(?i)(?s)Orbit.*'\nRETURN `airlines`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the country of the airlines whose name starts with 'Orbit'.",
    "evidence": "",
    "idx": 6782
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`name` =~ '(?i)(?s)Orbit.*'\nRETURN `airlines`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the countries of all airlines whose names start with Orbit?",
    "evidence": "",
    "idx": 6783
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`elevation` >= -50 AND `airports`.`elevation` <= 50\nRETURN `airports`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of airports whose altitude is between -50 and 50.",
    "evidence": "",
    "idx": 6784
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`elevation` >= -50 AND `airports`.`elevation` <= 50\nRETURN `airports`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all airports whose elevation is between -50 and 50?",
    "evidence": "",
    "idx": 6785
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nORDER BY `airports`.`elevation` IS NULL ASC, `airports`.`elevation` DESC \nRETURN `airports`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which country is the airport that has the highest altitude located in?",
    "evidence": "",
    "idx": 6786
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nORDER BY `airports`.`elevation` IS NULL ASC, `airports`.`elevation` DESC \nRETURN `airports`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the country of the airport with the highest elevation?",
    "evidence": "",
    "idx": 6787
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`name` =~ '(?i)(?s).*International.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of airports whose name contain the word 'International'.",
    "evidence": "",
    "idx": 6788
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_4",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`name` =~ '(?i)(?s).*International.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many airports' names have the word Interanation in them?",
    "evidence": "",
    "idx": 6789
  }
]