[
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'Maria' AND `t1`.`last_name` = 'Miller' AND CASE WHEN `t2`.`rental_date` is not NULL THEN apoc.temporal.format(`t2`.`rental_date`,'yyyy') ELSE NULL END = '2005')\nRETURN COUNT(`t2`.`rental_id`) AS `_col_0`, CASE WHEN COUNT(`t2`.`rental_id`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN CASE WHEN `t2`.`rental_date` is not NULL THEN apoc.temporal.format(`t2`.`rental_date`,'MM') ELSE NULL END = '7' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`rental_id`) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many titles did Mary Smith rent in 2005? Determine the percentage of titles rented in June 2005.",
    "evidence": "in June 2005 refers to month(rental_date) = 6 and year(rental_date) = 2005; percentage = divide(count(inventory_id where month(rental_date) = 6 and year(rental_date) = 2005), count(inventory_id)) * 100%",
    "idx": 7141
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`active` = 1\nRETURN COUNT(`customer`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many customers are still active?",
    "evidence": "active refers to active = 1",
    "idx": 7142
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rating` = 'PG-13'\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the films that are rated as PG-13.",
    "evidence": "film refers to title; rated as PG-13 refers to rating = 'PG-13'",
    "idx": 7143
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`city`)\nWHERE `t2`.`country_id` = `t1`.`country_id`\nAND (`t2`.`country` = 'United Arab Emirates')\nRETURN `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the cities that belong to United Arab Emirates.",
    "evidence": "United Arab Emirates refers to country = 'United Arab Emirates'",
    "idx": 7144
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`amount` > 10)\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List at least 5 customers who paid greater than $10. Provide the full name of the customers.",
    "evidence": "full name refers to first_name, last_name; greater than $10 refers to amount > 10",
    "idx": 7145
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`city`)\nWHERE `t2`.`country_id` = `t1`.`country_id`\nAND (`t2`.`country` = 'Philippines')\nRETURN `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List at least 3 cities under the country of Philippines.",
    "evidence": "",
    "idx": 7146
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film_actor`)\nMATCH (`t2`:`actor`)\nWHERE `t1`.`actor_id` = `t2`.`actor_id`\nAND (`t2`.`first_name` = 'LUCILLE' AND `t2`.`last_name` = 'TRACY')\nRETURN `t1`.`film_id` AS `film_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the description of the films starring Lucille Tracy?",
    "evidence": "",
    "idx": 7147
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`length` >= 100 AND `film`.`length` <= 110\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films have a duration between 100 to 110 minutes?",
    "evidence": "duration between 100 to 110 minutes refers to length between 100 and 110",
    "idx": 7148
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`last_name` = 'Dee'\nRETURN `actor`.`actor_id` AS `actor_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the actor ID of actors with Dee as their last name.",
    "evidence": "",
    "idx": 7149
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`first_name` = 'Nina' AND `customer`.`active` = 1\nRETURN COUNT(`customer`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the active customers, how many of them have Nina as their first name?",
    "evidence": "active refers to active = 1",
    "idx": 7150
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`inventory`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t2`.`store_id` = 2 AND `t1`.`rating` = 'R')\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In store ID 2, how many of the films are R rating?\n",
    "evidence": "R rating refers to rating = 'R'",
    "idx": 7151
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`inventory`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t1`.`title` = 'Amadeus Holy')\nRETURN `t2`.`store_id` AS `store_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the store ID of the film titled \"Amadeus Holy\".",
    "evidence": "",
    "idx": 7152
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`address` = '692 Joliet Street'\nRETURN `address`.`postal_code` AS `postal_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the postal code of the address 692 Joliet Street?",
    "evidence": "",
    "idx": 7153
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`active` = 1\nRETURN COUNT(`customer`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many customers are active?",
    "evidence": "active refers to active = 1",
    "idx": 7154
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`active` = 1 AND `customer`.`store_id` = 1\nRETURN COUNT(`customer`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the customers of store no.1, how many of them are active?",
    "evidence": "active refers to active = 1",
    "idx": 7155
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`address`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`first_name` = 'MARY' AND `t2`.`last_name` = 'SMITH')\nRETURN `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the address of Mary Smith?",
    "evidence": "",
    "idx": 7156
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'MARY' AND `t2`.`last_name` = 'SMITH')\nRETURN `t1`.`amount` AS `amount` ORDER BY `t1`.`amount` IS NULL ASC, `t1`.`amount` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the biggest amount of payment for a rental made by Mary Smith?",
    "evidence": "the biggest amount refers to max(amount)",
    "idx": 7157
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'MARY' AND `t2`.`last_name` = 'SMITH')\nRETURN COUNT(`t1`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times has Mary Smith rented a film?",
    "evidence": "",
    "idx": 7158
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'MARY' AND `t2`.`last_name` = 'SMITH')\nRETURN sum(`t1`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total amount of money Mary Smith has spent on film rentals?",
    "evidence": "the total amount = sum(amount)",
    "idx": 7159
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'MARY' AND `t2`.`last_name` = 'SMITH' AND CASE WHEN `t1`.`payment_date` is not NULL THEN apoc.temporal.format(`t1`.`payment_date`,'yyyy') ELSE NULL END = '2005' AND CASE WHEN `t1`.`payment_date` is not NULL THEN apoc.temporal.format(`t1`.`payment_date`,'yyyy') ELSE NULL END = '6')\nRETURN COUNT(`t1`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the times Mary Smith had rented a movie, how many of them happened in June, 2005?",
    "evidence": "in June 2005 refers to year(payment_date) = 2005 and month(payment_date) = 6",
    "idx": 7160
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nORDER BY `t1`.`amount` IS NULL ASC, `t1`.`amount` DESC \nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the full name of the customer who had made the biggest amount of payment in one single film rental.",
    "evidence": "full name refers to first_name, last_name; the biggest amount refers to max(amount)",
    "idx": 7161
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'MARY' AND `t2`.`last_name` = 'SMITH' AND `t1`.`amount` > 4.99)\nRETURN COUNT(`t1`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the payments made by Mary Smith, how many of them are over 4.99?",
    "evidence": "over 4.99 refers to amount > 4.99",
    "idx": 7162
  }
]