[
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (paragraphs@`paragraphs`)\nWHERE paragraphs.`chapter_id` = 18881\nRETURN COUNT(paragraphs.`paragraphnum`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many number of paragraphs are there in chapter ID 18881?",
    "evidence": "number of paragraphs refers to ParagraphNum",
    "idx": 1501
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (chapters@`chapters`)\nWHERE chapters.`work_id` = 9 AND chapters.`act` = 5\nRETURN COUNT(chapters.`scene`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many scenes are there in Act 5 of work ID 9?",
    "evidence": "",
    "idx": 1503
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (works@`works`)\nWHERE works.`date` > 1593\nRETURN sum(CASE WHEN works.`genretype` = 'Comedy' THEN 1 ELSE 0 END) - sum(CASE WHEN works.`genretype` = 'History' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From 1593 onwards, what is the difference between the number of comedy works and history works?",
    "evidence": "From 1593 onwards refers to Date > 1593; comedy works and history works refers to GenreType = 'comedy' and GenreType = 'History'",
    "idx": 1513
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (works@`works`)\nWHERE like(works.`title`,'%Henry%')\nRETURN works.`id` AS `id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the work numbers that are related to King Henry?",
    "evidence": "work numbers refers to works.id; related to King Henry refers to Title = '%Henry%'",
    "idx": 1515
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (characters@`characters`)\nWHERE characters.`description` = 'a senator of Venice'\nRETURN characters.`charname` AS `charname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the character names for a senator of Venice?",
    "evidence": "character names refers to CharName; a senator of Venice refers to characters.Description = 'a senator of Venice'",
    "idx": 1516
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t2@`paragraphs`)\nMATCH (t1@`characters`)\nWHERE t1.`id` = t2.`character_id`\nAND (t2.`paragraphnum` = 8 AND t2.`chapter_id` = 18820)\nRETURN t1.`charname` AS `charname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the character that can be found in paragraph 8 of chapter 18820?",
    "evidence": "name of the character refers to CharName; paragraph 8 refers to ParagraphNum = 8; chapter 18820 refers to chapter_id = 18820",
    "idx": 1517
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t2@`paragraphs`)\nMATCH (t1@`characters`)\nWHERE t1.`id` = t2.`character_id`\nAND (t2.`paragraphnum` = 3)\nRETURN DISTINCT t1.`charname` AS `charname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the character names in paragraph 3?",
    "evidence": "character names refers to CharName; paragraph 3 refers to ParagraphNum = 3",
    "idx": 1522
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t1.`title` = 'Titus Andronicus')\nRETURN cast (sum(CASE WHEN t2.`act` = 5 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`act`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of act number 5 in Titus Andronicus?",
    "evidence": "act number 5 refers to Act = 5; Titus Andronicus refers to Title = 'Titus Andronicus'; percentage = divide(sum(Act = 5), count(Act)) as percentage",
    "idx": 1526
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (works@`works`)\nWHERE works.`genretype` = 'Tragedy'\nRETURN COUNT(works.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the works of Shakespeare are Tragedy?",
    "evidence": "Tragedy refers to GenreType = 'Tragedy'",
    "idx": 1527
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t2@`chapters`)\nOPTIONAL MATCH (t1@`works`)\nWHERE t1.`title` = 'Venus and Adonis'\nAND t1.`id` = t2.`work_id`\nORDER BY t2.`scene` DESC NULLS LAST \nRETURN t2.`description` AS `description` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the Venus and Adonis, what is the description of the last scene listed?",
    "evidence": "Venus and Adonis refers to Title = 'Venus and Adonis'; last scene refers to max(Scene)",
    "idx": 1534
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`chapters`)\nMATCH (t2@`paragraphs`)\nWHERE t1.`id` = t2.`chapter_id`\nAND (t2.`plaintext` = 'What, wilt thou hear some music, my sweet love?')\nRETURN t1.`id` AS `id`, t1.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the chapter description where the paragraph \"What, wilt thou hear some music, my sweet love?\" belongs?",
    "evidence": "paragraph \"What, wilt thou hear some music, my sweet love?\" refers to  PlainText = 'What, wilt thou hear some music, my sweet love?'",
    "idx": 1536
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`donations`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`title` = 'Whistle While We Work!')\nRETURN sum(t2.`donation_to_project`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much donations have been collected for project 'Whistle While We Work!'?",
    "evidence": "donations collected refers to sum(donation_to_project); project 'Whistle While We Work!' refers to title = 'Whistle While We Work!'",
    "idx": 1547
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`donations`)-[donated_to_0:`donated_to`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nRETURN cast (sum(CASE  WHEN t2.`school_metro` = 'rural' THEN t1.`donation_to_project` ELSE 0 END) as float) * 100 / sum(t1.`donation_to_project`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From the total amount of donation to projects, what is the percentage of the amount is for school projects located in the rural area?",
    "evidence": "located in the rural area refers to school_metro = 'rural'; percentage = divide(sum(donation_to_project), sum(donation_to_project where school_metro = 'rural'))*100%",
    "idx": 1550
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t3@`donations`)-[donated_to_0:`donated_to`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND t2.`projectid` = t3.`projectid`\nORDER BY t2.`total_price_excluding_optional_support` DESC NULLS LAST \nRETURN t1.`title` AS `title`, sum(t3.`donation_to_project`) AS `_col_1`, cast ((t2.`total_price_excluding_optional_support` - sum(t3.`donation_to_project`)) as float) * 100 / sum(t3.`donation_to_project`) AS `_col_2` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Name the project that costs the most. How much has been collected from donation and what is the percentage amount still lacking?",
    "evidence": "project name refers to title; costs the most refers to max(total_price_excluding_optional_support); amount collected from donation refers to sum(donation_to_project); percentage amount refers to divide(subtract(total_price_excluding_optional_support, sum(donation_to_project)), sum(donation_to_project))*100%",
    "idx": 1551
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`school_district` = 'West New York School District' AND projects.`poverty_level` = 'highest poverty'\nRETURN COUNT(projects.`poverty_level`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many schools in the West New York School District have the highest poverty level?",
    "evidence": "the highest poverty level refers to poverty_level = 'highest poverty'",
    "idx": 1552
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`is_teacher_acct` = 't' AND donations.`donor_state` = 'CO'\nRETURN COUNT(donations.`donationid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many donations from teachers were done in the state of Colorado?",
    "evidence": "from teachers refers to is_teacher_acct = 't'; the state of Colorado refers to donor_state = 'CO-Colorado'",
    "idx": 1553
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`resource_type` = 'Books' AND t2.`school_metro` = 'urban')\nRETURN COUNT(t2.`schoolid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many schools in urban area requested for books resources?",
    "evidence": "urban area refers to school_metro = 'urban'; books resources refers to project_resource_type = 'Books'",
    "idx": 1564
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`donations`)-[donated_to_0:`donated_to`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`donor_city` = 'Los Angeles' AND NOT like(t2.`school_city`,'Los Angeles'))\nRETURN COUNT(t2.`schoolid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many donors in Los Angeles donated to school in another city?",
    "evidence": "in Los Angeles refers to donor_city = 'Los Angeles'; school in another city refers to school_city ! = 'Los Angeles'",
    "idx": 1565
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'Reading About Other Cultures'))\nRETURN t2.`teacher_prefix` AS `teacher_prefix`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the prefix for the teacher who handled the 'Reading About Other Cultures' project?",
    "evidence": "Reading About Other Cultures' project refers to title = 'Reading About Other Cultures'; prefix for the teacher refers to teacher_prefix",
    "idx": 1566
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'Fit Firsties!'))\nRETURN t2.`students_reached` AS `students_reached`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students will be impacted for the Fit Firsties! Project?",
    "evidence": "how many students refers to students_reached; Fit Firsties! project refers to title = 'Fit Firsties!'",
    "idx": 1567
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`is_teacher_acct` = 't' AND donations.`donor_city` = 'New York'\nRETURN COUNT(donations.`donationid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the donors from New York, how many of them are teachers?",
    "evidence": "from New York refers to donor_city = 'New York'; donor is a teacher refers to is_teacher_acct = 't';",
    "idx": 1571
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`for_honoree` = 't' AND donations.`donor_state` = 'NJ'\nRETURN COUNT(donations.`donationid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many donors from New Jersey have made a donation for an honoree?",
    "evidence": "from New Jersey refers to donor_state = 'NJ'; for an honoree refers to for_honoree = 't';",
    "idx": 1572
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`donationid` = 'a84dace1ff716f6f0c7af8ef9090a5d5'\nRETURN donations.`donation_message` AS `donation_message`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the donation message for donation ID a84dace1ff716f6f0c7af8ef9090a5d5?",
    "evidence": "",
    "idx": 1573
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (resources@`resources`)\nWHERE resources.`vendor_name` = 'Lakeshore Learning Materials'\nORDER BY resources.`item_quantity` DESC NULLS LAST \nRETURN resources.`item_name` AS `item_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the item that is provided in the biggest amount by the vendor Lakeshore Learning Materials?",
    "evidence": "lakeshore Learning Materials is vendor_name; biggest amount refers to Max(item_quantity);",
    "idx": 1575
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`teacher_ny_teaching_fellow` = 't' AND t2.`donor_city` = 'New York')\nRETURN COUNT(t1.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the projects created by a teacher from New York, how many of them have a donor from the same city?",
    "evidence": "New York is the donor city; donor from the same city refers to donor from New York in which teacher_ny_teaching_fellow = 't';",
    "idx": 1576
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`vendor_name` = 'Lakeshore Learning Materials' AND t2.`teacher_prefix` = 'Dr.')\nRETURN COUNT(t1.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many projects have their resources provided by the vendor Lakeshore Learning Materials and are created by a teacher with a doctor degree?",
    "evidence": "Lakeshore Learning Materials is vendor_name;  teacher with a doctor degree refers to teacher_prefix = 'Dr.';",
    "idx": 1577
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nORDER BY t2.`total_price_including_optional_support` - t2.`total_price_including_optional_support` DESC NULLS LAST \nRETURN t1.`vendor_name` AS `vendor_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the vendor of the resources needed by the project that had the highest cost of optional tip?",
    "evidence": "Highest cost of the optional tip refers to Max(total_price_including_optional_support - total_price_excluding_optional_support);",
    "idx": 1580
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`school_city` = 'Brooklyn')\nRETURN sum(t2.`donation_total`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total donated amount for projects created by a teacher working in a school in Brooklyn?",
    "evidence": "school in Brooklyn refers to school_city = 'Brooklyn'; total donated amount refers to donation_total;",
    "idx": 1581
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`payment_included_acct_credit` = 't' AND t1.`school_year_round` = 't')\nRETURN COUNT(t1.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the donations with a portion using account credits redemption, how many of them are for projects created by teachers working in a public year-round school?",
    "evidence": "portion using account credits redemption refers to payment_included_acct_credit = 't'; year-round school refers to school_year_round = 't';",
    "idx": 1583
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`primary_focus_area` = 'Literacy & Language' AND t1.`project_resource_type` = 'Supplies')\nORDER BY t1.`item_quantity` DESC NULLS LAST \nRETURN t1.`item_name` AS `item_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the most requested item under the resource type \"Supplies\" for projects whose main subject area is Literacy & Language?",
    "evidence": "main subject area refers to primary_focus_area = 'Literacy & Language'; resource type supplies refers to project_resource_type = 'Supplies'; most requested item refers to Max(item_quantity);",
    "idx": 1585
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`primary_focus_area` = 'Literacy & Language')\nORDER BY t1.`item_unit_price` DESC NULLS LAST \nRETURN t1.`item_name` AS `item_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which item provided to a project whose main subject area is Literacy & Language has the highest unit price?",
    "evidence": "main subject area refers to primary_focus_area = 'Literacy & Language'; highest unit price refers to Max(item_unit_price);",
    "idx": 1586
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`school_city` = 'Brooklyn')\nRETURN sum(t2.`donation_total`) / COUNT(t2.`donationid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average donation amount to a project created by a teacher working in a school in Brooklyn?",
    "evidence": "school in Brooklyn refers to school_city = 'Brooklyn'; Average = AVG(donation_total);",
    "idx": 1587
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`donor_acctid` = '22cbc920c9b5fa08dfb331422f5926b5'\nRETURN DISTINCT donations.`donor_city` AS `donor_city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "To which city did donor “22cbc920c9b5fa08dfb331422f5926b5” donate?",
    "evidence": "donor “22cbc920c9b5fa08dfb331422f5926b5” refers to donor_acctid = '22cbc920c9b5fa08dfb331422f5926b5'; city refers to donor_city",
    "idx": 1588
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`donor_acctid` = '22cbc920c9b5fa08dfb331422f5926b5'\nRETURN DISTINCT donations.`is_teacher_acct` AS `is_teacher_acct`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Is donor “22cbc920c9b5fa08dfb331422f5926b5” a teacher?",
    "evidence": "donor “22cbc920c9b5fa08dfb331422f5926b5” refers to donor_acctid = '22cbc920c9b5fa08dfb331422f5926b5'; is a teacher refers to is_teacher_acct;",
    "idx": 1589
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`teacher_acctid` = '42d43fa6f37314365d08692e08680973'\nRETURN CASE  WHEN projects.`teacher_prefix` = 'Dr.' THEN 'Yes' ELSE 'NO' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Have the teacher \"42d43fa6f37314365d08692e08680973\" acquired P.h.D or doctor degree?",
    "evidence": "teacher \"42d43fa6f37314365d08692e08680973\" refers to teacher_acctid = '42d43fa6f37314365d08692e08680973';",
    "idx": 1590
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`teacher_acctid` = '42d43fa6f37314365d08692e08680973'\nRETURN projects.`teacher_ny_teaching_fellow` AS `end`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Is teacher \"42d43fa6f37314365d08692e08680973\" a New York teacher?",
    "evidence": "teacher \"42d43fa6f37314365d08692e08680973\"refers to teacher_acctid = '42d43fa6f37314365d08692e08680973';",
    "idx": 1591
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`school_magnet` = 't' AND t2.`payment_included_acct_credit` = 'f')\nRETURN COUNT(t1.`schoolid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the schools' projects whose donation didn't use account credits redemption,how many schools are public magnet schools?",
    "evidence": "donation didn't use account credits redemption refers to payment_included_acct_credit = 'f'; magnet school refers to school_magnet = 't';",
    "idx": 1594
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`school_magnet` = 't')\nRETURN cast (sum(CASE  WHEN t1.`project_resource_type` = 'Books' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among public magnet schools,what percentage of schools that receive the donated resources as books?",
    "evidence": "magnet school refers to school_magnet = 't'; donated resources as books refers to project_resource_type = 'Books'; percentage = Divide(Count(projectid) where project_resource_type = 'Books', Count(projectid))*100",
    "idx": 1596
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`school_magnet` = 't' AND t1.`vendor_name` = 'ABC School Supply')\nRETURN COUNT(t2.`schoolid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the schools donated by the project of the resources provided by ABC School Supply, how many schools are public magnet schools?",
    "evidence": "ABC School Supply is vendor_name;  public magnet school refers to school_magnet = 't';",
    "idx": 1597
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`poverty_level` = 'highest poverty' AND t2.`donor_acctid` = '000eebf28658900e63b538cf8a73afbd')\nRETURN COUNT(t1.`schoolid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the schools donated by donor \"000eebf28658900e63b538cf8a73afbd\",how many schools whose poverty level are highest?",
    "evidence": "donor \"000eebf28658900e63b538cf8a73afbd\" refers to donor_acctid = '000eebf28658900e63b538cf8a73afbd'; highest poverty level refers to poverty_level = 'highest poverty';",
    "idx": 1598
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`projects`)\nMATCH (t2@`essays`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`schoolid` = '301c9bf0a45d159d162b65a93fddd74e')\nRETURN t2.`short_description` AS `short_description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the short description of the project that gives donation to school “301c9bf0a45d159d162b65a93fddd74e”?",
    "evidence": "school “301c9bf0a45d159d162b65a93fddd74e\" refers to schoolid = '301c9bf0a45d159d162b65a93fddd74e';",
    "idx": 1599
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`is_teacher_acct` = 't')\nRETURN cast (sum(CASE  WHEN like(t1.`school_city`,'Brooklyn') THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`teacher_acctid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the schools whose donators are teachers, what is the percentage of schools that are in Brooklyn?",
    "evidence": "donors are teachers refers to is_teacher_acct = 't'; Brooklyn is school_city; percentage = Divide(Count(school_city-'Brooklyn'),Count(school_city))*100",
    "idx": 1604
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`is_teacher_acct` = 't')\nRETURN cast (sum(CASE  WHEN t1.`students_reached` > 30 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the projects whose donators are teachers, what is the percentage of projects that affected more than 30 students?",
    "evidence": "donors are teachers refers to is_teacher_acct = 't'; affect more than 30 students refers to students_reached>30; Percentage = Divide(Count(students_reached>30), Count(students_reached))*100",
    "idx": 1605
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`school_city` = 'Bethlehem' AND projects.`school_metro` = 'suburban'\nRETURN COUNT(projects.`schoolid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many schools which have suburban metro are there in Bethlehem?",
    "evidence": "Bethlehem is school_city; suburban metro refers to school_metro = 'suburban';",
    "idx": 1606
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`school_city` = 'Los Angeles' AND projects.`school_year_round` = 't'\nRETURN COUNT(projects.`school_year_round`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of the year round school in Los Angeles?",
    "evidence": "Los Angeles is school_city; year-round school refers to school_year_round = 't';",
    "idx": 1607
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`school_county` = 'Twin Falls' AND projects.`primary_focus_area` = 'Math & Science'\nRETURN COUNT(projects.`teacher_acctid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many teachers in Twin Falls have Math & Science as their primary focus area?",
    "evidence": "Twin Falls is school_country; 'Math & Science' is primary_focus_area;",
    "idx": 1609
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`teacher_prefix` = 'Mr.' AND projects.`primary_focus_subject` = 'Literature & Writing'\nRETURN COUNT(projects.`teacher_acctid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many teachers that have Literature & Writing as their primary focus subject use 'Mr' as their teacher prefix?",
    "evidence": "Literature & Writing' is primary_focus_subject; use 'Mr' as their teacher prefix refers to teacher_prefix = 'Mr';",
    "idx": 1610
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`school_district` = 'Boston Public School District' AND projects.`grade_level` = 'Grades 3-5'\nRETURN COUNT(projects.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of projects that was created by the teachers that teach 3-5 grades in Boston Public School District?",
    "evidence": "teach 3-5 grades refers to grade_level = 'Grades 3-5'; 'Boston Public School District' is school_district;",
    "idx": 1611
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`title` = 'ABC Read')\nRETURN t2.`school_city` AS `school_city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the teacher who wrote the project 'ABC Read', which city was he/she in?",
    "evidence": "ABC Read' is the title; city refers to school_city",
    "idx": 1612
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'Creating Memories and Inspiring Dreams%'))\nRETURN t2.`teacher_prefix` AS `teacher_prefix`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the teacher prefix for the teacher who wrote the project 'Creating Memories and Inspiring Dreams'?",
    "evidence": "Creating Memories and Inspiring Dreams is title;",
    "idx": 1613
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`donations`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'Calculate, Financial Security For Tomorrow Starts Today! '))\nRETURN t2.`is_teacher_acct` AS `is_teacher_acct`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Is the donor of the project 'Calculate, Financial Security For Tomorrow Starts Today! ' a teacher?",
    "evidence": "Calculate, Financial Security For Tomorrow Starts Today! ' is title; donor is a teacher refers to is_teacher_acct = 't'",
    "idx": 1614
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`donations`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'A Rug For Reaching Readers'))\nRETURN sum(t2.`donation_total`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many number of donations did the project 'A Rug For Reaching Readers' get?",
    "evidence": "A Rug For Reaching Readers'is the title;",
    "idx": 1616
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`donations`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'Engaging Young Readers with a Leveled Classroom Library '))\nRETURN sum(t2.`donation_to_project`) + sum(t2.`donation_optional_support`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total donation amount for the project 'Engaging Young Readers with a Leveled Classroom Library'?",
    "evidence": "Engaging Young Readers with a Leveled Classroom Library' is the title; total donation amount = Add(donation_to_project, donation_optional_support)",
    "idx": 1617
  }
]