[
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)\nMATCH (`t1`:`albums`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t1`.`title` = 'Balls to the Wall')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of all tracks in the album named Balls to the Wall?",
    "evidence": "",
    "idx": 1877
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nMATCH (`t2`:`tracks`)-[uses_media_type_0:uses_media_type]->(`t3`:`media_types`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND `t3`.`id` = `t2`.`media_type_id`\nAND (`t1`.`name` = 'Rock' AND `t3`.`name` = 'MPEG audio file')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of tracks belongs to genre Rock and whose media type is MPEG audio file.",
    "evidence": "",
    "idx": 1878
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nMATCH (`t2`:`tracks`)-[uses_media_type_0:uses_media_type]->(`t3`:`media_types`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND `t3`.`id` = `t2`.`media_type_id`\nAND (`t1`.`name` = 'Rock' AND `t3`.`name` = 'MPEG audio file')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all Rock tracks that are stored on MPEG audio files?",
    "evidence": "",
    "idx": 1879
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nMATCH (`t2`:`tracks`)-[uses_media_type_0:uses_media_type]->(`t3`:`media_types`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND `t3`.`id` = `t2`.`media_type_id`\nAND (`t1`.`name` = 'Rock' OR `t3`.`name` = 'MPEG audio file')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of tracks belongs to genre Rock or media type is MPEG audio file.",
    "evidence": "",
    "idx": 1880
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nMATCH (`t2`:`tracks`)-[uses_media_type_0:uses_media_type]->(`t3`:`media_types`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND `t3`.`id` = `t2`.`media_type_id`\nAND (`t1`.`name` = 'Rock' OR `t3`.`name` = 'MPEG audio file')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all tracks that belong to the Rock genre and whose media type is MPEG?",
    "evidence": "",
    "idx": 1881
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t1`.`name` = 'Rock' OR `t1`.`name` = 'Jazz')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of tracks belongs to genre Rock or genre Jazz.",
    "evidence": "",
    "idx": 1882
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t1`.`name` = 'Rock' OR `t1`.`name` = 'Jazz')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the tracks that are Rock or Jazz songs?",
    "evidence": "",
    "idx": 1883
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t1`:`tracks`)-[t2:in_playlist]->()\nMATCH (`t3`:`playlists`)-[t2:contains_track]->()\nWHERE `t1`.`id` = `t2`.`track_id`\nAND `t3`.`id` = `t2`.`playlist_id`\nAND (`t3`.`name` = 'Movies')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of all tracks in the playlists of Movies.",
    "evidence": "",
    "idx": 1884
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t1`:`tracks`)-[t2:in_playlist]->()\nMATCH (`t3`:`playlists`)-[t2:contains_track]->()\nWHERE `t1`.`id` = `t2`.`track_id`\nAND `t3`.`id` = `t2`.`playlist_id`\nAND (`t3`.`name` = 'Movies')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all tracks that are on playlists titled Movies?",
    "evidence": "",
    "idx": 1885
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`tracks`:`tracks`)\nWHERE `tracks`.`name` = 'Fast As a Shark'\nRETURN `tracks`.`unit_price` AS `unit_price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How much is the track Fast As a Shark?",
    "evidence": "",
    "idx": 1886
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`tracks`:`tracks`)\nWHERE `tracks`.`name` = 'Fast As a Shark'\nRETURN `tracks`.`unit_price` AS `unit_price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the unit price of the tune \"Fast As a Shark\"?",
    "evidence": "",
    "idx": 1887
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find number of tracks in each genre?",
    "evidence": "",
    "idx": 1888
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many tracks are in each genre?",
    "evidence": "",
    "idx": 1889
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`editor`:`editor`)\nORDER BY `editor`.`age` IS NULL DESC, `editor`.`age`  \nRETURN `editor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of editors in ascending order of age.",
    "evidence": "",
    "idx": 1891
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`editor`:`editor`)\nWHERE `editor`.`age` > 25\nRETURN `editor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of editors who are older than 25.",
    "evidence": "",
    "idx": 1893
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`editor`:`editor`)\nWHERE `editor`.`age` = 24 OR `editor`.`age` = 25\nRETURN `editor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of editors of age either 24 or 25.",
    "evidence": "",
    "idx": 1894
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`editor`:`editor`)\nWITH `editor`.`age` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `age`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different ages of editors? Show each age along with the number of editors of that age.",
    "evidence": "",
    "idx": 1896
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`journal`:`journal`)\nRETURN DISTINCT `journal`.`theme` AS `theme`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the distinct themes of journals.",
    "evidence": "",
    "idx": 1897
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`t2`:`editor`)-[t1:member_of]->(`t3`:`journal`)\nWHERE `t1`.`editor_id` = `t2`.`editor_id`\nAND `t1`.`journal_id` = `t3`.`journal_id`\nRETURN `t2`.`name` AS `name`, `t3`.`theme` AS `theme`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of editors and the theme of journals for which they serve on committees.",
    "evidence": "",
    "idx": 1898
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`t2`:`editor`)-[t1:member_of]->(`t3`:`journal`)\nWHERE `t1`.`editor_id` = `t2`.`editor_id`\nAND `t1`.`journal_id` = `t3`.`journal_id`\nRETURN `t2`.`name` AS `name`, `t3`.`theme` AS `theme`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each journal_committee, find the editor name and the journal theme.",
    "evidence": "",
    "idx": 1899
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`t2`:`editor`)-[t1:member_of]->(`t3`:`journal`)\nWHERE `t1`.`editor_id` = `t2`.`editor_id`\nAND `t1`.`journal_id` = `t3`.`journal_id`\nRETURN `t2`.`name` AS `name`, `t2`.`age` AS `age`, `t3`.`theme` AS `theme` ORDER BY `t3`.`theme` IS NULL DESC, `t3`.`theme`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names and ages of editors and the theme of journals for which they serve on committees, in ascending alphabetical order of theme.",
    "evidence": "",
    "idx": 1900
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`t2`:`editor`)-[t1:member_of]->(`t3`:`journal`)\nWHERE `t1`.`editor_id` = `t2`.`editor_id`\nAND `t1`.`journal_id` = `t3`.`journal_id`\nAND (`t3`.`sales` > 3000)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of editors that are on the committee of journals with sales bigger than 3000.",
    "evidence": "",
    "idx": 1901
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "MATCH (`t1`:`editor`)-[t2:member_of]->()\nWHERE `t1`.`editor_id` = `t2`.`editor_id`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of editors that are on at least two journal committees.",
    "evidence": "",
    "idx": 1902
  },
  {
    "filename": "train_spider.json",
    "db_id": "journal_committee",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[journal_committee_sub0:member_of]->()\nRETURN `journal_committee_sub0`.`editor_id` AS `editor_id`   } AS in_collect_0\nMATCH (`editor`:`editor`)\nWHERE NOT `editor`.`editor_id` IN in_collect_0\nRETURN `editor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of editors that are not on any journal committee.",
    "evidence": "",
    "idx": 1903
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of accounts.",
    "evidence": "",
    "idx": 1906
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN `accounts`.`account_id` AS `account_id`, `accounts`.`customer_id` AS `customer_id`, `accounts`.`account_name` AS `account_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show ids, customer ids, names for all accounts.",
    "evidence": "",
    "idx": 1907
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nWHERE `accounts`.`account_name` = '338'\nRETURN `accounts`.`other_account_details` AS `other_account_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show other account details for account with name 338.",
    "evidence": "",
    "idx": 1909
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`t1`:`accounts`)\nMATCH (`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`account_name` = '162')\nRETURN `t2`.`customer_first_name` AS `customer_first_name`, `t2`.`customer_last_name` AS `customer_last_name`, `t2`.`customer_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name, last name, and phone of the customer with account name 162?",
    "evidence": "",
    "idx": 1911
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`t1`:`accounts`)\nMATCH (`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`customer_first_name` = 'Art' AND `t2`.`customer_last_name` = 'Turcotte')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many accounts does the customer with first name Art and last name Turcotte have?",
    "evidence": "",
    "idx": 1913
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`t1`:`accounts`)\nMATCH (`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`customer_first_name` = 'Art' AND `t2`.`customer_last_name` = 'Turcotte')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the number of accounts that the customer with the first name Art and last name Turcotte has.",
    "evidence": "",
    "idx": 1914
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nWITH `accounts`.`customer_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `customer_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all customer ids and the number of accounts for each customer.",
    "evidence": "",
    "idx": 1915
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nWITH `accounts`.`customer_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `customer_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the customer id and number of accounts with most accounts.",
    "evidence": "",
    "idx": 1917
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "WITH *, COLLECT { MATCH (`accounts_sub0`:`accounts`)\nRETURN `accounts_sub0`.`customer_id` AS `customer_id`   } AS in_collect_0\nMATCH (`customers`:`customers`)\nWHERE NOT `customers`.`customer_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of all customers without an account.",
    "evidence": "",
    "idx": 1919
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "WITH *, COLLECT { MATCH (`accounts_sub0`:`accounts`)\nRETURN `accounts_sub0`.`customer_id` AS `customer_id`   } AS in_collect_0\nMATCH (`customers`:`customers`)\nWHERE NOT `customers`.`customer_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers do not have an account?",
    "evidence": "",
    "idx": 1920
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`t2`:`accounts`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nRETURN DISTINCT `t1`.`customer_first_name` AS `customer_first_name`, `t1`.`customer_last_name` AS `customer_last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show distinct first and last names for all customers with an account.",
    "evidence": "",
    "idx": 1921
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`t2`:`accounts`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nRETURN DISTINCT `t1`.`customer_first_name` AS `customer_first_name`, `t1`.`customer_last_name` AS `customer_last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full names of customers who have accounts?",
    "evidence": "",
    "idx": 1922
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN COUNT(DISTINCT `accounts`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customers who hold an account.",
    "evidence": "",
    "idx": 1924
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customers.",
    "evidence": "",
    "idx": 1926
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`customer_id` AS `customer_id`, `customers`.`customer_first_name` AS `customer_first_name`, `customers`.`customer_last_name` AS `customer_last_name`, `customers`.`customer_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show ids, first names, last names, and phones for all customers.",
    "evidence": "",
    "idx": 1927
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_first_name` = 'Aniyah' AND `customers`.`customer_last_name` = 'Feest'\nRETURN `customers`.`customer_phone` AS `customer_phone`, `customers`.`customer_email` AS `customer_email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the phone and email of the customer with the first name Aniyah and last name Feest.",
    "evidence": "",
    "idx": 1930
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of customer cards.",
    "evidence": "",
    "idx": 1931
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nRETURN `customers_cards`.`card_id` AS `card_id`, `customers_cards`.`customer_id` AS `customer_id`, `customers_cards`.`card_type_code` AS `card_type_code`, `customers_cards`.`card_number` AS `card_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show ids, customer ids, card type codes, card numbers for all cards.",
    "evidence": "",
    "idx": 1933
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nWHERE `customers_cards`.`card_number` = '4560596484842'\nRETURN `customers_cards`.`date_valid_from` AS `date_valid_from`, `customers_cards`.`date_valid_to` AS `date_valid_to`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the date valid from and the date valid to for the card with card number '4560596484842'.",
    "evidence": "",
    "idx": 1935
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nWHERE `customers_cards`.`card_number` = '4560596484842'\nRETURN `customers_cards`.`date_valid_from` AS `date_valid_from`, `customers_cards`.`date_valid_to` AS `date_valid_to`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the valid from and valid to dates for the card with the number 4560596484842?",
    "evidence": "",
    "idx": 1936
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`t1`:`customers_cards`)\nMATCH (`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`card_number` = '4560596484842')\nRETURN `t2`.`customer_first_name` AS `customer_first_name`, `t2`.`customer_last_name` AS `customer_last_name`, `t2`.`customer_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name, last name, and phone of the customer with card 4560596484842.",
    "evidence": "",
    "idx": 1937
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`t1`:`customers_cards`)\nMATCH (`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`customer_first_name` = 'Art' AND `t2`.`customer_last_name` = 'Turcotte')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of cards the customer with the first name Art and last name Turcotte has.",
    "evidence": "",
    "idx": 1940
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nWHERE `customers_cards`.`card_type_code` = 'Debit'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customer cards of the type Debit.",
    "evidence": "",
    "idx": 1942
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`t1`:`customers_cards`)\nMATCH (`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`customer_first_name` = 'Blanche' AND `t2`.`customer_last_name` = 'Huels' AND `t1`.`card_type_code` = 'Credit')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many credit cards does customer Blanche Huels have?",
    "evidence": "",
    "idx": 1943
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nWITH `customers_cards`.`customer_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `customer_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all customer ids and the number of cards owned by each customer.",
    "evidence": "",
    "idx": 1945
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nWITH `customers_cards`.`customer_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `customer_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the customer id with most number of cards, and how many does he have?",
    "evidence": "",
    "idx": 1947
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nWITH `customers_cards`.`card_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `card_type_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all card type codes and the number of cards in each type.",
    "evidence": "",
    "idx": 1949
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nWITH `customers_cards`.`card_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 5\nRETURN _groupby_col_0 AS `card_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show card type codes with at least 5 cards.",
    "evidence": "",
    "idx": 1951
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nWITH `customers_cards`.`card_type_code` AS _groupby_col_0, COUNT(DISTINCT `customers_cards`.`customer_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `card_type_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all card type codes and the number of customers holding cards in each type.",
    "evidence": "",
    "idx": 1953
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nRETURN DISTINCT `customers_cards`.`card_type_code` AS `card_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all card type codes.",
    "evidence": "",
    "idx": 1955
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`customers_cards`:`customers_cards`)\nRETURN COUNT(DISTINCT `customers_cards`.`card_type_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of card types.",
    "evidence": "",
    "idx": 1957
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`financial_transactions`:`financial_transactions`)\nRETURN DISTINCT `financial_transactions`.`transaction_type` AS `transaction_type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all transaction types.",
    "evidence": "",
    "idx": 1959
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`financial_transactions`:`financial_transactions`)\nRETURN COUNT(DISTINCT `financial_transactions`.`transaction_type`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of transaction types.",
    "evidence": "",
    "idx": 1961
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`financial_transactions`:`financial_transactions`)\nRETURN avg(`financial_transactions`.`transaction_amount`) AS `_col_0`, sum(`financial_transactions`.`transaction_amount`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average and total transaction amount?",
    "evidence": "",
    "idx": 1963
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`t1`:`financial_transactions`)-[using_card_0:using_card]->(`t2`:`customers_cards`)\nWHERE `t1`.`card_id` = `t2`.`card_id`\nWITH `t2`.`card_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `card_type_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the card type codes and the number of transactions.",
    "evidence": "",
    "idx": 1965
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`financial_transactions`:`financial_transactions`)\nWITH `financial_transactions`.`transaction_type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `transaction_type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the transaction type and the number of transactions.",
    "evidence": "",
    "idx": 1967
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`financial_transactions`:`financial_transactions`)\nWITH `financial_transactions`.`transaction_type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `transaction_type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different transaction types, and how many transactions of each have taken place?",
    "evidence": "",
    "idx": 1968
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`financial_transactions`:`financial_transactions`)\nWITH `financial_transactions`.`account_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `account_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the account id and the number of transactions for each account",
    "evidence": "",
    "idx": 1969
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_card_transactions",
    "gql_statement": "MATCH (`financial_transactions`:`financial_transactions`)\nWITH `financial_transactions`.`account_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `account_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different account ids that have made financial transactions, as well as how many transactions correspond to each?",
    "evidence": "",
    "idx": 1970
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of tracks.",
    "evidence": "",
    "idx": 1972
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN `track`.`name` AS `name`, `track`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and location for all tracks.",
    "evidence": "",
    "idx": 1973
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`track`:`track`)\nWHERE `track`.`year_opened` > 2000\nRETURN `track`.`name` AS `name`, `track`.`seating` AS `seating` ORDER BY `seating` IS NULL DESC, `seating`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names and seatings, ordered by seating for all tracks opened after 2000.",
    "evidence": "",
    "idx": 1975
  }
]