[
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nWHERE `documents`.`document_name` = 'Noel CV' OR `documents`.`document_name` = 'King Book'\nRETURN `documents`.`document_type_code` AS `document_type_code`, `documents`.`document_name` AS `document_name`, `documents`.`document_description` AS `document_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the document type code, document name, and document description for the document with name 'Noel CV' or name 'King Book'.",
    "evidence": "",
    "idx": 6457
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nRETURN `documents`.`document_id` AS `document_id`, `documents`.`document_name` AS `document_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ids and names of all documents.",
    "evidence": "",
    "idx": 6459
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nWHERE `documents`.`document_type_code` = 'BK'\nRETURN `documents`.`document_name` AS `document_name`, `documents`.`document_id` AS `document_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find names and ids of all documents with document type code BK.",
    "evidence": "",
    "idx": 6461
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nWHERE `documents`.`document_type_code` = 'BK'\nWITH `documents`.`project_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `project_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of documents with the type code BK that correspond to each product id.",
    "evidence": "",
    "idx": 6464
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`t1`:`documents`)-[belongs_to_project_0:belongs_to_project]->(`t2`:`projects`)\nWHERE `t1`.`project_id` = `t2`.`project_id`\nAND (`t2`.`project_details` = 'Graph Database project')\nRETURN `t1`.`document_name` AS `document_name`, `t1`.`document_date` AS `document_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the document name and the document date for all documents on project with details 'Graph Database project'.",
    "evidence": "",
    "idx": 6465
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`t1`:`documents`)-[belongs_to_project_0:belongs_to_project]->(`t2`:`projects`)\nWHERE `t1`.`project_id` = `t2`.`project_id`\nAND (`t2`.`project_details` = 'Graph Database project')\nRETURN `t1`.`document_name` AS `document_name`, `t1`.`document_date` AS `document_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and dates for documents corresponding to project that has the details 'Graph Database project'?",
    "evidence": "",
    "idx": 6466
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nWITH `documents`.`project_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `project_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show project ids and the number of documents in each project.",
    "evidence": "",
    "idx": 6467
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nWITH `documents`.`project_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `project_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ids for projects with at least 2 documents.",
    "evidence": "",
    "idx": 6469
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nWITH `documents`.`document_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `document_type_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List document type codes and the number of documents in each code.",
    "evidence": "",
    "idx": 6471
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nWITH `documents`.`document_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 < 3\nRETURN _groupby_col_0 AS `document_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the document type code with fewer than 3 documents.",
    "evidence": "",
    "idx": 6473
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`t1`:`statements`)-[is_a_0:is_a]->(`t2`:`documents`)\nWHERE `t1`.`statement_id` = `t2`.`document_id`\nAND (`t1`.`statement_details` = 'Private Project')\nRETURN `t1`.`statement_details` AS `statement_details`, `t2`.`document_name` AS `document_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the statement detail and the corresponding document name for the statement with detail 'Private Project'.",
    "evidence": "",
    "idx": 6475
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`ref_document_types`:`ref_document_types`)\nRETURN `ref_document_types`.`document_type_code` AS `document_type_code`, `ref_document_types`.`document_type_name` AS `document_type_name`, `ref_document_types`.`document_type_description` AS `document_type_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all document type codes, document type names, document type descriptions.",
    "evidence": "",
    "idx": 6477
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`ref_document_types`:`ref_document_types`)\nWHERE `ref_document_types`.`document_type_name` = 'Film'\nRETURN `ref_document_types`.`document_type_description` AS `document_type_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the description of the document type name 'Film'.",
    "evidence": "",
    "idx": 6480
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`t2`:`documents`)-[has_document_type_0:has_document_type]->(`t1`:`ref_document_types`)\nWHERE `t1`.`document_type_code` = `t2`.`document_type_code`\nRETURN `t1`.`document_type_name` AS `document_type_name`, `t1`.`document_type_description` AS `document_type_description`, `t2`.`document_date` AS `document_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the type name, type description, and date of creation for each document.",
    "evidence": "",
    "idx": 6482
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`projects`:`projects`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of projects.",
    "evidence": "",
    "idx": 6483
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`projects`:`projects`)\nRETURN `projects`.`project_id` AS `project_id`, `projects`.`project_details` AS `project_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List ids and details for all projects.",
    "evidence": "",
    "idx": 6485
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`t2`:`documents`)-[belongs_to_project_0:belongs_to_project]->(`t1`:`projects`)\nWHERE `t1`.`project_id` = `t2`.`project_id`\nAND (`t2`.`document_name` = 'King Book')\nRETURN `t1`.`project_details` AS `project_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the project detail for the project with document \"King Book\"?",
    "evidence": "",
    "idx": 6487
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`ref_budget_codes`:`ref_budget_codes`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of budget codes.",
    "evidence": "",
    "idx": 6490
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`ref_budget_codes`:`ref_budget_codes`)\nRETURN `ref_budget_codes`.`budget_type_code` AS `budget_type_code`, `ref_budget_codes`.`budget_type_description` AS `budget_type_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all budget type codes and descriptions.",
    "evidence": "",
    "idx": 6491
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`ref_budget_codes`:`ref_budget_codes`)\nWHERE `ref_budget_codes`.`budget_type_code` = 'ORG'\nRETURN `ref_budget_codes`.`budget_type_description` AS `budget_type_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the description of the budget type that has the code ORG.",
    "evidence": "",
    "idx": 6494
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents_with_expenses`:`documents_with_expenses`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of documents with expenses.",
    "evidence": "",
    "idx": 6496
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents_with_expenses`:`documents_with_expenses`)\nWHERE `documents_with_expenses`.`budget_type_code` = 'SF'\nRETURN `documents_with_expenses`.`document_id` AS `document_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the ids of documents with expenses that have the budget code 'SF'.",
    "evidence": "",
    "idx": 6498
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`t1`:`documents_with_expenses`)-[has_budget_type_0:has_budget_type]->(`t2`:`ref_budget_codes`)\nWHERE `t1`.`budget_type_code` = `t2`.`budget_type_code`\nRETURN `t2`.`budget_type_code` AS `budget_type_code`, `t2`.`budget_type_description` AS `budget_type_description`, `t1`.`document_id` AS `document_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the budget type code and description and the corresponding document id.",
    "evidence": "",
    "idx": 6499
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`t1`:`documents_with_expenses`)-[has_budget_type_0:has_budget_type]->(`t2`:`ref_budget_codes`)\nWHERE `t1`.`budget_type_code` = `t2`.`budget_type_code`\nAND (`t2`.`budget_type_description` = 'Government')\nRETURN `t1`.`document_id` AS `document_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show ids for all documents with budget types described as 'Government'.",
    "evidence": "",
    "idx": 6501
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents_with_expenses`:`documents_with_expenses`)\nWITH `documents_with_expenses`.`budget_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `budget_type_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show budget type codes and the number of documents in each budget type.",
    "evidence": "",
    "idx": 6503
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`t2`:`documents_with_expenses`)-[is_a_0:is_a]->(`t1`:`documents`)\nWHERE `t1`.`document_id` = `t2`.`document_id`\nAND (`t1`.`document_name` =~ '(?i)(?s).*s.*')\nRETURN `t1`.`document_id` AS `document_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of documents with letter 's' in the name with any expense budgets.",
    "evidence": "",
    "idx": 6505
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "WITH *, COLLECT { MATCH (`documents_with_expenses_sub0`:`documents_with_expenses`)\nRETURN `documents_with_expenses_sub0`.`document_id` AS `document_id`   } AS in_collect_0\nMATCH (`documents`:`documents`)\nWHERE NOT `documents`.`document_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many documents do not have any expense?",
    "evidence": "",
    "idx": 6507
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "WITH *, COLLECT { MATCH (`documents_with_expenses_sub0`:`documents_with_expenses`)\nRETURN `documents_with_expenses_sub0`.`document_id` AS `document_id`   } AS in_collect_0\nMATCH (`documents`:`documents`)\nWHERE NOT `documents`.`document_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of documents that do not have expenses.",
    "evidence": "",
    "idx": 6508
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN MAX(`accounts`.`account_details`) AS `_col_0`   \nUNION DISTINCT\nMATCH (`accounts`:`accounts`)\nWHERE `accounts`.`account_details` =~ '(?i)(?s).*5.*'\nRETURN `accounts`.`account_details` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the account details with the largest value or with value having char '5' in it?",
    "evidence": "",
    "idx": 6509
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN MAX(`accounts`.`account_details`) AS `_col_0`   \nUNION DISTINCT\nMATCH (`accounts`:`accounts`)\nWHERE `accounts`.`account_details` =~ '(?i)(?s).*5.*'\nRETURN `accounts`.`account_details` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the account details with the greatest value, as well as those that include the character 5.",
    "evidence": "",
    "idx": 6510
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`scientists`:`scientists`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of scientists.",
    "evidence": "",
    "idx": 6511
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`projects`:`projects`)\nRETURN sum(`projects`.`hours`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total hours of all projects.",
    "evidence": "",
    "idx": 6513
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`projects`:`projects`)\nRETURN sum(`projects`.`hours`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of hours for all projects?",
    "evidence": "",
    "idx": 6514
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH ()-[assignedto:assigned_to]->()\nRETURN COUNT(DISTINCT `assignedto`.`scientist`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many different scientists are assigned to any project?",
    "evidence": "",
    "idx": 6515
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`projects`:`projects`)\nRETURN COUNT(DISTINCT `projects`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of distinct projects.",
    "evidence": "",
    "idx": 6517
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`projects`:`projects`)\nRETURN avg(`projects`.`hours`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average hours of all projects.",
    "evidence": "",
    "idx": 6519
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`projects`:`projects`)\nRETURN avg(`projects`.`hours`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average hours across all projects?",
    "evidence": "",
    "idx": 6520
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`projects`:`projects`)\nORDER BY `projects`.`hours` IS NULL ASC, `projects`.`hours` DESC \nRETURN `projects`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of project that continues for the longest time.",
    "evidence": "",
    "idx": 6521
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "CALL(*) {\nMATCH (`projects_sub0`:`projects`)\nRETURN avg(`projects_sub0`.`hours`) AS `_col_0`  \n}\nMATCH (`projects`:`projects`)\nWHERE `projects`.`hours` > `_col_0`\nRETURN `projects`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of all projects that are operated longer than the average working hours of all projects.",
    "evidence": "",
    "idx": 6523
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`t3`:`scientists`)-[t1:assigned_to]->(`t2`:`projects`)\nWHERE `t1`.`project` = `t2`.`code`\nAND `t1`.`scientist` = `t3`.`ssn`\nAND (`t3`.`name` =~ '(?i)(?s).*Smith.*')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the project for which a scientist whose name contains ‘Smith’ is assigned to.",
    "evidence": "",
    "idx": 6525
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`t3`:`scientists`)-[t1:assigned_to]->(`t2`:`projects`)\nWHERE `t1`.`project` = `t2`.`code`\nAND `t1`.`scientist` = `t3`.`ssn`\nAND (`t3`.`name` = 'Michael Rogers' OR `t3`.`name` = 'Carol Smith')\nRETURN sum(`t2`.`hours`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total hours of the projects that scientists named Michael Rogers or Carol Smith are assigned to.",
    "evidence": "",
    "idx": 6527
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`t3`:`scientists`)-[t1:assigned_to]->(`t2`:`projects`)\nWHERE `t1`.`project` = `t2`.`code`\nAND `t1`.`scientist` = `t3`.`ssn`\nAND (`t3`.`name` = 'Michael Rogers' OR `t3`.`name` = 'Carol Smith')\nRETURN sum(`t2`.`hours`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the sum of hours for projects that scientists with the name Michael Rogers or Carol Smith are assigned to?",
    "evidence": "",
    "idx": 6528
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`projects`:`projects`)\nWHERE `projects`.`hours` >= 100 AND `projects`.`hours` <= 300\nRETURN `projects`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of projects that require between 100 and 300 hours of work.",
    "evidence": "",
    "idx": 6529
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`scientists`:`scientists`)\nRETURN `scientists`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all scientists sorted in alphabetical order.",
    "evidence": "",
    "idx": 6531
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`t1`:`scientists`)-[t2:assigned_to]->()\nWHERE `t1`.`ssn` = `t2`.`scientist`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of projects which each scientist is working on and scientist's name.",
    "evidence": "",
    "idx": 6537
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "CALL(*) {\nMATCH (`projects_sub0`:`projects`)\nRETURN MAX(`projects_sub0`.`hours`) AS `_col_0`  \n}\nMATCH (`t3`:`scientists`)-[t1:assigned_to]->(`t2`:`projects`)\nWHERE `t1`.`project` = `t2`.`code`\nAND `t1`.`scientist` = `t3`.`ssn`\nAND (`t2`.`hours` = `_col_0`)\nRETURN `t3`.`ssn` AS `ssn`, `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the SSN and name of scientists who are assigned to the project with the longest hours.",
    "evidence": "",
    "idx": 6539
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "CALL(*) {\nMATCH (`projects_sub0`:`projects`)\nRETURN MAX(`projects_sub0`.`hours`) AS `_col_0`  \n}\nMATCH (`t3`:`scientists`)-[t1:assigned_to]->(`t2`:`projects`)\nWHERE `t1`.`project` = `t2`.`code`\nAND `t1`.`scientist` = `t3`.`ssn`\nAND (`t2`.`hours` = `_col_0`)\nRETURN `t3`.`ssn` AS `ssn`, `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the SSN and names of scientists working on the project with the most hours?",
    "evidence": "",
    "idx": 6540
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`t2`:`scientists`)-[t1:assigned_to]->()\nWHERE `t1`.`scientist` = `t2`.`ssn`\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of scientists who are assigned to some project.",
    "evidence": "",
    "idx": 6541
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[assignedto_sub0:assigned_to]->()\nRETURN `assignedto_sub0`.`project` AS `project`   } AS in_collect_0\nMATCH (`projects`:`projects`)\nWHERE NOT `projects`.`code` IN in_collect_0\nRETURN `projects`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Select the project names which are not assigned yet.",
    "evidence": "",
    "idx": 6543
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[assignedto_sub0:assigned_to]->()\nRETURN `assignedto_sub0`.`scientist` AS `scientist`   } AS in_collect_0\nMATCH (`scientists`:`scientists`)\nWHERE NOT `scientists`.`ssn` IN in_collect_0\nRETURN `scientists`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of scientists who are not assigned to any project.",
    "evidence": "",
    "idx": 6545
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[assignedto_sub0:assigned_to]->()\nRETURN `assignedto_sub0`.`scientist` AS `scientist`   } AS in_collect_0\nMATCH (`scientists`:`scientists`)\nWHERE NOT `scientists`.`ssn` IN in_collect_0\nRETURN `scientists`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of scientists who have not been assigned a project?",
    "evidence": "",
    "idx": 6546
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[assignedto_sub0:assigned_to]->()\nRETURN `assignedto_sub0`.`scientist` AS `scientist`   } AS in_collect_0\nMATCH (`scientists`:`scientists`)\nWHERE NOT `scientists`.`ssn` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of scientists who are not assigned to any project.",
    "evidence": "",
    "idx": 6547
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "MATCH (`t1`:`scientists`)-[t2:assigned_to]->(`t3`:`projects`)\nWHERE `t1`.`ssn` = `t2`.`scientist`\nAND `t2`.`project` = `t3`.`code`\nRETURN `t1`.`name` AS `name`, `t3`.`name` AS `name_1`, `t3`.`hours` AS `hours` ORDER BY `t3`.`name` IS NULL DESC, `t3`.`name` , `t1`.`name` IS NULL DESC, `t1`.`name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the scientists' names, their projects' names, and the hours worked by that scientist on each project, in alphabetical order of project name, and then scientist name.",
    "evidence": "",
    "idx": 6549
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "CALL(*) {\nMATCH (`projects_sub0`:`projects`)\nRETURN min(`projects_sub0`.`hours`) AS `_col_0`  \n}\nMATCH (`t3`:`scientists`)-[t1:assigned_to]->(`t2`:`projects`)\nWHERE `t1`.`project` = `t2`.`code`\nAND `t1`.`scientist` = `t3`.`ssn`\nAND (`t2`.`hours` = `_col_0`)\nRETURN `t2`.`name` AS `name`, `t3`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find name of the project that needs the least amount of time to finish and the name of scientists who worked on it.",
    "evidence": "",
    "idx": 6551
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "CALL(*) {\nMATCH (`projects_sub0`:`projects`)\nRETURN min(`projects_sub0`.`hours`) AS `_col_0`  \n}\nMATCH (`t3`:`scientists`)-[t1:assigned_to]->(`t2`:`projects`)\nWHERE `t1`.`project` = `t2`.`code`\nAND `t1`.`scientist` = `t3`.`ssn`\nAND (`t2`.`hours` = `_col_0`)\nRETURN `t2`.`name` AS `name`, `t3`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the project that requires the fewest number of hours, and the names of the scientists assigned to it?",
    "evidence": "",
    "idx": 6552
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nORDER BY `wine`.`score` IS NULL DESC, `wine`.`score`  \nRETURN `wine`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the name of the wine with the highest score.",
    "evidence": "",
    "idx": 6554
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`year` = '2008'\nRETURN `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all wines produced in 2008.",
    "evidence": "",
    "idx": 6557
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`year` = '2008'\nRETURN `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all wines produced in 2008?",
    "evidence": "",
    "idx": 6558
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nRETURN `wine`.`grape` AS `grape`, `wine`.`appelation` AS `appelation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the grapes and appelations of all wines.",
    "evidence": "",
    "idx": 6559
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nRETURN `wine`.`grape` AS `grape`, `wine`.`appelation` AS `appelation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the grapes and appelations of each wine?",
    "evidence": "",
    "idx": 6560
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nRETURN `wine`.`name` AS `name`, `wine`.`score` AS `score`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names and scores of all wines.",
    "evidence": "",
    "idx": 6561
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nRETURN `wine`.`name` AS `name`, `wine`.`score` AS `score`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and scores of all wines?",
    "evidence": "",
    "idx": 6562
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`appellations`:`appellations`)\nRETURN `appellations`.`area` AS `area`, `appellations`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the area and county of all appelations.",
    "evidence": "",
    "idx": 6563
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`appellations`:`appellations`)\nRETURN `appellations`.`area` AS `area`, `appellations`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the areas and counties for all appelations?",
    "evidence": "",
    "idx": 6564
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`year` < 2010\nRETURN `wine`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the prices of wines produced before the year of 2010?",
    "evidence": "",
    "idx": 6565
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`year` < 2010\nRETURN `wine`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the prices of wines produced before 2010.",
    "evidence": "",
    "idx": 6566
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`score` > 90\nRETURN `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all distinct wines that have scores higher than 90.",
    "evidence": "",
    "idx": 6567
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`score` > 90\nRETURN `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of wines with scores higher than 90?",
    "evidence": "",
    "idx": 6568
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[made_from_0:made_from]->(`t1`:`grapes`)\nWHERE `t1`.`grape` = `t2`.`grape`\nAND (`t1`.`color` = 'Red')\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all distinct wines that are made of red color grape.",
    "evidence": "",
    "idx": 6569
  }
]