[
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`dest` = 'SNA' AND `airlines`.`origin` = 'DFW' AND `airlines`.`dep_delay` = 0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights from Dallas to Santa Ana departed on time?",
    "evidence": "from Dallas refers to ORIGIN = 'DFW'; to Santa Ana refers to DEST = 'SNA'; departed on time refers to DEP_DELAY = 0;",
    "idx": 4556
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[departs_from_0:departs_from]->(`t2`:`airports`)\nWHERE `t1`.`origin` = `t2`.`code`\nAND (`t1`.`origin` = 'CLT' AND `t1`.`dest` = 'AUS' AND `t2`.`description` = 'Charlotte, NC: Charlotte Douglas International' AND `t1`.`cancellation_code` = 'A')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights from Charlotte Douglas International Airport to Austin - Bergstrom International Airport experienced serious reasons that cause flight cancellation?",
    "evidence": "from refers to ORIGIN; Charlotte Douglas International Airport refers to Description = 'Charlotte, NC: Charlotte Douglas International'; to refers to DEST; Austin - Bergstrom International Airport refers to Description = 'Austin, TX: Austin - Bergstrom International'; serious reasons refers to CANCELLATION_CODE = 'A';",
    "idx": 4557
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nORDER BY `t2`.`cancelled` IS NULL ASC, `t2`.`cancelled` DESC \nRETURN `t1`.`description` AS `description`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which flight carrier operator has the most cancelled flights?",
    "evidence": "flight carrier operator refers to OP_CARRIER_AIRLINE_ID; most cancelled flights refers to MAX(COUNT(CANCELLED = 1));",
    "idx": 4558
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nMATCH (`t1`:`airlines`)-[arrives_at_0:arrives_at]->(`t3`:`airports`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND `t1`.`dest` = `t3`.`code`\nAND (`t1`.`fl_date` = '2018/8/20' AND `t1`.`tail_num` = 'N903JB' AND `t2`.`description` =~ '(?i)(?s).*JetBlue Airways.*' AND `t3`.`description` =~ '(?i)(?s).*Fort Lauderdale-Hollywood.*')\nRETURN `t1`.`dep_time` AS `dep_time`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the actual departure time of JetBlue Airways with the plane's tail number N903JB to Fort Lauderdale-Hollywood International Airport on the 20th of August 2018?",
    "evidence": "actual departure time refers to DEP_TIME; JetBlue Airways refers to Description like '%JetBlue Airways%'; tail number refers to TAIL_NUM; TAIL_NUM = 'N903JB'; to refers to DEST; Fort Lauderdale-Hollywood International Airport refers to Description like '%Fort Lauderdale-Hollywood%'; on the 20th of August 2018 refers to FL_DATE = '2018/8/20';",
    "idx": 4559
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND (`t1`.`origin` = 'ACY' AND `t1`.`dest` = 'FLL')\nWITH `t2`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which flight carrier operator flies from Atlantic City to Fort Lauderdale?",
    "evidence": "flight carrier operator refers to OP_CARRIER_AIRLINE_ID; from Atlantic City refers to ORIGIN = 'ACY'; to Fort Lauderdale refers to DEST = 'FLL';",
    "idx": 4560
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`code` = 'A11'\nRETURN `airports`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the airport description of the airport code A11?",
    "evidence": "",
    "idx": 4561
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`origin` = 'OKC'\nRETURN COUNT(*) AS `num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of flights that have Oklahoma as their origin?",
    "evidence": "Oklahoma as origin refers to Origin = 'OKC';",
    "idx": 4562
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`code` =~ '(?i)(?s)C.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many airports have a code starting with the letter C?",
    "evidence": "code starting with the letter C refers to Code like 'C%';",
    "idx": 4563
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`op_carrier_fl_num` = 1596\nRETURN `airlines`.`dest` AS `dest`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the destinations of flight number 1596.",
    "evidence": "destination refers to DEST; flight number refers to OP_CARRIER_FL_NUM; OP_CARRIER_FL_NUM = 1596;",
    "idx": 4564
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`code` =~ '(?i)(?s).*3'\nRETURN `airports`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the description of the airports that have code that ends with number 3?",
    "evidence": "code that ends with number 3 refers to Code like '%3';",
    "idx": 4565
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airports`:`airports`)\nWHERE `airports`.`description` = 'Driftwood Bay, AK: Driftwood Bay Airport'\nRETURN `airports`.`code` AS `code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the code of the airport described as Driftwood Bay, AK: Driftwood Bay Airport.",
    "evidence": "Driftwood Bay, AK: Driftwood Bay Airport refers to Description = 'Driftwood Bay, AK: Driftwood Bay Airport';",
    "idx": 4566
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`cancelled` = 1\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cancelled flights are there?",
    "evidence": "cancelled flights refers to CANCELLED = 1;",
    "idx": 4567
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`fl_date` = '2018/8/17'\nWITH `airlines`.`tail_num` AS _groupby_col_0\nRETURN _groupby_col_0 AS `tail_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the tail number of flights that flew on August 17, 2018.",
    "evidence": "tail number refers to TAIL_NUM; on August 17, 2018 refers to FL_DATE = '2018/8/17';",
    "idx": 4568
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nORDER BY `airlines`.`actual_elapsed_time` IS NULL DESC, `airlines`.`actual_elapsed_time`  \nRETURN `airlines`.`origin` AS `origin`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the origin of the flight that has the shortest actual elapsed time.",
    "evidence": "shortest actual elapsed time refers to MIN(ACTUAL_ELAPSED_TIME);",
    "idx": 4569
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t1`.`op_carrier_airline_id` = `t2`.`code`\nAND (`t2`.`description` = 'Ross Aviation Inc.: GWE')\nRETURN `t1`.`fl_date` AS `fl_date`, `t1`.`tail_num` AS `tail_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the date and tail number of flight with air carrier \"Ross Aviation Inc.: GWE\".",
    "evidence": "date of flight refers to FL_DATE; tail number of flight refers to TAIL_NUM; Ross Aviation Inc.: GWE refers to Description = 'Ross Aviation Inc.: GWE';",
    "idx": 4570
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nORDER BY `t2`.`arr_time` IS NULL DESC, `t2`.`arr_time`  \nRETURN `t1`.`description` AS `description`, `t1`.`code` AS `code`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the air carrier description and code of the flight with the shortest arrival time.",
    "evidence": "shortest arrival time refers to MIN(ARR_TIME);",
    "idx": 4571
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t1`.`description` =~ '(?i)(?s).*JetBlue Airways: B6.*' AND `t2`.`arr_delay_new` = 0)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights of air carrier called JetBlue Airways: B6 have 0 new arrival delay?",
    "evidence": "JetBlue Airways refers to Description = '%JetBlue Airway%'; 0 new arrival delay refers to ARR_DELAY_NEW = 0;",
    "idx": 4572
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t2`.`dest` = 'MIA')\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the air carrier description of all flights arriving at Miami.",
    "evidence": "arriving at Miami refers to DEST = 'MIA';",
    "idx": 4573
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t2`.`cancelled` = 1)\nWITH `t1`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the air carrier's description of the cancelled flights?",
    "evidence": "cancelled flights refers to CANCELLED = 1;",
    "idx": 4574
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t1`.`description` = 'Semo Aviation Inc.: SEM')\nRETURN `t2`.`actual_elapsed_time` AS `actual_elapsed_time`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the actual elapsed time of the flights with air carrier named Semo Aviation Inc.: SEM.",
    "evidence": "actual elapsed time refers to ACTUAL_ELAPSED_TIME; Semo Aviation Inc.: SEM. Refers to Description = 'Semo Aviation Inc.: SEM';",
    "idx": 4575
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t1`.`description` = 'Asap Air Inc.: ASP')\nORDER BY `t2`.`dep_delay` IS NULL ASC, `t2`.`dep_delay` DESC \nRETURN `t2`.`tail_num` AS `tail_num`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the flights with air carrier described as Asap Air Inc.: ASP, what is the tail number of the flight with the longest departure delay?",
    "evidence": "Asap Air Inc.: ASP refers to Description = 'Asap Air Inc.: ASP'; tail number refers to TAIL_NUM; longest departure delay refers to MAX(DEP_DELAY);",
    "idx": 4576
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t2`.`dep_delay` = 0)\nWITH `t1`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the air carrier's description of the flights with 0 departure delay.",
    "evidence": "0 departure delay refers to DEP_DELAY = 0;",
    "idx": 4577
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nORDER BY `t2`.`actual_elapsed_time` IS NULL ASC, `t2`.`actual_elapsed_time` DESC \nRETURN `t1`.`description` AS `description`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the air carrier description of the flight with the highest actual elapsed time.",
    "evidence": "highest actual elapsed time refers to MAX(ACTUAL_ELAPSED_TIME);",
    "idx": 4578
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t1`.`description` = 'Southeast Alaska Airlines: WEB')\nRETURN `t2`.`dest` AS `dest`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the destinations of the flights with air carrier description \"Southeast Alaska Airlines: WEB\"?",
    "evidence": "destinations refers to DEST; Southeast Alaska Airlines: WEB refers to Description = 'Southeast Alaska Airlines: WEB';",
    "idx": 4579
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t1`.`description` = 'Spirit Air Lines: NK' AND `t2`.`cancelled` = 0 AND `t2`.`fl_date` >= '2018/8/10' AND `t2`.`fl_date` <= '2018/8/20')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From August 10 to August 20, 2018, how many cancelled flights of air carrier named Spirit Air Lines: NK are there?",
    "evidence": "From August 10 to August 20, 2018 refers to FL_DATE BETWEEN '2018/8/10' AND '2018/8/20'; cancelled flights refers to CANCELLED = 1; Trans Southern Airways: 'Spirit Air Lines: NK' refers to Description = 'Spirit Air Lines: NK';",
    "idx": 4580
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t1`.`description` =~ '(?i)(?s).*Horizon Air.*' AND `t2`.`fl_date` = '2018/8/2')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of flights that flew on August 2, 2018 with air carrier described as Horizon Air?",
    "evidence": "on August 2, 2018 refers to FL_DATE = '2018/8/2'; Horizon Air refers to Description which includs 'Horizon Air';",
    "idx": 4581
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t2`.`arr_time` <= 1000 AND `t1`.`description` = 'Iscargo Hf: ICQ')\nRETURN `t2`.`tail_num` AS `tail_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the tail number of the flight with air carrier named Iscargo Hf: ICQ and arrival time of 1000 and below?",
    "evidence": "tail number refers to TAIL_NUM; Iscargo Hf: ICQ refers to Description = 'Iscargo Hf: ICQ'; arrival time of 1000 and below refers to ARR_TIME < = 1000;",
    "idx": 4582
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t2`.`actual_elapsed_time` < 100 AND `t1`.`description` = 'Profit Airlines Inc.: XBH')\nRETURN `t2`.`fl_date` AS `fl_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the flight date of flights with air carrier described as Profit Airlines Inc.: XBH which have an actual elapsed time below 100.",
    "evidence": "flight date refers to FL_DATE; Profit Airlines Inc.: XBH refers to Description = 'Profit Airlines Inc.: XBH'; actual elapsed time below 100 refers to ACTUAL_ELAPSED_TIME < 100;",
    "idx": 4583
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t1`.`description` =~ '(?i)(?s).*Republic Airline.*' AND `t2`.`dep_delay` > 30)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the flights with air carrier named Republic Airline, how many of the flights have departure delay of 30 minutes and above?",
    "evidence": "Republic Airline refers to Description which contains 'Republic Airline'; departure delay of 30 minutes and above refers to DEP_DELAY > 30;",
    "idx": 4584
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t2`.`fl_date` = '2018/8/25')\nWITH `t1`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the air carriers of the flights that flew on August 25, 2018 that have departure delay of -5?",
    "evidence": "on August 25, 2018 refers to FL_DATE = '2018/8/25'; departure delay of -5 refers to DEP_DELAY = -5;",
    "idx": 4585
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t1`:`airlines`)-[operated_by_0:operated_by]->(`t2`:`air carriers`)\nWHERE `t2`.`code` = `t1`.`op_carrier_airline_id`\nAND (`t1`.`tail_num` = 'N922US' AND `t1`.`origin` = 'PHX')\nWITH `t2`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the air carrier description of the flight with a tail number N922US from Phoenix.",
    "evidence": "tail number refers to TAIL_NUM; TAIL_NUM = 'N922US'; from Phoenix refers to ORIGIN = 'PHX';",
    "idx": 4586
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t2`.`arr_delay` < 0 AND `t2`.`dep_delay` < 0)\nWITH `t1`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the air carrier description of the flights that have an earlier arrival and departure.",
    "evidence": "earlier arrival and departure refers to ARR_DELAY < 0 AND DEP_DELAY < 0;",
    "idx": 4587
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "CALL(*) {\nMATCH (`airlines_sub0`:`airlines`)\nRETURN avg(`airlines_sub0`.`actual_elapsed_time`) * 0.8 AS `_col_0`  \n}\nMATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t1`.`description` = 'Southwest Airlines Co.: WN' AND `t2`.`actual_elapsed_time` < `_col_0`)\nRETURN `t2`.`tail_num` AS `tail_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the flights with air carrier \"Southwest Airlines Co.: WN\", provide the tail number of flights with an actual elapsed time lower than the 80% of the average actual elapsed time of listed flights.",
    "evidence": "Southwest Airlines Co.: WN refers to Description = 'Southwest Airlines Co.: WN'; tail number refers to TAIL_NUM; actual elapsed time lower than the 80% of the average actual elapsed time refers to ACTUAL_ELAPSED_TIME < (MULTIPLY AVG(ACTUAL_ELAPSED_TIME), 0.8);",
    "idx": 4588
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "CALL(*) {\nMATCH (`airlines_sub0`:`airlines`)\nRETURN avg(`airlines_sub0`.`arr_time`) * 0.4 AS `_col_0`  \n}\nMATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t2`.`dest` = 'PHX' AND `t2`.`arr_time` < `_col_0`)\nWITH `t1`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the air carrier's description with arrival time lower than the 40% of the average arrival time of flights that flew to Phoenix.",
    "evidence": "arrival time lower than the 40% of the average arrival time refers to ARR_TIME < MULTIPLY(AVG(ARR_TIME), 0.4); flew to Phoenix refers to DEST = 'PHX';",
    "idx": 4589
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[operated_by_0:operated_by]->(`t1`:`air carriers`)\nWHERE `t1`.`code` = `t2`.`op_carrier_airline_id`\nAND (`t1`.`description` =~ '(?i)(?s).*American Airlines.*')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`dep_delay` < 0 THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the flights of the air carrier described as American Airlines, what is the percentage of the flights with earlier departure?",
    "evidence": "American Airlines can be found in Description which contains 'American Airlines'; percentage = MULTIPLY(DIVIDE(SUM(DEP_DELAY < 0), COUNT(DEP_DELAY)), 1.0); earlier departure refers to DEP_DELAY < 0;",
    "idx": 4590
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t1`.`title` = 'The Illuminati')\nRETURN `t2`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the publisher of the book \"The Illuminati\"?",
    "evidence": "\"The Illuminati\" is the title of the book; name of publisher refers to publisher_name",
    "idx": 4593
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t2`.`publisher_name` = 'Thomas Nelson')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many books were published by publisher \"Thomas Nelson\"?",
    "evidence": "\"Thomas Nelson\" is the publisher_name",
    "idx": 4594
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t2`.`publisher_name` = 'Thomas Nelson')\nORDER BY `t1`.`publication_date` IS NULL DESC, `t1`.`publication_date`  \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the title of the oldest book published by publisher \"Thomas Nelson\".",
    "evidence": "\"Thomas Nelson\" is the publisher_name; oldest book refers to Min(publication_date)",
    "idx": 4595
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[written_in_0:written_in]->(`t2`:`book_language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`language_name` = 'British English')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of all the books in British English.",
    "evidence": "\"British English\" is the language_name of the book",
    "idx": 4599
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`order_line`)\nMATCH (`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND (`t1`.`title` = 'The Little House')\nRETURN min(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the cheapest order price of the book \"The Little House\"?",
    "evidence": "\"The Little House\" is the title of book; cheapest order price refers to Min(price)",
    "idx": 4600
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[written_in_0:written_in]->(`t2`:`book_language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`language_name` = 'Japanese')\nORDER BY `t1`.`publication_date` IS NULL DESC, `t1`.`publication_date`  \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the title of the earliest published Japanese book.",
    "evidence": "Japanese book refers to language_name = 'Japanese'; earliest published refers to Min(publication_date)",
    "idx": 4603
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`order_line`)\nMATCH (`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND (`t1`.`title` = 'O Xará')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders does the book \"O Xará\" have?",
    "evidence": "\"O Xará\" is the title of the book",
    "idx": 4607
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`address`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND (`t1`.`country_name` = 'Ukraine')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of Ukrainian addresses in the database.",
    "evidence": "Ukrainian address refers to country_name = 'Ukraine'",
    "idx": 4609
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`cust_order`)\nMATCH (`t1`:`shipping_method`)\nWHERE `t1`.`method_id` = `t2`.`shipping_method_id`\nAND (toString(`t2`.`order_date`) =~ '(?i)(?s)2022-11-10.*')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`method_name` = 'International' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of the International shipping orders on 2022/11/10.",
    "evidence": "International shipping order refers to method_name = 'International'; orders on 2022/11/10 refers to order_date LIKE '2022-11-10%'; percentage = Divide (Sum(order_id  where method_name = 'International'), Count(order_id)) * 100",
    "idx": 4611
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`book`:`book`)\nWHERE CASE WHEN `book`.`publication_date` is not NULL THEN apoc.temporal.format(`book`.`publication_date`,'yyyy') ELSE NULL END = '1900'\nORDER BY `book`.`publication_date` IS NULL DESC, `book`.`publication_date`  \nRETURN `book`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of the first book that was published in 1900?",
    "evidence": "published in 1900 refers to publication_date LIKE '1900%'; first book refers to Min(publication_date)",
    "idx": 4614
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`email` = 'aalleburtonkc@yellowbook.com'\nRETURN `customer`.`first_name` AS `first_name`, `customer`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the customer who owns the \"aalleburtonkc@yellowbook.com\" e-mail address?",
    "evidence": "\"aalleburtonkc@yellowbook.com\" is the email of customer; full name refers to first_name, last_name",
    "idx": 4615
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t3`:`cust_order`)\nMATCH (`t2`:`address`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND `t3`.`dest_address_id` = `t2`.`address_id`\nAND (`t1`.`country_name` = 'Iran' AND CASE WHEN `t3`.`order_date` is not NULL THEN apoc.temporal.format(`t3`.`order_date`,'yyyy') ELSE NULL END = '2022')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders in 2022 have Iran as their destinations?",
    "evidence": "Iran as their destination refers to country_name = 'Iran'; orders in 2022 refers to order_date LIKE '2022%'",
    "idx": 4616
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`order_status`)\nMATCH (`t2`:`order_history`)\nWHERE `t1`.`status_id` = `t2`.`status_id`\nAND (`t1`.`status_value` = 'Delivered' AND CASE WHEN `t2`.`status_date` is not NULL THEN apoc.temporal.format(`t2`.`status_date`,'yyyy') ELSE NULL END = '2021')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were delivered in 2021?",
    "evidence": "delivered refers to status_value = 'Delivered'; in 2021 refers to status_date LIKE '2021%'",
    "idx": 4617
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND (`t3`.`author_name` = 'Danielle Steel')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the names of the books written by Danielle Steel.",
    "evidence": "\"Danielle Steel\" is the author_name; name of books refers to title",
    "idx": 4621
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nMATCH (`t1`:`book`)-[published_by_0:published_by]->(`t4`:`publisher`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND `t4`.`publisher_id` = `t1`.`publisher_id`\nAND (`t1`.`publication_date` = localdatetime('1997-07-10T00:00:00'))\nRETURN `t3`.`author_name` AS `author_name`, `t4`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the author's and publisher's name of the book published on July 10, 1997.",
    "evidence": "author's name refers to author_name; publisher's name refers to publisher_name; book published on July 10, 1997 refers to publication_date LIKE '1997-07-10'",
    "idx": 4625
  }
]