[
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t2.`inspection_id` = 52238)\nRETURN t1.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Write down the last name of employee who did inspection ID 52238?",
    "evidence": "",
    "idx": 3193
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t1.`first_name` = 'Thomas' AND t1.`last_name` = 'Langley')\nRETURN DISTINCT t2.`results` AS `results`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the inspection result for inspection done by Thomas Langley?",
    "evidence": "inspection result refers to results",
    "idx": 3194
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t2.`inspection_id` = 52269)\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the job title of employee who did inspection ID 52269?",
    "evidence": "job title refers to title",
    "idx": 3197
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t1.`dba_name` = 'XANDO COFFEE & BAR / COSI SANDWICH BAR')\nRETURN DISTINCT t2.`results` AS `results`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the inspection results for Xando Coffee & Bar / Cosi Sandwich Bar?",
    "evidence": "Xando Coffee & Bar / Cosi Sandwich Bar refers to dba_name = 'XANDO COFFEE & BAR / COSI SANDWICH BAR'",
    "idx": 3198
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t1.`dba_name` = 'JOHN SCHALLER')\nRETURN DISTINCT t2.`inspection_type` AS `inspection_type`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What type of inspection was done at John Schaller?",
    "evidence": "type of inspection refers to inspection_type; John Schaller refers to dba_name = 'JOHN SCHALLER'",
    "idx": 3199
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t1.`license_no` = 1222441)\nRETURN DISTINCT t2.`results` AS `results`, t1.`zip` AS `zip`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Did license number 1222441 pass the inspection and what is the zip code number of it?",
    "evidence": "license number 1222441 refers to license_no = 1222441; result of the inspection refers to results; zip code number refers to zip",
    "idx": 3204
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t2.`license_no` = 1334073)\nRETURN DISTINCT t1.`first_name` AS `first_name`, t1.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the employee that inspected establishments with license 1334073?",
    "evidence": "full name refers to first_name, last_name; with license 1334073 refers to license_no = 1334073",
    "idx": 3205
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nMATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t3@`establishment`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND t2.`license_no` = t3.`license_no`\nAND (t1.`first_name` = 'Joshua' AND t1.`last_name` = 'Rosa')\nRETURN DISTINCT t3.`dba_name` AS `dba_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which establishments did Joshua Rosa inspect?",
    "evidence": "establishment name refers to dba_name",
    "idx": 3206
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t2.`results` = 'Fail' AND t1.`salary` > 70000)\nRETURN COUNT(DISTINCT t1.`employee_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many employees have salary greater than 70000 but fail the inspection?",
    "evidence": "salary greater than 70000 refers to salary > 70000; fail the inspection refers to results = 'Fail'",
    "idx": 3207
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nMATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t3@`establishment`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND t2.`license_no` = t3.`license_no`\nAND (t1.`first_name` = 'Joshua' AND t1.`last_name` = 'Rosa')\nRETURN DISTINCT t3.`dba_name` AS `dba_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the establishment that Joshua Rosa inspected?",
    "evidence": "name of the establishment refers to dba_name",
    "idx": 3208
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nMATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t3@`establishment`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND t2.`license_no` = t3.`license_no`\nAND (t1.`first_name` = 'Bob' AND t1.`last_name` = 'Benson')\nRETURN DISTINCT t3.`risk_level` AS `risk_level`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the risk level of the establishment that Bob Benson inspected?",
    "evidence": "",
    "idx": 3209
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t2.`license_no` = 1576687)\nRETURN DISTINCT t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the employee that inspected the establishment with license number 1576687?",
    "evidence": "license number 1576687 refers to license_no = 1576687",
    "idx": 3210
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH ()-[t2:`has_violation`]->(t1@`inspection_point`)\nWHERE t1.`point_id` = t2.`point_id`\nAND (t1.`point_level` = 'Serious ' AND t2.`fine` = 0)\nRETURN COUNT(DISTINCT t2.`point_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many inspection points with serious point level that have no fine?",
    "evidence": "serious point level refers to point_level = 'Serious '; have no fine refers to fine = 0",
    "idx": 3211
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nMATCH (t2@`inspection`)-[t3:`has_violation`]->()\nWHERE t1.`license_no` = t2.`license_no`\nAND t2.`inspection_id` = t3.`inspection_id`\nAND (t1.`facility_type` = 'Restaurant')\nRETURN cast (COUNT(CASE  WHEN t3.`fine` = 250 THEN t1.`license_no`  END) as float) * 100 / COUNT(t1.`license_no`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of restaurants that paid a fine of 250 among all establishments?",
    "evidence": "a fine of 250 refers to fine = 250; percentage = divide(sum(license_no where fine = 250), count(license_no)) * 100%",
    "idx": 3212
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t2.`results` = 'Pass')\nRETURN cast (COUNT(CASE  WHEN t1.`risk_level` = 1 THEN t1.`license_no`  END) as float) * 100 / COUNT(t1.`license_no`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of establishments with a risk level of 1 among all of the establishments that passed the inspection?",
    "evidence": "a risk level of 1 refers to risk_level = 1; pass the inspection refers to results = 'Pass'; percentage = divide(sum(license_no where risk_level = 1), count(license_no)) * 100% where results = 'Pass'",
    "idx": 3213
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (employee@`employee`)\nWHERE employee.`first_name` = 'Jessica' AND employee.`last_name` = 'Anthony'\nRETURN employee.`salary` AS `salary`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much salary does Jessica Anthony receive?",
    "evidence": "",
    "idx": 3216
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (employee@`employee`)\nWHERE employee.`title` = 'Supervisor'\nRETURN COUNT(employee.`employee_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the list of employees, what is the total number of supervisors?",
    "evidence": "supervisor refers to title = 'Supervisor'",
    "idx": 3218
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (employee@`employee`)\nWHERE employee.`state` = 'IL' AND employee.`city` = 'Hoffman Estates'\nRETURN COUNT(employee.`employee_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many employees are living in Hoffman Estates, IL?",
    "evidence": "in Hoffman Estates refers to city = 'Hoffman Estates'; IL refers to state = 'IL'",
    "idx": 3220
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (establishment@`establishment`)\nWHERE establishment.`risk_level` = 3\nRETURN COUNT(establishment.`license_no`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of establishments with the highest risk level?",
    "evidence": "total number of establishments with the highest risk level = count(max(risk_level))",
    "idx": 3221
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (employee@`employee`)\nWHERE employee.`salary` = 82700\nRETURN employee.`first_name` AS `first_name`, employee.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the employee that receives 82700 as their salary?",
    "evidence": "employee name refers to first_name, last_name; receives 82700 as salary refers to salary = 82700",
    "idx": 3222
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nMATCH (t2@`inspection`)-[t3:`has_violation`]->()\nWHERE t1.`license_no` = t2.`license_no`\nAND t2.`inspection_id` = t3.`inspection_id`\nAND (t1.`facility_type` = 'Grocery Store' AND t3.`fine` = 250)\nRETURN COUNT(DISTINCT t1.`license_no`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many grocery stores paid $250 fine upon their inspection?",
    "evidence": "grocery store refers to facility_type = 'Grocery Store'; $250 fine refers to fine = 250",
    "idx": 3235
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH ()-[t2:`has_violation`]->(t1@`inspection_point`)\nWHERE t1.`point_id` = t2.`point_id`\nAND (t1.`point_level` = 'Serious ' AND t2.`fine` = 0)\nRETURN COUNT(DISTINCT t2.`inspection_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the inspections with serious point levels have no fines?",
    "evidence": "serious point level refers to point_level = 'Serious'; no fines refers to fine = 0",
    "idx": 3237
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[t3:`has_violation`]->(t4@`inspection_point`)\nMATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND t2.`inspection_id` = t3.`inspection_id`\nAND t3.`point_id` = t4.`point_id`\nAND (t4.`category` = 'No Smoking Regulations')\nRETURN DISTINCT t1.`dba_name` AS `dba_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the establishment's name with an inspection category of No Smoking Regulations?",
    "evidence": "establishment's name refers to dba_name; an inspection category of No Smoking Regulations refers to category = 'No Smoking Regulations'",
    "idx": 3238
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t2.`inspection_type` = 'Canvass' AND t1.`facility_type` = 'Restaurant')\nRETURN COUNT(CASE  WHEN t2.`results` = 'Pass' THEN t1.`license_no`  END) - COUNT(CASE  WHEN t2.`results` = 'Fail' THEN t1.`license_no`  END) AS `diff`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the difference in the number of restaurants that passed and failed the canvass inspection type?",
    "evidence": "canvass inspection type refers to inspection_type = 'Canvass'; restaurant refers to facility_type = 'Restaurant'; difference = subtract(count(inspection_id where results = 'Pass'), count(inspection_id where results = 'Fail'))",
    "idx": 3239
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nMATCH (t2@`inspection`)-[t3:`has_violation`]->()\nWHERE t1.`license_no` = t2.`license_no`\nAND t2.`inspection_id` = t3.`inspection_id`\nAND (t3.`fine` = 500)\nRETURN cast (COUNT(CASE  WHEN t1.`facility_type` = 'Restaurant' THEN t1.`license_no`  END) as float) * 100 / COUNT(t1.`facility_type`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the establishments that paid a 500 fine, what is the percentage of restaurants?",
    "evidence": "a 500 fine refers to fine = 500; restaurant refers to facility_type = 'Restaurant'; percentage = divide(count(license_no where facility_type = 'Restaurant'), count(license_no)) * 100% where fine = 500",
    "idx": 3240
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-04-28') AND t2.`cmc_rank` = 1)\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which crytocurrency was ranked the first by CoinMarketCap on 2013/4/28?",
    "evidence": "ranked the first refers to cmc_rank = 1; on 2013/4/28 refers to date = '2013-04-28'",
    "idx": 3244
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-04-28') AND t1.`name` = 'Bitcoin')\nRETURN t2.`market_cap` AS `market_cap`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much dollars was a Bitcoin worth on 2013/4/28 according to the coin market?",
    "evidence": "worth refers to price; on 2013/4/28 refers to date = '2013-04-28'",
    "idx": 3245
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-05-03') AND t2.`open` IS NULL)\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which crytocurrency was not opened on 2013/5/3?",
    "evidence": "not opened refers to open IS NULL; on 2013/5/3 refers to date = '2013-05-03'",
    "idx": 3246
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-04-29') AND t1.`name` = 'Bitcoin')\nRETURN t2.`close` AS `close`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the price of Bitcoin when it closed at the end of the day on 2013/4/29?",
    "evidence": "price when it closed refers to close; on 2013/4/29 refers to date = '2013-04-29'",
    "idx": 3247
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-04-29') AND t1.`name` = 'Bitcoin')\nRETURN t2.`time_high` AS `time_high`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did Bitcoin reach its highest price on 2013/4/29?",
    "evidence": "time that a coin reaches its highest price refers to time_high; on 2013/4/29 refers to date = '2013-04-29'",
    "idx": 3248
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-04-28') AND t1.`name` = 'Bitcoin')\nRETURN t2.`high` - t2.`low` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the max profit a user can make on Bitcoin on 2013/4/28?",
    "evidence": "the max profit = subtract(high, low); on 2013/4/28 refers to date = '2013-04-28'",
    "idx": 3249
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-04-28') AND t1.`name` = 'Bitcoin')\nRETURN t2.`max_supply` - t2.`total_supply` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the number of Bitcoins verifiably burned until 2013/4/28?",
    "evidence": "the number of Bitcoins verifiably burned = max_supply - total_supply; 2013/4/28 refers to date = '2013-04-28'",
    "idx": 3250
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-05-05') AND t1.`name` = 'Bitcoin')\nRETURN (CASE  WHEN t2.`percent_change_7d` > 0 THEN 'INCREASED' ELSE 'DECREASED' END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Had Bitcoin's price increased or decreased on 2013/5/5 compared with the price 7 days before?",
    "evidence": "price increased refers to percent_change_7d>0; decreased refers percent_change_7d<0; on 2013/5/5 refers to date = '2013-05-05'",
    "idx": 3252
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-04-28') AND t1.`name` IN ['Bitcoin', 'Litecoin'])\nORDER BY t2.`circulating_supply` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which crytocurrency had a bigger number of coins circulating in the market and in the general public's hands on 2013/4/28, Bitcoin or Litecoin?",
    "evidence": "a bigger number of coins circulating in the market refers to max(circulating_supply); on 2013/4/28 refers to date = '2013-04-28'",
    "idx": 3253
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` = date('2013-04-28') AND t1.`name` = 'Bitcoin')\nRETURN t2.`price` AS `price`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much was a Bitcoin on 2013/4/28?",
    "evidence": "how much refers to price; on 2013/4/28 refers to date = '2013-04-28'",
    "idx": 3254
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t2.`date` < date('2018-04-28') AND t1.`name` = 'Bitcoin')\nRETURN cast ((sum(t2.`max_supply`) - sum(t2.`total_supply`)) as float) / sum(t2.`total_supply`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the percentage of the Bitcoins verifiably burned until 2018/4/28?",
    "evidence": "the percentage of the Bitcoins verifiably burned = divide(subtract(SUM(max_supply), SUM(total_supply)),SUM(total_supply))*100%; until 2013/4/28 refers to date<'2013-04-08'",
    "idx": 3255
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (coins@`coins`)\nWHERE coins.`name` = 'BitBar'\nRETURN coins.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the descripition of BitBar?",
    "evidence": "",
    "idx": 3257
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t1.`name` = 'Bitcoin')\nORDER BY t2.`low`  NULLS FIRST \nRETURN t2.`date` AS `date` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When is the best time to purchase Bitcoin?",
    "evidence": "lowest price refers to low; best time refers to date with the low;",
    "idx": 3261
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t1.`name` = 'Peercoin' AND t2.`cmc_rank` = 5)\nRETURN t2.`date` AS `date`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did Peercoin rank fifth?",
    "evidence": "when refers to date; rank fifth refers to cmc_rank = 5",
    "idx": 3262
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (t1@`coins`)\nMATCH (t2@`historical`)\nWHERE t1.`id` = t2.`coin_id`\nAND (t1.`name` = 'Lebowskis' AND (t2.`open` IS NULL OR t2.`open` = 0))\nRETURN DISTINCT t2.`date` AS `date`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When was Lebowskis not opened?",
    "evidence": "when refers to date; not opened refers to open IS NULL",
    "idx": 3264
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (suppliers@`suppliers`)\nWHERE suppliers.`country` = 'USA'\nRETURN COUNT(suppliers.`supplierid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many suppliers are there in the United States of America?",
    "evidence": "United States of America refers to Country = 'USA'",
    "idx": 3272
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (t1@`products`)-[supplied_by_0:`supplied_by`]->(t2@`suppliers`)\nWHERE t1.`supplierid` = t2.`supplierid`\nAND (t1.`productname` = 'Pavlova')\nRETURN t2.`contactname` AS `contactname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the contact person of the Pavlova supplier company?",
    "evidence": "contact person refers to ContactName; Pavlova is the name of the product;",
    "idx": 3273
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (t2@`products`)-[in_category_0:`in_category`]->(t1@`categories`)\nWHERE t1.`categoryid` = t2.`categoryid`\nAND (t1.`categoryname` = 'Beverages')\nRETURN t2.`productname` AS `productname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the products that belong to the beverage category?",
    "evidence": "products belong to beverage category refer to ProductName where CategoryName = 'beverage';",
    "idx": 3274
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (t2@`products`)-[in_category_0:`in_category`]->(t1@`categories`)\nWHERE t1.`categoryid` = t2.`categoryid`\nAND (t2.`productname` = 'tofu')\nRETURN t1.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the description of the category that tofu belongs to?",
    "evidence": "tofu is the name of the product;",
    "idx": 3275
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (t1@`products`)-[supplied_by_0:`supplied_by`]->(t2@`suppliers`)\nWHERE t1.`supplierid` = t2.`supplierid`\nAND (t1.`productname` = 'Camembert Pierrot')\nRETURN t2.`contactname` AS `contactname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the person to contact to get Camembert Pierrot?",
    "evidence": "Camembert Pierrot is the name of the product; person to contact refers to ContactName;",
    "idx": 3276
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (t2@`orders`)-[handled_by_0:`handled_by`]->(t1@`employees`)\nWHERE t1.`employeeid` = t2.`employeeid`\nAND (t1.`firstname` = 'Margaret' AND t1.`lastname` = 'Peacock')\nRETURN COUNT(t2.`employeeid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders have Margaret Peacock placed?",
    "evidence": "",
    "idx": 3278
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (t1@`products`)-[supplied_by_0:`supplied_by`]->(t2@`suppliers`)\nWHERE t1.`supplierid` = t2.`supplierid`\nAND (t1.`productname` = 'Teatime Chocolate Biscuits')\nRETURN t2.`contactname` AS `contactname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the contact name for product Teatime Chocolate Biscuits?",
    "evidence": "\"Teatime Chocolate Biscuits\" is the ProductName",
    "idx": 3280
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`country` = 'Germany' AND customers.`city` = 'Berlin'\nRETURN COUNT(customers.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are there in Berlin, Germany?",
    "evidence": "\"Berlin\" is the City; 'Germany' is the Country",
    "idx": 3281
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (categories@`categories`)\nWHERE categories.`categoryname` = 'Condiments'\nRETURN categories.`categoryid` AS `categoryid`, categories.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the ID and description of the condiments category?",
    "evidence": "condiments category refers to CategoryName = 'Condiments'; the ID refers to CategoryID",
    "idx": 3282
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (t1@`products`)-[supplied_by_0:`supplied_by`]->(t2@`suppliers`)\nWHERE t1.`supplierid` = t2.`supplierid`\nAND (t2.`country` = 'Spain')\nRETURN t1.`productname` AS `productname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What were the products supplied by the company in Spain?",
    "evidence": "company in Spain refers to Country = 'Spain'; product supplied refers to ProductName",
    "idx": 3283
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (suppliers@`suppliers`)\nWHERE suppliers.`country` = 'USA'\nRETURN COUNT(suppliers.`supplierid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many suppliers does Northwind have in USA?",
    "evidence": "'USA' is a country; supplier refers to CompanyName",
    "idx": 3286
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (shippers@`shippers`)\nRETURN COUNT(shippers.`shipperid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many companies do ship Northwind's orders?",
    "evidence": "companies refers to ShipperID",
    "idx": 3287
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (suppliers@`suppliers`)\nWHERE suppliers.`country` = 'UK'\nRETURN COUNT(suppliers.`supplierid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many suppliers are from UK?",
    "evidence": "from UK refers to Country = 'UK'",
    "idx": 3292
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (products@`products`)\nWHERE products.`productid` = 77\nRETURN products.`productname` AS `productname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of product with the ID of 77?",
    "evidence": "name of product refers to ProductName; ID refers to ProductID",
    "idx": 3293
  },
  {
    "filename": "train.json",
    "db_id": "retail_world",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`city` = 'London'\nRETURN COUNT(customers.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are located in London?",
    "evidence": "London refers to City = 'London'",
    "idx": 3295
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_orderkey` = 5 AND lineitem.`l_returnflag` = 'R'\nRETURN COUNT(lineitem.`l_linenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many kinds of items are returned in order no.5?",
    "evidence": "returned refer to l_returnflag = 'R'; order no.5 refers to l_orderkey = 5; kinds of items refer to l_linenumber;",
    "idx": 3299
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_orderkey` IN [4, 36]\nORDER BY lineitem.`l_shipdate` DESC NULLS LAST \nRETURN lineitem.`l_orderkey` AS `l_orderkey` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which order has a higher priority, order no. 4 or order no. 36?",
    "evidence": "earlier orderdate have higher priority in delivery; which order no. 4 or order no. 36 refers to o_orderkey in (4, 36) where MIN(o_orderdate);",
    "idx": 3300
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL {\nMATCH (orders_sub0@`orders`)\nRETURN MAX(orders_sub0.`o_totalprice`) AS `_col_0` \n}\nMATCH (orders@`orders`)\nWHERE orders.`o_totalprice` = _col_0\nRETURN orders.`o_comment` AS `o_comment`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the comment of the order with the highest total price?",
    "evidence": "the highest total price refers to MAX(o_totalprice); comment of the order refers to o_comment;",
    "idx": 3301
  }
]