[
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nMATCH ()-[t3:reviewed]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND (`t1`.`name` = 'Cafe Zinho' AND `t1`.`state` = 'Texas' AND `t2`.`category_name` = 'restaurant')\nRETURN COUNT(DISTINCT `t3`.`text`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the number of reviews written for \" Cafe Zinho \" restaurant in Texas",
    "evidence": "",
    "idx": 992
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nMATCH (`t3`:`category`)-[category_of_1:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND (`t1`.`rating` = 5 AND `t2`.`category_name` = 'Italian' AND `t3`.`category_name` = 'restaurant')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all 5 star Italian restaurant",
    "evidence": "",
    "idx": 993
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`category`)-[category_of_0:category_of]->(`t2`:`business`)-[neighbourhood_of_0:neighbourhood_of]->(`t1`:`neighbourhood`)\nMATCH (`t4`:`category`)-[category_of_1:category_of]->(`t2`:`business`)\nWHERE `t3`.`business_id` = `t2`.`business_id`\nAND `t4`.`business_id` = `t2`.`business_id`\nAND `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`city` = 'Madison' AND `t3`.`category_name` = 'Italian' AND `t4`.`category_name` = 'restaurant')\nRETURN `t1`.`neighbourhood_name` AS `neighbourhood_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the neighbourhoods with Italian restaurant in Madison",
    "evidence": "",
    "idx": 994
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`category`)-[category_of_0:category_of]->(`t2`:`business`)-[neighbourhood_of_0:neighbourhood_of]->(`t1`:`neighbourhood`)\nMATCH (`t4`:`category`)-[category_of_1:category_of]->(`t2`:`business`)\nWHERE `t3`.`business_id` = `t2`.`business_id`\nAND `t4`.`business_id` = `t2`.`business_id`\nAND `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`city` = 'Madison' AND `t2`.`rating` < 2.5 AND `t3`.`category_name` = 'Italian' AND `t4`.`category_name` = 'restaurant')\nRETURN `t1`.`neighbourhood_name` AS `neighbourhood_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the neighbourhoods with Italian restaurant rated less than 2.5 in Madison",
    "evidence": "",
    "idx": 995
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`state` = 'Pennsylvania' AND `t2`.`category_name` = 'restaurant')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find all the restaurant in Pennsylvania",
    "evidence": "",
    "idx": 996
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nMATCH ()-[t3:reviewed]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND (`t1`.`review_count` > 100 AND `t2`.`category_name` = 'Pet Groomers')\nRETURN `t3`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the reviews for all Pet Groomers with more than 100 reviews",
    "evidence": "",
    "idx": 998
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`city` = 'Los Angeles' AND `t2`.`category_name` = 'breweries')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the breweries in \" Los Angeles \" ?",
    "evidence": "",
    "idx": 999
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t4`:`user`)-[t3:reviewed]->(`t1`:`business`)\nMATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`user_id` = `t3`.`user_id`\nAND (`t1`.`name` = 'Mesa Grill' AND `t2`.`category_name` = 'restaurant')\nRETURN `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all users who reviewed restaurant \" Mesa Grill \"",
    "evidence": "",
    "idx": 1002
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` = 'Los Angeles' AND `business`.`name` = 'Walmart'\nRETURN `business`.`full_address` AS `full_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the addresses of all Walmart in \" Los Angeles \"",
    "evidence": "",
    "idx": 1003
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t4`:`user`)-[t3:reviewed]->(`t1`:`business`)\nMATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`user_id` = `t3`.`user_id`\nAND (`t1`.`city` = 'Dallas' AND `t2`.`category_name` = 'restaurant' AND `t4`.`name` = 'Patrick')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all restaurant reviewed by Patrick in \" Dallas \"",
    "evidence": "",
    "idx": 1004
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t4`:`user`)-[t3:reviewed]->(`t1`:`business`)\nMATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`user_id` = `t3`.`user_id`\nAND (`t2`.`category_name` = 'Bars' AND `t4`.`name` = 'Patrick')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all Bars reviewed by Patrick",
    "evidence": "",
    "idx": 1006
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t4`:`user`)-[t3:reviewed]->(`t1`:`business`)\nMATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`user_id` = `t3`.`user_id`\nAND (`t1`.`rating` >= 3 AND `t2`.`category_name` = 'Bars' AND `t4`.`name` = 'Patrick')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all Bars reviewed by Patrick with at least 3 stars",
    "evidence": "",
    "idx": 1007
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`user`)-[t2:tipped]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`user_id` = `t2`.`user_id`\nAND (`t1`.`name` = 'Barrio Cafe' AND `t2`.`year` = 2015)\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all users who have written tips for \" Barrio Cafe \" in 2015",
    "evidence": "",
    "idx": 1008
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`rating` < 2 AND `business`.`state` = 'Texas'\nRETURN `business`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all businesses in Texas with a rating below 2",
    "evidence": "",
    "idx": 1009
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nMATCH (`t3`:`category`)-[category_of_1:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND (`t1`.`city` = 'Los Angeles' AND `t2`.`category_name` = 'Seafood' AND `t3`.`category_name` = 'restaurant')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all restaurant Seafood in Los Angeles",
    "evidence": "",
    "idx": 1010
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:reviewed]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nAND (`t1`.`rating` > 4 AND `t2`.`name` = 'Patrick')\nRETURN `t1`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all reviews by Patrick with a rating above 4",
    "evidence": "",
    "idx": 1013
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` = 'Los Angeles' AND `business`.`name` = 'Apple Store'\nRETURN `business`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all Apple Store in \" Los Angeles \"",
    "evidence": "",
    "idx": 1014
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`city` = 'Dallas' AND `t1`.`rating` > 4.5 AND `t2`.`category_name` = 'restaurant')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all Dallas restaurant with a rating above 4.5",
    "evidence": "",
    "idx": 1015
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`category`)-[category_of_0:category_of]->(`t2`:`business`)-[neighbourhood_of_0:neighbourhood_of]->(`t1`:`neighbourhood`)\nWHERE `t3`.`business_id` = `t2`.`business_id`\nAND `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`name` = 'Flat Top Grill' AND `t3`.`category_name` = 'category_category_name0')\nRETURN `t1`.`neighbourhood_name` AS `neighbourhood_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What neighbourhood is restaurant \" Flat Top Grill \" in ?",
    "evidence": "",
    "idx": 1016
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`user`)-[t2:tipped]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`user_id` = `t2`.`user_id`\nAND (`t1`.`city` = 'Dallas')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all users who have written tips about businesses in Dallas",
    "evidence": "",
    "idx": 1019
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`name` = 'MGM Grand Buffet' AND `t1`.`state` = 'Texas' AND `t2`.`category_name` = 'restaurant')\nRETURN `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all cities in Texas in which there is a restaurant called \" MGM Grand Buffet \"",
    "evidence": "",
    "idx": 1020
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t4`:`user`)-[t3:tipped]->(`t1`:`business`)\nMATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`user_id` = `t3`.`user_id`\nAND (`t2`.`category_name` = 'Pet Groomers')\nRETURN `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the users who have given tips on Pet Groomers",
    "evidence": "",
    "idx": 1021
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t4`:`user`)-[t3:reviewed]->(`t1`:`business`)\nMATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`user_id` = `t3`.`user_id`\nAND (`t2`.`category_name` = 'restaurant')\nRETURN `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all users who reviewed businesses that are restaurant .",
    "evidence": "",
    "idx": 1023
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t4`:`user`)-[t3:reviewed]->(`t1`:`business`)\nMATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`user_id` = `t3`.`user_id`\nAND (`t2`.`category_name` = 'restaurant' AND `t3`.`year` = 2010)\nRETURN `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all users who reviewed businesses that are restaurant in 2010 .",
    "evidence": "",
    "idx": 1025
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`user`)-[t1:reviewed]->()\nMATCH (`t3`:`user`)-[t2:tipped]->()\nWHERE `t3`.`user_id` = `t1`.`user_id`\nAND `t3`.`user_id` = `t2`.`user_id`\nAND (`t1`.`year` = 2012)\nRETURN `t2`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the tips from a user who has written a review in 2012",
    "evidence": "",
    "idx": 1026
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`city` = 'Madison' AND `t2`.`category_name` = 'escape games')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the number of escape games in Madison",
    "evidence": "",
    "idx": 1028
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`rating` > 3.5 AND `t2`.`category_name` = 'restaurant')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the number of restaurant rated more than 3.5",
    "evidence": "",
    "idx": 1033
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:reviewed]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nAND (`t1`.`year` = 2015 AND `t2`.`name` = 'Niloofar')\nRETURN COUNT(DISTINCT `t1`.`text`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many reviews has Niloofar written in 2015",
    "evidence": "",
    "idx": 1034
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:reviewed]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nAND (`t2`.`name` = 'Michelle')\nRETURN avg(`t1`.`rating`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the average rating given in Michelle reviews",
    "evidence": "",
    "idx": 1035
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`checkin`)-[checkin_at_0:checkin_at]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`name` = 'Cafe Zinho' AND `t2`.`day` = 'Friday')\nRETURN `t2`.`count` AS `count`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of checkins for \" Cafe Zinho \" on Friday",
    "evidence": "",
    "idx": 1036
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`user`)-[t2:reviewed]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`user_id` = `t2`.`user_id`\nAND (`t1`.`city` = 'Pittsburgh' AND `t1`.`name` = 'Sushi Too')\nRETURN COUNT(DISTINCT `t3`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many users reviewed \" Sushi Too \" in Pittsburgh",
    "evidence": "",
    "idx": 1037
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`city` = 'Pittsburgh' AND `t1`.`rating` = 4.5 AND `t2`.`category_name` = 'restaurant')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of restaurant in Pittsburgh rated 4.5",
    "evidence": "",
    "idx": 1038
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:tipped]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nAND (`t2`.`name` = 'Niloofar')\nRETURN sum(`t1`.`likes`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total likes on tips from Niloofar",
    "evidence": "",
    "idx": 1040
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`user`)-[t2:tipped]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`user_id` = `t2`.`user_id`\nAND (`t1`.`name` = 'Cafe Zinho' AND `t3`.`name` = 'Niloofar')\nRETURN sum(`t2`.`likes`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total likes on tips from Niloofar about \" Cafe Zinho \"",
    "evidence": "",
    "idx": 1042
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:tipped]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nAND (`t1`.`year` = 2010 AND `t2`.`name` = 'Michelle')\nRETURN COUNT(DISTINCT `t1`.`text`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many tips has Michelle written in 2010",
    "evidence": "",
    "idx": 1043
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:tipped]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nAND (`t1`.`year` = 2010 AND `t2`.`name` = 'Michelle')\nRETURN COUNT(DISTINCT `t1`.`text`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return me the number of tips that are written by Michelle in 2010 .",
    "evidence": "",
    "idx": 1044
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:tipped]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nAND (`t1`.`month` = 'April' AND `t2`.`name` = 'Michelle')\nRETURN COUNT(DISTINCT `t1`.`text`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many tips has Michelle written in April",
    "evidence": "",
    "idx": 1045
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`state` = 'Texas' AND `t2`.`category_name` = 'restaurant')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the number of restaurant in Texas",
    "evidence": "",
    "idx": 1046
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t4`:`user`)-[t3:reviewed]->(`t1`:`business`)\nMATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`user_id` = `t3`.`user_id`\nAND (`t1`.`city` = 'Dallas' AND `t1`.`name` = 'Texas de Brazil' AND `t1`.`state` = 'Texas' AND `t2`.`category_name` = 'restaurant')\nRETURN COUNT(DISTINCT `t4`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many people reviewed the restaurant \" Texas de Brazil \" in Dallas Texas ?",
    "evidence": "",
    "idx": 1049
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`user`)-[t2:reviewed]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`user_id` = `t2`.`user_id`\nAND (`t1`.`name` = 'Bistro Di Napoli' AND `t2`.`year` = 2015)\nRETURN COUNT(DISTINCT `t3`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many people reviewed \" Bistro Di Napoli \" in 2015 ?",
    "evidence": "",
    "idx": 1050
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`name` = 'Acacia Cafe'\nRETURN `business`.`review_count` AS `review_count`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many reviews does \" Acacia Cafe \" have ?",
    "evidence": "",
    "idx": 1053
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nMATCH (`t3`:`checkin`)-[checkin_at_0:checkin_at]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND (`t1`.`name` = 'Barrio Cafe' AND `t2`.`category_name` = 'restaurant')\nWITH `t3`.`day` AS _groupby_col_0, avg(`t3`.`count`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `day`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average number of checkins in restaurant \" Barrio Cafe \" per day",
    "evidence": "",
    "idx": 1054
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` = 'Los Angeles' AND `business`.`name` = 'Target'\nRETURN COUNT(DISTINCT `business`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many Target are there in \" Los Angeles \" ?",
    "evidence": "",
    "idx": 1060
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t4`:`user`)-[t3:reviewed]->(`t1`:`business`)\nMATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`user_id` = `t3`.`user_id`\nAND (`t1`.`name` = 'Vintner Grill' AND `t2`.`category_name` = 'category_category_name0' AND `t3`.`year` = 2010)\nRETURN COUNT(DISTINCT `t4`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many people reviewed restaurant \" Vintner Grill \" in 2010 ?",
    "evidence": "",
    "idx": 1063
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`user`:`user`)\nWHERE `user`.`name` = 'Michelle'\nRETURN COUNT(DISTINCT `user`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of users called Michelle",
    "evidence": "",
    "idx": 1065
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t2`.`category_name` = 'restaurant')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return me the number of businesses that are restaurant .",
    "evidence": "",
    "idx": 1066
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`name` = 'Panda Express'\nRETURN COUNT(DISTINCT `business`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return me the number of cities that has \" Panda Express \" .",
    "evidence": "",
    "idx": 1067
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:tipped]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nAND (`t2`.`name` = 'Michelle')\nRETURN COUNT(DISTINCT `t1`.`text`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return me the number of tips that are written by Michelle .",
    "evidence": "",
    "idx": 1068
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`checkin`)-[checkin_at_0:checkin_at]->(`t1`:`business`)-[neighbourhood_of_0:neighbourhood_of]->(`t2`:`neighbourhood`)\nWHERE `t3`.`business_id` = `t1`.`business_id`\nAND `t2`.`business_id` = `t1`.`business_id`\nAND (`t2`.`neighbourhood_name` = 'Brighton Heights')\nRETURN sum(`t3`.`count`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total checkins in \" Brighton Heights \" neighbourhood",
    "evidence": "",
    "idx": 1069
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nMATCH (`t3`:`category`)-[category_of_1:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND (`t1`.`state` = 'Texas' AND `t2`.`category_name` = 'Moroccan' AND `t3`.`category_name` = 'restaurant')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me all the Moroccan restaurant in Texas",
    "evidence": "",
    "idx": 1073
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nMATCH (`t3`:`category`)-[category_of_1:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND (`t1`.`city` = 'Dallas' AND `t1`.`rating` > 3.5 AND `t2`.`category_name` = 'Mexican' AND `t3`.`category_name` = 'restaurant')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all Mexican restaurant in Dallas with at least 3.5 stars",
    "evidence": "",
    "idx": 1074
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nMATCH (`t3`:`category`)-[category_of_1:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`business_id` = `t1`.`business_id`\nAND (`t1`.`city` = 'Dallas' AND `t1`.`state` = 'Texas' AND `t2`.`category_name` = 'Valet Service' AND `t3`.`category_name` = 'restaurant')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all restaurant with Valet Service in Dallas Texas",
    "evidence": "",
    "idx": 1076
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`category`)-[category_of_0:category_of]->(`t1`:`business`)-[neighbourhood_of_0:neighbourhood_of]->(`t2`:`neighbourhood`)\nMATCH (`t4`:`category`)-[category_of_1:category_of]->(`t1`:`business`)\nWHERE `t3`.`business_id` = `t1`.`business_id`\nAND `t4`.`business_id` = `t1`.`business_id`\nAND `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`city` = 'Madison' AND `t3`.`category_name` = 'Italian' AND `t4`.`category_name` = 'restaurant' AND `t2`.`neighbourhood_name` = 'Meadowood')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all Italian restaurant in the Meadowood neighbourhood of Madison",
    "evidence": "",
    "idx": 1077
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`city` = 'Los Angeles' AND `t1`.`rating` > 3 AND `t1`.`review_count` > 30 AND `t2`.`category_name` = 'Bars')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all Bars in \" Los Angeles \" with at least 30 reviews and average rating above 3 stars",
    "evidence": "",
    "idx": 1078
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:reviewed]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`rating`) AS _groupby_col_1\nWHERE _groupby_col_1 < 3\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find users whose average review rating is below 3",
    "evidence": "",
    "idx": 1080
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`journal`:`journal`)\nWHERE `journal`.`name` = 'PVLDB'\nRETURN `journal`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the homepage of PVLDB .",
    "evidence": "",
    "idx": 1081
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`author`:`author`)\nWHERE `author`.`name` = 'H. V. Jagadish'\nRETURN `author`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the homepage of \" H. V. Jagadish \" .",
    "evidence": "",
    "idx": 1082
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`title` = 'Making database systems usable'\nRETURN `publication`.`abstract` AS `abstract`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the abstract of \" Making database systems usable \" .",
    "evidence": "",
    "idx": 1083
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`title` = 'Making database systems usable'\nRETURN `publication`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the year of \" Making database systems usable \"",
    "evidence": "",
    "idx": 1084
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`year` > 2000\nRETURN `publication`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the papers after 2000 .",
    "evidence": "",
    "idx": 1086
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`conference`:`conference`)\nWHERE `conference`.`name` = 'VLDB'\nRETURN `conference`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the homepage of the VLDB conference .",
    "evidence": "",
    "idx": 1087
  }
]