[
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)-[t4:`from_region`]->(t5@`noc_region`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND t3.`id` = t4.`person_id`\nAND t4.`region_id` = t5.`id`\nAND (t1.`games_name` = '2016 Summer' AND t5.`region_name` = 'China')\nRETURN COUNT(t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many athlete from China participate in the 2016 Summer Olympics?",
    "evidence": "athletes from China refer to person_id where region_name = 'China'; the 2016 Summer Olympics refer to games_name = '2016 Summer';",
    "idx": 2556
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`event`)-[t2:`awards_medal`]->()\nWHERE t1.`id` = t2.`event_id`\nAND (like(t1.`event_name`,'Ice Hockey Men%s Ice Hockey') AND t2.`medal_id` = 1)\nRETURN COUNT(t2.`competitor_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many gold medals were given to the winners in the Ice Hockey Men's Ice Hockey event?",
    "evidence": "gold medals given to the winners refer to competitor_id where medal_name = 'Gold'; Ice Hockey Men's Ice Hockey refers to event_name = 'Ice Hockey Men''s Ice Hockey';",
    "idx": 2557
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`games_name` = '2002 Winter' AND t2.`age` < 20)\nRETURN cast (COUNT(CASE  WHEN t3.`gender` = 'F' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of female athletes below 20s who participated in the 2002 Winter Olympic?",
    "evidence": "DIVIDE(COUNT(person_id where gender = 'F' and age < 20), COUNT(person_id)) as percentage where games_name = '2002 Winter';",
    "idx": 2559
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`games_name` = '2012 Summer')\nRETURN cast (COUNT(CASE  WHEN t3.`gender` = 'M' THEN 1 ELSE NULL END) as float) / COUNT(CASE  WHEN t3.`gender` = 'F' THEN 1 ELSE NULL END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio male to female athletes in the 2012 Summer Olympic?",
    "evidence": "DIVIDE(COUNT(gender = 'M'), COUNT(gender = 'F')) where games_name = '2012 Summer';",
    "idx": 2560
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`region_name` = 'Philippines' AND t3.`gender` = 'F')\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female athletes are from the Philippines?",
    "evidence": "female athletes refer to id where gender = 'F'; from the Philippines region_name = 'Philippines';",
    "idx": 2561
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`full_name` = 'Yao Ming')\nRETURN t1.`region_name` AS `region_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which region is Yao Ming from?",
    "evidence": "region refers to region_name;",
    "idx": 2562
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nWHERE t1.`id` = t2.`person_id`\nAND (t1.`full_name` = 'Michael Fred Phelps, II')\nORDER BY t2.`age`  NULLS FIRST \nRETURN t2.`age` AS `age` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "At what age did Michael Fred Phelps, II join the Olympics?",
    "evidence": "At what age join the Olympics refers to MIN(age);",
    "idx": 2563
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "CALL {\nMATCH ()-[t1_sub0:`has_person`]->(t2_sub0@`person`)\nWHERE t1_sub0.`person_id` = t2_sub0.`id`\nAND (t2_sub0.`full_name` = 'Clara Hughes')\nRETURN t1_sub0.`region_id` AS `region_id` \n}\nMATCH ()-[person_region:`from_region`]->()\nWHERE person_region.`region_id` = region_id\nRETURN COUNT(person_region.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many athletes are there in the region where Clara Hughes is from?",
    "evidence": "",
    "idx": 2564
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nMATCH ()-[t3:`awarded_in`]->(t4@`event`)\nWHERE t1.`id` = t2.`person_id`\nAND t2.`id` = t3.`competitor_id`\nAND t3.`event_id` = t4.`id`\nAND (t1.`full_name` = 'Ian James Thorpe' AND like(t4.`event_name`,'Swimming Men%s 200 metres Freestyle'))\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Men's 200 Metres Freestyle events did Ian James Thorpe compete in?",
    "evidence": "Men's 200 Metres Freestyle events refer to event_name = 'Swimming Men''s 200 metres Freestyle'; events compete in refers to event_id;",
    "idx": 2565
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`event`)-[t2:`awards_medal`]->()\nMATCH ()-[t3:`has_competitor`]->(t4@`person`)\nWHERE t1.`id` = t2.`event_id`\nAND t2.`competitor_id` = t3.`id`\nAND t3.`person_id` = t4.`id`\nAND (t4.`full_name` = 'Larysa Semenivna Latynina (Diriy-)' AND like(t1.`event_name`,'Gymnastics Women%s Individual All-Around') AND t2.`medal_id` = 1)\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times was Larysa Semenivna Latynina (Diriy-) declared as champion in Gymnastics Women's Individual All-Around?",
    "evidence": "Gymnastics Women's Individual All-Around refers to event_name = 'Gymnastics Women''s Individual All-Around'; declared as champion refers to medal_name = 'Gold' or medal_id = 1;",
    "idx": 2566
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nMATCH ()-[t3:`held_in`]->(t4@`city`)\nWHERE t1.`id` = t2.`person_id`\nAND t2.`games_id` = t3.`games_id`\nAND t3.`city_id` = t4.`id`\nAND (t1.`full_name` = 'Carl Lewis Borack')\nRETURN t4.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the cities where Carl Lewis Borack competed?",
    "evidence": "name of the cities refers to city_name",
    "idx": 2567
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`id`\nAND (t2.`city_name` = 'London')\nRETURN COUNT(t1.`games_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Olympic games were held in London?",
    "evidence": "London refers to city_name = 'London';",
    "idx": 2568
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t3.`games_name` = '1992 Summer')\nRETURN t2.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city was the 1992 Summer Olympic held?",
    "evidence": "city refers to city_name; 1992 Summer Olympic refers to games_name = '1992 Summer';",
    "idx": 2569
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`games_name` = '2016 Summer' AND t2.`age` > 59)\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many athletes over the age of 59 competed in the 2016 Summer Olympics?",
    "evidence": "over the age of 59 refers to age > 59; the 2016 Summer Olympics refer to games_name = '2016 Summer';",
    "idx": 2570
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t2:`participated_in`]->()\nMATCH ()-[t1:`awarded_in`]->(t3@`event`)\nWHERE t1.`competitor_id` = t2.`id`\nAND t1.`event_id` = t3.`id`\nAND (like(t3.`event_name`,'Gymnastics Men%s Parallel Bars, Teams') AND t2.`age` = 10)\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many 10-year old athletes participated in the Gymnastics Men's Parallel Bars, Teams event?",
    "evidence": "10-year old athletes refer to competitor_id where age = 10; Gymnastics Men's Parallel Bars, Teams refer to event_name = 'Gymnastics Men''s Parallel Bars, Teams';",
    "idx": 2571
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t3:`from_region`]->(t4@`noc_region`)\nMATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`person_id`\nAND t3.`region_id` = t4.`id`\nAND (t1.`games_name` = '2016 Summer' AND t4.`region_name` = 'USA')\nRETURN avg(t2.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average age of the athletes from the United States of America who competed in the 2016 Summer Olympics?",
    "evidence": "AVG(age) where games_name = '2016 Summer' and region_name = 'USA';",
    "idx": 2572
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (city@`city`)\nWHERE city.`city_name` = 'Rio de Janeiro'\nRETURN city.`id` AS `id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the id of Rio de Janeiro?",
    "evidence": "Rio de Janeiro refers to city_name = 'Rio de Janeiro';",
    "idx": 2578
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t2@`event`)-[belongs_to_sport_0:`belongs_to_sport`]->(t1@`sport`)\nWHERE t1.`id` = t2.`sport_id`\nAND (t1.`sport_name` = 'Cycling')\nRETURN COUNT(t2.`event_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many kinds of events belong to the sport of cycling?",
    "evidence": "kinds of events refer to event_name; sport of cycling refers to sport_name = 'Cycling';",
    "idx": 2580
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`full_name` = 'Vijay Singh Chauhan')\nRETURN t1.`region_name` AS `region_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is Vijay Singh Chauhan's region name?",
    "evidence": "",
    "idx": 2581
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t2.`city_name` = 'Roma')\nRETURN t3.`games_year` AS `games_year`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did Roma host the Olympic Games?",
    "evidence": "Roma refers to city_name = 'Roma'; When host refers to games_year;",
    "idx": 2582
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`games_name` = '1984 Summer' AND t2.`age` = 20)\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many 20 years old athletes were there in the 1984 Summer Olympic Games?",
    "evidence": "20 years old athletes refer to person_id where age = 20; 1984 Summer Olympic Games refer to games_name = '1984 Summer';",
    "idx": 2583
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nWHERE t1.`id` = t2.`person_id`\nAND (t1.`full_name` = 'Prithipal Singh')\nRETURN COUNT(t2.`games_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games has Prithipal Singh participated in?",
    "evidence": "games refer to games_id;",
    "idx": 2584
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t2@`event`)-[belongs_to_sport_0:`belongs_to_sport`]->(t1@`sport`)\nWHERE t1.`id` = t2.`sport_id`\nAND (t1.`sport_name` = 'Athletics')\nRETURN COUNT(t2.`event_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many kinds of events does athletics have?",
    "evidence": "kinds of events refer to event_name; athletics refer to sport_name = 'Athletics';",
    "idx": 2586
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`region_name` = 'Russia')\nORDER BY t3.`weight` DESC NULLS LAST \nRETURN t3.`full_name` AS `full_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the heaviest athlete from Russia?",
    "evidence": "the heaviest athlete refers to full_name where MAX(weight); from Russia refers to region_name = 'Russia';",
    "idx": 2587
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`region_name` = 'Vanuatu')\nRETURN cast (COUNT(CASE  WHEN t3.`height` > 175 THEN 1 ELSE NULL END) as float) * 100 / COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of athletes from Vanuatu who are taller than 175?",
    "evidence": "DIVIDE(COUNT(id where height > 175), COUNT(id)) as percentage where region_name = 'Vanuatu';",
    "idx": 2590
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t3.`games_name` = '1920 Summer')\nRETURN t2.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Where was the 1920 Summer held?",
    "evidence": "where it was held refers to city_name; the 1920 Summer refers to games_name = '1920 Summer';",
    "idx": 2592
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t2.`city_name` = 'London' AND t3.`games_year` >= 1900 AND t3.`games_year` <= 1992)\nRETURN COUNT(t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From 1900 to 1992, how many games did London host?",
    "evidence": "From 1900 to 1992 refers to games_year BETWEEN 1900 AND 1992; London refers to city_name = 'London'; games refer to games_name;",
    "idx": 2593
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t2.`city_name` = 'Paris' AND t3.`season` = 'Summer')\nRETURN COUNT(t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Summer games are there that were held in Paris?",
    "evidence": "Summer games refer to games_id where season = 'Summer'; Paris refers to city_name = 'Paris';",
    "idx": 2594
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t2.`city_name` = 'Beijing' AND t3.`games_year` = 2008)\nRETURN t3.`games_name` AS `games_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the game name that was held in Beijing in 2008?",
    "evidence": "Beijing refers to city_name = 'Beijing'; in 2008 refers to games_year = '2008';",
    "idx": 2596
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`awards_medal`]->()\nMATCH ()-[t2:`participated_in`]->()\nWHERE t1.`competitor_id` = t2.`id`\nAND (t1.`medal_id` = 1)\nRETURN cast (COUNT(CASE  WHEN t2.`age` > 30 THEN 1  END) as float) * 100 / COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of champions at the age of over 30?",
    "evidence": "DIVIDE(COUNT(competitor_id where age > 30), COUNT(competitor_id))as percentage where medal_id = 1;",
    "idx": 2597
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`games_name` = '2012 Summer' AND t3.`full_name` = 'A Lamusi')\nRETURN t2.`age` AS `age`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "At which age did A Lamusi participate in 2012 Summer?",
    "evidence": "2012 Summer refers to games_name = '2012 Summer';",
    "idx": 2598
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`games_name` = '2000 Summer' AND t2.`age` = 31)\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many competitors were there who participated in 2000 Summer with age 31?",
    "evidence": "in 2000 Summer refers to games_name = '2000 Summer'; age = 31",
    "idx": 2599
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`games_name` = '1948 Summer' AND t3.`gender` = 'M')\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many male competitors were there who participated in 1948 Summer?",
    "evidence": "male competitors refers to id where gender = 'M'; in 1948 Summer refers to games_name = '1948 Summer';",
    "idx": 2600
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`games_name` = '2014 Winter')\nORDER BY t2.`age`  NULLS FIRST \nRETURN t3.`full_name` AS `full_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the youngest competitor that participated in 2014 Winter?",
    "evidence": "the youngest competitor refers to full_name where MIN(age); in 2014 Winter refers to games_name = '2014 Winter';",
    "idx": 2602
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`games_name` = '1988 Winter')\nRETURN avg(t2.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average age of competitors who participated in 1988 Winter?",
    "evidence": "AVG(age) where games_name = '1988 Winter';",
    "idx": 2603
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`games_year` = 1988)\nRETURN cast (COUNT(CASE  WHEN t3.`gender` = 'F' AND t3.`height` > 170 THEN 1  END) as float) * 100 / COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of female competitors whose heights are over 170 that participated in the game in 1988?",
    "evidence": "DIVIDE(COUNT(person_id where gender = 'F' and height > 170), COUNT(person_id)) as percentage where games_year = 1988;",
    "idx": 2604
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nRETURN cast (COUNT(CASE  WHEN t2.`age` > 24 AND t1.`season` = 'Winter' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t2.`games_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of people whose age greater than 24 and participate in winter season?",
    "evidence": "DIVIDE(COUNT(season = 'Winter' and age > 24), COUNT(person_id)) as percentage;",
    "idx": 2606
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`has_person`]->(t2@`person`)\nWHERE t1.`person_id` = t2.`id`\nAND (t2.`full_name` = 'Christine Jacoba Aaftink')\nRETURN t1.`region_id` AS `region_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the region id of Christine Jacoba Aaftink?",
    "evidence": "",
    "idx": 2607
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`id`\nAND (t2.`city_name` = 'London')\nRETURN t1.`games_id` AS `games_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the id of the games held in London?",
    "evidence": "London refers to city_name = 'London';",
    "idx": 2610
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`season` = 'Summer' AND t2.`age` < 30)\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many people who are below 30 and participated in the summer season?",
    "evidence": "people who are below 30 refer to person_id where age < 30; the summer season refers to season = 'Summer';",
    "idx": 2611
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`season` = 'Winter')\nRETURN avg(t2.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average age of the people who participated in the winter season?",
    "evidence": "AVG(age) where season = 'Winter';",
    "idx": 2613
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`season` = 'Summer')\nRETURN cast (COUNT(CASE  WHEN t2.`age` < 35 THEN 1  END) as float) * 100 / COUNT(t2.`games_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of the people who are under 35 and participated in the summer season?",
    "evidence": "DIVIDE(COUNT(age < 35) / COUNT(person_id)) as percentage where season = 'Summer';",
    "idx": 2614
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`medal`)-[t2:`awarded_in`]->()\nWHERE t1.`id` = t2.`medal_id`\nAND (t2.`competitor_id` = 9)\nRETURN DISTINCT t1.`medal_name` AS `medal_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of medal that competitor id 9 obtained?",
    "evidence": "name of medal refers to medal_name;",
    "idx": 2616
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (person@`person`)\nORDER BY person.`weight` DESC NULLS LAST \nRETURN person.`full_name` AS `full_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the heaviest athlete?",
    "evidence": "Who refers to full_name; the heaviest refers to MAX(weight);",
    "idx": 2618
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t3.`games_year` = 1992)\nRETURN t2.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city were the Olympic games held in 1992?",
    "evidence": "city refers to city_name; in 1992 refers to games_year = 1992;",
    "idx": 2619
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nWHERE t1.`id` = t2.`person_id`\nORDER BY t2.`age` DESC NULLS LAST \nRETURN t1.`full_name` AS `full_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the oldest competitor?",
    "evidence": "name refers to full_name; the oldest refers to MAX(age);",
    "idx": 2620
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`region_name` = 'Belgium' AND t3.`gender` = 'M')\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Belgian men have competed in an Olympic Games?",
    "evidence": "Belgian men refer to gender = 'M' where region_name = 'Belgium';",
    "idx": 2621
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t2:`held_in`]->(t3@`city`)\nMATCH ()-[t1:`participated_in`]->()\nWHERE t1.`games_id` = t2.`games_id`\nAND t2.`city_id` = t3.`id`\nAND (t3.`city_name` = 'Barcelona')\nRETURN COUNT(t1.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many athletes took part in the Olympic games held in Barcelona?",
    "evidence": "Barcelona refers to city_name = 'Barcelona';",
    "idx": 2622
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t2@`event`)-[belongs_to_sport_0:`belongs_to_sport`]->(t1@`sport`)\nWHERE t1.`id` = t2.`sport_id`\nAND (t1.`sport_name` = 'Football')\nRETURN COUNT(t2.`event_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many different football events are there?",
    "evidence": "events refer to event_name; football refers to sport_name = 'Football';",
    "idx": 2623
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nMATCH ()-[t3:`held_in`]->(t4@`city`)\nWHERE t1.`id` = t2.`person_id`\nAND t2.`games_id` = t3.`games_id`\nAND t3.`city_id` = t4.`id`\nAND (t1.`full_name` = 'John Aalberg')\nRETURN t4.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What were the cities in which John Aalberg competed?",
    "evidence": "cities refer to city_name;",
    "idx": 2624
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`id`\nAND (t2.`city_name` = 'Barcelona')\nRETURN COUNT(t1.`games_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In Barcelona, how many Olympic games were held?",
    "evidence": "Barcelona refers to city_name = 'Barcelona';",
    "idx": 2625
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`games_name` = '1992 Winter' AND t2.`age` > 30)\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many competitors over the age of 30 participated in the 1992 Winter Olympics?",
    "evidence": "competitors over the age of 30 refer to person_id where age > 30; the 1992 Winter Olympics refers to games_name = '1992 Winter';",
    "idx": 2626
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t3:`from_region`]->(t4@`noc_region`)\nMATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`person_id`\nAND t3.`region_id` = t4.`id`\nAND (t1.`games_name` = '2012 Summer' AND t4.`region_name` = 'Argentina')\nRETURN avg(t2.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average age of Argentina's athletes who participated in the Summer Olympics in 2012?",
    "evidence": "AVG(age) where games_name = '2012 Summer' and region_name = 'Argentina';",
    "idx": 2628
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`weight` = 77)\nRETURN t1.`noc` AS `noc`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the NOC code of the region of the competitors weighted 77 kg?",
    "evidence": "NOC code refers to noc; competitors weighted 77 kg refer to person_id where weight = 77;",
    "idx": 2632
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`participated_in`]->(t2@`games`)\nMATCH ()-[t3:`held_in`]->(t4@`city`)\nWHERE t1.`games_id` = t2.`id`\nAND t1.`games_id` = t3.`games_id`\nAND t3.`city_id` = t4.`id`\nORDER BY t1.`age` DESC NULLS LAST \nRETURN t4.`city_name` AS `city_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which city was the game held where the oldest competitor participated?",
    "evidence": "in which city refers to city_name; the oldest refers to MAX(age);",
    "idx": 2635
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nWHERE t1.`id` = t2.`person_id`\nORDER BY t2.`age`  NULLS FIRST \nRETURN t1.`full_name` AS `full_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the youngest competitor?",
    "evidence": "name refers to full_name; the youngest refers to MIN(age);",
    "idx": 2636
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`full_name` = 'Sohail Abbas')\nRETURN t1.`games_year` AS `games_year`, t1.`season` AS `season`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In what year and season did Sohail Abbas compete?",
    "evidence": "year refers to games_year;",
    "idx": 2639
  }
]