[
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (person@`person`)\nWHERE person.`birth_country` = 'USA'\nRETURN person.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the actors born in the USA?",
    "evidence": "born in the USA refers to birth_country = 'USA'",
    "idx": 735
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`episode`)-[has_vote_0:`has_vote`]->(t2@`vote`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t2.`stars` = 1)\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the episodes that were least enjoyed?",
    "evidence": "least enjoyed refers to stars = 1",
    "idx": 736
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`person`)-[t2:`nominated_for`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t2.`result` = 'Winner' AND t2.`role` = 'director')\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the two people who won an award for their role as directors?",
    "evidence": "won an award refers to result = 'Winner'; role as director refers to role = 'director'",
    "idx": 737
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`episode`)-[has_vote_0:`has_vote`]->(t2@`vote`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t1.`title` = 'Juvenile')\nRETURN sum(t2.`votes`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many votes did the episode titled Juvenile get?",
    "evidence": "the episode titled Juvenile refers to title = 'Juvenile'",
    "idx": 738
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t3@`person`)-[t2:`worked_on`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND t3.`person_id` = t2.`person_id`\nAND (t2.`credited` = 'false' AND t3.`name` = 'Anthony Azzara')\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which episodes was Anthony Azzara not credited?",
    "evidence": "which episode refers to title; not credited refers to credited = ''",
    "idx": 739
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t1:`nominated_for`]->(t2@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t2.`title` = 'DWB' AND t1.`result` = 'Winner')\nRETURN DISTINCT t1.`year` AS `year`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In what year did the episodes titled DWB get an award?",
    "evidence": "titled DWB refers to title = 'DWB'; get an award refers to result = 'Winner'",
    "idx": 740
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t1.`role` = 'president of NBC West Coast')\nRETURN t2.`birth_region` AS `birth_region`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which region were the assistant location managers born?",
    "evidence": "region refers to birth_region; assistant location manager refers to role = 'assistant location manager'",
    "idx": 741
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t3@`person`)-[t2:`worked_on`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND t3.`person_id` = t2.`person_id`\nAND (t3.`name` = 'Donna Villella')\nRETURN COUNT(t3.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stars did the episodes in which Donna Villella worked?",
    "evidence": "",
    "idx": 742
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`person`)-[t2:`nominated_for`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t2.`result` = 'Nominee' AND t1.`name` = 'Julia Roberts')\nRETURN t2.`role` AS `role`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What role was Julia Roberts nominated for?",
    "evidence": "nominated refers to result = 'Nominee'",
    "idx": 743
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`person`)-[t2:`worked_on`]->()\nMATCH ()-[t3:`nominated_for`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND t2.`episode_id` = t3.`episode_id`\nORDER BY t1.`height_meters` DESC NULLS LAST \nRETURN t2.`role` AS `role` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What role does the tallest person play?",
    "evidence": "the tallest refers to max(height_meters)",
    "idx": 744
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t3@`person`)-[t2:`worked_on`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND t3.`person_id` = t2.`person_id`\nAND (t3.`name` = 'Jace Alexander')\nRETURN t1.`rating` AS `rating`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the rating of the episodes that Jace Alexander worked on?",
    "evidence": "",
    "idx": 745
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t3@`person`)-[t2:`worked_on`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND t3.`person_id` = t2.`person_id`\nAND (t1.`episode` = 19 AND t1.`season` = 9)\nRETURN t3.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of all the people who worked on episode 19 of season 9?",
    "evidence": "",
    "idx": 746
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t3@`vote`)\nMATCH (t1@`person`)-[t2:`worked_on`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND t2.`episode_id` = t3.`episode_id`\nAND (t3.`stars` = 1 AND t1.`name` = 'Jim Bracchitta')\nRETURN cast (sum(t3.`stars`) as float) / COUNT(t2.`episode_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average star rating of the episodes Jim Bracchitta has worked on?",
    "evidence": "average star rating = divide(sum(stars), count(episode_id)) where name = 'Jim Bracchitta'",
    "idx": 747
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t2:`worked_on`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t1.`title` = 'True North')\nRETURN cast (sum(CASE  WHEN t2.`role` = 'Additional Crew' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`episode_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of people have worked on the True North episode as additional crew?",
    "evidence": "the True North episode refers to title = 'True North'; additional crew refers to role = 'Additional Crew'; percentage = divide(count(episode_id where role = 'Additional Crew'), count(episode_id)) * 100% where title = 'True North'",
    "idx": 748
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t2:`nominated_for`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t2.`year` = 1999 AND t2.`result` = 'Nominee' AND t1.`episode` = 20 AND t2.`organization` = 'Primetime Emmy Awards' AND t1.`series` = 'Law and Order')\nRETURN COUNT(t2.`award_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times was episode 20 of the Law and Order series nominated for the Primetime Emmy Awards in 1999?",
    "evidence": "nominated refers to result = 'nominee'; the Law and Order series refers to series = 'Law and Order'; the Primetime Emmy Awards refers to organization = 'Primetime Emmy Awards'; in 1999 refers to year = 1999",
    "idx": 753
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t1.`episode_id` = 'tt0629228' AND t1.`category` = 'Cast' AND t1.`credited` = 'false' AND t2.`birth_country` = 'USA')\nRETURN COUNT(t1.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the American casts, how many were uncredited on episode ID tt0629228?",
    "evidence": "American refers to birth_country = 'USA'; cast refers to category = 'Cast'; uncredited refers to credited = ''",
    "idx": 756
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->(t3@`episode`)\nWHERE t2.`person_id` = t1.`person_id`\nAND t1.`episode_id` = t3.`episode_id`\nAND (t3.`episode` = 9 AND t2.`name` = 'Jason Kuschner')\nRETURN t1.`role` AS `role`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the role of Jason Kuschner in episode 9?",
    "evidence": "",
    "idx": 757
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->(t3@`episode`)\nWHERE t2.`person_id` = t1.`person_id`\nAND t1.`episode_id` = t3.`episode_id`\nAND (t3.`episode` = 1 AND t1.`role` = 'president of NBC West Coast')\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who played the role of the \"president of NBC West Coast\" in the first episode?",
    "evidence": "who refers to name; the role of the \"president of NBC West Coast\" refers to role = 'president of NBC West Coast'; the first episode refers to episode = 1",
    "idx": 758
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`person`)-[t2:`nominated_for`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`birth_country` = 'Canada')\nRETURN COUNT(t1.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many people from Canada are nominated for an award?",
    "evidence": "from Canada refers to birth_country = Canada; nominated refers to award is NOT NULL",
    "idx": 760
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t2.`name` = 'Jerry Orbach')\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many episodes are credited to Jerry Orbach?",
    "evidence": "",
    "idx": 761
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t2:`nominated_for`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t2.`result` = 'Nominee')\nRETURN t1.`episode` AS `episode`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which episodes are nominated for an awards but not win?",
    "evidence": "nominated for an award but not win refers to result = 'Nominee'",
    "idx": 765
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (episode@`episode`)\nWHERE episode.`season` = 9\nRETURN sum(episode.`rating`) / COUNT(episode.`episode_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average rating for each episode in season 9?",
    "evidence": "average rating = divide(sum(rating), count(episode_id))",
    "idx": 766
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`episode`)-[has_vote_0:`has_vote`]->(t1@`vote`)\nWHERE t2.`episode_id` = t1.`episode_id`\nAND (t1.`stars` = 10)\nRETURN sum(CASE  WHEN t2.`episode` = 24 THEN t1.`votes` ELSE 0 END) - sum(CASE  WHEN t2.`episode` = 1 THEN t1.`votes` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the difference of 10 stars votes between the first episode and the last episode?",
    "evidence": "the first episode refers to episode = 1; the last episode refers to episode = 24; 10 stars vote refers to stars = 10; the difference = subtract(votes where episode = 1, votes where episode = 24) where stars = 10",
    "idx": 767
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t1:`worked_on`]->(t2@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t1.`credited` = 'true' AND t2.`episode` >= 1 AND t2.`episode` <= 10)\nRETURN COUNT(t1.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many credits have been displayed from episode 1 until 10?",
    "evidence": "credit displayed refers to credited = 'true'; from episode 1 until 10 refers to episode > = 1 AND episode < = 10",
    "idx": 768
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`episode`)-[has_keyword_0:`has_keyword`]->(t2@`keyword`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t2.`keyword` = 'mafia')\nRETURN t1.`episode` AS `episode`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the episode that has mafia keyword?",
    "evidence": "mafia keyword refers to Keyword = 'mafia'",
    "idx": 769
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`vote`)\nMATCH ()-[t2:`nominated_for`]->()\nWHERE t1.`episode_id` = t2.`episode_id`\nORDER BY t1.`percent` DESC NULLS LAST \nRETURN t2.`person_id` AS `person_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average star with highest percentage for episodes that have received award?",
    "evidence": "received award refers to result = 'Winner'; the highest percentage refers to max(percent); average star = divide(sum(stars), count(episode_id))",
    "idx": 770
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t2:`nominated_for`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nRETURN sum(t1.`rating`) / COUNT(t1.`episode`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average ranking episodes that are nominated for an award?",
    "evidence": "average ranking = divide(sum(rating), sum(episode_id))",
    "idx": 771
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (person@`person`)\nWHERE person.`name` = 'Michael Preston'\nRETURN person.`birth_country` AS `birth_country`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which continent was Michael Preston born on?",
    "evidence": "continent refers to birth_country",
    "idx": 773
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`nominated_for`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`result` = 'Nominee' AND t1.`role` = 'Katrina Ludlow' AND t1.`series` = 'Law and Order')\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who was the nominee playing the role of Katrina Ludlow in the Law & Order series?",
    "evidence": "nominee refers to result = 'Nominee'; the role of Katrina Ludlow refers to role = 'Katrina Ludlow'",
    "idx": 774
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`person`)-[t2:`worked_on`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t2.`role` = 'Alex Brown' AND t2.`credited` = 'true')\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who was the actor who was portraying \"Alex Brown\" and has been credited?",
    "evidence": "who refers to name; portraying \"Alex Brown\" refers to role = 'Alex Brown'; has been credited refers to credited = 'true'",
    "idx": 778
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`nominated_for`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`result` = 'Winner' AND t2.`height_meters` > 1.80)\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who are the actors with a height of over 1.80m in an episode that won an award?",
    "evidence": "who refers to name; a height of over 1.80m refers to height_meters > 1.80; won an award refers to result = 'Winner'",
    "idx": 781
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "CALL {\nMATCH (offices_sub0@`offices`)\nWHERE offices_sub0.`city` = 'Sydney'\nRETURN offices_sub0.`officecode` AS `officecode` \n}\nMATCH (employees@`employees`)\nWHERE employees.`officecode` = officecode\nRETURN COUNT(employees.`employeenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many employees are there in Sydney?",
    "evidence": "sales agent and sales representative are synonyms; Sydney is a city;",
    "idx": 786
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`payments`)-[is_made_by_0:`is_made_by`]->(t2@`customers`)\nWHERE t1.`customernumber` = t2.`customernumber`\nAND (t1.`paymentdate` >= date('2003-01-01') AND t1.`paymentdate` <= date('2005-12-31'))\nRETURN cast (sum(t1.`amount`) as float) / 3 AS `_col_0`, MAX(t1.`amount`) AS `_col_1`, min(t1.`amount`) AS `_col_2`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average, highest and lowest annual payments collected between 1/1/2003 to 12/31/2005?",
    "evidence": "paymentDate BETWEEN '2003-01-01' AND '2005-12-31'; average annual payments = DIVIDE(SUM(amount), 3);",
    "idx": 788
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`orders`)\nMATCH (t1@`orderdetails`)\nWHERE t1.`ordernumber` = t2.`ordernumber`\nAND (t1.`quantityordered` * t1.`priceeach` > 4000 AND t2.`status` = 'Cancelled')\nRETURN COUNT(DISTINCT t1.`ordernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many different orders with a total price greater than 4000 are cancelled?",
    "evidence": "total price = MULTIPLY(quantityOrdered, priceEach) > 4000; cancelled orders refer to status = 'Cancelled';",
    "idx": 790
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`orders`)\nMATCH (t1@`orderdetails`)\nWHERE t1.`ordernumber` = t2.`ordernumber`\nAND (t2.`status` = 'Cancelled')\nRETURN sum(t1.`quantityordered` * t1.`priceeach`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total value of cancelled orders?",
    "evidence": "total value = SUM(MULTIPLY(quantityOrdered, priceEach)); cancelled orders refers to status = 'Cancelled';",
    "idx": 791
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`products`)\nMATCH (t1@`orderdetails`)\nWHERE t1.`productcode` = t2.`productcode`\nAND (t2.`productline` = 'Planes')\nRETURN COUNT(t1.`productcode`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Planes orders were there?",
    "evidence": "Planes is a product line;",
    "idx": 793
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`products`)\nMATCH (t1@`orderdetails`)\nWHERE t1.`productcode` = t2.`productcode`\nAND (t2.`msrp` - t2.`buyprice` > 100)\nRETURN COUNT(t1.`productcode`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders which expected profits greater than 100?",
    "evidence": "expected profits greater than 100 = (SUBTRACT(msrp, buyPrice))>100;",
    "idx": 794
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (employees@`employees`)\nWHERE employees.`jobtitle` = 'Sales Rep' AND employees.`officecode` = '1'\nRETURN COUNT(employees.`officecode`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales representatives who have office code is 1?",
    "evidence": "sales representative refers to jobTitle = 'Sales Rep';",
    "idx": 795
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`employees`)-[works_in_0:`works_in`]->(t2@`offices`)\nWHERE t1.`officecode` = t2.`officecode`\nAND (t2.`city` = 'Tokyo')\nRETURN t1.`firstname` AS `firstname`, t1.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List out full name of employees who are working in Tokyo?",
    "evidence": "Tokyo is a city; full name = firstName+lastName;",
    "idx": 800
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`creditlimit` < 220000 AND customers.`country` = 'Australia'\nRETURN COUNT(customers.`creditlimit`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Australian customers who have credit line under 220000?",
    "evidence": "Australian is a nationality of country = 'Australia'; credit line refers to creditLimit; creditLimit < 220000;",
    "idx": 807
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`employees`)-[works_in_0:`works_in`]->(t2@`offices`)\nWHERE t1.`officecode` = t2.`officecode`\nAND (t2.`city` = 'Boston')\nRETURN t1.`firstname` AS `firstname`, t1.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List out full name of employees who are working in Boston?",
    "evidence": "full name = contactFirstName, contactLastName; Boston is a city;",
    "idx": 809
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`creditlimit` < 220000 AND customers.`country` = 'Norway'\nRETURN COUNT(customers.`creditlimit`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers who are in Norway and have credit line under 220000?",
    "evidence": "Norway is a country; credit line refers to creditLimit; creditLimit<220000;",
    "idx": 810
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`employees`)-[works_in_0:`works_in`]->(t2@`offices`)\nWHERE t1.`officecode` = t2.`officecode`\nAND (t2.`city` = 'Paris')\nRETURN t1.`firstname` AS `firstname`, t1.`lastname` AS `lastname`, t1.`email` AS `email`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List out full name and email of employees who are working in Paris?",
    "evidence": "full name = firstName+LastName; Paris is a city;",
    "idx": 811
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`creditlimit` = 0 AND customers.`country` = 'Germany'\nRETURN COUNT(customers.`customernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the German customers, how many of the them has credit limit of zero?",
    "evidence": "German is a nationality of country = 'Germany'; CREDITLIMIT = 0",
    "idx": 813
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`products`)\nMATCH (t1@`orderdetails`)\nWHERE t1.`productcode` = t2.`productcode`\nAND (t2.`productname` = '1937 Lincoln Berline')\nRETURN sum(t1.`priceeach` - t2.`buyprice`) / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average actual profit by 1937 Lincoln Berline?",
    "evidence": "average actual profit = AVG(SUBTRACT(priceEach, buyPrice)); 1937 Lincoln Berline is a product name;",
    "idx": 814
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (products_sub0@`products`)\nWHERE products_sub0.`productline` = 'Planes'\nRETURN collect(products_sub0.`productcode`) AS `productcode` \n} \nMATCH (orderdetails@`orderdetails`)\nWHERE orderdetails.`productcode` IN in_collect_0\nRETURN MAX(orderdetails.`quantityordered` * orderdetails.`priceeach`) - avg(orderdetails.`priceeach`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the planes which has the hightest total price, how much it exceeds the average?",
    "evidence": "plane is a product line; total price = MULTIPLY(quantityOrdered, priceEach); how much the total price exceeds the average = SUBTRACT(MAX(MULTIPLY(quantityOrdered, priceEach))), AVG(priceEach));",
    "idx": 816
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE like(customers.`contactlastname`,'M%') AND customers.`country` <> 'Germany'\nRETURN customers.`phone` AS `phone`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the phone number of all companies where the last name of the contact person starts with the letter M and are not from Germany?",
    "evidence": "last name of contact person starts with M refers to lastName LIKE 'M%'; Germany is a country; not from Germany refers to country<>'Germany';",
    "idx": 818
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (orders@`orders`)\nWHERE orders.`status` = 'Shipped' AND orders.`shippeddate` >= date('2005-01-01') AND orders.`shippeddate` <= date('2005-12-31')\nRETURN cast (sum(CASE  WHEN orders.`customernumber` = 186 THEN 1 ELSE 0 END) as float) * 100 / COUNT(orders.`ordernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of all the orders placed and shipped throughout the year 2005, what percentage of those orders corresponds to customer number 186?",
    "evidence": "shipped orders refers to status = 'shipped'; year(shippedDate) = 2005; percentage = DIVIDE(SUM(customerNumber = 186)), COUNT(orderNumber)) as percentage;",
    "idx": 820
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`orders`)-[is_placed_by_0:`is_placed_by`]->(t1@`customers`)\nWHERE t1.`customernumber` = t2.`customernumber`\nAND (t2.`status` = 'Cancelled' AND t1.`creditlimit` > 115000)\nRETURN COUNT(t1.`customernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers with a canceled shipment have a credit limit greater than 115,000?",
    "evidence": "cancelled shipment refers to status = 'cancelled'; creditLimit > 115000;",
    "idx": 821
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t3@`payments`)-[is_made_by_0:`is_made_by`]->(t2@`customers`)-[is_assigned_to_0:`is_assigned_to`]->(t1@`employees`)\nWHERE t1.`employeenumber` = t2.`salesrepemployeenumber`\nAND t2.`customernumber` = t3.`customernumber`\nAND (t1.`firstname` = 'Barry' AND t1.`lastname` = 'Jones' AND t1.`jobtitle` = 'Sales Rep')\nORDER BY t2.`creditlimit`  NULLS FIRST \nRETURN t3.`paymentdate` AS `paymentdate` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On what date did the customer with the lowest credit limit serviced by sales representative Barry Jones make payments for his/her orders?",
    "evidence": "",
    "idx": 822
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`customers`)-[is_assigned_to_0:`is_assigned_to`]->(t1@`employees`)\nWHERE t1.`employeenumber` = t2.`salesrepemployeenumber`\nAND (t2.`country` = 'France')\nRETURN t1.`reportsto` AS `reportsto`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "To whom does the employee have to inform that is the sales representative of the French customer?",
    "evidence": "inform refers to reportsTo; 'reportsTO' is the leader of the 'employeeNumber'; France is a country; country = 'France';",
    "idx": 823
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`orders`)-[is_placed_by_0:`is_placed_by`]->(t1@`customers`)\nWHERE t1.`customernumber` = t2.`customernumber`\nAND (t2.`shippeddate` = date('2005-04-04') AND t2.`status` = 'Shipped')\nRETURN t1.`addressline1` AS `addressline1`, t1.`addressline2` AS `addressline2`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full address of the customer who commented that DHL be used for the order that was shipped on April 4, 2005?",
    "evidence": "full address = addressLine1+addressLine2; shippedDate = '2005-04-04';",
    "idx": 824
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`customers`)-[is_assigned_to_0:`is_assigned_to`]->(t1@`employees`)-[works_in_0:`works_in`]->(t3@`offices`)\nWHERE t1.`employeenumber` = t2.`salesrepemployeenumber`\nAND t1.`officecode` = t3.`officecode`\nAND (t2.`city` = 'NYC' AND t1.`jobtitle` = 'Sales Rep')\nRETURN t2.`addressline1` AS `addressline1`, t2.`addressline2` AS `addressline2`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full address of the office where the employee who is a sales representative for the customer whose business is located in the city of New York works?",
    "evidence": "full address = addressLine1 + addressLine2; NYC is a shortname of New York City.",
    "idx": 825
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`customers`)-[is_assigned_to_0:`is_assigned_to`]->(t2@`employees`)\nWHERE t1.`salesrepemployeenumber` = t2.`employeenumber`\nAND (t2.`jobtitle` = 'Sales Rep')\nRETURN t1.`addressline1` AS `addressline1`, t1.`addressline2` AS `addressline2`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full address of the office where 4 people work and one of them is Sales Representation?",
    "evidence": "full address = addressLine1+addressLine2; Sales Manager is a job title;",
    "idx": 826
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`customers`)-[is_assigned_to_0:`is_assigned_to`]->(t2@`employees`)\nWHERE t1.`salesrepemployeenumber` = t2.`employeenumber`\nAND (t1.`addressline1` = '25 Maiden Lane' AND t1.`addressline2` = 'Floor No. 4')\nRETURN t2.`firstname` AS `firstname`, t2.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the sales representative that made the order which was sent to 25 Maiden Lane, Floor No. 4?",
    "evidence": "Sales representative is an employee;",
    "idx": 829
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "CALL {\nMATCH (t1_sub0@`products`)\nORDER BY t1_sub0.`msrp` - t1_sub0.`buyprice` DESC NULLS LAST \nRETURN t1_sub0.`productcode` AS `productcode` \nLIMIT 1\n}\nMATCH (t2@`orderdetails`)\nWHERE t2.`productcode` = productcode\nRETURN sum(t2.`quantityordered`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many products with the highest expected profits were sold in total?",
    "evidence": "Products refer to productCode; Expected profits = SUBTRACT(MSRP, buyPrice);",
    "idx": 831
  }
]