[
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "MATCH (`trucks`:`trucks`)\nORDER BY `trucks`.`truck_licence_number` IS NULL DESC, `trucks`.`truck_licence_number`  \nRETURN `trucks`.`truck_details` AS `truck_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the details of all trucks in the order of their license number.",
    "evidence": "",
    "idx": 3650
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "MATCH (`products`:`products`)\nORDER BY `products`.`product_price` IS NULL ASC, `products`.`product_price` DESC \nRETURN `products`.`product_name` AS `product_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the most expensive product.",
    "evidence": "",
    "idx": 3651
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`payment_method` = 'Visa'\nRETURN `customers`.`customer_email` AS `customer_email`, `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names and emails of customers who payed by Visa card.",
    "evidence": "",
    "idx": 3652
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:has_address]->(`t3`:`addresses`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`address_id` = `t3`.`address_id`\nAND (`t3`.`state_province_county` = 'California')\nRETURN `t1`.`customer_name` AS `customer_name`, `t1`.`customer_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names and phone numbers of customers living in California state.",
    "evidence": "",
    "idx": 3653
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "WITH *, COLLECT { MATCH (`employees_sub0`:`employees`)\nRETURN `employees_sub0`.`employee_address_id` AS `employee_address_id`   } AS in_collect_0\nMATCH (`addresses`:`addresses`)\nWHERE NOT `addresses`.`address_id` IN in_collect_0\nRETURN `addresses`.`state_province_county` AS `state_province_county`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the states which do not have any employee in their record.",
    "evidence": "",
    "idx": 3654
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "MATCH (`customers`:`customers`)\nORDER BY `customers`.`date_became_customer` IS NULL DESC, `customers`.`date_became_customer`  \nRETURN `customers`.`customer_name` AS `customer_name`, `customers`.`customer_phone` AS `customer_phone`, `customers`.`customer_email` AS `customer_email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names, phone numbers, and emails of all customers sorted by their dates of becoming customers.",
    "evidence": "",
    "idx": 3655
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "MATCH (`customers`:`customers`)\nORDER BY `customers`.`date_became_customer` IS NULL DESC, `customers`.`date_became_customer`  \nRETURN `customers`.`customer_name` AS `customer_name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the first 5 customers.",
    "evidence": "",
    "idx": 3656
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "MATCH (`delivery_routes`:`delivery_routes`)\nRETURN `delivery_routes`.`route_name` AS `route_name` ORDER BY `route_name` IS NULL DESC, `route_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all routes in alphabetic order.",
    "evidence": "",
    "idx": 3657
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of authors.",
    "evidence": "",
    "idx": 3660
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`inst`:`inst`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of institutions.",
    "evidence": "",
    "idx": 3662
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`papers`:`papers`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of total papers.",
    "evidence": "",
    "idx": 3664
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`fname` = 'Jeremy' AND `t1`.`lname` = 'Gibbons')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of papers published by \"Jeremy Gibbons\"?",
    "evidence": "",
    "idx": 3665
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`fname` = 'Aaron' AND `t1`.`lname` = 'Turon')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the papers published by \"Aaron Turon\".",
    "evidence": "",
    "idx": 3667
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`fname` = 'Atsushi' AND `t1`.`lname` = 'Ohori')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers have \"Atsushi Ohori\" published?",
    "evidence": "",
    "idx": 3669
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->()\nMATCH ()-[t2:affiliated_with]->(`t3`:`inst`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`instid` = `t3`.`instid`\nAND (`t1`.`fname` = 'Matthias' AND `t1`.`lname` = 'Blume')\nRETURN DISTINCT `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the institution that \"Matthias Blume\" belongs to?",
    "evidence": "",
    "idx": 3671
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->()\nMATCH ()-[t2:affiliated_with]->(`t3`:`inst`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`instid` = `t3`.`instid`\nAND (`t1`.`fname` = 'Katsuhiro' AND `t1`.`lname` = 'Ueno')\nRETURN DISTINCT `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which institution does \"Katsuhiro Ueno\" belong to?",
    "evidence": "",
    "idx": 3673
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->()\nMATCH ()-[t2:affiliated_with]->(`t3`:`inst`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`instid` = `t3`.`instid`\nAND (`t3`.`name` = 'University of Oxford')\nRETURN DISTINCT `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who belong to the institution \"University of Oxford\"? Show the first names and last names.",
    "evidence": "",
    "idx": 3675
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->()\nMATCH ()-[t2:affiliated_with]->(`t3`:`inst`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`instid` = `t3`.`instid`\nAND (`t3`.`name` = 'Google')\nRETURN DISTINCT `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which authors belong to the institution \"Google\"? Show the first names and last names.",
    "evidence": "",
    "idx": 3677
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t3`.`title` = 'Binders Unbound')\nRETURN `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the last names of the author of the paper titled \"Binders Unbound\"?",
    "evidence": "",
    "idx": 3679
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t3`.`title` = 'Nameless ,  Painless')\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first and last name of the author(s) who wrote the paper \"Nameless, Painless\".",
    "evidence": "",
    "idx": 3681
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`papers`)-[t2:published_from]->()\nMATCH ()-[t2:affiliated_with]->(`t3`:`inst`)\nWHERE `t1`.`paperid` = `t2`.`paperid`\nAND `t2`.`instid` = `t3`.`instid`\nAND (`t3`.`name` = 'Indiana University')\nRETURN DISTINCT `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the papers published under the institution \"Indiana University\"?",
    "evidence": "",
    "idx": 3683
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`papers`)-[t2:published_from]->()\nMATCH ()-[t2:affiliated_with]->(`t3`:`inst`)\nWHERE `t1`.`paperid` = `t2`.`paperid`\nAND `t2`.`instid` = `t3`.`instid`\nAND (`t3`.`name` = 'Google')\nRETURN DISTINCT `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the papers published by the institution \"Google\".",
    "evidence": "",
    "idx": 3685
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`papers`)-[t2:published_from]->()\nMATCH ()-[t2:affiliated_with]->(`t3`:`inst`)\nWHERE `t1`.`paperid` = `t2`.`paperid`\nAND `t2`.`instid` = `t3`.`instid`\nAND (`t3`.`name` = 'Tokohu University')\nRETURN COUNT(DISTINCT `t1`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers are published by the institution \"Tokohu University\"?",
    "evidence": "",
    "idx": 3687
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`papers`)-[t2:published_from]->()\nMATCH ()-[t2:affiliated_with]->(`t3`:`inst`)\nWHERE `t1`.`paperid` = `t2`.`paperid`\nAND `t2`.`instid` = `t3`.`instid`\nAND (`t3`.`name` = 'University of Pennsylvania')\nRETURN COUNT(DISTINCT `t1`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of papers published by the institution \"University of Pennsylvania\".",
    "evidence": "",
    "idx": 3689
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`fname` = 'Olin' AND `t1`.`lname` = 'Shivers')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the papers which have \"Olin Shivers\" as an author.",
    "evidence": "",
    "idx": 3691
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`fname` = 'Stephanie' AND `t1`.`lname` = 'Weirich')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which papers have \"Stephanie Weirich\" as an author?",
    "evidence": "",
    "idx": 3693
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nMATCH ()-[t2:affiliated_with]->(`t4`:`inst`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`instid` = `t4`.`instid`\nAND (`t4`.`country` = 'USA' AND `t2`.`authorder` = 2 AND `t1`.`lname` = 'Turon')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which paper is published in an institution in \"USA\" and have \"Turon\" as its second author?",
    "evidence": "",
    "idx": 3695
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nMATCH ()-[t2:affiliated_with]->(`t4`:`inst`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`instid` = `t4`.`instid`\nAND (`t4`.`country` = 'Japan' AND `t2`.`authorder` = 1 AND `t1`.`lname` = 'Ohori')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the titles of papers whose first author is affiliated with an institution in the country \"Japan\" and has last name \"Ohori\"?",
    "evidence": "",
    "idx": 3697
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`papers`:`papers`)\nWHERE `papers`.`title` =~ '(?i)(?s).*ML.*'\nRETURN `papers`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the titles of the papers that contain the word \"ML\".",
    "evidence": "",
    "idx": 3699
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`papers`:`papers`)\nWHERE `papers`.`title` =~ '(?i)(?s).*ML.*'\nRETURN `papers`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which papers have the substring \"ML\" in their titles? Return the titles of the papers.",
    "evidence": "",
    "idx": 3700
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`papers`:`papers`)\nWHERE `papers`.`title` =~ '(?i)(?s).*Database.*'\nRETURN `papers`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which paper's title contains the word \"Database\"?",
    "evidence": "",
    "idx": 3701
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`papers`:`papers`)\nWHERE `papers`.`title` =~ '(?i)(?s).*Database.*'\nRETURN `papers`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which papers have the substring \"Database\" in their titles? Show the titles of the papers.",
    "evidence": "",
    "idx": 3702
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t3`.`title` =~ '(?i)(?s).*Functional.*')\nRETURN `t1`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of all the authors who have written a paper with title containing the word \"Functional\".",
    "evidence": "",
    "idx": 3703
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t3`.`title` =~ '(?i)(?s).*Functional.*')\nRETURN `t1`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who has written a paper that has the word \"Functional\" in its title? Return the first names of the authors.",
    "evidence": "",
    "idx": 3704
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t3`.`title` =~ '(?i)(?s).*Monadic.*')\nRETURN `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of all the authors that have written a paper with title containing the word \"Monadic\".",
    "evidence": "",
    "idx": 3705
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`papers`)\nWHERE `t1`.`authid` = `t2`.`authid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t3`.`title` =~ '(?i)(?s).*Monadic.*')\nRETURN `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which authors have written a paper with title containing the word \"Monadic\"? Return their last names.",
    "evidence": "",
    "idx": 3706
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nWHERE `authors`.`lname` = 'Ueno'\nRETURN `authors`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name of the author with last name \"Ueno\"?",
    "evidence": "",
    "idx": 3709
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nWHERE `authors`.`lname` = 'Ueno'\nRETURN `authors`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which authors have last name \"Ueno\"? List their first names.",
    "evidence": "",
    "idx": 3710
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nWHERE `authors`.`fname` = 'Amal'\nRETURN `authors`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last name of the author with first name \"Amal\".",
    "evidence": "",
    "idx": 3711
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nWHERE `authors`.`fname` = 'Amal'\nRETURN `authors`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which authors have first name \"Amal\"? List their last names.",
    "evidence": "",
    "idx": 3712
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nRETURN `authors`.`fname` AS `fname` ORDER BY `fname` IS NULL DESC, `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of all the authors ordered in alphabetical order.",
    "evidence": "",
    "idx": 3713
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nRETURN `authors`.`fname` AS `fname` ORDER BY `fname` IS NULL DESC, `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort the first names of all the authors in alphabetical order.",
    "evidence": "",
    "idx": 3714
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nRETURN `authors`.`lname` AS `lname` ORDER BY `lname` IS NULL DESC, `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Retrieve all the last names of authors in alphabetical order.",
    "evidence": "",
    "idx": 3715
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nRETURN `authors`.`lname` AS `lname` ORDER BY `lname` IS NULL DESC, `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me a list of all the last names of authors sorted in alphabetical order",
    "evidence": "",
    "idx": 3716
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nRETURN `authors`.`fname` AS `fname`, `authors`.`lname` AS `lname` ORDER BY `lname` IS NULL DESC, `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Retrieve all the first and last names of authors in the alphabetical order of last names.",
    "evidence": "",
    "idx": 3717
  },
  {
    "filename": "train_spider.json",
    "db_id": "icfp_1",
    "gql_statement": "MATCH (`authors`:`authors`)\nRETURN `authors`.`fname` AS `fname`, `authors`.`lname` AS `lname` ORDER BY `lname` IS NULL DESC, `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort the list of all the first and last names of authors in alphabetical order of the last names.",
    "evidence": "",
    "idx": 3718
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`actor`:`actor`)\nRETURN COUNT(DISTINCT `actor`.`last_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many different last names do the actors and actresses have?",
    "evidence": "",
    "idx": 3719
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`actor`:`actor`)\nRETURN COUNT(DISTINCT `actor`.`last_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different last names actors have.",
    "evidence": "",
    "idx": 3720
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`address`:`address`)\nWITH `address`.`district` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `district`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which districts have at least two addresses?",
    "evidence": "",
    "idx": 3721
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`address`:`address`)\nWITH `address`.`district` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `district`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the districts which have two or more addresses.",
    "evidence": "",
    "idx": 3722
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`address` = '1031 Daugavpils Parkway'\nRETURN `address`.`phone` AS `phone`, `address`.`postal_code` AS `postal_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the phone number and postal code of the address 1031 Daugavpils Parkway?",
    "evidence": "",
    "idx": 3723
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`address` = '1031 Daugavpils Parkway'\nRETURN `address`.`phone` AS `phone`, `address`.`postal_code` AS `postal_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the phone and postal code corresponding to the address '1031 Daugavpils Parkway'.",
    "evidence": "",
    "idx": 3724
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`district` = 'California'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many addresses are in the district of California?",
    "evidence": "",
    "idx": 3725
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`district` = 'California'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of addressed in the California district.",
    "evidence": "",
    "idx": 3726
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND (`t2`.`country` = 'Australia')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many cities are in Australia?",
    "evidence": "",
    "idx": 3727
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND (`t2`.`country` = 'Australia')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of cities in Australia.",
    "evidence": "",
    "idx": 3728
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`payment`:`payment`)\nWHERE `payment`.`amount` > 10\nRETURN `payment`.`payment_date` AS `payment_date`   \nUNION DISTINCT\nMATCH (`t1`:`payment`)-[processed_by_0:processed_by]->(`t2`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`first_name` = 'Elsa')\nRETURN `t1`.`payment_date` AS `payment_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the payment dates for the payments with an amount larger than 10 and the payments handled by a staff person with the first name Elsa.",
    "evidence": "",
    "idx": 3729
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`payment`:`payment`)\nWHERE `payment`.`amount` > 10\nRETURN `payment`.`payment_date` AS `payment_date`   \nUNION DISTINCT\nMATCH (`t1`:`payment`)-[processed_by_0:processed_by]->(`t2`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`first_name` = 'Elsa')\nRETURN `t1`.`payment_date` AS `payment_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the payment dates for any payments that have an amount greater than 10 or were handled by a staff member with the first name Elsa?",
    "evidence": "",
    "idx": 3730
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE toInteger(`customer`.`active`) = '1'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers have an active value of 1?",
    "evidence": "",
    "idx": 3731
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE toInteger(`customer`.`active`) = '1'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customers who are active.",
    "evidence": "",
    "idx": 3732
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN `film`.`title` AS `title`, `film`.`rental_rate` AS `rental_rate` ORDER BY `rental_rate` IS NULL ASC, `rental_rate` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which film has the highest rental rate? And what is the rate?",
    "evidence": "",
    "idx": 3733
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN `film`.`title` AS `title`, `film`.`rental_rate` AS `rental_rate` ORDER BY `rental_rate` IS NULL ASC, `rental_rate` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the title and rental rate of the film with the highest rental rate?",
    "evidence": "",
    "idx": 3734
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`payment`:`payment`)\nRETURN sum(`payment`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of all payments?",
    "evidence": "",
    "idx": 3735
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`payment`:`payment`)\nRETURN sum(`payment`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the sum of all payment amounts.",
    "evidence": "",
    "idx": 3736
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`category`)-[t2:contains_film]->(`t3`:`film`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nAND `t2`.`film_id` = `t3`.`film_id`\nAND (`t3`.`title` = 'HUNGER ROOF')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the genre name of the film HUNGER ROOF?",
    "evidence": "",
    "idx": 3737
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN COUNT(DISTINCT `film`.`language_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many languages are in these films?",
    "evidence": "",
    "idx": 3739
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN COUNT(DISTINCT `film`.`language_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different languages in these films.",
    "evidence": "",
    "idx": 3740
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rating` = 'R'\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the movies rated as R? List the titles.",
    "evidence": "",
    "idx": 3741
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rating` = 'R'\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the titles of any movies with an R rating.",
    "evidence": "",
    "idx": 3742
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`store`)-[located_at_0:located_at]->(`t2`:`address`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`store_id` = 1)\nRETURN `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where is store 1 located?",
    "evidence": "",
    "idx": 3743
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`store`)-[located_at_0:located_at]->(`t2`:`address`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`store_id` = 1)\nRETURN `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the address of store 1.",
    "evidence": "",
    "idx": 3744
  }
]