[
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`province`)\nMATCH (`t1`:`city`)\nWHERE `t1`.`province` = `t2`.`name`\nAND (`t1`.`name` = 'Edmonton')\nRETURN CASE WHEN `t2`.`population`=0 THEN NULL ELSE toFloat(`t1`.`population`) * 100 / `t2`.`population` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of population in Edmonton city to the population of its province.",
    "evidence": "Percentage of population in each city = population(city) / population(province) * 100%",
    "idx": 6379
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`located`:`located`)\nWHERE `located`.`province` = 'Albania' AND NOT `located`.`lake` IS NULL\nRETURN `located`.`lake` AS `lake`, `located`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of the lake in Albania province and in which city does it located at.",
    "evidence": "",
    "idx": 6381
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountains` = 'Himalaya'\nRETURN `mountain`.`name` AS `name`, `mountain`.`height` AS `height` ORDER BY `height` IS NULL ASC, `height` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the tallest mountain on Himalaya and what is its height.",
    "evidence": "Tallest refers to max(height)",
    "idx": 6382
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`type` = 'volcano'\nRETURN `mountain`.`name` AS `name`, `mountain`.`latitude` AS `latitude`, `mountain`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the mountains that are volcanic along with its longitude and latitude.",
    "evidence": "",
    "idx": 6383
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`type` = 'volcano' AND `mountain`.`height` >= 2000 AND `mountain`.`height` <= 4000\nRETURN `mountain`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all the volcano mountains between the height of 2000 to 4000.",
    "evidence": "",
    "idx": 6384
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`sea` = 'Mediterranean Sea'\nORDER BY `river`.`length` IS NULL ASC, `river`.`length` DESC \nRETURN `river`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please state the longest river that flows to the Mediterranean Sea.",
    "evidence": "",
    "idx": 6385
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`river`)\nMATCH (`t1`:`geo_river`)\nWHERE `t1`.`river` = `t2`.`name`\nAND (`t2`.`length` > 1000)\nRETURN `t1`.`province` AS `province`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all rivers and province it is located that is greater than 1000 in length.",
    "evidence": "",
    "idx": 6388
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`mountain`)\nMATCH (`t2`:`geo_mountain`)\nWHERE `t1`.`name` = `t2`.`mountain`\nAND (`t1`.`name` = 'Moldoveanu')\nRETURN `t2`.`province` AS `province`, `t2`.`country` AS `country`, `t1`.`height` AS `height`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which province and country does Moldoveanu located? State its height.",
    "evidence": "Moldoveanu is a mountain",
    "idx": 6389
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`politics`)\nMATCH (`t2`:`population`)\nWHERE `t1`.`country` = `t2`.`country`\nAND (CASE WHEN `t1`.`independence` is not NULL THEN apoc.temporal.format(`t1`.`independence`,'yyyy') ELSE NULL END = '1960')\nORDER BY `t2`.`infant_mortality` IS NULL ASC, `t2`.`infant_mortality` DESC \nRETURN `t1`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which nation has the greatest infant mortality rate among those that attained independence in 1960?",
    "evidence": "",
    "idx": 6402
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`located`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`river` = 'Pjandsh')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country was the source of Pjandsh River? Give the full name of the country.",
    "evidence": "",
    "idx": 6408
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`economy`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t1`.`population` > 1000000000)\nORDER BY `t2`.`gdp` IS NULL DESC, `t2`.`gdp`  \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the countries have the population north of a billion, which one has the lowest GDP? Give the full name of the country.",
    "evidence": "billion = 1000000000",
    "idx": 6409
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`politics`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`independence` = '1492-01-01')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country became independent on 1492-01-01? Give the full name of the country.",
    "evidence": "",
    "idx": 6410
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`geo_desert`:`geo_desert`)\nWITH `geo_desert`.`desert` AS _groupby_col_0, COUNT(DISTINCT `geo_desert`.`country`) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `desert`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many deserts are not located in a single country? Name them.",
    "evidence": "",
    "idx": 6419
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "CALL(*) {\nMATCH (`country_sub0`:`country`)\nRETURN MAX(`country_sub0`.`population`) - MAX(`country_sub0`.`population`) * 0.9995 AS `_col_0`  \n}\nMATCH (`country`:`country`)\nWHERE `country`.`population` <= `_col_0`\nRETURN `country`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name of the capitals of the countries that have less than 99.95% less population than the country that has the most population.",
    "evidence": "",
    "idx": 6423
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`name` = 'Donau'\nRETURN `river`.`name` AS `name`, `river`.`river` AS `river`, `river`.`lake` AS `lake`, `river`.`sea` AS `sea`, `river`.`length` AS `length`, `river`.`sourcelongitude` AS `sourcelongitude`, `river`.`sourcelatitude` AS `sourcelatitude`, `river`.`mountains` AS `mountains`, `river`.`sourcealtitude` AS `sourcealtitude`, `river`.`estuarylongitude` AS `estuarylongitude`, `river`.`estuarylatitude` AS `estuarylatitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Average length of the rivers flowing into the Donau River.",
    "evidence": "",
    "idx": 6424
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`encompasses_sub0`:`encompasses`)\nWITH `encompasses_sub0`.`country` AS _groupby_col_0, COUNT(`encompasses_sub0`.`continent`) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `country`   } AS in_collect_0\nMATCH (`country`:`country`)\nWHERE `country`.`code` IN in_collect_0 AND CASE WHEN `country`.`area`=0 THEN NULL ELSE `country`.`population` / `country`.`area` END <= 10\nRETURN `country`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Of all the countries that share territory with more than one continent, in which of them does the average population not exceed 10 inhabitants per square kilometer?",
    "evidence": "",
    "idx": 6427
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`organization`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (CASE WHEN `t2`.`established` is not NULL THEN apoc.temporal.format(`t2`.`established`,'yyyy') ELSE NULL END = '1947')\nRETURN CASE WHEN `t1`.`area`=0 THEN NULL ELSE `t1`.`population` / `t1`.`area` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average population ratio of the countries in which organizations were established in 1947?",
    "evidence": "Average population ratio = Population / Area",
    "idx": 6430
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`name` = 'Aarhus'\nRETURN `city`.`longitude` AS `longitude`, `city`.`latitude` AS `latitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the geographic location of Aarhus city? Please provide the answer with the coordinates of the location.",
    "evidence": "Longitude, Latitude = coordinates of the location",
    "idx": 6434
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`organization`:`organization`)\nWHERE `organization`.`name` = 'European Bank for Reconstruction and Development'\nRETURN `organization`.`city` AS `city`, `organization`.`province` AS `province`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which city is the European Bank for Reconstruction and Development's headquarters? Please include the city and province where the headquarters are located in your answer.",
    "evidence": "",
    "idx": 6436
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`borders`:`borders`)\nORDER BY `borders`.`length` IS NULL ASC, `borders`.`length` DESC \nRETURN `borders`.`country1` AS `country1`, `borders`.`country2` AS `country2`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which two nations are separated from one another by the longest border? Please include the entire names of the nations in your answer.",
    "evidence": "",
    "idx": 6438
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`economy`)\nWHERE `t1`.`code` = `t2`.`country`\nORDER BY `t2`.`gdp` IS NULL ASC, `t2`.`gdp` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which nation has the highest GDP? Please give the nation's full name.",
    "evidence": "",
    "idx": 6439
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`ethnicgroup`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`name` = 'African')\nORDER BY `t2`.`percentage` IS NULL DESC, `t2`.`percentage`  \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which nation has the lowest proportion of people who speak an African language? Please state the nation's full name.",
    "evidence": "Nation and country share the same meaning. Proportion refers to percentage",
    "idx": 6440
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`economy`)\nWHERE `t1`.`code` = `t2`.`country`\nORDER BY `t2`.`inflation` IS NULL ASC, `t2`.`inflation` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the top 3 countries with the highest inflation rate.",
    "evidence": "",
    "idx": 6441
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`name` = 'English' AND `t2`.`percentage` = 100)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide a list of every nation where English is spoken and utilized entirely.",
    "evidence": "Utilizition entirely means Percentage = 100% uses",
    "idx": 6442
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`politics_sub0`:`politics`)\nWHERE `politics_sub0`.`dependent` <> ''\nRETURN `politics_sub0`.`country` AS `country`   } AS in_collect_0\nMATCH (`organization`:`organization`)\nWHERE `organization`.`country` IN in_collect_0\nRETURN `organization`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which company falls under the category of an associated member? Please provide the organization's full name.",
    "evidence": "",
    "idx": 6446
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`politics`)\nWHERE CASE WHEN `t1`.`independence` is not NULL THEN apoc.temporal.format(`t1`.`independence`,'yyyy') ELSE NULL END >= '1993'\nRETURN sum(CASE WHEN `t1`.`government` = 'parliamentary democracy' THEN 1 ELSE 0 END) AS `_col_0`, CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t1`.`government` = 'parliamentary democracy' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of nations have achieved independence since 1993 and practice parliamentary democracy? Please include any three parliament-based democracies that attained independence after 1993.",
    "evidence": "Percentage of rivers with lengths greater than 3,000 miles = [(Total number of rivers with lengths greater than 3,000 miles) / (Total number of rivers)] * 100%",
    "idx": 6448
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`organization`:`organization`)\nWHERE CASE WHEN `organization`.`established` is not NULL THEN apoc.temporal.format(`organization`.`established`,'yyyy') ELSE NULL END >= '1970' AND CASE WHEN `organization`.`established` is not NULL THEN apoc.temporal.format(`organization`.`established`,'yyyy') ELSE NULL END <= '1980'\nRETURN `organization`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all the organisations that were established from 1970 to 1980.",
    "evidence": "",
    "idx": 6450
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`organization`:`organization`)\nWHERE `organization`.`country` = 'USA'\nRETURN `organization`.`name` AS `name`, `organization`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For each organisations with headquarters in the USA, provide the its full name and the city where the headquarter is located at.",
    "evidence": "",
    "idx": 6452
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`organization`:`organization`)\nWHERE `organization`.`city` = 'Paris'\nRETURN `organization`.`abbreviation` AS `abbreviation`, `organization`.`name` AS `name`, `organization`.`established` AS `established` ORDER BY `established` IS NULL DESC, `established`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the first organisation established in the Paris city. State its abbreviation, full name and date of establishment.",
    "evidence": "Paris is a city",
    "idx": 6453
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`organization`:`organization`)\nWHERE `organization`.`name` =~ '(?i)(?s).*United Nation.*'\nRETURN `organization`.`name` AS `name`, `organization`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the organisations that where its name contains 'United Nation'. State its full name and its headquarter city.",
    "evidence": "",
    "idx": 6454
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`borders`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country1`\nAND (`t2`.`length` > 4000)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State all countries with border greater than 4,000. List the full country name.",
    "evidence": "",
    "idx": 6455
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`organization`)\nMATCH (`t2`:`country`)\nWHERE `t1`.`country` = `t2`.`code`\nAND (`t1`.`name` = 'Asia Pacific Economic Cooperation')\nRETURN `t2`.`name` AS `name`, `t2`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the area and population of the country where Asia Pacific Economic Cooperation headquarter is located.",
    "evidence": "Asia Pacific Economic Cooperation is an organization name",
    "idx": 6457
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`ismember_sub0`:`ismember`)\nWHERE `ismember_sub0`.`type` = 'Category III' AND `ismember_sub0`.`organization` = 'IFAD'\nRETURN `ismember_sub0`.`country` AS `country`   } AS in_collect_0\nMATCH (`country`:`country`)\nWHERE `country`.`code` IN in_collect_0\nRETURN `country`.`name` AS `name`, `country`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all countries with 'Category III' membership in 'IFAD' organization. Please also provide the capital of the country.",
    "evidence": "",
    "idx": 6458
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`organization`)\nMATCH (`t2`:`country`)\nWHERE `t1`.`city` = `t2`.`capital`\nAND (`t2`.`name` = 'Australia')\nRETURN `t2`.`capital` AS `capital`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the capital of Australia? Is the capital a headquarter to any organization? Name the organization(s).",
    "evidence": "",
    "idx": 6459
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`borders`:`borders`)\nWHERE `borders`.`country1` = 'MEX' AND `borders`.`country2` = 'USA'\nRETURN `borders`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the border length between 'USA' and 'MEX'",
    "evidence": "",
    "idx": 6461
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`organization`)\nMATCH (`t2`:`city`)\nWHERE `t1`.`city` = `t2`.`name`\nAND (`t1`.`name` = 'World Tourism Organization')\nRETURN `t2`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the population of the city of the 'World Tourism Organization' headquarter.",
    "evidence": "",
    "idx": 6462
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`mountain`)\nMATCH (`t2`:`geo_mountain`)\nWHERE `t1`.`name` = `t2`.`mountain`\nAND (`t2`.`province` = 'Alaska')\nRETURN `t1`.`name` AS `name`, `t1`.`height` AS `height`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the name and height of all mountains in Alaska",
    "evidence": "Alaska is a province",
    "idx": 6464
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`economy`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t1`.`name` = 'Greece')\nRETURN `t2`.`inflation` AS `inflation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the inflation rate of Greece.",
    "evidence": "",
    "idx": 6466
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`politics`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`government` = 'parliamentary democracy')\nRETURN `t1`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name its capital of all the countries with parliamentary democracy government.",
    "evidence": "Parliamentary democracy is a government form",
    "idx": 6467
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`ethnicgroup`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`name` = 'Chinese' AND `t2`.`percentage` > 70)\nRETURN `t1`.`name` AS `name`, `t1`.`population` * `t2`.`percentage` AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide a full list of countries and its population with more than 70% of Chinese.",
    "evidence": "",
    "idx": 6468
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`type` = 'volcanic'\nRETURN `mountain`.`height` AS `height`, `mountain`.`name` AS `name` ORDER BY `height` IS NULL ASC, `height` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the peak height of the highest volcanic type of mountain? Give it's name.",
    "evidence": "peak means the highest",
    "idx": 6470
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`river`:`river`)\nRETURN `river`.`name` AS `name`, `river`.`length` AS `length` ORDER BY `length` IS NULL ASC, `length` DESC \nSKIP 16\nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What river has the 17th-longest length overall? Specify it's length.",
    "evidence": "",
    "idx": 6473
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`politics`:`politics`)\nWHERE CASE WHEN `politics`.`independence` is not NULL THEN apoc.temporal.format(`politics`.`independence`,'yyyy') ELSE NULL END >= '1950' AND CASE WHEN `politics`.`independence` is not NULL THEN apoc.temporal.format(`politics`.`independence`,'yyyy') ELSE NULL END <= '1999' AND `politics`.`government` = 'parliamentary democracy'\nRETURN `politics`.`country` AS `country`, `politics`.`independence` AS `independence`, `politics`.`dependent` AS `dependent`, `politics`.`government` AS `government`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Lists all governments with a parliamentary democracy that achieved their independence between 01/01/1950 and 12/31/1999.",
    "evidence": "Inhabitants, synonymous with population",
    "idx": 6478
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`politics`:`politics`)\nRETURN CASE WHEN COUNT(`politics`.`country`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN CASE WHEN `politics`.`independence` is not NULL THEN apoc.temporal.format(`politics`.`independence`,'yyyy') ELSE NULL END = '1960' THEN 1 ELSE 0 END)) * 100 / COUNT(`politics`.`country`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of countries became independent during the year 1960?",
    "evidence": "Percentage = count(countries independent 1960) / total num of countries",
    "idx": 6479
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`desert`:`desert`)\nWHERE `desert`.`latitude` < 30 OR `desert`.`latitude` > 40\nRETURN `desert`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all deserts that are not between latitudes 30 and 40.",
    "evidence": "",
    "idx": 6480
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`geo_desert`)\nMATCH (`t1`:`desert`)\nWHERE `t1`.`name` = `t2`.`desert`\nWITH `t1`.`name` AS _groupby_col_0, `t1`.`latitude` AS _groupby_col_1, `t1`.`longitude` AS _groupby_col_2, COUNT(`t1`.`name`) AS _groupby_col_3\nWHERE _groupby_col_3 > 1\nRETURN _groupby_col_1 AS `latitude`, _groupby_col_2 AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the coordinates of all the deserts whose area is in more than one country.",
    "evidence": "coordinates consists of Latitude, Longitude",
    "idx": 6481
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`educationnum` = 11\nRETURN DISTINCT `customers`.`occupation` AS `occupation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the occupations of the customers with an education level of 11.",
    "evidence": "education level of 11 refers to EDUCATIONNUM = 11;",
    "idx": 6485
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t1`:`customers`)\nMATCH (`t2`:`mailings1_2`)\nWHERE `t1`.`id` = `t2`.`refid`\nAND (`t1`.`age` > 40 AND `t2`.`response` = 'true')\nRETURN DISTINCT `t1`.`occupation` AS `occupation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the occupations of the customers over 40 and have sent a true response to the incentive mailing sent by the marketing department.",
    "evidence": "over 40 refers to age > 40; RESPONSE = 'true';",
    "idx": 6490
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`occupation` = 'Handlers-cleaners'\nRETURN `customers`.`geoid` AS `geoid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the customer's geographic identifier who are handlers or cleaners.",
    "evidence": "geographic identifier refers to GEOID; OCCUPATION = 'Handlers-cleaners';",
    "idx": 6502
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`demog`:`demog`)\nWHERE `demog`.`income_k` >= 2100 AND `demog`.`income_k` <= 2500\nRETURN `demog`.`geoid` AS `geoid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the geographic identifier with an income that ranges from 2100 to 2500.",
    "evidence": "geographic identifier with an income that ranges from 2100 to 2500 refers to GEOID where INCOME_K BETWEEN 2100 AND 2500;",
    "idx": 6504
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`demog`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`geoid` = `t2`.`geoid`\nAND (`t2`.`income_k` < 2000 AND `t1`.`age` >= 20 AND `t1`.`age` <= 35)\nRETURN `t1`.`educationnum` AS `educationnum`, `t1`.`occupation` AS `occupation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the level of education and occupation of customers ages from 20 to 35 with an income K of 2000 and below.",
    "evidence": "customers ages from 20 to 35 refer to ID where age BETWEEN 20 AND 35; income K of 2000 and below refers to INCOME_K < 2000; level of education refers to EDUCATIONNUM;",
    "idx": 6507
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`demog`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`geoid` = `t2`.`geoid`\nAND (`t1`.`marital_status` = 'Divorced' AND `t1`.`age` < 50)\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the number of inhabitants of customers with a divorced marital status and older than 50 years old.",
    "evidence": "number of inhabitants refers to INHABITANTS_K; older than 50 years old refers to age < 50; MARITAL_STATUS = 'Divorced;",
    "idx": 6508
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "WITH *, COLLECT { MATCH (`customers_sub0`:`customers`)\nWHERE `customers_sub0`.`educationnum` < 4 AND `customers_sub0`.`sex` = 'Male'\nRETURN `customers_sub0`.`geoid` AS `geoid`   } AS in_collect_0\nMATCH (`demog`:`demog`)\nWHERE `demog`.`geoid` IN in_collect_0\nRETURN `demog`.`income_k` AS `income_k`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the male customers with an level of education of 4 and below, list their income K.",
    "evidence": "male customers with an level of education of 4 and below refer to SEX = 'Male' where EDUCATIONNUM < 4;",
    "idx": 6510
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`demog`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`geoid` = `t2`.`geoid`\nAND (`t1`.`educationnum` >= 4 AND `t1`.`educationnum` <= 6 AND `t1`.`sex` = 'Male')\nRETURN `t1`.`occupation` AS `occupation`, `t2`.`income_k` AS `income_k`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the occupation and income of male customers with an level of education of 4 to 6.",
    "evidence": "male customers with an level of education of 4 to 6 refer to SEX = 'Male' where EDUCATIONNUM BETWEEN 4 AND 6; income refers to INCOME_K;",
    "idx": 6511
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "WITH *, COLLECT { MATCH (`customers_sub0`:`customers`)\nWHERE `customers_sub0`.`educationnum` < 5 AND `customers_sub0`.`sex` = 'Female' AND `customers_sub0`.`marital_status` = 'Widowed'\nRETURN `customers_sub0`.`geoid` AS `geoid`   } AS in_collect_0\nMATCH (`demog`:`demog`)\nWHERE `demog`.`geoid` IN in_collect_0\nRETURN `demog`.`income_k` AS `income_k`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the widowed female customers, give the income of those who has an level of education of 5 and below.",
    "evidence": "widowed female customers refer to SEX = 'Female' where MARITAL_STATUS = 'Widowed'; level of education of 5 and below refers to EDUCATIONNUM ≤ 5;",
    "idx": 6514
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`demog`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`geoid` = `t2`.`geoid`\nAND (`t1`.`age` >= 40 AND `t1`.`age` <= 60)\nORDER BY `t2`.`income_k` IS NULL ASC, `t2`.`income_k` DESC \nRETURN `t1`.`marital_status` AS `marital_status`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the marital status of customers within the age of 40 to 60 that has the highest income among the group.",
    "evidence": "age of 40 to 60 refers to age BETWEEN 40 AND 60; the highest income refers to MAX(INCOME_K);",
    "idx": 6515
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`demog`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`geoid` = `t2`.`geoid`\nAND (`t1`.`occupation` = 'Farming-fishing' AND `t1`.`sex` = 'Male' AND `t1`.`age` >= 20 AND `t1`.`age` <= 30)\nRETURN `t2`.`inhabitants_k` AS `inhabitants_k`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the customers with a marital status of married-civ-spouse, list the number of inhabitants and age of those who are machine-op-inspct.",
    "evidence": "OCCUPATION = 'Machine-op-inspct'; number of inhabitants refers to INHABITANTS_K;",
    "idx": 6517
  }
]