[
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies`)\nMATCH (t1@`u2base`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`country` = 'france' AND t2.`year` = 4)\nRETURN avg(cast (t1.`rating` as float)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average rating of the newest movies from France?",
    "evidence": "France is a country; year = 4 represents the newest date.",
    "idx": 1019
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies`)\nMATCH (t1@`u2base`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`country` = 'UK' AND t2.`runningtime` < 2 AND t1.`rating` = '5')\nRETURN COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the most rated UK movies, how many of them has running time of less than 2?",
    "evidence": "UK is a country",
    "idx": 1020
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies2directors`)\nMATCH (t1@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`country` = 'UK')\nRETURN t2.`genre` AS `genre`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "UK produced what genre of movies?",
    "evidence": "UK is a country",
    "idx": 1022
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`users`)\nMATCH (t1@`u2base`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`rating` = '3')\nRETURN DISTINCT t2.`age` AS `age`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Movies with rating 3 are viewed by audiences in which distinct age group?",
    "evidence": "The audience and users are the same meaning",
    "idx": 1023
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`movies2directors`)\nMATCH (t2@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`country` = 'UK' AND t1.`genre` = 'Adventure' AND t2.`isenglish` = 'F')\nRETURN t1.`movieid` AS `movieid` \nLIMIT 5",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List down 5 non English adventure movies from UK?",
    "evidence": "not English refers to isEnglish = 'F'; UK is a country",
    "idx": 1024
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`users`)\nMATCH (t1@`u2base`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`rating` = '2')\nRETURN cast (sum(CASE WHEN t2.`u_gender` = 'F' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of female audiences who viewed movies with rating 2?",
    "evidence": "The audience and users are the same meaning; Female users refers to u_gender = 'F'; Percentage of female users = count(female users) / count(all users); count(all users) = count(female users) + count(male users)",
    "idx": 1025
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies2directors`)\nMATCH (t1@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`country` = 'USA' AND t1.`isenglish` = 'F' AND t2.`genre` = 'Action')\nRETURN COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the action movies from the USA, how many of them are not in English?",
    "evidence": "USA is a country; not in English can be represented by isEnglish = 'F'",
    "idx": 1027
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`users`)\nMATCH (t1@`u2base`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`rating` = '5' AND t2.`age` < '18' AND t2.`u_gender` = 'M')\nRETURN COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the male users no older than 18, how many times have they given the highest rating?",
    "evidence": "Male users refers to u_gender = 'M'",
    "idx": 1028
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies`)\nMATCH (t1@`u2base`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`country` = 'UK' AND t1.`rating` = '5')\nRETURN COUNT(DISTINCT t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among divergent movies that got the highest rating, how many of them are from the UK?",
    "evidence": "UK is a country",
    "idx": 1029
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`u2base`)\nMATCH (t1@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`year` = 1 AND t2.`rating` = '1' AND t1.`isenglish` = 'T')\nRETURN COUNT(DISTINCT t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the movies in English that are the oldest, how many of them have the lowest rating?",
    "evidence": "Year contains relative value, higer year value refers to newer date; Year = 4 refers to newest date, Year = 1 refer to oldest date; Lowest rating = 1；isEnglish = 'T' means English movie",
    "idx": 1031
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t3@`directors`)\nMATCH (t2@`movies2directors`)\nWHERE t2.`directorid` = t3.`directorid`\nAND (t2.`genre` = 'Action' AND t3.`d_quality` = 4)\nRETURN COUNT(DISTINCT t2.`directorid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For different directors who direct well, how many of them have directed an action film?",
    "evidence": "direct well means the quality of directing is good, which means d_quality = 4.",
    "idx": 1032
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`u2base`)\nWHERE t1.`userid` = t2.`userid`\nAND (t2.`userid` = 2462959 AND t1.`u_gender` = 'F')\nRETURN COUNT(t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the users who rate the movie with the id '2462959' are female?",
    "evidence": "Female users mean that u_gender = 'F'",
    "idx": 1034
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`actors`)\nMATCH (t2@`movies2actors`)\nWHERE t1.`actorid` = t2.`actorid`\nAND (t2.`movieid` = 1722327)\nRETURN t1.`actorid` AS `actorid`, t1.`a_quality` AS `a_quality`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List the ids and ratings of each actors played in the movie with the id 1722327?",
    "evidence": "",
    "idx": 1035
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies2directors`)\nMATCH (t1@`u2base`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`genre` = 'drama' AND t1.`rating` = '3')\nRETURN COUNT(DISTINCT t2.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many drama movie with the rating of 3?",
    "evidence": "",
    "idx": 1036
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`users`)\nMATCH (t1@`u2base`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`rating` = '5' AND t2.`age` >= '25' AND t2.`age` <= '35')\nRETURN COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the movies rated 5 are rated by a user between the ages of 25 and 35?",
    "evidence": "",
    "idx": 1037
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`users`)\nMATCH (t1@`u2base`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`movieid` = 1695219)\nRETURN t2.`userid` AS `userid`, t2.`age` AS `age`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List all of the user ids and ages who rated movies with the id 1695219?",
    "evidence": "",
    "idx": 1040
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`directors`)\nMATCH (t1@`movies2directors`)\nWHERE t1.`directorid` = t2.`directorid`\nAND (t1.`genre` = 'Action')\nRETURN cast (sum(CASE WHEN t2.`avg_revenue` > t2.`d_quality` THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the proportion of action movies directors who are called 'box office success paradox'?",
    "evidence": "'box office success paradox' means average revenue exceeds their quality; The proportion can be computed by [(avg_revenue > d_quality) / ()] * 100%",
    "idx": 1042
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`movies`)\nMATCH (t2@`movies2actors`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`country` = 'USA' AND t2.`cast_num` > 1)\nRETURN COUNT(t2.`actorid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many American movies have cast number more than 1?",
    "evidence": "USA is a country",
    "idx": 1045
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`movies2actors`)\nMATCH (t2@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`country` = 'USA' OR t2.`country` = 'UK')\nRETURN COUNT(t1.`actorid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many actors have acted in both US or UK films?",
    "evidence": "US and UK are 2 countries",
    "idx": 1047
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies2directors`)\nMATCH (t1@`directors`)\nWHERE t1.`directorid` = t2.`directorid`\nAND (t1.`avg_revenue` = 4 AND (t2.`genre` = 'Adventure' OR t2.`genre` = 'Action'))\nRETURN COUNT(t1.`directorid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many directors with average revenue of 4 have made either action or adventure films?",
    "evidence": "",
    "idx": 1048
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies2directors`)\nMATCH (t1@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`country` = 'USA' AND t2.`genre` = 'comedy')\nRETURN COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many American comedies are there?",
    "evidence": "USA is a country",
    "idx": 1049
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`movies2directors`)\nMATCH (t2@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`year` = 4 AND t1.`genre` IN ['Action', 'drama'])\nRETURN COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many latest released dramas and action movies?",
    "evidence": "",
    "idx": 1050
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`movies2directors`)\nMATCH (t2@`u2base`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`rating` = '1' AND t1.`genre` = 'comedy')\nRETURN COUNT(DISTINCT t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the disparate number of the comedy films that got the 1 rating?",
    "evidence": "",
    "idx": 1053
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies2directors`)\nMATCH (t1@`directors`)\nWHERE t1.`directorid` = t2.`directorid`\nAND (t1.`d_quality` = 5)\nRETURN DISTINCT t1.`avg_revenue` AS `avg_revenue`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's different average revenue status for director who directed the movie that got the most 1 ratings?",
    "evidence": "",
    "idx": 1054
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies`)\nMATCH (t1@`u2base`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`country` = 'France' AND t1.`rating` = '1')\nRETURN DISTINCT t1.`movieid` AS `movieid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which different movies from France got the least ratings?",
    "evidence": "France is a country",
    "idx": 1056
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`movies`)\nMATCH (t2@`movies2actors`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`country` IN ['France', 'USA'])\nRETURN COUNT(t2.`actorid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female actors have been played a role in any of French or USA movies?",
    "evidence": "French and USA are two countries; Female actors mean that a_gender = 'F'",
    "idx": 1057
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t1@`u2base`)\nMATCH (t2@`movies2actors`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`rating` = '5')\nRETURN COUNT(DISTINCT t2.`actorid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many different actors have played a role in the highest rating movie?",
    "evidence": "highest rating of a movie is 5",
    "idx": 1058
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`u2base`)\nMATCH (t1@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`country` = 'UK' AND t1.`runningtime` = 2 AND t2.`rating` = '1' AND t1.`year` = 2)\nRETURN COUNT(t2.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users have rated 1 each for the UK's second newest movies with a running time of 2?",
    "evidence": "second newest movies refers to year = 2 since year in this database is a relative value, less is the newer",
    "idx": 1059
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies2directors`)\nMATCH (t1@`directors`)\nWHERE t1.`directorid` = t2.`directorid`\nRETURN cast (sum(CASE  WHEN t1.`d_quality` = 4 AND t1.`avg_revenue` = 4 THEN 1 ELSE 0 END) as float) / COUNT(t2.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total average movie directed by the directors who's quality and revenue is 4?",
    "evidence": "",
    "idx": 1064
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (t2@`movies2directors`)\nMATCH (t1@`movies`)\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`country` = 'other' AND t1.`year` = 3)\nRETURN cast (sum(CASE WHEN t1.`isenglish` = 'T' THEN 1 ELSE 0 END) - sum(CASE WHEN t1.`isenglish` = 'F' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`movieid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage difference of English and non-English-language crime movies in other countries in year 3?",
    "evidence": "non-English-language refers to isEnglish = 'F'; The percentage difference can be computed by [count(isEnglish = 'T' in movies) - count(isEnglish = 'F' in movies) / (all movies)] * 100%",
    "idx": 1066
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`customer name` = 'Aimee Bixby' AND t2.`ship mode` = 'Standard Class')\nRETURN COUNT(DISTINCT t2.`order id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the orders made by Aimee Bixby, how many of them chose the slowest delivery speed?",
    "evidence": "made by Aimee Bixby refers to \"Customer Name\" = 'Aimee Bixby'; the slowest delivery speed refers to \"Ship Mode\" = 'Standard Class';",
    "idx": 1068
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`customer name` = 'Aimee Bixby')\nRETURN COUNT(DISTINCT t2.`order id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders has Aimee Bixby made?",
    "evidence": "Aimee Bixby made refers to \"Customer Name\" = 'Aimee Bixby';",
    "idx": 1069
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`product name` = 'Telescoping Adjustable Floor Lamp')\nRETURN sum(t1.`quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total quantity of \"Telescoping Adjustable Floor Lamp\" ordered from central superstores?",
    "evidence": "\"Telescoping Adjustable Floor Lamp\" is a \"Product Name\"; from central superstores refers to Region = 'Central';",
    "idx": 1071
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t2.`product id`\nAND (t3.`product name` = 'Telescoping Adjustable Floor Lamp' AND t1.`segment` = 'Consumer')\nRETURN COUNT(DISTINCT t1.`customer name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers who have ordered the product \"Telescoping Adjustable Floor Lamp\", how many of them are consumers?",
    "evidence": "\"Telescoping Adjustable Floor Lamp\" is a \"Product Name\"; consumers refers to Segment = 'Consumer';",
    "idx": 1073
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t2.`product id`\nAND (t1.`customer name` = 'Aimee Bixby' AND t3.`product name` = 'Xerox 1952' AND t2.`order date` = date('2014-09-10'))\nRETURN sum(t2.`quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the quantity of Xerox 1952 ordered by Aimee Bixby on 2014/9/10?",
    "evidence": "Xerox 1952 is a \"Product Name\"; ordered by Aimee Bixby refers to \"Customer Name\" = 'Aimee Bixby'; on 2014/9/10 refers to \"Order Date\" = date('2014-09-10');",
    "idx": 1074
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t2.`product id`\nAND (t1.`customer name` = 'Aimee Bixby' AND t3.`product name` = 'Xerox 1952')\nRETURN COUNT(DISTINCT t2.`order id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For how many times has Aimee Bixby ordered the product Xerox 1952?",
    "evidence": "Xerox 1952 is a \"Product Name\"; Aimee Bixby ordered refers to \"Customer Name\" = 'Aimee Bixby';",
    "idx": 1075
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t2.`product id`\nAND (t1.`customer name` = 'Aimee Bixby' AND t3.`product name` = 'Xerox 1952' AND t2.`order date` = date('2014-09-10'))\nRETURN DISTINCT t2.`sales` / (1 - t2.`discount`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the original price of Xerox 1952 ordered by Aimee Bixby on 2014/9/10?",
    "evidence": "Xerox 1952 is a \"Product Name\"; ordered by Aimee Bixby refers to \"Customer Name\" = 'Aimee Bixby'; on 2014/9/10 refers to \"Order Date\" = date('2014-09-10'); original price refers to DIVIDE(Sales, SUTRACT(1, discount))",
    "idx": 1076
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t2.`product id`\nAND (t1.`customer name` = 'Aimee Bixby' AND t3.`product name` = 'Xerox 1952' AND t2.`order date` = date('2014-09-10'))\nRETURN DISTINCT (t2.`sales` / (1 - t2.`discount`)) * t2.`quantity` - t2.`profit` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the total cost of Xerox 1952 ordered by Aimee Bixby on 2014/9/10?",
    "evidence": "Xerox 1952 is a \"Product Name\"; ordered by Aimee Bixby refers to \"Customer Name\" = 'Aimee Bixby'; on 2014/9/10 refers to \"Order Date\" = date('2014-09-10'); total cost refers to SUTRACT(MULTIPLY(DIVIDE(Sales, SUTRACT(1, discount)), Quantity), Profit)",
    "idx": 1077
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_2`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nORDER BY (t1.`sales` / (1 - t1.`discount`)) DESC NULLS LAST \nRETURN t2.`product name` AS `product name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the product that has the highest original price?",
    "evidence": "has the highest original price refers to MAX(DIVIDE(Sales, SUTRACT(1, discount))); name of the product refers to \"Product Name\"",
    "idx": 1078
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t2.`product id`\nAND (t1.`customer name` = 'Darren Powers')\nORDER BY t2.`order date` DESC NULLS LAST \nRETURN t3.`product name` AS `product name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the product that was ordered recently by Darren Powers?",
    "evidence": "Darren Powers is the \"Customer Name\"; name of the product refers to \"Product Name\"; recently refers to MAX(\"Order Date\")",
    "idx": 1079
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`product name` = 'Advantus Plastic Paper Clips')\nRETURN sum(t1.`quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many quantities of Advantus plastic paper clips were ordered overall?",
    "evidence": "Advantus plastic paper clips is the \"Product Name\";",
    "idx": 1080
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_4`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t2.`customer name` = 'Alejandro Grove')\nRETURN DISTINCT t3.`product name` AS `product name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the products that were ordered by Alejandro Grove?",
    "evidence": "ordered by Alejandro Grove refers to \"Customer Name\" = 'Alejandro Grove'; names of the products refers to \"Product Name\"",
    "idx": 1081
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_4`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t3.`product name` = 'Cardinal EasyOpen D-Ring Binders' AND t2.`city` = 'Chicago' AND t1.`quantity` > 10)\nRETURN COUNT(DISTINCT t1.`customer id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers in Chicago ordered at least 10 Cardinal EasyOpen D-Ring Binders in a single order?",
    "evidence": "at least 10 goods refers to Quantity > = 14; Cardinal EasyOpen D-Ring Binders refers to \"Product Name\"; customers in Chicago refers to City = 'Chicago'",
    "idx": 1082
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_4`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t1.`profit` > 1000)\nRETURN DISTINCT t2.`product name` AS `product name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the products with a profit of no less than 1,000 in one single order?",
    "evidence": "profit of no less than 1,000 refers to Profit > = 1000; names of the products refers to \"Product Name\"",
    "idx": 1083
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_3`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t1.`ship date` = date('2013-03-04') AND t2.`region` = 'South' AND t1.`order date` = date('2013-03-04'))\nRETURN t2.`product name` AS `product name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which item was shipped on 3/4/2013 and scheduled for same day delivery in the South region?",
    "evidence": "shipped on 3/4/2013 refers to \"Order Date\" = date('2013-03-04'); same day delivery refers to \"Ship Mode\" = 'Same Day'; item refers to \"Product Name\"",
    "idx": 1088
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`product name` = 'Avery Hi-Liter EverBold Pen Style Fluorescent Highlighters, 4/Pack' AND t2.`region` = 'Central')\nRETURN sum(t1.`sales`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total sales of 'Avery Hi-Liter EverBold Pen Style Fluorescent Highlighters, 4/Pack' in the Central region?",
    "evidence": "'Avery Hi-Liter EverBold Pen Style Fluorescent Highlighters, 4/Pack' is the \"Product Name\";",
    "idx": 1089
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_2`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t3.`product name` = 'Global High-Back Leather Tilter, Burgundy' AND t1.`order date` = date('2013-10-13') AND t1.`region` = 'East')\nRETURN DISTINCT t2.`customer name` AS `customer name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which customer ordered 'Global High-Back Leather Tilter, Burgundy' on 10/13/2013 in the East region?",
    "evidence": "'Global High-Back Leather Tilter, Burgundy' is the \"Product Name\"; on 10/13/2013 refers to \"Order Date\" = Date('2013-10-13'); Region = 'East'",
    "idx": 1092
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_3`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t2.`customer name` = 'Katherine Murray' AND t1.`order date` = date('2018-11-04') AND t2.`region` = 'South')\nRETURN DISTINCT t3.`category` AS `category`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What category does the item ordered by Katherine Murray on 11/4/2018 in the South region belong to?",
    "evidence": "ordered by Katherine Murray refers to \"Customer Name\" = 'Katherine Murray'; on 11/4/2018 refers to \"Order Date\" = Date('2018-11-04');",
    "idx": 1093
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_4`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`region` = 'West' AND t1.`ship mode` = 'Standard Class')\nRETURN cast (sum(CASE  WHEN t2.`category` = 'Furniture' THEN 1 ELSE 0 END) as float) * 100 / sum(t1.`quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage do items under the category of 'Furniture' make up the total number of items ordered that are shipped as standard in the West region?",
    "evidence": "shipped as standard refers to \"Ship Mode\" = 'Standard Class'; Region = 'West'; percentage refers to DIVIDE(SUM(Quantity where Category = 'Furniture'), SUM(Quantity)) * 1.0",
    "idx": 1094
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`customer name` = 'Ann Chong' AND t1.`region` = 'Central')\nRETURN t2.`ship date` AS `ship date`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ship date of the order by the customer named Ann Chong in the central region?",
    "evidence": "Ann Chong' is the \"Customer Name\"; Region = 'Central'",
    "idx": 1095
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_4`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`product name` = 'Hon Valutask Swivel Chairs' AND t1.`region` = 'West')\nRETURN sum(t1.`sales`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the total sales of the accumulated orders of Hon Valutask Swivel Chairs in the West region?",
    "evidence": "'Hon Valutask Swivel Chairs' is the \"Product Name\"",
    "idx": 1097
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t1.`order date` = date('2018-04-26') AND t1.`ship date` = date('2018-04-27') AND t2.`region` = 'Central')\nRETURN t2.`product name` AS `product name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What product was ordered in the Central region on April 26, 2018, and shipped by April 27, 2018?",
    "evidence": "on April 26, 2018 refers to \"Order Date\" = date('2018-04-26'); shipped by April 27, 2018 refers to \"Ship Date\" = date('2018-04-27');",
    "idx": 1099
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_2`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`region` = 'East')\nORDER BY t1.`profit` DESC NULLS LAST \nRETURN t2.`customer name` AS `customer name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the customer from the East region that purchased the order with the highest profit?",
    "evidence": "highest profit refers to MAX(profit); Region = 'East'",
    "idx": 1100
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t1.`order id` = 'CA-2011-137274' AND t2.`region` = 'Central')\nRETURN t1.`order date` AS `order date`, t2.`product name` AS `product name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the order date and product name of the order ID CA-2011-137274 from the Central region?",
    "evidence": "",
    "idx": 1101
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`category` = 'Office Supplies' AND t2.`region` = 'Central')\nORDER BY t1.`sales` DESC NULLS LAST \nRETURN t2.`product name` AS `product name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the products under the office supplies category, what is the product that made the highest sales in the Central region?",
    "evidence": "made the highest sales refers to MAX(Sales)",
    "idx": 1103
  }
]