[
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (`t2`:`user_reviews`)-[written_for_0:written_for]->(`t1`:`playstore`)\nWHERE `t1`.`app` = `t2`.`app`\nAND (`t1`.`type` = 'Free' AND `t1`.`category` = 'SPORTS')\nRETURN `t1`.`app` AS `app`, `t2`.`translated_review` AS `translated_review`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all free sports Apps and their translated review.",
    "evidence": "paid sports Apps refers to type = 'Paid' and Category = 'SPORTS';",
    "idx": 1880
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`customers_sub0`:`customers`)\nRETURN CASE WHEN `customers_sub0`.`customer names` =~ '(?i)(?s).*Group.*' THEN `customers_sub0`.`customer names` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the customers with name containing the word 'Group'.",
    "evidence": "name containing the word 'Group' refers to Customer Names LIKE '%Group%';",
    "idx": 1883
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[handled_by_0:handled_by]->(`t2`:`sales team`)\nWHERE `t2`.`salesteamid` = `t1`.`_salesteamid`\nAND (`t1`.`ordernumber` = 'SO - 000137')\nRETURN `t2`.`sales team` AS `sales team`, `t2`.`region` AS `region`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the sales team and the region of order number 'SO - 000137'.",
    "evidence": "",
    "idx": 1885
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[contains_0:contains]->(`t1`:`products`)\nMATCH (`t2`:`sales orders`)-[handled_by_0:handled_by]->(`t3`:`sales team`)\nWHERE `t2`.`_productid` = `t1`.`productid`\nAND `t3`.`salesteamid` = `t2`.`_salesteamid`\nAND (`t3`.`sales team` = 'Douglas Tucker')\nRETURN DISTINCT `t1`.`productid` AS `productid`, `t1`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the order numbers along with its product name for each order under the sales team of 'Douglas Tucker'.",
    "evidence": "",
    "idx": 1886
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[fulfilled_at_0:fulfilled_at]->(`t2`:`store locations`)\nWHERE `t2`.`storeid` = `t1`.`_storeid`\nAND (`t1`.`sales channel` = 'In-Store')\nRETURN DISTINCT `t1`.`ordernumber` AS `ordernumber`, `t2`.`city name` AS `city name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the order numbers for In-Store sales and find the city where the store is located.",
    "evidence": "In-Store sales refer to Sales Channel = 'In-Store'; city refers to City Name;",
    "idx": 1887
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`sales orders`)-[placed_by_1:placed_by]->(`t2_sub0`:`customers`)\nWHERE `t2_sub0`.`customerid` = `t1_sub0`.`_customerid`\nRETURN CASE  WHEN `t1_sub0`.`orderdate` =~ '(?i)(?s).*/.*/18' AND `t2_sub0`.`customer names` = 'Rochester Ltd' THEN `t1_sub0`.`ordernumber` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN DISTINCT `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the numbers ordered by 'Rochester Ltd' in 2018.",
    "evidence": "Rochester Ltd is the name of the customer; all the numbers ordered refer to OrderNumber; 2018 refers to SUBSTR(OrderDate, -2) = '18';",
    "idx": 1889
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[contains_0:contains]->(`t1`:`products`)\nMATCH (`t2`:`sales orders`)-[handled_by_0:handled_by]->(`t3`:`sales team`)\nWHERE `t2`.`_productid` = `t1`.`productid`\nAND `t3`.`salesteamid` = `t2`.`_salesteamid`\nAND (`t2`.`warehousecode` = 'WARE-NMK1003')\nRETURN DISTINCT `t1`.`product name` AS `product name`, `t3`.`sales team` AS `sales team`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide all the orders from WARE-NMK1003. Name the product and sales team for each of these order.",
    "evidence": "all the orders from WARE-NMK1003 refer to OrderNumber where WarehouseCode = 'WARE-NMK1003'; product refers to Product Name;",
    "idx": 1890
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[placed_by_1:placed_by]->(`t1_sub0`:`customers`)\nWHERE `t2_sub0`.`_customerid` = `t1_sub0`.`customerid`\nRETURN CASE  WHEN `t2_sub0`.`sales channel` = 'Online' THEN `t1_sub0`.`customer names` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of all customers who had made orders online.",
    "evidence": "orders online refer to Sales Channel = 'Online';",
    "idx": 1891
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[contains_0:contains]->(`t2`:`products`)\nWHERE `t2`.`productid` = `t1`.`_productid`\nAND (`t1`.`shipdate` =~ '(?i)(?s)7/.*/18')\nRETURN CASE WHEN COUNT(`t1`.`ordernumber`)=0 THEN NULL ELSE sum(CASE  WHEN `t2`.`product name` = 'Home Fragrances' THEN 1 ELSE 0 END) * 100 / COUNT(`t1`.`ordernumber`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the sales order shipped in July 2018, calculate the percentage of orders for home fragrances.",
    "evidence": "shipped in July 2018 refers to ShipDate between 01-07-2018 and 31-07-2018; DIVIDE(COUNT(OrderNumber where Product Name = 'Home Fragrances' and SUBSTR(OrderDate, 1, 1) = '7'), COUNT(OrderNumber where SUBSTR(ShipDate, -2) = '18')) as percentage;",
    "idx": 1892
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer names` =~ '(?i)(?s)W.*'\nRETURN DISTINCT `customers`.`customerid` AS `customerid`, `customers`.`customer names` AS `customer names` ORDER BY `customer names` IS NULL ASC, `customer names` DESC",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the customer IDs and names that start with alphabet \"W\".",
    "evidence": "names that start with alphabet \"W\" refer to Customer Names LIKE 'W%';",
    "idx": 1893
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`products_sub0`:`products`)\nRETURN `products_sub0`.`productid` AS `productid`, CASE  WHEN `products_sub0`.`product name` =~ '(?i)(?s).*Outdoor.*' THEN `products_sub0`.`product name` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `productid`, `t` ORDER BY `t` IS NULL ASC, `t` DESC",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the product IDs and names that include the word \"Outdoor\".",
    "evidence": "names that include the word \"Outdoor\" refer to Product Name LIKE '%Outdoor%';",
    "idx": 1894
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`sales orders_sub0`:`sales orders`)\nRETURN CASE  WHEN `sales orders_sub0`.`sales channel` = 'In-Store' AND `sales orders_sub0`.`warehousecode` = 'WARE-NMK1003' AND `sales orders_sub0`.`discount applied` = '0.4' THEN `sales orders_sub0`.`ordernumber` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN COUNT(DISTINCT `t`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the sales with 40% discount via in-store channel, how many products were shipped from warehouse code of WARE-NMK1003?",
    "evidence": "40% discount refers to Discount Applied = 0.4; in-store channel refers to Sales Channel = 'In-Store'; orders refer to OrderNumber;",
    "idx": 1895
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`store locations`)-[located_in_0:located_in]->(`t1`:`regions`)\nWHERE `t2`.`statecode` = `t1`.`statecode`\nAND (`t2`.`county` = 'Allen County')\nRETURN DISTINCT `t2`.`storeid` AS `storeid`, `t2`.`city name` AS `city name`, `t1`.`region` AS `region`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the ID, city and region of the stores which are in Allen country.",
    "evidence": "ID refers to StoreID;",
    "idx": 1897
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`store locations`)-[located_in_0:located_in]->(`t1`:`regions`)\nWHERE `t2`.`statecode` = `t1`.`statecode`\nAND (`t2`.`type` = 'Borough' OR `t2`.`type` = 'CDP')\nRETURN DISTINCT `t2`.`storeid` AS `storeid`, `t2`.`city name` AS `city name`, `t1`.`state` AS `state`, `t2`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ID, city, state and region for the store type which is fewer between borough and CDP.",
    "evidence": "COUNT(StoreID) < COUNT(StoreID where Type = 'Borough') < COUNT(StoreID where Type = 'CDP');",
    "idx": 1898
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[handled_by_0:handled_by]->(`t2`:`sales team`)\nWHERE `t2`.`salesteamid` = `t1`.`_salesteamid`\nAND (`t2`.`salesteamid` = 18 AND `t1`.`sales channel` = 'In-Store' OR `t1`.`sales channel` = 'Online')\nRETURN `t2`.`region` AS `region`, `t2`.`sales team` AS `sales team`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the region and name of the sale team ID of 18 and compare their orders between in-store and online.",
    "evidence": "sale team ID of 18 refers to _SalesTeamID = 18; COUNT(OrderNumber where Sales Channel = 'In-Store') > COUNT(OrderNumber where Sales Channel = 'Online');",
    "idx": 1899
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[placed_by_0:placed_by]->(`t2`:`customers`)\nWHERE `t2`.`customerid` = `t1`.`_customerid`\nAND (`t2`.`customer names` = 'Medline ')\nRETURN CASE WHEN COUNT(`t1`.`_customerid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`sales channel` = 'In-Store' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`_customerid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of order via in-store channel of customer \"Medline\".",
    "evidence": "Medline is the name of the customer; DIVIDE(COUNT(OrderNumber where Sales Channel = 'In-Store' and Customer Names = 'Medline'), COUNT(OrderNumber where Customer Names = 'Medline')) as percentage;",
    "idx": 1900
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nMATCH (`t2`:`sales orders`)-[contains_0:contains]->(`t3`:`products`)\nWHERE `t2`.`_customerid` = `t1`.`customerid`\nAND `t3`.`productid` = `t2`.`_productid`\nAND (`t2`.`sales channel` = 'Wholesale' AND `t3`.`product name` = 'Bedroom Furniture' AND `t2`.`orderdate` =~ '(?i)(?s).*/.*/19')\nRETURN `t1`.`customer names` AS `customer names`, `t2`.`deliverydate` AS `deliverydate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the customer names and lasting delivery periods for the product of \"Bedroom Furniture\" by wholesale channel in 2019.",
    "evidence": "delivery period in 2019 means time between placing of an order and the receipt of product and refers to SUBTRACT(DeliveryDate, OrderDate) where SUBSTR(OrderDate, -2 ) = '19'; Sales Channel = 'Wholesale'; Product Name = 'Bedroom Furniture';",
    "idx": 1901
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`store locations`)-[located_in_0:located_in]->(`t1`:`regions`)\nWHERE `t2`.`statecode` = `t1`.`statecode`\nAND (`t2`.`state` = 'California' AND `t2`.`water area` = '0')\nRETURN DISTINCT `t2`.`city name` AS `city name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the store located cities with regions in no water area of California state.",
    "evidence": "cities refer to City Name; no water area refers to Water Area = 0;",
    "idx": 1902
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[handled_by_0:handled_by]->(`t2`:`sales team`)\nWHERE `t2`.`salesteamid` = `t1`.`_salesteamid`\nRETURN CASE WHEN COUNT(`t1`.`ordernumber`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`sales team` = 'Carlos Miller' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`ordernumber`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the order percentage by \"Carlos Miller\" sales team.",
    "evidence": "DIVIDE(COUNT(OrderNumber where Sales Team = 'Carlos Miller'), COUNT(OrderNumber)) as percentage;",
    "idx": 1903
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[contains_0:contains]->(`t2`:`products`)\nWHERE `t2`.`productid` = `t1`.`_productid`\nRETURN sum(CASE  WHEN `t2`.`product name` = 'Platters' THEN 1 ELSE 0 END) AS `num1`, sum(CASE  WHEN `t2`.`product name` = 'Serveware' THEN 1 ELSE 0 END) AS `num2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compare the number of orders between \"Platters\" and \"Serveware\" products.",
    "evidence": "COUNT(OrderNumber where Product Name = 'Platters') > COUNT(OrderNumber where Product Name = 'Serveware');",
    "idx": 1904
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[handled_by_0:handled_by]->(`t2`:`sales team`)\nWHERE `t2`.`salesteamid` = `t1`.`_salesteamid`\nAND (`t2`.`region` = 'South' AND `t2`.`salesteamid` >= 1 AND `t2`.`salesteamid` <= 9)\nWITH `t2`.`salesteamid` AS _groupby_col_0, COUNT(`t1`.`ordernumber`) AS _groupby_col_1\nWHERE _groupby_col_1 <> 0\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the sales team in South region, write down the numbers of orders made by the sales team ID of one digit.",
    "evidence": "sales team ID of one digit refers to _SalesTeamID BETWEEN 1 AND 9; numbers of orders refer to COUNT(OrderNumber);",
    "idx": 1905
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`regions_sub0`:`regions`)\nRETURN CASE WHEN `regions_sub0`.`statecode` = 'GA' THEN `regions_sub0`.`state` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the full name of state code \"GA\".",
    "evidence": "",
    "idx": 1909
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`regions_sub0`:`regions`)\nRETURN CASE  WHEN `regions_sub0`.`region` = 'Midwest' THEN `regions_sub0`.`statecode` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN COUNT(DISTINCT `t`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many states located in the Midwest region?",
    "evidence": "",
    "idx": 1910
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`sales orders`)-[contains_1:contains]->(`t2_sub0`:`products`)\nWHERE `t2_sub0`.`productid` = `t1_sub0`.`_productid`\nRETURN DISTINCT CASE WHEN `t1_sub0`.`unit cost` = '781.22' THEN `t2_sub0`.`product name` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the product name of order which has unit cost of 781.22.",
    "evidence": "",
    "idx": 1911
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`sales orders`)-[contains_1:contains]->(`t2_sub0`:`products`)\nWHERE `t2_sub0`.`productid` = `t1_sub0`.`_productid`\nRETURN DISTINCT CASE WHEN `t2_sub0`.`product name` = 'Cookware' THEN `t1_sub0`.`deliverydate` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the delivery date of cookware.",
    "evidence": "Cookware is the name of the product;",
    "idx": 1912
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`sales orders`)-[contains_1:contains]->(`t2_sub0`:`products`)\nWHERE `t2_sub0`.`productid` = `t1_sub0`.`_productid`\nRETURN DISTINCT CASE WHEN `t1_sub0`.`discount applied` = 0.1 THEN `t2_sub0`.`product name` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the name of products which have been applied 10% discount.",
    "evidence": "applied 10% discount refers to Discount Applied = 0.1;",
    "idx": 1914
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`store locations`)-[located_in_1:located_in]->(`t1_sub0`:`regions`)\nWHERE `t2_sub0`.`statecode` = `t1_sub0`.`statecode`\nRETURN DISTINCT CASE  WHEN `t1_sub0`.`region` = 'South' THEN `t2_sub0`.`city name`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the city name of states located in South region.",
    "evidence": "",
    "idx": 1915
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`store locations`)-[located_in_1:located_in]->(`t1_sub0`:`regions`)\nWHERE `t2_sub0`.`statecode` = `t1_sub0`.`statecode`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`type` = 'Town' THEN `t1_sub0`.`region`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the region of stores which have type of \"Town\" in the list?",
    "evidence": "",
    "idx": 1916
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[placed_by_1:placed_by]->(`t1_sub0`:`customers`)\nWHERE `t2_sub0`.`_customerid` = `t1_sub0`.`customerid`\nRETURN DISTINCT CASE  WHEN `t1_sub0`.`customer names` = 'Ole Group' THEN `t2_sub0`.`discount applied`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the discount levels applied for all orders from Ole Group.",
    "evidence": "Ole Group is the name of the customer; discount levels applied refer to Discount Applied NOT NULL;",
    "idx": 1918
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[placed_by_1:placed_by]->(`t1_sub0`:`customers`)\nWHERE `t2_sub0`.`_customerid` = `t1_sub0`.`customerid`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`shipdate` = '7/8/18' THEN `t1_sub0`.`customer names`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the customer name of orders which has shipped date in 7/8/2018.",
    "evidence": "shipped date in 7/8/2018 refers to ShipDate = '7/8/18'",
    "idx": 1919
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[placed_by_1:placed_by]->(`t1_sub0`:`customers`)\nWHERE `t2_sub0`.`_customerid` = `t1_sub0`.`customerid`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`unit cost` > '4000' THEN `t1_sub0`.`customer names`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the customer names of orders which have unit cost greater than 4000USD?",
    "evidence": "unit cost greater than 4000USD refers to Unit Cost > 4000;",
    "idx": 1922
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`sales orders`)-[contains_1:contains]->(`t2_sub0`:`products`)\nWHERE `t2_sub0`.`productid` = `t1_sub0`.`_productid`\nRETURN replace(`t1_sub0`.`unit price`,',','') AS `_col_0` ORDER BY replace(`t1_sub0`.`unit price`,',','') IS NULL DESC, replace(`t1_sub0`.`unit price`,',','')  \nLIMIT 1\n}\nMATCH (`t1`:`sales orders`)-[contains_0:contains]->(`t2`:`products`)\nWHERE `t2`.`productid` = `t1`.`_productid`\nAND (replace(`t1`.`unit price`,',','') = `_col_0`)\nRETURN `t1`.`ordernumber` AS `ordernumber`, `t2`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the order number and product name of the order which has the lowest unit price.",
    "evidence": "the lowest unit price refers to MIN(Unit Price);",
    "idx": 1926
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`sales orders`)-[handled_by_1:handled_by]->(`t2_sub0`:`sales team`)\nWHERE `t2_sub0`.`salesteamid` = `t1_sub0`.`_salesteamid`\nRETURN DISTINCT CASE  WHEN `t1_sub0`.`orderdate` = '5/31/18' THEN `t2_sub0`.`sales team` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all sale team names which had orders on 5/31/2018.",
    "evidence": "had orders on 5/31/2018 refer to OrderDate = '5/31/18'; sale team names refer to Sales Team;",
    "idx": 1927
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL(*) {\nMATCH (`sales orders_sub0`:`sales orders`)\nRETURN replace(`sales orders_sub0`.`unit price`,',','') AS `_col_0` ORDER BY replace(`sales orders_sub0`.`unit price`,',','') IS NULL ASC, replace(`sales orders_sub0`.`unit price`,',','') DESC \nLIMIT 1\n}\nMATCH (`sales orders`:`sales orders`)\nWHERE replace(`sales orders`.`unit price`,',','') = `_col_0`\nRETURN `sales orders`.`ordernumber` AS `ordernumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which order number has the highest unit price?",
    "evidence": "the highest unit price refers to MAX(Unit Price);",
    "idx": 1929
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`sales orders_sub0`:`sales orders`)\nRETURN CASE WHEN `sales orders_sub0`.`ordernumber` = 'SO - 000103' THEN `sales orders_sub0`.`unit cost` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN DISTINCT `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the unit cost of order SO - 000103?",
    "evidence": "OrderNumber = 'SO - 000103';",
    "idx": 1930
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[fulfilled_at_0:fulfilled_at]->(`t2`:`store locations`)\nWHERE `t2`.`storeid` = `t1`.`_storeid`\nAND (`t1`.`orderdate` =~ '(?i)(?s).*/.*/19')\nWITH `t2`.`city name` AS _groupby_col_0, COUNT(`t1`.`ordernumber`) AS _groupby_col_1\nWHERE _groupby_col_1 <> 0\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the total number of orders by each city in 2019.",
    "evidence": "total number of orders refers to COUNT(OrderNumber); 2019 refers to OrderDate between 01-01-2019 and 31-12-2019; city refers to City Name;",
    "idx": 1933
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL(*) {\nMATCH (`sales orders_sub0`:`sales orders`)\nRETURN replace(`sales orders_sub0`.`unit cost`,',','') AS `_col_0` ORDER BY replace(`sales orders_sub0`.`unit cost`,',','') IS NULL ASC, replace(`sales orders_sub0`.`unit cost`,',','') DESC \nLIMIT 1\n}\nMATCH (`sales orders`:`sales orders`)\nWHERE replace(`sales orders`.`unit cost`,',','') = `_col_0`\nRETURN `sales orders`.`ordernumber` AS `ordernumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which order have the highest unit cost?",
    "evidence": "order have the highest unit cost refers to OrderNumber where MAX(Unit Cost);",
    "idx": 1937
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`products_sub0`:`products`)\nRETURN CASE  WHEN `products_sub0`.`productid` >= 30 AND `products_sub0`.`productid` <= 40 THEN `products_sub0`.`product name` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the name of products with the ID of 30 to 40.",
    "evidence": "products with the ID of 30 to 40 refer to Product Name WHERE ProductID BETWEEN 30 AND 40;",
    "idx": 1938
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`sales orders`)-[fulfilled_at_1:fulfilled_at]->(`t2_sub0`:`store locations`)\nWHERE `t2_sub0`.`storeid` = `t1_sub0`.`_storeid`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`city name` = 'Daly City' THEN `t1_sub0`.`ordernumber`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all orders where its products were shipped from Daly City.",
    "evidence": "shipped from Daly City refers to Store Locations where City Name = 'Daly City'; orders refer to OrderNumber;",
    "idx": 1940
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[placed_by_0:placed_by]->(`t2`:`customers`)\nWHERE `t2`.`customerid` = `t1`.`_customerid`\nAND (`t2`.`customer names` = 'Qualitest ')\nORDER BY `t1`.`order quantity` IS NULL ASC, `t1`.`order quantity` DESC \nRETURN `t1`.`ordernumber` AS `ordernumber`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the order number where Qualitest ordered the highest product quantity.",
    "evidence": "Qualitest ordered the highest product quantity refers to Customer Names where MAX(Order Quantity);",
    "idx": 1942
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[contains_0:contains]->(`t2`:`products`)\nWHERE `t2`.`productid` = `t1`.`_productid`\nAND (`t1`.`sales channel` = 'In-Store')\nRETURN DISTINCT `t1`.`ordernumber` AS `ordernumber`, `t2`.`product name` AS `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the order for all in-store sales along with the products sold.",
    "evidence": "orders for all in-store sales refer to OrderNumber where Sales Channel = 'In-Store'; products refer to Product Name;",
    "idx": 1943
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`sales orders`)-[handled_by_1:handled_by]->(`t2_sub0`:`sales team`)\nWHERE `t2_sub0`.`salesteamid` = `t1_sub0`.`_salesteamid`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`sales team` = 'Samuel Fowler' THEN `t1_sub0`.`ordernumber` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State all the order numbers for sales team of Samuel Fowler.",
    "evidence": "",
    "idx": 1946
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[contains_0:contains]->(`t1`:`products`)\nWHERE `t2`.`_productid` = `t1`.`productid`\nAND (`t1`.`product name` = 'Baseball' AND `t2`.`orderdate` =~ '(?i)(?s)12/.*/18')\nRETURN COUNT(`t2`.`ordernumber`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the number of baseball ordered in December 2017.",
    "evidence": "Product Name = 'Baseball'; December 2017 refers to OrderDate LIKE '12/%/17';",
    "idx": 1947
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[contains_0:contains]->(`t1`:`products`)\nWHERE `t2`.`_productid` = `t1`.`productid`\nAND (`t1`.`product name` = 'Ornaments' AND `t2`.`orderdate` =~ '(?i)(?s).*/.*/18')\nRETURN CASE WHEN 12=0 THEN NULL ELSE toFloat(sum(`t2`.`order quantity`)) / 12 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the average number of ornaments sold each month in 2018.",
    "evidence": "DIVIDE(SUM(Order Quantity where Product Name = 'Ornaments' and OrderDate LIKE '%/18'), 12);",
    "idx": 1948
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[placed_by_1:placed_by]->(`t1_sub0`:`customers`)\nMATCH (`t2_sub0`:`sales orders`)-[contains_1:contains]->(`t3_sub0`:`products`)\nWHERE `t2_sub0`.`_customerid` = `t1_sub0`.`customerid`\nAND `t3_sub0`.`productid` = `t2_sub0`.`_productid`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`deliverydate` =~ '(?i)(?s).*/.*/21' AND `t1_sub0`.`customer names` = 'Sundial ' THEN `t3_sub0`.`product name`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the product names delivered in 2021 for the customer \"Sundial\".",
    "evidence": "delivered in 2021 refer to DeliveryDate LIKE '%/21'; 'Sundial' is the Customer Names",
    "idx": 1951
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`store locations`)-[located_in_0:located_in]->(`t1`:`regions`)\nWHERE `t2`.`statecode` = `t1`.`statecode`\nAND (`t2`.`state` = 'Michigan')\nRETURN DISTINCT `t2`.`storeid` AS `storeid`, `t1`.`region` AS `region`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the store IDs and region of the state \"Michigan\".",
    "evidence": "\"Michigan\" is the State",
    "idx": 1952
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[placed_by_0:placed_by]->(`t2`:`customers`)\nWHERE `t2`.`customerid` = `t1`.`_customerid`\nRETURN sum(CASE  WHEN `t2`.`customer names` = 'Apollo Ltd' THEN 1 ELSE 0 END) AS `_col_0`, sum(CASE  WHEN `t2`.`customer names` = 'Pacific Ltd' THEN 1 ELSE 0 END) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compare the total number of orders between customer \"Apollo Ltd\" and \"Pacific Ltd\".",
    "evidence": "\"Apollo Ltd\" and \"Pacific Ltd\" are both Customer Names; total number of orders refers to COUNT(OrderNumber)",
    "idx": 1953
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[fulfilled_at_0:fulfilled_at]->(`t2`:`store locations`)\nWHERE `t2`.`storeid` = `t1`.`_storeid`\nAND (`t2`.`population` >= 3000000 AND `t2`.`population` <= 4000000)\nRETURN COUNT(`t1`.`ordernumber`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the number of orders made from the store in city with population of 3000000 to 4000000.",
    "evidence": "number of order refers to OrderNumber; population of 3000000 to 4000000 refers to Population BETWEEN 3000000 AND 4000000",
    "idx": 1954
  }
]