[
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t1`.`award_category` = 'Primetime Emmy' AND `t1`.`year` >= 2009 AND `t1`.`year` <= 2010 AND `t1`.`result` <> 'Winner')\nRETURN `t2`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the characters that were nominated for Primetime Emmy Award from 2009 to 2010 but did not win?",
    "evidence": "nominated for Primetime Emmy Award but did not win refers to award_category = 'Primetime Emmy' and result = 'Nominee';  from 2009 to 2010 refers to year > = '2009' and  year < = '2010'",
    "idx": 3272
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`person` = 'Adam Kuhlman')\nRETURN sum(`t1`.`votes`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total votes of episodes that Adam Kuhlman had involved.",
    "evidence": "Adam Kuhlman had involved refers to person = 'Adam Kuhlman'",
    "idx": 3273
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`keyword`)\nMATCH ()-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`episode_id` = 'S20-E1')\nRETURN `t1`.`keyword` AS `keyword`, `t2`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the keyword and crew member's name for episode id S20-E1.",
    "evidence": "",
    "idx": 3274
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`stars` = 10 AND `t2`.`percent` > 29)\nRETURN `t1`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the keyword for episodes with stars score of 10 at 30% and above?",
    "evidence": "stars score of 10 at 30% and above refers to stars = 10 and percent > 29",
    "idx": 3275
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'Sex, Pies and Idiot Scrapes')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`stars` = 5 THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of star score 5 that was collected by title \"Sex, Pies and Idiot Scrapes\"?",
    "evidence": "percentage = DIVIDE(SUM(stars = 5), COUNT(stars)) as percentage",
    "idx": 3276
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Dangerous Curves')\nRETURN CASE  WHEN `t2`.`keyword` = 'limbo dancing' THEN 'Yes' ELSE 'No' END AS `result`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please check is \"limbo dancing\" the keyword for title \"Dangerous Curves\"?",
    "evidence": "",
    "idx": 3277
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)\nMATCH (`t1`:`award`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`award_category` = 'WGA Award (TV)')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down all the keywords for winner of \"WGA Award (TV)\" award.",
    "evidence": "winner of \"WGA Award (TV)\" award refers to award_category = 'WGA Award (TV)' and result = 'Winner'",
    "idx": 3278
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`award` = 'Outstanding Animated Program (For Programming Less Than One Hour)' AND `t2`.`role` = 'co-executive producer')\nRETURN `t1`.`birth_place` AS `birth_place`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the birth place of co-executive producer for nominee of \"Outstanding Animated Program (For Programming Less Than One Hour)\" award.",
    "evidence": "co-executive producer refers to role = 'co-executive producer'; nominee of \"Outstanding Animated Program (For Programming Less Than One Hour)\" award refers to award = 'Outstanding Animated Program (For Programming Less Than One Hour)' and result = 'Nominee'",
    "idx": 3279
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`award`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`award_category` = 'Blimp Award' AND `t2`.`stars` >= 1 AND `t2`.`stars` <= 5)\nWITH `t2`.`stars` AS _groupby_col_0, sum(`t2`.`stars`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `stars`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Sum up the votes from star 1 to 5 for all of the contestants in Blimp Award.",
    "evidence": "contestants refers to result = 'Winner' and result = 'Nominee'; in Blimp Award refers to award = 'Blimp Award'; star 1 to 5 refers to 1 < stars < 5",
    "idx": 3280
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`award_category` IN ['Jupiter Award ', 'WGA Award (TV)'])\nRETURN sum(`t2`.`rating`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total rating of winners in OFTA Television Award and WGA Award (TV).",
    "evidence": "winners refers to result = 'Winner'; in OFTA Television Award and WGA Award (TV) refers to award = 'OFTA Television Award' and award = 'WGA Award (TV)'",
    "idx": 3281
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'No Loan Again, Naturally' AND `t1`.`rating` = 6.8 AND `t2`.`stars` >= 5 AND `t2`.`stars` <= 10)\nRETURN sum(`t2`.`percent`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Out of the rating of 6.8 scored by title \"No Loan Again, Naturally\", how many percent of it consists of scores 5 to 10?",
    "evidence": "scores 5 to 10 refers to TOTAL(percent) where 1 < = stars < 5",
    "idx": 3282
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`vote`:`vote`)\nWHERE `vote`.`stars` > 8\nRETURN COUNT(DISTINCT `vote`.`episode_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many episodes have the star score greater than 8?",
    "evidence": "star score greater than 8 refers to stars > 8",
    "idx": 3283
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`vote`:`vote`)\nORDER BY `vote`.`votes` IS NULL ASC, `vote`.`votes` DESC \nRETURN `vote`.`episode_id` AS `episode_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which episode has the highest number of vote of the star score?",
    "evidence": "highest number of vote of the star score refers to max(votes)",
    "idx": 3284
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`keyword`:`keyword`)\nWHERE `keyword`.`keyword` = '2d animation'\nRETURN COUNT(`keyword`.`episode_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many episodes have the keyword \"2d animation\"?",
    "evidence": "",
    "idx": 3285
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`award_id` = 328\nRETURN `award`.`organization` AS `organization`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the organization which hold the award id 328.",
    "evidence": "",
    "idx": 3286
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`award_category` = 'Primetime Emmy'\nRETURN COUNT(`award`.`award_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many awards classified as \"Primetime Emmy\" category?",
    "evidence": "category refers to award_category",
    "idx": 3287
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`role` = 'co-executive producer' AND `t1`.`height_meters` > 1.60)\nRETURN `t1`.`birth_name` AS `birth_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the birth name of crews who are co-executive producer and higher than 1.60 meters.",
    "evidence": "co-executive producer refers to role = 'co-executive producer'; higher than 1.60 meters refers to height_meters > 1.60",
    "idx": 3288
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`result` = 'Nominee')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`birth_country` = 'USA' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of the nominees who were born in USA.",
    "evidence": "nominees refers to result = 'Nominee'; born in USA refers to birth_country = 'USA'; percentage = divide(sum(result = 'Nominee' and birth_country = 'USA'), count(Person.name)) * 100%",
    "idx": 3289
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`result` = 'Winner')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`height_meters` > 1.75 THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of the winners who are higher than 1.75 meters.",
    "evidence": "winners refers to result = 'Winner'; higher than 1.75 meters refers to height_meters > 1.75; percentage = divide(sum(result = 'Winner' and height_meters > 1.75), count(result = 'Winner' )) * 100%\n",
    "idx": 3290
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = 2)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the title of episodes which have star score of 2.",
    "evidence": "star score of 2 refers to stars = 2",
    "idx": 3291
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'How the Test Was Won')\nRETURN `t2`.`stars` AS `stars`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the star scores of episode which has title of \"How the Test Was Won\".",
    "evidence": "star scores refers to stars",
    "idx": 3292
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (CASE WHEN `t1`.`air_date` is not NULL THEN apoc.temporal.format(`t1`.`air_date`,'yyyy') ELSE NULL END = '2008' AND `t2`.`stars` > 5)\nRETURN COUNT(DISTINCT `t2`.`episode_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the episodes which have star score greater than 5, how many episodes have air date in 2008?",
    "evidence": "star score greater than 5 refers to stars > 5; have air date in 2008 refers to air_date LIKE '2008%'",
    "idx": 3293
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t1`.`year` = 2009)\nRETURN `t2`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the names of the awarded character in the awards held in 2009.",
    "evidence": "in 2009 refers to year = 2009; name of awarded character refers to character\n\n",
    "idx": 3294
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t2`.`character` = 'Mr. Burns')\nRETURN DISTINCT `t1`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which are the years that character Mr. Burns won an award?",
    "evidence": "",
    "idx": 3295
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t2`.`character` = 'Lenny')\nRETURN DISTINCT `t1`.`award_category` AS `award_category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the awarded category that the awarded character Lenny won?",
    "evidence": "\n\nawarded category refers to award_category",
    "idx": 3296
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t2`.`character` = 'Smithers')\nRETURN DISTINCT `t1`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of actor who took the role Smithers?",
    "evidence": "name refers to person; the role Smithers refers to character = 'Smithers'",
    "idx": 3297
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Dangerous Curves')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the keywords of the episode which has title as Dangerous Curves?",
    "evidence": "",
    "idx": 3298
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`t1`.`air_date`,(case when size(`t1`.`air_date`)+1+(1-1)+4 < 0 then 0 else size(`t1`.`air_date`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`t1`.`air_date`,size(`t1`.`air_date`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`t1`.`air_date`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`t1`.`air_date`,1-1,4) END = '2008')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the keywords of the episodes which have the air date in 2008?",
    "evidence": "have air date in 2008 refers to air_date LIKE '2008%'",
    "idx": 3299
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (CASE WHEN `t1`.`air_date` is not NULL THEN apoc.temporal.format(`t1`.`air_date`,'yyyy') ELSE NULL END = '2009' AND `t2`.`stars` < 8)\nRETURN COUNT(DISTINCT `t2`.`episode_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the episodes which have star score less than 8, how many episodes were aired in 2009?",
    "evidence": "star score less than 8 refers to stars < 8; aired in 2009 refers to air_date LIKE '2009%'",
    "idx": 3300
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`role` = 'director' AND `t1`.`birth_country` = 'South Korea')\nRETURN `t1`.`birth_name` AS `birth_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the birth name of crews who are director and have birth country in South Korea.",
    "evidence": "director refers to role = 'director'",
    "idx": 3301
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nWHERE `episode`.`rating` < 7\nRETURN COUNT(`episode`.`episode_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of episode with a rating below 7?",
    "evidence": "rating below 7 refers to rating < 7",
    "idx": 3302
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`birth_region` = 'California' AND `person`.`birth_country` = 'USA'\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the names of person born in California, USA.",
    "evidence": "California refers to birth_region = 'California'; USA refers to birth_country = 'USA'",
    "idx": 3303
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH ()-[credit:credit]->()\nWHERE `credit`.`episode_id` IN ['S20-E5', 'S20-E6', 'S20-E7', 'S20-E8', 'S20-E9', 'S20-E10'] AND `credit`.`credited` = 'true' AND `credit`.`role` = 'casting'\nRETURN COUNT(`credit`.`credited`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In between the episode 5 and10 of season 2, how many of them are credited for casting?",
    "evidence": "between the episode 5 and 10 of season 20 refers to episode_id IN('S20-E5', 'S20-E6', 'S20-E7', 'S20-E8', 'S20-E9', 'S20-E10'); credited refers to credited = 'true'; for casting refers to role = 'casting'",
    "idx": 3304
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`vote`:`vote`)\nWHERE `vote`.`stars` = 2 AND `vote`.`votes` = 9\nRETURN `vote`.`episode_id` AS `episode_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the episode ID that received 2 stars and 9 votes?",
    "evidence": "2 stars refers to stars = 2; 9 votes refers to votes = 9",
    "idx": 3305
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`organization` = 'Primetime Emmy Awards' AND `t1`.`year` = 2009 AND `t1`.`result` = 'Winner')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the title of the episode won in Primetime Emmy Awards 2009.",
    "evidence": "won refers to result = 'Winner'; in Primetime Emmy Awards refers to organization = 'Primetime Emmy Awards'; 2009 refers to year = 2009",
    "idx": 3306
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`person` = 'Carlton Batten' AND `t2`.`credited` = 'true')\nORDER BY `t1`.`votes` IS NULL ASC, `t1`.`votes` DESC \nRETURN `t2`.`category` AS `category`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the episode with highest votes, what is the category credited to Carlton Batten?",
    "evidence": "highest votes refers to max(votes); to Carlton Batten refers to person = 'Carlton Batten'",
    "idx": 3308
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`credited` = 'true' AND `t2`.`person` = 'Bonita Pietila' AND `t2`.`role` = 'casting')\nRETURN `t1`.`episode_id` AS `episode_id`, `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the episode ID and title of episode where casting was credited to Bonita Pietila.",
    "evidence": "was credited refers to credited = 'true'; to Bonita Pietila refers to person = 'Bonita Pietila'",
    "idx": 3310
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`award`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`organization` = 'Annie Awards' AND `t1`.`result` = 'Nominee' AND `t2`.`percent` > 6)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In episode nominated in Annie Awards, how many of the episodes have a percent greater than 6?",
    "evidence": "nominated refers to result = 'Nominee'; Annie Awards refers to organization = 'Annie Awards'; percent greater than 6 refers to percent > 6",
    "idx": 3311
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`votes` > 1000 AND `t1`.`award_category` = 'WGA Award (TV)' AND `t1`.`result` = 'Nominee')\nRETURN DISTINCT `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of episode nominated for WGA Award (TV) with votes greater than 1000?",
    "evidence": "nominated refers to result = 'Nominee'; WGA Award (TV) refers to award_category = 'WGA Award (TV)'; votes greater than 1000 refers to votes > 1000",
    "idx": 3312
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'How the Test Was Won' AND `t2`.`role` = 'additional timer' AND `t2`.`credited` = 'true' AND `t2`.`category` = 'Animation Department')\nRETURN `t2`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the people in Animation Department, who are credited for additional time in the episode titled by \"How the Test Was Won\"?",
    "evidence": "Animation Department refers to category = 'Animation Department'; credited refers to credited = 'true'; for additional timer refers to role = 'additional timer'",
    "idx": 3313
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (CASE  WHEN 1-1 < 0 AND 7 < 0  THEN substring(`t1`.`air_date`,(case when size(`t1`.`air_date`)+1+(1-1)+7 < 0 then 0 else size(`t1`.`air_date`)+1+(1-1)+7 end),-(7))  WHEN 1-1 < 0 AND 7 >= 0  THEN substring(`t1`.`air_date`,size(`t1`.`air_date`)+1+(1-1),7)  WHEN 1-1 >= 0 AND 7 < 0  THEN substring(`t1`.`air_date`,(case when 1-1+1+(7) < 0 then 0 else 1-1+1+(7) end),-(7))  ELSE substring(`t1`.`air_date`,1-1,7) END = '2008-11')\nRETURN `t2`.`stars` AS `stars`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the stars of episodes aired in November 2008.",
    "evidence": "in November 2008 refers to air_date LIKE '2008-11%'",
    "idx": 3314
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t3`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t1`.`episode_id` = `t3`.`episode_id`\nAND (`t3`.`air_date` = '2009-04-19' AND `t1`.`award_category` = 'Prism Award' AND `t2`.`stars` = 5 AND `t1`.`result` = 'Nominee')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of episode with 5 stars and nominated for Prism Award which is aired on April 19, 2009?",
    "evidence": "5 stars refers to stars = 5; nominated refers to result = 'Nominee'; Prism Award refers to award_category = 'Prism Award'; on April 19 2009 refers to air_date = '2009-04-19'",
    "idx": 3315
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`result` = 'Nominee')\nORDER BY `t2`.`votes` IS NULL ASC, `t2`.`votes` DESC \nRETURN `t1`.`award_category` AS `award_category`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In episode with the highest votes, list the category of awards it is nominated for.",
    "evidence": "highest votes refers to max(votes); nominated refers to result = 'Nominee'",
    "idx": 3316
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`credited` = 'true' AND `t2`.`person` = 'Sam Im' AND CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`t1`.`air_date`,(case when size(`t1`.`air_date`)+1+(1-1)+4 < 0 then 0 else size(`t1`.`air_date`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`t1`.`air_date`,size(`t1`.`air_date`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`t1`.`air_date`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`t1`.`air_date`,1-1,4) END = '2009' AND `t2`.`role` = 'additional timer')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In episodes aired in 2009, how many of them are credited to Sam Im for additional timer?",
    "evidence": "in 2009 refers to air_date LIKE '2009%'; credited refers to credited = 'true'; Sam Im refers to person = 'Sam Im'; for additional timer refers to role = 'additional timer'",
    "idx": 3317
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "CALL(*) {\nMATCH (`vote_sub0`:`vote`)\nRETURN avg(`vote_sub0`.`stars`) AS `_col_0`  \n}\nMATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` > 0.7 * `_col_0`)\nRETURN DISTINCT `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the title of the episode with stars greater than the 70% of average stars of all episodes.",
    "evidence": "stars greater than the 70% of average stars refers to stars > multiply(avg(stars), 0.7)",
    "idx": 3318
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`title` = 'Gone Maggie Gone' AND `t1`.`year` = 2009)\nRETURN CASE WHEN COUNT(`t1`.`result`)=0 THEN NULL ELSE toFloat((sum(CASE  WHEN `t1`.`result` = 'Nominee' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t1`.`result` = 'Winner' THEN 1 ELSE 0 END))) * 100 / COUNT(`t1`.`result`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In year 2009, what is the percentage of the episode titled by \"Gone Maggie Gone\" being nominated?",
    "evidence": "being nominated refers to result = 'Nominee'; percentage = divide(count(result = 'Nominee'), count(result)) * 100%",
    "idx": 3319
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`enlist`)\nMATCH (`t2`:`male`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`organ` = 'navy')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the male students that belong to the navy department.",
    "evidence": "belong to the navy department refers to organ = 'navy';",
    "idx": 3324
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enlist`)\nMATCH (`t1`:`longest_absense_from_school`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`month` = 9)\nRETURN `t2`.`organ` AS `organ`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the departments the students are absent from school for 9 months are in.",
    "evidence": "absent from school for 9 months refers to month = 9",
    "idx": 3331
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "WITH *, COLLECT { MATCH (`male_sub0`:`male`)\nRETURN `male_sub0`.`name` AS `name_1`   } AS in_collect_0\nMATCH (`filed_for_bankrupcy`:`filed_for_bankrupcy`)\nWHERE NOT `filed_for_bankrupcy`.`name` IN in_collect_0\nRETURN `filed_for_bankrupcy`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the female students that have filed for bankruptcy.",
    "evidence": "females students have filed for bankruptcy refers to name that appeared in both filed_for_bankrupcy and male tables",
    "idx": 3333
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`enlist`:`enlist`)\nWHERE `enlist`.`organ` = 'foreign_legion'\nRETURN `enlist`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all students enlisted in the foreign legion.",
    "evidence": "in the foreign legion organ = 'foreign_legion';",
    "idx": 3336
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`longest_absense_from_school`:`longest_absense_from_school`)\nWHERE `longest_absense_from_school`.`month` = 6\nRETURN `longest_absense_from_school`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all students that have been absent for 6 months.",
    "evidence": "absent for 6 months `month` = 6;",
    "idx": 3340
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enlist`)\nMATCH (`t1`:`enrolled`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`organ` = 'air_force')\nRETURN `t1`.`name` AS `name`, `t1`.`school` AS `school`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all students in the air force and which school they were enrolled at.",
    "evidence": "in the air force refers to organ = 'air_force';",
    "idx": 3343
  }
]