[
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`donations`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'Armenian Genocide'))\nRETURN t2.`donation_optional_support` AS `donation_optional_support`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the donation optional support amount for the project 'Armenian Genocide'?",
    "evidence": "Armenian Genocide' is the title;",
    "idx": 1618
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`donations`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'I Can\\'t See It...Can You Help Me???'))\nRETURN t2.`donation_included_optional_support` AS `donation_included_optional_support`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Did the project 'I Can't See It...Can You Help Me???' get the tip for the donation?",
    "evidence": "I Can't See It...Can You Help Me???' is the title;",
    "idx": 1620
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`donations`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(cast (t2.`donation_timestamp` as string),'2008-07-29 11:38:43.361'))\nRETURN t1.`teacher_acctid` AS `teacher_acctid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the teacher's account ID for the project that got the donation at 11:38:43 on 2008/7/29 ?",
    "evidence": "donation at 11:38:43 on 2008/7/29 refers to donation_timestamp = '2008/7/29 11:38:43'; teacher's account ID refers to teacher_acctid;",
    "idx": 1621
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`donations`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'Awesome Audiobooks Make Avid Readers'))\nRETURN cast (sum(t2.`donation_optional_support`) as float) * 100 / sum(t2.`donation_total`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the donation of the project 'Awesome Audiobooks Make Avid Readers', what was the percentage of the tip in the total amount?",
    "evidence": "Awesome Audiobooks Make Avid Readers' is the title; percentage = Divie(donation_optional_support, donation_total)*100;",
    "idx": 1623
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`donations`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'Bringing Drama to Life'))\nRETURN cast (sum(CASE  WHEN like(t2.`payment_method`,'creditcard') THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`donationid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the all donations to the project 'Bringing Drama to Life', what is the percentage of the donation is paid by credit card?",
    "evidence": "Bringing Drama to Life' is the title; Percentage = Divide(Count(payment_method = 'creditcard'), Count(projectid))*100;",
    "idx": 1624
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (essays@`essays`)\nWHERE essays.`title` = 'Future Einsteins Of America'\nRETURN essays.`short_description` AS `short_description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the short description for the title Future Einsteins Of America?",
    "evidence": "",
    "idx": 1625
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`school_district` = 'Livingston Parish School Dist' AND projects.`school_metro` = 'suburban'\nRETURN COUNT(projects.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many suburban metros are there in Livingston Parish School District?",
    "evidence": "suburban metros refer to metro = 'suburban'; Livingston Parish School District refer to school_district",
    "idx": 1627
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`projects`)\nMATCH (t2@`essays`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t2.`title`,'Future Einsteins Of America'))\nRETURN t1.`school_district` AS `school_district`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which school district was Future Einsteins Of America project located at?",
    "evidence": "Future Einsteins of America refer to title",
    "idx": 1630
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t3@`donations`)-[donated_to_0:`donated_to`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND t2.`projectid` = t3.`projectid`\nAND (t1.`title` = 'Needed Resource Materials For My Students')\nRETURN t3.`payment_method` AS `payment_method`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What payment method was used for Needed Resource Materials For My Students?",
    "evidence": "Needed Resource Materials For My Students refer to title",
    "idx": 1631
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`donations`)-[donated_to_0:`donated_to`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`payment_method` = 'creditcard' AND t2.`school_district` = 'Memphis City School District')\nRETURN COUNT(t1.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many donations were paid via credit card to Memphis City School District?",
    "evidence": "paid via credit card refer to payment method = creditcard; Memphis City School District refer to school_district",
    "idx": 1632
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t1.`title`,'Look, Look, We Need a Nook!'))\nRETURN t2.`school_latitude` AS `school_latitude`, t2.`school_longitude` AS `school_longitude`, t2.`resource_type` AS `resource_type`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the coordinates of the school where project 'Look, Look, We Need a Nook!' Was donated to and what resource type is it?",
    "evidence": "Coordinates of the school refer to school_latitude, school_longitude); Look, Look, We Need a Nook! Refer to title;",
    "idx": 1635
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`projects`)\nMATCH (t2@`essays`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (like(t2.`title`,'Lets Share Ideas'))\nRETURN t1.`date_posted` AS `date_posted`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What date did the project with he 'Lets Share Ideas essay' went live?",
    "evidence": "date refer to date_posted; Lets Share Ideas refer to title",
    "idx": 1637
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`school_district` = 'Los Angeles Unif Sch Dist' AND t1.`vendor_name` = 'Quill.com')\nRETURN t2.`school_city` AS `school_city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which cities in the Los Angeles Unified School District has bought supplies from Quill.com?",
    "evidence": "cities refer to school_city; Los Angeles Unified School District refer to school_district = 'Los Angeles Unified School District'; supplies refer to project_resource_type; Quill.com refer to vendor_name",
    "idx": 1639
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`donor_city` = 'Pocatello' AND donations.`is_teacher_acct` = 'f'\nRETURN COUNT(donations.`donationid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many donors who donated to the city of Pocatello are not teachers?",
    "evidence": "city of Pocatello refers to donor_city = 'Pocatello'; not teachers refers to is_teacher_acct = 'f'",
    "idx": 1642
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`teacher_prefix` = 'Dr.' AND projects.`school_county` = 'Suffolk'\nRETURN COUNT(projects.`schoolid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many schools in Suffolk County have Ph.D. teachers?",
    "evidence": "Suffolk County refers to School_county = 'Suffolk'; Ph.D. teachers refers to Teacher_prefix = 'Dr.'",
    "idx": 1643
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`payment_method` = 'amazon'\nRETURN sum(donations.`donation_to_project`) + sum(donations.`donation_optional_support`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the sum of the total donated amounts paid through Amazon?",
    "evidence": "paid through Amazon refers to payment_method = 'Amazon'; sum of the total donated amounts refers to SUM(donation_to_project,donation_optional_support)",
    "idx": 1644
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`dollar_amount` = '100_and_up' AND donations.`for_honoree` = 't'\nRETURN COUNT(donations.`donationid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many donations of more than $100 were made for an honoree?",
    "evidence": "an honoree refers to for_honoree = 't'; more than $100 refers to dollar_amount = '100_and_up'",
    "idx": 1645
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (resources@`resources`)\nWHERE resources.`vendor_name` = 'Quill.com' AND resources.`item_quantity` >= 5 AND resources.`item_quantity` <= 10\nRETURN COUNT(resources.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On how many projects where the teacher has ordered between 5 to 10 items are from are from Quill.com?",
    "evidence": "ordered between 5 to 10 items refers to item_quantity between 5 and 10; are from Quill.com refers to vendor_name = 'Quill.com'",
    "idx": 1647
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`school_metro` = 'suburban' AND projects.`school_county` = 'Los Angeles'\nRETURN projects.`school_city` AS `school_city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which cities are Los Angeles County Suburban Metro Schools located?",
    "evidence": "Los Angeles County refers to school_county = 'Los Angeles'",
    "idx": 1649
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE donations.`payment_method` = 'no_cash_received'\nRETURN cast (sum(CASE  WHEN donations.`payment_included_campaign_gift_card` = 't' THEN 1 ELSE 0 END) as float) * 100 / COUNT(donations.`donationid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of projects that have not received a cash donation have received a portion of a donation included corporate sponsored giftcard?",
    "evidence": "have not received a cash donation refers to payment_method = 'no_cash_received'; received a portion of a donation included corporate sponsored giftcard payment_included_campaign_gift_card = 't'; percentage refers to DIVIDE(payment_included_campaign_gift_card = 't',payment_included_campaign_gift_card)*100",
    "idx": 1651
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (projects@`projects`)\nWHERE projects.`school_city` = 'Santa Barbara'\nRETURN cast (sum(CASE  WHEN projects.`school_metro` = 'suburban' THEN 1 ELSE 0 END) as float) * 100 / COUNT(projects.`projectid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of projects in the City of Santa Barbara are in suburban metro?",
    "evidence": "City of Santa Barbara refers to school_city = 'Santa Barbara'; percentage refers to DIVIDE(school_metro = 'suburban'; school_metro)*100",
    "idx": 1652
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (donations@`donations`)\nWHERE like(cast (donations.`donation_timestamp` as string),'2013-03%')\nRETURN donations.`payment_method` AS `payment_method`, cast (COUNT(donations.`donationid`) as float) * 100 / 51090 AS `_col_1` \nGROUP BY payment_method",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of payment methods of donations made in March 2013?",
    "evidence": "made in March 2013 refers to substr(donation_timestamp,1,7) = '2013-03'; percentage refers to DIVIDE(SUM(payment_method made in March 2013), SUM(payment_method))*100",
    "idx": 1653
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (resources@`resources`)\nWHERE resources.`vendor_name` = 'AKJ Books'\nRETURN sum(resources.`item_unit_price`) / sum(resources.`item_quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average unit price of AKJ Books items?",
    "evidence": "AKJ Books items refers to vendor_name = 'AKJ Books'; average unit price refers to DIVIDE(sum(item_unit_price),count(resourceid))",
    "idx": 1654
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nMATCH (t3@`donations`)-[donated_to_0:`donated_to`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND t2.`projectid` = t3.`projectid`\nAND (t2.`school_city` = 'Brooklyn' AND t2.`school_metro` = 'urban' AND t3.`for_honoree` = 't' AND t1.`item_name` = 'TT992 - Refill Pack for Safety Name Tags')\nRETURN COUNT(t2.`schoolid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many schools in Brooklyn with urban metro and donations for an honoree have requested TT992 - Refill Pack for Safety Name Tags as a resource?",
    "evidence": "in Brooklyn refers to school_city = 'Brooklyn'; urban metro refers to school_metro = 'urban'; donations for an honoree refers to for_honoree = 't'; requested TT992 - Refill Pack for Safety Name Tags refers to item_name = 'TT992 - Refill Pack for Safety Name Tags'",
    "idx": 1655
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`school_latitude` = 42003718 AND t2.`school_longitude` = -87668289)\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the project title of the school located at latitude 42003718 and longitude -87668289?",
    "evidence": "latitude 42003718 refers to school_latitude = 42003718; longitude -87668289 refers to school_longitude = -87668289",
    "idx": 1657
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`grade_level` = 'Grades 9-12')\nRETURN DISTINCT t1.`vendor_name` AS `vendor_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the vendors serving material for projects for grades 9-12?",
    "evidence": "for grades 9-12 refers to grade_level = 'Grades 9-12'",
    "idx": 1659
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`donations`)-[donated_to_0:`donated_to`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`is_teacher_acct` = 't' AND t2.`school_city` = 'Chicago')\nRETURN COUNT(DISTINCT t2.`teacher_acctid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many teachers have made some type of donation for projects in Chicago?",
    "evidence": "in Chicago refers to school_city = 'Chicago'; teachers refers to is_teacher_acct = 't'",
    "idx": 1660
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`school_city` = 'Rock Hill' AND t2.`is_teacher_acct` = 't')\nRETURN COUNT(DISTINCT t1.`teacher_acctid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Rock Hill City School projects have teacher donors?",
    "evidence": "Rock Hill City School refers to school_city = 'Rock Hill'; teacher donors refers to is_teacher_acct = 't'",
    "idx": 1661
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`school_metro` = 'urban' AND t2.`school_district` = 'Onslow Co School District')\nRETURN sum(t1.`item_quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many total items were requested for the Onslow Co School District urban metro school projects?",
    "evidence": "Onslow Co School District refers to school_district = 'Onslow Co School District';",
    "idx": 1662
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)-[donated_to_0:`donated_to`]->(t1@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t1.`school_county` = 'Fresno')\nRETURN sum(t2.`donation_optional_support` + t2.`donation_to_project`) / COUNT(t2.`donationid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average total donations received by Fresno County colleges?",
    "evidence": "Fresno County colleges refers to school_county = 'Fresno'; average refers to DIVIDE(sum(donation_optional_support,donation_to_project),sum(donation_total))",
    "idx": 1663
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`projects`)\nMATCH (t2@`essays`)\nWHERE t1.`projectid` = t2.`projectid`\nRETURN cast (sum(CASE  WHEN like(t2.`title`,'ABC Read') THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`school_county`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In what percentage of counties has the ABC Read project been launched?",
    "evidence": "ABC Read project been launched refers to title = 'ABC Read'; percentage refers to DIVIDE(count(case when title = 'ABC Read' then school_county else null end),count(school_county))*100",
    "idx": 1664
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t2@`donations`)\nMATCH (t1@`resources`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`for_honoree` = 't')\nRETURN avg(t1.`item_quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average amount of resources from projects that have received donations per honoree?",
    "evidence": "donations per honoree refers to for_honoree = 't'; average refers to DIVIDE(sum(item_quantity), count(donationid))",
    "idx": 1665
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND (t2.`primary_focus_subject` = 'Mathematics')\nORDER BY t1.`item_unit_price` DESC NULLS LAST \nRETURN t1.`item_name` AS `item_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which item provided for projects with Mathematics as a primary subject is the most expensive?",
    "evidence": "Mathematics as a primary subject refers to primary_focus_subject = 'Mathematics'; most expensive refers to max(item_unit_price)",
    "idx": 1667
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (t1@`essays`)\nMATCH (t3@`resources`)-[requested_for_0:`requested_for`]->(t2@`projects`)\nWHERE t1.`projectid` = t2.`projectid`\nAND t2.`projectid` = t3.`projectid`\nAND (t1.`title` = 'Bloody Times')\nRETURN t3.`vendor_name` AS `vendor_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the vendor that the project \"Bloody Times\" uses for their resources?",
    "evidence": "project \"Bloody Times\" refers to title = 'Bloody Times'",
    "idx": 1671
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`region_sales`)\nWHERE t.`region_id` = 1\nRETURN (sum(CASE  WHEN t.`game_platform_id` = 50 THEN t.`num_sales` ELSE 0 END) - sum(CASE  WHEN t.`game_platform_id` = 51 THEN t.`num_sales` ELSE 0 END)) * 100000 AS `nums`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many more games were sold on game platform ID 50 than on game platform ID 51 in region ID 1?",
    "evidence": "result = subtract(sum(num_sales where game_platform_id = 50), sum(num_sales where game_platform_id = 51))",
    "idx": 1678
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t2.`genre_name` = 'Action')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many action games are there in total?",
    "evidence": "action game refers to genre_name = 'Action'",
    "idx": 1680
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t1.`game_name` = '3D Lemmings')\nRETURN t2.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre of 3D Lemmings?",
    "evidence": "genre refers to genre_name; 3D Lemmings refers to game_name = '3D Lemmings'",
    "idx": 1681
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[t2:`published_by`]->(t3@`publisher`)\nWHERE t1.`id` = t2.`game_id`\nAND t2.`publisher_id` = t3.`id`\nAND (t1.`game_name` = '3D Lemmings')\nRETURN t3.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the publisher of 3D Lemmings?",
    "evidence": "publisher refers to publisher_name; 3D Lemmings refers to game_name = '3D Lemmings'",
    "idx": 1682
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[t2:`published_by`]->(t3@`publisher`)\nMATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t4@`genre`)\nWHERE t1.`id` = t2.`game_id`\nAND t2.`publisher_id` = t3.`id`\nAND t1.`genre_id` = t4.`id`\nAND (t4.`genre_name` = 'Puzzle' AND t3.`publisher_name` = '10TACLE Studios')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the games published by 10TACLE Studios, how many of them are puzzles?",
    "evidence": "published by 10TACLE Studios refers to publisher_name = '10TACLE Studios'; puzzle refers to genre_name = 'Puzzle'",
    "idx": 1684
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[t2:`published_by`]->(t3@`publisher`)\nMATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t4@`genre`)\nWHERE t1.`id` = t2.`game_id`\nAND t2.`publisher_id` = t3.`id`\nAND t1.`genre_id` = t4.`id`\nAND (t3.`publisher_name` = 'Nintendo')\nRETURN cast (COUNT(CASE  WHEN t4.`genre_name` = 'Sports' THEN t1.`id` ELSE NULL END) as float) * 100 / COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the games published by Nintendo, what is the percentage of those in the genre of sports?",
    "evidence": "published by Nintendo refers to publisher_name = 'Nintendo'; in the genre of sports refers to genre_name = 'Sports'; percentage = divide(count(game_id where genre_name = 'Sports'), count(game_id)) * 100% where publisher_name = 'Nintendo'",
    "idx": 1687
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game_platform`)-[has_sales_0:`has_sales`]->(t1@`region_sales`)\nMATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t3@`platform`)\nWHERE t1.`game_platform_id` = t2.`id`\nAND t2.`platform_id` = t3.`id`\nAND (t3.`platform_name` = 'DS')\nRETURN sum(t1.`num_sales`) * 100000 / 4 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games were sold on the DS platform on average in the 4 different regions?",
    "evidence": "on the DS platform refers to platform_name = 'DS'; number of games sold on average = divide(sum(multiply(num_sales, 100000)), 4) where platform_name = 'DS'",
    "idx": 1688
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)-[available_on_0:`available_on`]->(t2@`platform`)\nMATCH ()-[t3:`publishes`]->(t4@`game`)\nWHERE t1.`platform_id` = t2.`id`\nAND t1.`game_publisher_id` = t3.`id`\nAND t3.`game_id` = t4.`id`\nAND (t4.`game_name` = 'Pro Evolution Soccer 2016')\nRETURN COUNT(t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many platforms are available for the game Pro Evolution Soccer 2016?",
    "evidence": "game Pro Evolution Soccer 2016 refers to game_name = 'Pro Evolution Soccer 2016'",
    "idx": 1695
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t2.`genre_name` = 'Sports')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games in the database belong to the genre of sports?",
    "evidence": "the genre of sports refers to genre_name = 'Sports'",
    "idx": 1696
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game`)-[belongs_to_0:`belongs_to`]->(t1@`genre`)\nWHERE t1.`id` = t2.`genre_id`\nRETURN COUNT(CASE  WHEN t1.`genre_name` = 'Sports' THEN t2.`id` ELSE NULL END) - COUNT(CASE  WHEN t1.`genre_name` = 'Simulation' THEN t2.`id` ELSE NULL END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many more sports games than simulation games?",
    "evidence": "sports game refers to genre_name = 'Sports'; simulation game refers to genre_name = 'Simulation'; how many more = subtract(sum(game_id where genre_name = 'Sports'), sum(game_id where genre_name = 'Simulation'))",
    "idx": 1698
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`region_sales`)-[sold_in_0:`sold_in`]->(t1@`region`)\nWHERE t1.`id` = t2.`region_id`\nAND (t1.`region_name` = 'Europe' AND t2.`game_platform_id` = 3871)\nRETURN t2.`num_sales` * 100000 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales does game platform id 3871 make in Europe?",
    "evidence": "number of sales = multiply(num_sales, 100000); in Europe refers to region_name = 'Europe'",
    "idx": 1700
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[t2:`published_by`]->(t3@`publisher`)\nMATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t4@`genre`)\nWHERE t1.`id` = t2.`game_id`\nAND t2.`publisher_id` = t3.`id`\nAND t1.`genre_id` = t4.`id`\nAND (t3.`publisher_name` = 'Namco Bandai Games')\nRETURN cast (COUNT(CASE  WHEN t4.`genre_name` = 'Adventure' THEN t1.`id` ELSE NULL END) as float) * 100 / COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For all the games which were published by Namco Bandai Games, what percentage of them were adventure games?",
    "evidence": "published by Namco Bandai Games refers to publisher_name = 'Namco Bandai Games'; adventure game refers to genre_name = 'Adventure'; percentage = divide(sum(game_id where genre_name = 'Adventure'), count(game_id)) * 100% where publisher_name = 'Namco Bandai Games'",
    "idx": 1703
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->()\nWHERE t1.`id` = t2.`publisher_id`\nRETURN cast (COUNT(CASE  WHEN t1.`publisher_name` = 'Atari' THEN t2.`game_id` ELSE NULL END) as float) / COUNT(CASE  WHEN t1.`publisher_name` = 'Athena' THEN t2.`game_id` ELSE NULL END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times more is the number of games which were published by Atari than Athena?",
    "evidence": "published by Atari refers to publisher_name = 'Atari'; published by  Athena refers to publisher_name = 'Athena'; times = divide(sum(publisher_id where publisher_name = 'Atari'), sum(publisher_id where publisher_name = 'Athena'))",
    "idx": 1704
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->()\nWHERE t1.`id` = t2.`publisher_id`\nAND (t1.`publisher_name` = 'Electronic Arts')\nRETURN COUNT(DISTINCT t2.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games did Electronic Arts publish?",
    "evidence": "Electronic Arts refers to publisher_name = 'Electronic Arts'",
    "idx": 1705
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t1.`game_name` = 'Advent Rising')\nRETURN t2.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre of the Advent Rising game?",
    "evidence": "genre refers to genre_name; Advent Rising game refers to game_name = 'Advent Rising'",
    "idx": 1706
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->(t3@`game`)-[belongs_to_0:`belongs_to`]->(t4@`genre`)\nWHERE t1.`id` = t2.`publisher_id`\nAND t2.`game_id` = t3.`id`\nAND t3.`genre_id` = t4.`id`\nAND (t4.`genre_name` = 'Role-Playing' AND t1.`publisher_name` = 'Microsoft Game Studios')\nRETURN COUNT(t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many role-playing games did Microsoft Game Studios publish?",
    "evidence": "role-playing game refers to genre_name = 'Role-Playing'; Microsoft Game Studios refers to publisher_name = 'Microsoft Game Studios'",
    "idx": 1707
  }
]