[
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH ()-[advisor:advises]->()\nRETURN COUNT(DISTINCT `advisor`.`s_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students have advisors?",
    "evidence": "",
    "idx": 2448
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nRETURN COUNT(DISTINCT `course`.`dept_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many departments offer courses?",
    "evidence": "",
    "idx": 2450
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nRETURN COUNT(DISTINCT `course`.`dept_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of departments which offer courses.",
    "evidence": "",
    "idx": 2451
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nWHERE `course`.`dept_name` = 'Physics'\nRETURN COUNT(DISTINCT `course`.`course_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many different courses offered by Physics department?",
    "evidence": "",
    "idx": 2452
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nWHERE `course`.`dept_name` = 'Physics'\nRETURN COUNT(DISTINCT `course`.`course_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of courses in the Physics department.",
    "evidence": "",
    "idx": 2453
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[prereq_sub0:has_prerequisite]->()\nRETURN `prereq_sub0`.`course_id` AS `course_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE NOT `course`.`course_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many courses that do not have prerequisite?",
    "evidence": "",
    "idx": 2454
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[prereq_sub0:has_prerequisite]->()\nRETURN `prereq_sub0`.`course_id` AS `course_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE NOT `course`.`course_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of courses without prerequisites.",
    "evidence": "",
    "idx": 2455
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[prereq_sub0:has_prerequisite]->()\nRETURN `prereq_sub0`.`course_id` AS `course_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE NOT `course`.`course_id` IN in_collect_0\nRETURN `course`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the courses that do not have any prerequisite?",
    "evidence": "",
    "idx": 2456
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[prereq_sub0:has_prerequisite]->()\nRETURN `prereq_sub0`.`course_id` AS `course_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE NOT `course`.`course_id` IN in_collect_0\nRETURN `course`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of courses without prerequisites?",
    "evidence": "",
    "idx": 2457
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH ()-[teaches:teaches]->()\nRETURN COUNT(DISTINCT `teaches`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many different instructors have taught some course?",
    "evidence": "",
    "idx": 2458
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`department`:`department`)\nWHERE `department`.`dept_name` = 'Marketing' OR `department`.`dept_name` = 'Finance'\nRETURN sum(`department`.`budget`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total budgets of the Marketing or Finance department.",
    "evidence": "",
    "idx": 2460
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`department`:`department`)\nWHERE `department`.`dept_name` = 'Marketing' OR `department`.`dept_name` = 'Finance'\nRETURN sum(`department`.`budget`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the sum of budgets of the Marketing and Finance departments?",
    "evidence": "",
    "idx": 2461
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWHERE `instructor`.`name` =~ '(?i)(?s).*Soisalon.*'\nRETURN `instructor`.`dept_name` AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the department name of the instructor whose name contains 'Soisalon'.",
    "evidence": "",
    "idx": 2462
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWHERE `instructor`.`name` =~ '(?i)(?s).*Soisalon.*'\nRETURN `instructor`.`dept_name` AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the department with an instructure who has a name like 'Soisalon'?",
    "evidence": "",
    "idx": 2463
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`building` = 'Lamberton' AND `classroom`.`capacity` < 50\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many rooms whose capacity is less than 50 does the Lamberton building have?",
    "evidence": "",
    "idx": 2464
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`building` = 'Lamberton' AND `classroom`.`capacity` < 50\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of rooms in Lamberton with capacity lower than 50.",
    "evidence": "",
    "idx": 2465
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`department_sub0`:`department`)\nRETURN avg(`department_sub0`.`budget`) AS `_col_0`  \n}\nMATCH (`department`:`department`)\nWHERE `department`.`budget` > `_col_0`\nRETURN `department`.`dept_name` AS `dept_name`, `department`.`budget` AS `budget`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and budget of departments whose budgets are more than the average budget.",
    "evidence": "",
    "idx": 2466
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`department_sub0`:`department`)\nRETURN avg(`department_sub0`.`budget`) AS `_col_0`  \n}\nMATCH (`department`:`department`)\nWHERE `department`.`budget` > `_col_0`\nRETURN `department`.`dept_name` AS `dept_name`, `department`.`budget` AS `budget`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and budgets of departments with budgets greater than the average?",
    "evidence": "",
    "idx": 2467
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWHERE `instructor`.`dept_name` = 'Statistics'\nORDER BY `instructor`.`salary` IS NULL DESC, `instructor`.`salary`  \nRETURN `instructor`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the name of the instructor who is in Statistics department and earns the lowest salary?",
    "evidence": "",
    "idx": 2468
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->()\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`year` = 2009 OR `t2`.`year` = 2010)\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of students who took any class in the years of 2009 and 2010.",
    "evidence": "",
    "idx": 2470
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->()\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`year` = 2009 OR `t2`.`year` = 2010)\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the students who took classes in 2009 or 2010?",
    "evidence": "",
    "idx": 2471
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nORDER BY `course`.`credits` IS NULL DESC, `course`.`credits`  \nRETURN `course`.`title` AS `title` ORDER BY `title` IS NULL DESC, `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all courses ordered by their titles and credits.",
    "evidence": "",
    "idx": 2472
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nORDER BY `course`.`credits` IS NULL DESC, `course`.`credits`  \nRETURN `course`.`title` AS `title` ORDER BY `title` IS NULL DESC, `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Given the titles of all courses, in order of titles and credits.",
    "evidence": "",
    "idx": 2473
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`department`:`department`)\nORDER BY `department`.`budget` IS NULL DESC, `department`.`budget`  \nRETURN `department`.`dept_name` AS `dept_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which department has the lowest budget?",
    "evidence": "",
    "idx": 2474
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`department`:`department`)\nORDER BY `department`.`budget` IS NULL DESC, `department`.`budget`  \nRETURN `department`.`dept_name` AS `dept_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the name of the department with the lowest budget.",
    "evidence": "",
    "idx": 2475
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`department`:`department`)\nORDER BY `department`.`budget` IS NULL ASC, `department`.`budget` DESC \nRETURN `department`.`dept_name` AS `dept_name`, `department`.`building` AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names and buildings of all departments sorted by the budget from large to small.",
    "evidence": "",
    "idx": 2476
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`department`:`department`)\nORDER BY `department`.`budget` IS NULL ASC, `department`.`budget` DESC \nRETURN `department`.`dept_name` AS `dept_name`, `department`.`building` AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and buildings of the deparments, sorted by budget descending?",
    "evidence": "",
    "idx": 2477
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nORDER BY `instructor`.`salary` IS NULL ASC, `instructor`.`salary` DESC \nRETURN `instructor`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the instructor with the highest salary?",
    "evidence": "",
    "idx": 2478
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nORDER BY `instructor`.`salary` IS NULL ASC, `instructor`.`salary` DESC \nRETURN `instructor`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the name of the highest paid instructor.",
    "evidence": "",
    "idx": 2479
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nRETURN `instructor`.`id` AS `id`, `instructor`.`name` AS `name`, `instructor`.`dept_name` AS `dept_name`, `instructor`.`salary` AS `salary` ORDER BY `instructor`.`salary` IS NULL DESC, `instructor`.`salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the information of all instructors ordered by their salary in ascending order.",
    "evidence": "",
    "idx": 2480
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`student`:`student`)\nORDER BY `student`.`tot_cred` IS NULL DESC, `student`.`tot_cred`  \nRETURN `student`.`name` AS `name`, `student`.`dept_name` AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the students and their department names sorted by their total credits in ascending order.",
    "evidence": "",
    "idx": 2482
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`student`:`student`)\nORDER BY `student`.`tot_cred` IS NULL DESC, `student`.`tot_cred`  \nRETURN `student`.`name` AS `name`, `student`.`dept_name` AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of students and their respective departments, ordered by number of credits from least to greatest?",
    "evidence": "",
    "idx": 2483
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`course`)\nMATCH (`t3`:`instructor`)-[t2:teaches]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND `t2`.`id` = `t3`.`id`\nAND (`t2`.`year` = 2008)\nRETURN `t1`.`title` AS `title`, `t3`.`name` AS `name` ORDER BY `t1`.`title` IS NULL DESC, `t1`.`title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list in alphabetic order all course names and their instructors' names in year 2008.",
    "evidence": "",
    "idx": 2484
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`capacity` > 50\nWITH `classroom`.`building` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of rooms with more than 50 capacity for each building.",
    "evidence": "",
    "idx": 2486
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`capacity` > 50\nWITH `classroom`.`building` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many rooms in each building have a capacity of over 50?",
    "evidence": "",
    "idx": 2487
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWITH `classroom`.`building` AS _groupby_col_0, MAX(`classroom`.`capacity`) AS _groupby_col_1, avg(`classroom`.`capacity`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the maximum and average capacity among rooms in each building.",
    "evidence": "",
    "idx": 2488
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWITH `classroom`.`building` AS _groupby_col_0, MAX(`classroom`.`capacity`) AS _groupby_col_1, avg(`classroom`.`capacity`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the greatest and average capacity for rooms in each building?",
    "evidence": "",
    "idx": 2489
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nWITH `course`.`title` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the title of the course that is offered by more than one department.",
    "evidence": "",
    "idx": 2490
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nWITH `course`.`title` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of courses that are offered in more than one department?",
    "evidence": "",
    "idx": 2491
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nWITH `course`.`dept_name` AS _groupby_col_0, sum(`course`.`credits`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total credits of courses provided by different department.",
    "evidence": "",
    "idx": 2492
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`course`:`course`)\nWITH `course`.`dept_name` AS _groupby_col_0, sum(`course`.`credits`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many total credits are offered by each department?",
    "evidence": "",
    "idx": 2493
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`instructor_sub0`:`instructor`)\nRETURN avg(`instructor_sub0`.`salary`) AS `_col_0_1`  \n}\nMATCH (`instructor`:`instructor`)\nWITH `instructor`.`dept_name` AS _groupby_col_0, avg(`instructor`.`salary`) AS _groupby_col_1, min(`instructor`.`salary`) AS _groupby_col_3\n,_col_0_1 AS _groupby_col_2\nWHERE _groupby_col_1 > `_col_0_1`\nRETURN _groupby_col_3 AS `_col_0`, _groupby_col_0 AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the minimum salary for the departments whose average salary is above the average payment of all instructors.",
    "evidence": "",
    "idx": 2494
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`section`:`section`)\nWITH `section`.`semester` AS _groupby_col_0, `section`.`year` AS _groupby_col_1, COUNT(*) AS _groupby_col_2\nRETURN _groupby_col_2 AS `_col_0`, _groupby_col_0 AS `semester`, _groupby_col_1 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of courses provided in each semester and year.",
    "evidence": "",
    "idx": 2496
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`section`:`section`)\nWITH `section`.`semester` AS _groupby_col_0, `section`.`year` AS _groupby_col_1, COUNT(*) AS _groupby_col_2\nRETURN _groupby_col_2 AS `_col_0`, _groupby_col_0 AS `semester`, _groupby_col_1 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many courses are provided in each semester and year?",
    "evidence": "",
    "idx": 2497
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`dept_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of students in each department.",
    "evidence": "",
    "idx": 2498
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH ()-[t1:advises]->(`t2`:`student`)\nWHERE `t1`.`s_id` = `t2`.`id`\nAND (`t2`.`dept_name` = 'History')\nRETURN `t1`.`i_id` AS `i_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id of the instructor who advises of all students from History department?",
    "evidence": "",
    "idx": 2500
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`instructor`)-[t1:advises]->(`t3`:`student`)\nWHERE `t1`.`i_id` = `t2`.`id`\nAND `t1`.`s_id` = `t3`.`id`\nAND (`t3`.`dept_name` = 'History')\nRETURN `t2`.`name` AS `name`, `t2`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and salary of the instructors who are advisors of any student from History department?",
    "evidence": "",
    "idx": 2502
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`instructor`)-[t1:advises]->(`t3`:`student`)\nWHERE `t1`.`i_id` = `t2`.`id`\nAND `t1`.`s_id` = `t3`.`id`\nAND (`t3`.`dept_name` = 'History')\nRETURN `t2`.`name` AS `name`, `t2`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and salaries of instructors who advises students in the History department?",
    "evidence": "",
    "idx": 2503
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[prereq_sub0:has_prerequisite]->()\nRETURN `prereq_sub0`.`course_id` AS `course_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE NOT `course`.`course_id` IN in_collect_0\nRETURN `course`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of courses without prerequisites?",
    "evidence": "",
    "idx": 2505
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1_sub0:has_prerequisite]->(`t2_sub0`:`course`)\nWHERE `t1_sub0`.`course_id` = `t2_sub0`.`course_id`\nAND (`t2_sub0`.`title` = 'International Finance')\nRETURN `t1_sub0`.`prereq_id` AS `prereq_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE `course`.`course_id` IN in_collect_0\nRETURN `course`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the title of the prerequisite class of International Finance course?",
    "evidence": "",
    "idx": 2506
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1_sub0:has_prerequisite]->(`t2_sub0`:`course`)\nWHERE `t1_sub0`.`course_id` = `t2_sub0`.`course_id`\nAND (`t2_sub0`.`title` = 'International Finance')\nRETURN `t1_sub0`.`prereq_id` AS `prereq_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE `course`.`course_id` IN in_collect_0\nRETURN `course`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the title of the prerequisite to the course International Finance.",
    "evidence": "",
    "idx": 2507
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1_sub0:has_prerequisite]->(`t2_sub0`:`course`)\nWHERE `t1_sub0`.`prereq_id` = `t2_sub0`.`course_id`\nAND (`t2_sub0`.`title` = 'Differential Geometry')\nRETURN `t1_sub0`.`course_id` AS `course_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE `course`.`course_id` IN in_collect_0\nRETURN `course`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the title of course whose prerequisite is course Differential Geometry.",
    "evidence": "",
    "idx": 2508
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1_sub0:has_prerequisite]->(`t2_sub0`:`course`)\nWHERE `t1_sub0`.`prereq_id` = `t2_sub0`.`course_id`\nAND (`t2_sub0`.`title` = 'Differential Geometry')\nRETURN `t1_sub0`.`course_id` AS `course_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE `course`.`course_id` IN in_collect_0\nRETURN `course`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the title of the course with Differential Geometry as a prerequisite?",
    "evidence": "",
    "idx": 2509
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[takes_sub0:takes]->()\nWHERE `takes_sub0`.`semester` = 'Fall' AND `takes_sub0`.`year` = 2003\nRETURN `takes_sub0`.`id` AS `id`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE `student`.`id` IN in_collect_0\nRETURN `student`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of students who have taken any course in the fall semester of year 2003.",
    "evidence": "",
    "idx": 2510
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[takes_sub0:takes]->()\nWHERE `takes_sub0`.`semester` = 'Fall' AND `takes_sub0`.`year` = 2003\nRETURN `takes_sub0`.`id` AS `id`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE `student`.`id` IN in_collect_0\nRETURN `student`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of students who took a course in the Fall of 2003?",
    "evidence": "",
    "idx": 2511
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`section`)-[part_of_0:part_of]->(`t1`:`course`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t2`.`building` = 'Chandler' AND `t2`.`semester` = 'Fall' AND `t2`.`year` = 2010)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the title of the course that was offered at building Chandler during the fall semester in the year of 2010?",
    "evidence": "",
    "idx": 2512
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t3`:`course`)\nMATCH (`t1`:`instructor`)-[t2:teaches]->()\nWHERE `t1`.`id` = `t2`.`id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`title` = 'C Programming')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the instructors who taught C Programming course before.",
    "evidence": "",
    "idx": 2514
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t3`:`course`)\nMATCH (`t1`:`instructor`)-[t2:teaches]->()\nWHERE `t1`.`id` = `t2`.`id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`title` = 'C Programming')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of instructors who have taught C Programming courses?",
    "evidence": "",
    "idx": 2515
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`instructor`)-[t1:advises]->(`t3`:`student`)\nWHERE `t1`.`i_id` = `t2`.`id`\nAND `t1`.`s_id` = `t3`.`id`\nAND (`t3`.`dept_name` = 'Math')\nRETURN `t2`.`name` AS `name`, `t2`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and salary of instructors who are advisors of the students from the Math department.",
    "evidence": "",
    "idx": 2516
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`instructor`)-[t1:advises]->(`t3`:`student`)\nWHERE `t1`.`i_id` = `t2`.`id`\nAND `t1`.`s_id` = `t3`.`id`\nAND (`t3`.`dept_name` = 'Math')\nRETURN `t2`.`name` AS `name`, `t2`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and salaries of instructors who advise students in the Math department?",
    "evidence": "",
    "idx": 2517
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`instructor`)-[t1:advises]->(`t3`:`student`)\nWHERE `t1`.`i_id` = `t2`.`id`\nAND `t1`.`s_id` = `t3`.`id`\nAND (`t3`.`dept_name` = 'Math')\nORDER BY `t3`.`tot_cred` IS NULL DESC, `t3`.`tot_cred`  \nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of instructors who are advisors of the students from the Math department, and sort the results by students' total credit.",
    "evidence": "",
    "idx": 2518
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1_sub0:has_prerequisite]->(`t2_sub0`:`course`)\nWHERE `t1_sub0`.`course_id` = `t2_sub0`.`course_id`\nAND (`t2_sub0`.`title` = 'Mobile Computing')\nRETURN `t1_sub0`.`prereq_id` AS `prereq_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE `course`.`course_id` IN in_collect_0\nRETURN `course`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the course title of the prerequisite of course Mobile Computing?",
    "evidence": "",
    "idx": 2520
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1_sub0:has_prerequisite]->(`t2_sub0`:`course`)\nWHERE `t1_sub0`.`course_id` = `t2_sub0`.`course_id`\nAND (`t2_sub0`.`title` = 'Mobile Computing')\nRETURN `t1_sub0`.`prereq_id` AS `prereq_id`   } AS in_collect_0\nMATCH (`course`:`course`)\nWHERE `course`.`course_id` IN in_collect_0\nRETURN `course`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the title of the course that is a prerequisite for Mobile Computing?",
    "evidence": "",
    "idx": 2521
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`instructor`)-[t1:advises]->(`t3`:`student`)\nWHERE `t1`.`i_id` = `t2`.`id`\nAND `t1`.`s_id` = `t3`.`id`\nORDER BY `t3`.`tot_cred` IS NULL ASC, `t3`.`tot_cred` DESC \nRETURN `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of instructor who is the advisor of the student who has the highest number of total credits.",
    "evidence": "",
    "idx": 2522
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`instructor`)-[t1:advises]->(`t3`:`student`)\nWHERE `t1`.`i_id` = `t2`.`id`\nAND `t1`.`s_id` = `t3`.`id`\nORDER BY `t3`.`tot_cred` IS NULL ASC, `t3`.`tot_cred` DESC \nRETURN `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the instructor who advises the student with the greatest number of total credits?",
    "evidence": "",
    "idx": 2523
  }
]