[
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[has_file_0:has_file]->(`t1`:`files`)\nWHERE `t1`.`f_id` = `t2`.`f_id`\nWITH `t2`.`languages` AS _groupby_col_0, MAX(`t1`.`duration`) AS _groupby_col_1, MAX(`t2`.`resolution`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `languages` ORDER BY `languages` IS NULL DESC, `languages`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum duration and resolution of all songs, for each language, ordered alphabetically by language?",
    "evidence": "",
    "idx": 4246
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[has_file_0:has_file]->(`t1`:`files`)\nWHERE `t1`.`f_id` = `t2`.`f_id`\nWITH `t2`.`genre_is` AS _groupby_col_0, min(`t1`.`duration`) AS _groupby_col_1, min(`t2`.`rating`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `genre_is` ORDER BY `genre_is` IS NULL DESC, `genre_is`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the shortest duration and lowest rating of songs grouped by genre and ordered by genre?",
    "evidence": "",
    "idx": 4247
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`t2`:`song`)-[has_file_0:has_file]->(`t1`:`files`)\nWHERE `t1`.`f_id` = `t2`.`f_id`\nWITH `t2`.`genre_is` AS _groupby_col_0, min(`t1`.`duration`) AS _groupby_col_1, min(`t2`.`rating`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `genre_is` ORDER BY `genre_is` IS NULL DESC, `genre_is`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the shortest and most poorly rated song for each genre, ordered alphabetically by genre?",
    "evidence": "",
    "idx": 4248
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "CALL(*) {\nMATCH (`song_sub0`:`song`)\nWHERE `song_sub0`.`rating` < 8\nRETURN MAX(`song_sub0`.`resolution`) AS `_col_0`  \n}\nMATCH (`song`:`song`)\nWHERE `song`.`resolution` > `_col_0`\nRETURN `song`.`f_id` AS `f_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is ids of the songs whose resolution is higher than the resolution of any songs with rating lower than 8?",
    "evidence": "",
    "idx": 4251
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "CALL(*) {\nMATCH (`song_sub0`:`song`)\nWHERE `song_sub0`.`rating` < 8\nRETURN MAX(`song_sub0`.`resolution`) AS `_col_0`  \n}\nMATCH (`song`:`song`)\nWHERE `song`.`resolution` > `_col_0`\nRETURN `song`.`f_id` AS `f_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id of every song that has a resolution higher than that of a song with a rating below 8?",
    "evidence": "",
    "idx": 4252
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "CALL(*) {\nMATCH (`song`:`song`)\nWHERE `song`.`genre_is` = 'modern'\nRETURN avg(`song`.`resolution`) AS `_col_0`  \n}\nMATCH (`song`:`song`)\nWHERE `song`.`resolution` > `_col_0`\nRETURN `song`.`f_id` AS `f_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is ids of the songs whose resolution is higher than the average resolution of songs in modern genre?",
    "evidence": "",
    "idx": 4253
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "CALL(*) {\nMATCH (`song`:`song`)\nWHERE `song`.`genre_is` = 'modern'\nRETURN avg(`song`.`resolution`) AS `_col_0`  \n}\nMATCH (`song`:`song`)\nWHERE `song`.`resolution` > `_col_0`\nRETURN `song`.`f_id` AS `f_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of all songs that have higher resolution of the average resolution in the modern genre?",
    "evidence": "",
    "idx": 4254
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_1",
    "gql_statement": "MATCH (`song`:`song`)\nWHERE `song`.`languages` = 'english'\nORDER BY `song`.`rating` IS NULL DESC, `song`.`rating`  \nRETURN `song`.`f_id` AS `f_id`, `song`.`genre_is` AS `genre_is`, `song`.`artist_name` AS `artist_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the id, genre and artist name of English songs ordered by rating.",
    "evidence": "",
    "idx": 4255
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`salary`)\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings')\nRETURN avg(`t1`.`salary`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is average salary of the players in the team named 'Boston Red Stockings' ?",
    "evidence": "",
    "idx": 4259
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`salary`)\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings')\nRETURN avg(`t1`.`salary`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the average salary of the players in the team called 'Boston Red Stockings'.",
    "evidence": "",
    "idx": 4260
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`all_star`)-[player_0:player]->(`t1`:`player`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND (`t2`.`year` = 1998)\nRETURN `t1`.`name_first` AS `name_first`, `t1`.`name_last` AS `name_last`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are first and last names of players participating in all star game in 1998?",
    "evidence": "",
    "idx": 4261
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`hall_of_fame`:`hall_of_fame`)\nWITH `hall_of_fame`.`yearid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `yearid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many players enter hall of fame each year?",
    "evidence": "",
    "idx": 4263
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`hall_of_fame`:`hall_of_fame`)\nWITH `hall_of_fame`.`yearid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `yearid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of players who enter hall of fame for each year.",
    "evidence": "",
    "idx": 4264
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH ()-[home_game:played_home_at]->()\nWITH `home_game`.`year` AS _groupby_col_0, avg(`home_game`.`attendance`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `year`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average number of attendance at home games for each year?",
    "evidence": "",
    "idx": 4265
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`park`:`park`)\nWHERE `park`.`state` = 'NY'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many parks are there in the state of NY?",
    "evidence": "",
    "idx": 4267
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`park`:`park`)\nWHERE `park`.`state` = 'NY'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show me the number of parks the state of NY has.",
    "evidence": "",
    "idx": 4268
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`death_year` = ''\nRETURN `player`.`name_first` AS `name_first`, `player`.`name_last` AS `name_last`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the players' first name and last name who have empty death record.",
    "evidence": "",
    "idx": 4269
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`death_year` = ''\nRETURN `player`.`name_first` AS `name_first`, `player`.`name_last` AS `name_last`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first name and last name of the players whose death record is empty?",
    "evidence": "",
    "idx": 4270
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`birth_country` = 'USA' AND `player`.`bats` = 'R'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many players born in USA are right-handed batters? That is, have the batter value 'R'.",
    "evidence": "",
    "idx": 4271
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`birth_country` = 'USA' AND `player`.`bats` = 'R'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of players who were born in USA and have bats information 'R'.",
    "evidence": "",
    "idx": 4272
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:attended]->(`t3`:`college`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t3`.`college_id` = `t2`.`college_id`\nAND (`t3`.`name_full` = 'Yale University')\nRETURN avg(`t1`.`height`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average height of the players from the college named 'Yale University'?",
    "evidence": "",
    "idx": 4273
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`weight` > 220 OR `player`.`height` < 75\nRETURN `player`.`name_first` AS `name_first`, `player`.`name_last` AS `name_last`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List players' first name and last name who have weight greater than 220 or height shorter than 75.",
    "evidence": "",
    "idx": 4275
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`weight` > 220 OR `player`.`height` < 75\nRETURN `player`.`name_first` AS `name_first`, `player`.`name_last` AS `name_last`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first name and last name of the players who have weight above 220 or height below 75?",
    "evidence": "",
    "idx": 4276
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`postseason`)\nWHERE `t1`.`team_id_winner` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings')\nRETURN MAX(`t1`.`wins`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the maximum scores of the team Boston Red Stockings when the team won in postseason?",
    "evidence": "",
    "idx": 4277
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`postseason`)\nWHERE `t1`.`team_id_winner` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings')\nRETURN MAX(`t1`.`wins`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum scores the team Boston Red Stockings got when the team won in postseason?",
    "evidence": "",
    "idx": 4278
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`postseason`)\nWHERE `t1`.`team_id_loser` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings' AND `t1`.`year` = 2009)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many times did Boston Red Stockings lose in 2009 postseason?",
    "evidence": "",
    "idx": 4279
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`postseason`)\nWHERE `t1`.`team_id_loser` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings' AND `t1`.`year` = 2009)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of times the team \"Boston Red Stockings\" lost in 2009 postseason.",
    "evidence": "",
    "idx": 4280
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`postseason`)\nWHERE `t1`.`team_id_winner` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings')\nWITH `t1`.`year` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of wins the team Boston Red Stockings got in the postseasons each year in history?",
    "evidence": "",
    "idx": 4281
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`postseason`:`postseason`)\nWHERE `postseason`.`year` = 1885 AND `postseason`.`ties` = 1\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many games in 1885 postseason resulted in ties (that is, the value of \"ties\" is '1')?",
    "evidence": "",
    "idx": 4283
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`postseason`:`postseason`)\nWHERE `postseason`.`year` = 1885 AND `postseason`.`ties` = 1\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of tied games (the value of \"ties\" is '1') in 1885 postseason.",
    "evidence": "",
    "idx": 4284
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`salary`)\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings' AND `t1`.`year` = 2010)\nRETURN sum(`t1`.`salary`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total salary paid by team Boston Red Stockings in 2010?",
    "evidence": "",
    "idx": 4285
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`salary`)\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings' AND `t1`.`year` = 2010)\nRETURN sum(`t1`.`salary`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total salary expenses of team Boston Red Stockings in 2010?",
    "evidence": "",
    "idx": 4286
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`salary`)\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings' AND `t1`.`year` = 2000)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many players were in the team Boston Red Stockings in 2000?",
    "evidence": "",
    "idx": 4287
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH (`t1`:`salary`)\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings' AND `t1`.`year` = 2000)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many players did Boston Red Stockings have in 2000?",
    "evidence": "",
    "idx": 4288
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`salary`:`salary`)\nWHERE `salary`.`year` = 2001\nRETURN `salary`.`salary` AS `salary` ORDER BY `salary` IS NULL ASC, `salary` DESC \nLIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the 3 highest salaries of the players in 2001?",
    "evidence": "",
    "idx": 4289
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`salary`:`salary`)\nWHERE `salary`.`year` = 2001\nRETURN `salary`.`salary` AS `salary` ORDER BY `salary` IS NULL ASC, `salary` DESC \nLIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How much salary did the top 3 well-paid players get in 2001?",
    "evidence": "",
    "idx": 4290
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`salary`:`salary`)\nWHERE `salary`.`year` = 2010\nRETURN `salary`.`salary` AS `salary`   \nUNION DISTINCT\nMATCH (`salary`:`salary`)\nWHERE `salary`.`year` = 2001\nRETURN `salary`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What were all the salary values of players in 2010 and 2001?",
    "evidence": "",
    "idx": 4291
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`salary`:`salary`)\nWHERE `salary`.`year` = 2010\nRETURN `salary`.`salary` AS `salary`   \nUNION DISTINCT\nMATCH (`salary`:`salary`)\nWHERE `salary`.`year` = 2001\nRETURN `salary`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the salary values players received in 2010 and 2001.",
    "evidence": "",
    "idx": 4292
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`park`:`park`)\nWHERE `park`.`city` = 'Atlanta'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many parks are there in Atlanta city?",
    "evidence": "",
    "idx": 4293
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`park`:`park`)\nWHERE `park`.`city` = 'Atlanta'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many parks does Atlanta city have?",
    "evidence": "",
    "idx": 4294
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH ()-[t1:played_home_at]->(`t2`:`park`)\nWHERE `t1`.`park_id` = `t2`.`park_id`\nAND (`t1`.`year` = 2000 AND `t2`.`city` = 'Atlanta')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many games were played in city Atlanta in 2000?",
    "evidence": "",
    "idx": 4297
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH ()-[t1:played_home_at]->()\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings' AND `t1`.`year` >= 2000 AND `t1`.`year` <= 2010)\nRETURN sum(`t1`.`attendance`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total home game attendance of team Boston Red Stockings from 2000 to 2010?",
    "evidence": "",
    "idx": 4299
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH ()-[t1:played_home_at]->()\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings' AND `t1`.`year` >= 2000 AND `t1`.`year` <= 2010)\nRETURN sum(`t1`.`attendance`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many games in total did team Boston Red Stockings attend from 2000 to 2010?",
    "evidence": "",
    "idx": 4300
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t1`:`salary`)\nMATCH (`t2`:`player`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND (`t2`.`name_first` = 'Len' AND `t2`.`name_last` = 'Barker' AND `t1`.`year` >= 1985 AND `t1`.`year` <= 1990)\nRETURN sum(`t1`.`salary`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How much did the the player with first name Len and last name Barker earn between 1985 to 1990 in total?",
    "evidence": "",
    "idx": 4301
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH ()-[t1:played_home_at]->()\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t2`.`name` = 'Boston Red Stockings' AND `t1`.`year` >= 1990 AND `t1`.`year` <= 2000)\nRETURN sum(`t1`.`games`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many home games did the team Boston Red Stockings play from 1990 to 2000 in total?",
    "evidence": "",
    "idx": 4303
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`t2`:`team`)\nMATCH ()-[t1:played_home_at]->()\nWHERE `t1`.`team_id` = `t2`.`team_id_br`\nAND (`t1`.`year` = 1980)\nORDER BY `t1`.`attendance` IS NULL DESC, `t1`.`attendance`  \nRETURN `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which team had the least number of attendances in home games in 1980?",
    "evidence": "",
    "idx": 4305
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`park`:`park`)\nWITH `park`.`state` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `state`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of states that have more than 2 parks.",
    "evidence": "",
    "idx": 4307
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`park`:`park`)\nWITH `park`.`state` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `state`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which states have more than 2 parks?",
    "evidence": "",
    "idx": 4308
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`team_franchise`:`team_franchise`)\nWHERE `team_franchise`.`active` = 'Y'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many team franchises are active, with active value 'Y'?",
    "evidence": "",
    "idx": 4309
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`team_franchise`:`team_franchise`)\nWHERE `team_franchise`.`active` = 'Y'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of team franchises that are active (have 'Y' as \"active\" information).",
    "evidence": "",
    "idx": 4310
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`park`:`park`)\nWITH `park`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2 AND _groupby_col_1 <= 4\nRETURN _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which cities have 2 to 4 parks?",
    "evidence": "",
    "idx": 4311
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH (`park`:`park`)\nWITH `park`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2 AND _groupby_col_1 <= 4\nRETURN _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the cities that have 2 to 4 parks.",
    "evidence": "",
    "idx": 4312
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH ()-[t1:played_home_at]->(`t2`:`park`)\nWHERE `t1`.`park_id` = `t2`.`park_id`\nAND (`t1`.`year` = 2008)\nORDER BY `t1`.`attendance` IS NULL ASC, `t1`.`attendance` DESC \nRETURN `t2`.`park_name` AS `park_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which park had most attendances in 2008?",
    "evidence": "",
    "idx": 4313
  },
  {
    "filename": "train_spider.json",
    "db_id": "baseball_1",
    "gql_statement": "MATCH ()-[t1:played_home_at]->(`t2`:`park`)\nWHERE `t1`.`park_id` = `t2`.`park_id`\nAND (`t1`.`year` = 2008)\nORDER BY `t1`.`attendance` IS NULL ASC, `t1`.`attendance` DESC \nRETURN `t2`.`park_name` AS `park_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which park did the most people attend in 2008?",
    "evidence": "",
    "idx": 4314
  },
  {
    "filename": "train_spider.json",
    "db_id": "mountain_photos",
    "gql_statement": "MATCH (`camera_lens`:`camera_lens`)\nORDER BY `camera_lens`.`max_aperture` IS NULL ASC, `camera_lens`.`max_aperture` DESC \nRETURN `camera_lens`.`brand` AS `brand`, `camera_lens`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the brand and name for each camera lens, and sort in descending order of maximum aperture.",
    "evidence": "",
    "idx": 4316
  },
  {
    "filename": "train_spider.json",
    "db_id": "mountain_photos",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nRETURN MAX(`mountain`.`height`) AS `_col_0`, avg(`mountain`.`height`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum and average height of the mountains?",
    "evidence": "",
    "idx": 4318
  },
  {
    "filename": "train_spider.json",
    "db_id": "mountain_photos",
    "gql_statement": "MATCH (`camera_lens`:`camera_lens`)\nWHERE `camera_lens`.`name` =~ '(?i)(?s).*Digital.*'\nRETURN `camera_lens`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the camera lens names containing substring \"Digital\".",
    "evidence": "",
    "idx": 4326
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nWHERE `channel`.`owner` <> 'CCTV'\nRETURN `channel`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of channels that are not owned by CCTV.",
    "evidence": "",
    "idx": 4327
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nWHERE `channel`.`owner` <> 'CCTV'\nRETURN `channel`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which channels are not owned by CCTV? Give me the channel names.",
    "evidence": "",
    "idx": 4328
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nORDER BY `channel`.`rating_in_percent` IS NULL ASC, `channel`.`rating_in_percent` DESC \nRETURN `channel`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all channel names ordered by their rating in percent from big to small.",
    "evidence": "",
    "idx": 4329
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nORDER BY `channel`.`rating_in_percent` IS NULL ASC, `channel`.`rating_in_percent` DESC \nRETURN `channel`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me a list of all the channel names sorted by the channel rating in descending order.",
    "evidence": "",
    "idx": 4330
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nORDER BY `channel`.`rating_in_percent` IS NULL ASC, `channel`.`rating_in_percent` DESC \nRETURN `channel`.`owner` AS `owner`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show me the owner of the channel with the highest rating.",
    "evidence": "",
    "idx": 4332
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`program`:`program`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of programs.",
    "evidence": "",
    "idx": 4334
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`program`:`program`)\nORDER BY `program`.`launch` IS NULL DESC, `program`.`launch`  \nRETURN `program`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list all the names of programs, ordering by launch time.",
    "evidence": "",
    "idx": 4335
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`program`:`program`)\nRETURN `program`.`name` AS `name`, `program`.`origin` AS `origin`, `program`.`owner` AS `owner`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name, origin and owner of each program.",
    "evidence": "",
    "idx": 4337
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`program`:`program`)\nORDER BY `program`.`launch` IS NULL ASC, `program`.`launch` DESC \nRETURN `program`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the name of the program that was launched most recently.",
    "evidence": "",
    "idx": 4339
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`program`:`program`)\nORDER BY `program`.`launch` IS NULL ASC, `program`.`launch` DESC \nRETURN `program`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which program was launched most recently? Return the program name.",
    "evidence": "",
    "idx": 4340
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nWHERE `channel`.`owner` = 'CCTV'\nRETURN sum(`channel`.`share_in_percent`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the total percentage share of all channels owned by CCTV.",
    "evidence": "",
    "idx": 4341
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nWHERE `channel`.`owner` = 'CCTV'\nRETURN sum(`channel`.`share_in_percent`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total share (in percent) of all the channels owned by CCTV?",
    "evidence": "",
    "idx": 4342
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`t1`:`channel`)-[t2:broadcast]->()\nWHERE `t1`.`channel_id` = `t2`.`channel_id`\nAND (`t2`.`time_of_day` = 'Morning')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the channels that are broadcast in the morning.",
    "evidence": "",
    "idx": 4343
  }
]