[
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the best american restaurant in the bay area ?",
    "evidence": "",
    "idx": 1401
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "WITH *, COLLECT { MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`region` = 'bay area'\nRETURN `geographic`.`city_name` AS `city_name`   } AS in_collect_0\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t1`.`city_name` IN in_collect_0)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where can we find some restaurants in the bay area ?",
    "evidence": "",
    "idx": 1439
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "WITH *, COLLECT { MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`region` = 'bay area'\nRETURN `geographic`.`city_name` AS `city_name`   } AS in_collect_0\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t1`.`city_name` IN in_collect_0)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me some restaurants in the bay area ?",
    "evidence": "",
    "idx": 1440
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "WITH *, COLLECT { MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`region` = 'bay area'\nRETURN `geographic`.`city_name` AS `city_name`   } AS in_collect_0\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t1`.`city_name` IN in_collect_0)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me a restaurant in the bay area ?",
    "evidence": "",
    "idx": 1441
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "WITH *, COLLECT { MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`region` = 'bay area'\nRETURN `geographic`.`city_name` AS `city_name`   } AS in_collect_0\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t1`.`city_name` IN in_collect_0)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where can i find a restaurant in the bay area ?",
    "evidence": "",
    "idx": 1442
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "WITH *, COLLECT { MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`region` = 'region0'\nRETURN `geographic`.`city_name` AS `city_name`   } AS in_collect_0\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t1`.`city_name` IN in_collect_0 AND `t1`.`rating` > 2.5)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me a good restaurant in the bay area ?",
    "evidence": "",
    "idx": 1443
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "WITH *, COLLECT { MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`region` = 'region0'\nRETURN `geographic`.`city_name` AS `city_name`   } AS in_collect_0\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t1`.`city_name` IN in_collect_0 AND `t1`.`rating` > 2.5)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are some good restaurants in the bay area ?",
    "evidence": "",
    "idx": 1444
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "WITH *, COLLECT { MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`region` = 'region0'\nRETURN `geographic`.`city_name` AS `city_name`   } AS in_collect_0\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t1`.`city_name` IN in_collect_0 AND `t1`.`rating` > 2.5)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me some good restaurants in the bay area ?",
    "evidence": "",
    "idx": 1445
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "WITH *, COLLECT { MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`region` = 'region0'\nRETURN `geographic`.`city_name` AS `city_name`   } AS in_collect_0\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t1`.`city_name` IN in_collect_0 AND `t1`.`rating` > 2.5)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is a good restaurant in the bay area ?",
    "evidence": "",
    "idx": 1446
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_management",
    "gql_statement": "MATCH (`head`:`head`)\nRETURN `head`.`name` AS `name`, `head`.`born_state` AS `born_state`, `head`.`age` AS `age` ORDER BY `age` IS NULL DESC, `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name, born state and age of the heads of departments ordered by age.",
    "evidence": "",
    "idx": 1448
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_management",
    "gql_statement": "MATCH (`department`:`department`)\nRETURN `department`.`creation` AS `creation`, `department`.`name` AS `name`, `department`.`budget_in_billions` AS `budget_in_billions`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the creation year, name and budget of each department.",
    "evidence": "",
    "idx": 1449
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_management",
    "gql_statement": "MATCH (`head`:`head`)\nWHERE `head`.`name` =~ '(?i)(?s).*Ha.*'\nRETURN `head`.`head_id` AS `head_id`, `head`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which head's name has the substring 'Ha'? List the id and name.",
    "evidence": "",
    "idx": 1459
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`farm`:`farm`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of farms.",
    "evidence": "",
    "idx": 1461
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`farm`:`farm`)\nRETURN `farm`.`total_horses` AS `total_horses` ORDER BY `total_horses` IS NULL DESC, `total_horses`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the total number of horses on farms in ascending order.",
    "evidence": "",
    "idx": 1462
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`farm_competition`:`farm_competition`)\nWHERE `farm_competition`.`theme` <> 'Aliens'\nRETURN `farm_competition`.`hosts` AS `hosts`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the hosts of competitions whose theme is not \"Aliens\"?",
    "evidence": "",
    "idx": 1464
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`farm_competition`:`farm_competition`)\nORDER BY `farm_competition`.`year` IS NULL DESC, `farm_competition`.`year`  \nRETURN `farm_competition`.`theme` AS `theme`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the themes of farm competitions, sorted by year ascending.",
    "evidence": "",
    "idx": 1467
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`farm`:`farm`)\nWHERE `farm`.`total_horses` > 5000\nRETURN avg(`farm`.`working_horses`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the average number of working horses on farms with more than 5000 total horses.",
    "evidence": "",
    "idx": 1469
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`farm`:`farm`)\nRETURN MAX(`farm`.`cows`) AS `_col_0`, min(`farm`.`cows`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum and minimum number of cows across all farms.",
    "evidence": "",
    "idx": 1470
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`farm`:`farm`)\nRETURN MAX(`farm`.`cows`) AS `_col_0`, min(`farm`.`cows`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the maximum and minimum number of cows across all farms.",
    "evidence": "",
    "idx": 1471
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN COUNT(DISTINCT `city`.`status`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different statuses.",
    "evidence": "",
    "idx": 1473
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`city`:`city`)\nORDER BY `city`.`population` IS NULL ASC, `city`.`population` DESC \nRETURN `city`.`official_name` AS `official_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List official names of cities in descending order of population.",
    "evidence": "",
    "idx": 1474
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`city`:`city`)\nORDER BY `city`.`population` IS NULL ASC, `city`.`population` DESC \nRETURN `city`.`official_name` AS `official_name`, `city`.`status` AS `status`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the official name and status of the city with the largest population.",
    "evidence": "",
    "idx": 1476
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`t2`:`farm_competition`)-[host_city_0:host_city]->(`t1`:`city`)\nWHERE `t1`.`city_id` = `t2`.`host_city_id`\nRETURN `t2`.`year` AS `year`, `t1`.`official_name` AS `official_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the years and the official names of the host cities of competitions.",
    "evidence": "",
    "idx": 1478
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`t2`:`farm_competition`)-[host_city_0:host_city]->(`t1`:`city`)\nWHERE `t1`.`city_id` = `t2`.`host_city_id`\nRETURN `t2`.`year` AS `year`, `t1`.`official_name` AS `official_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the years and official names of the cities of each competition.",
    "evidence": "",
    "idx": 1479
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`t2`:`farm_competition`)-[host_city_0:host_city]->(`t1`:`city`)\nWHERE `t1`.`city_id` = `t2`.`host_city_id`\nAND (`t1`.`population` > 1000)\nRETURN `t2`.`theme` AS `theme`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the themes of competitions with host cities having populations larger than 1000.",
    "evidence": "",
    "idx": 1480
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`city`:`city`)\nWITH `city`.`status` AS _groupby_col_0, avg(`city`.`population`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `status`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the different statuses of cities and the average population of cities with each status.",
    "evidence": "",
    "idx": 1482
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "WITH *, COLLECT { MATCH (`farm_competition_sub0`:`farm_competition`)\nRETURN `farm_competition_sub0`.`host_city_id` AS `host_city_id`   } AS in_collect_0\nMATCH (`city`:`city`)\nWHERE NOT `city`.`city_id` IN in_collect_0\nRETURN `city`.`official_name` AS `official_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the official names of cities that have not held any competition.",
    "evidence": "",
    "idx": 1484
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 1500 OR `city`.`population` < 500\nRETURN `city`.`official_name` AS `official_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the official names of cities with population bigger than 1500 or smaller than 500.",
    "evidence": "",
    "idx": 1486
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`status` <> 'Village'\nRETURN `city`.`census_ranking` AS `census_ranking`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the census ranking of cities whose status are not \"Village\".",
    "evidence": "",
    "idx": 1488
  },
  {
    "filename": "train_spider.json",
    "db_id": "farm",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`status` <> 'Village'\nRETURN `city`.`census_ranking` AS `census_ranking`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the census rankings of cities that do not have the status \"Village\"?",
    "evidence": "",
    "idx": 1489
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "WITH *, COLLECT { MATCH (`student_course_attendance_sub0`:`student_course_attendance`)\nRETURN `student_course_attendance_sub0`.`student_id` AS `student_id_1`   } AS in_collect_0\nMATCH (`students`:`students`)\nWHERE NOT `students`.`student_id` IN in_collect_0\nRETURN `students`.`student_id` AS `student_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the id of students who never attends courses?",
    "evidence": "",
    "idx": 1492
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "WITH *, COLLECT { MATCH (`student_course_attendance_sub0`:`student_course_attendance`)\nRETURN `student_course_attendance_sub0`.`student_id` AS `student_id_1`   } AS in_collect_0\nMATCH (`students`:`students`)\nWHERE NOT `students`.`student_id` IN in_collect_0\nRETURN `students`.`student_id` AS `student_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the  ids of every student who has never attended a course?",
    "evidence": "",
    "idx": 1493
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH ()-[t1:registered_for]->(`t2`:`courses`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nRETURN `t1`.`student_id` AS `student_id`, `t2`.`course_name` AS `course_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of all students for courses and what are the names of those courses?",
    "evidence": "",
    "idx": 1496
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t2`:`students`)-[t1:registered_for]->()\nWHERE `t1`.`student_id` = `t2`.`student_id`\nORDER BY `t1`.`registration_date` IS NULL ASC, `t1`.`registration_date` DESC \nRETURN `t2`.`student_details` AS `student_details`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is detail of the student who most recently registered course?",
    "evidence": "",
    "idx": 1497
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t2`:`students`)-[t1:registered_for]->()\nWHERE `t1`.`student_id` = `t2`.`student_id`\nORDER BY `t1`.`registration_date` IS NULL ASC, `t1`.`registration_date` DESC \nRETURN `t2`.`student_details` AS `student_details`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What details do we have on the students who registered for courses most recently?",
    "evidence": "",
    "idx": 1498
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t2`:`student_course_attendance`)\nMATCH (`t1`:`courses`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`course_name` = 'English')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students attend course English?",
    "evidence": "",
    "idx": 1499
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t2`:`student_course_attendance`)\nMATCH (`t1`:`courses`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`course_name` = 'English')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students are attending English courses?",
    "evidence": "",
    "idx": 1500
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t2`:`student_course_attendance`)\nMATCH (`t1`:`courses`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t2`.`student_id` = 171)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many courses do the student whose id is 171 attend?",
    "evidence": "",
    "idx": 1501
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t2`:`student_course_attendance`)\nMATCH (`t1`:`courses`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t2`.`student_id` = 171)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many courses does the student with id 171 actually attend?",
    "evidence": "",
    "idx": 1502
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t2`:`candidates`)-[is_person_0:is_person]->(`t1`:`people`)\nWHERE `t1`.`person_id` = `t2`.`candidate_id`\nAND (`t1`.`email_address` = 'stanley.monahan@example.org')\nRETURN `t2`.`candidate_id` AS `candidate_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find id of the candidate whose email is stanley.monahan@example.org?",
    "evidence": "",
    "idx": 1503
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t2`:`candidates`)-[is_person_0:is_person]->(`t1`:`people`)\nWHERE `t1`.`person_id` = `t2`.`candidate_id`\nAND (`t1`.`email_address` = 'stanley.monahan@example.org')\nRETURN `t2`.`candidate_id` AS `candidate_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id of the candidate whose email is stanley.monahan@example.org?",
    "evidence": "",
    "idx": 1504
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t1`:`students`)-[t2:registered_for]->()\nWHERE `t1`.`student_id` = `t2`.`student_id`\nWITH `t1`.`student_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `student_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the id of students who registered some courses and the number of their registered courses?",
    "evidence": "",
    "idx": 1507
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t1`:`students`)-[t2:registered_for]->()\nWHERE `t1`.`student_id` = `t2`.`student_id`\nWITH `t1`.`student_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `student_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For every student who is registered for some course, how many courses are they registered for?",
    "evidence": "",
    "idx": 1508
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`candidate_assessments`:`candidate_assessments`)\nWHERE `candidate_assessments`.`asessment_outcome_code` = 'Pass'\nRETURN `candidate_assessments`.`candidate_id` AS `candidate_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find id of candidates whose assessment code is \"Pass\"?",
    "evidence": "",
    "idx": 1509
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t1`:`candidates`)-[has_assessment_0:has_assessment]->(`t2`:`candidate_assessments`)\nMATCH (`t1`:`candidates`)-[is_person_0:is_person]->(`t3`:`people`)\nWHERE `t1`.`candidate_id` = `t2`.`candidate_id`\nAND `t1`.`candidate_id` = `t3`.`person_id`\nAND (`t2`.`asessment_outcome_code` = 'Fail')\nRETURN `t3`.`cell_mobile_number` AS `cell_mobile_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the cell mobile number of the candidates whose assessment code is \"Fail\"?",
    "evidence": "",
    "idx": 1511
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t3`:`students`)\nMATCH ()-[t2:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND `t2`.`person_id` = `t3`.`student_id`\nRETURN DISTINCT `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find distinct cities of address of students?",
    "evidence": "",
    "idx": 1519
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t3`:`students`)\nMATCH ()-[t2:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND `t2`.`person_id` = `t3`.`student_id`\nRETURN DISTINCT `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different cities where students live?",
    "evidence": "",
    "idx": 1520
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH ()-[student_course_registrations:registered_for]->()\nRETURN `student_course_registrations`.`student_id` AS `student_id`   \nUNION DISTINCT\nMATCH (`student_course_attendance`:`student_course_attendance`)\nRETURN `student_course_attendance`.`student_id` AS `student_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the id of students who registered courses or attended courses?",
    "evidence": "",
    "idx": 1525
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH ()-[student_course_registrations:registered_for]->()\nRETURN `student_course_registrations`.`student_id` AS `student_id`   \nUNION DISTINCT\nMATCH (`student_course_attendance`:`student_course_attendance`)\nRETURN `student_course_attendance`.`student_id` AS `student_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of the students who either registered or attended a course?",
    "evidence": "",
    "idx": 1526
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH ()-[student_course_registrations:registered_for]->()\nWHERE `student_course_registrations`.`student_id` = 121\nRETURN `student_course_registrations`.`course_id` AS `course_id`   \nUNION DISTINCT\nMATCH (`student_course_attendance`:`student_course_attendance`)\nWHERE `student_course_attendance`.`student_id` = 121\nRETURN `student_course_attendance`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id of courses which are registered or attended by student whose id is 121?",
    "evidence": "",
    "idx": 1527
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH ()-[student_course_registrations:registered_for]->()\nWHERE `student_course_registrations`.`student_id` = 121\nRETURN `student_course_registrations`.`course_id` AS `course_id`   \nUNION DISTINCT\nMATCH (`student_course_attendance`:`student_course_attendance`)\nWHERE `student_course_attendance`.`student_id` = 121\nRETURN `student_course_attendance`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of the courses that are registered or attended by the student whose id is 121?",
    "evidence": "",
    "idx": 1528
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "WITH *, COLLECT { MATCH (`student_course_attendance_sub0`:`student_course_attendance`)\nRETURN `student_course_attendance_sub0`.`student_id` AS `student_id_1`   } AS in_collect_0\nMATCH ()-[student_course_registrations:registered_for]->()\nWHERE NOT `student_course_registrations`.`student_id` IN in_collect_0\nRETURN `student_course_registrations`.`student_id` AS `student_id`, `student_course_registrations`.`course_id` AS `course_id`, `student_course_registrations`.`registration_date` AS `registration_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all info of students who registered courses but not attended courses?",
    "evidence": "",
    "idx": 1529
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "WITH *, COLLECT { MATCH (`student_course_attendance_sub0`:`student_course_attendance`)\nRETURN `student_course_attendance_sub0`.`student_id` AS `student_id_1`   } AS in_collect_0\nMATCH ()-[student_course_registrations:registered_for]->()\nWHERE NOT `student_course_registrations`.`student_id` IN in_collect_0\nRETURN `student_course_registrations`.`student_id` AS `student_id`, `student_course_registrations`.`course_id` AS `course_id`, `student_course_registrations`.`registration_date` AS `registration_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all details of the students who registered but did not attend any course?",
    "evidence": "",
    "idx": 1530
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH ()-[t2:registered_for]->(`t1`:`courses`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`course_name` = 'statistics')\nORDER BY `t2`.`registration_date` IS NULL DESC, `t2`.`registration_date`  \nRETURN `t2`.`student_id` AS `student_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of the students who registered course statistics by order of registration date?",
    "evidence": "",
    "idx": 1532
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_assessment",
    "gql_statement": "MATCH (`t2`:`student_course_attendance`)\nMATCH (`t1`:`courses`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`course_name` = 'statistics')\nORDER BY `t2`.`date_of_attendance` IS NULL DESC, `t2`.`date_of_attendance`  \nRETURN `t2`.`student_id` AS `student_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the id of students who attended  statistics courses in the order of attendance date.",
    "evidence": "",
    "idx": 1533
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`book`:`book`)\nRETURN `book`.`writer` AS `writer` ORDER BY `writer` IS NULL DESC, `writer`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the writers of the books in ascending alphabetical order.",
    "evidence": "",
    "idx": 1536
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`book`:`book`)\nORDER BY `book`.`issues` IS NULL DESC, `book`.`issues`  \nRETURN `book`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the titles of the books in ascending order of issues.",
    "evidence": "",
    "idx": 1537
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`book`:`book`)\nWHERE `book`.`writer` <> 'Elaine Lee'\nRETURN `book`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of the books whose writer is not \"Elaine Lee\"?",
    "evidence": "",
    "idx": 1538
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`publication`:`publication`)\nORDER BY `publication`.`price` IS NULL ASC, `publication`.`price` DESC \nRETURN `publication`.`publisher` AS `publisher`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the publisher of the publication with the highest price.",
    "evidence": "",
    "idx": 1542
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`publication`:`publication`)\nORDER BY `publication`.`price` IS NULL DESC, `publication`.`price`  \nRETURN `publication`.`publication_date` AS `publication_date`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the publication dates of publications with 3 lowest prices.",
    "evidence": "",
    "idx": 1543
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`t2`:`publication`)-[belongs_to_0:belongs_to]->(`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nRETURN `t1`.`title` AS `title`, `t2`.`publication_date` AS `publication_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the title and publication dates of books.",
    "evidence": "",
    "idx": 1544
  },
  {
    "filename": "train_spider.json",
    "db_id": "book_2",
    "gql_statement": "MATCH (`t2`:`publication`)-[belongs_to_0:belongs_to]->(`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND (`t2`.`price` > 4000000)\nRETURN `t1`.`writer` AS `writer`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show writers who have published a book with price more than 4000000.",
    "evidence": "",
    "idx": 1545
  }
]