[
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`role` = 'director' AND `t1`.`award` = 'Outstanding Animated Program (For Programming Less Than One Hour)' AND `t2`.`title` = 'No Loan Again, Naturally')\nRETURN `t1`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the name of the director who achieved the Outstanding Animated Program (For Programming Less Than One Hour) award whose episode title is \"No Loan Again, Naturally\".",
    "evidence": "the director refers to role = 'director'",
    "idx": 3218
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`award_category` = 'WGA Award (TV)' AND `t1`.`birth_country` = 'USA' AND `t2`.`year` >= 2009 AND `t2`.`year` <= 2010)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many WGA Award (TV) award recipients were born in the USA from 2009 to 2010?",
    "evidence": "WGA Award (TV) award refers to award_category = 'WGA Award (TV)'; born in the USA refers to birth_country = 'USA'; from 2009 to 2010 refers to birthdate BETWEEN '2019-01-01' and '2019-12-31'",
    "idx": 3219
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`award`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`role` = 'composer' AND `t1`.`award` = 'Outstanding Music Composition for a Series (Original Dramatic Score)' AND `t2`.`votes` > 200)\nRETURN DISTINCT `t1`.`episode_id` AS `episode_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which episode did the composer win for Outstanding Music Composition for a Series (Original Dramatic Score) with more than 200 votes?",
    "evidence": "more than 200 votes refer to votes > 200; composer refers to role = 'composer'; Outstanding Music Composition for a Series (Original Dramatic Score) refers to award = 'Outstanding Music Composition for a Series (Original Dramatic Score)'",
    "idx": 3220
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nRETURN sum(CASE  WHEN `t1`.`episode` = 1 THEN `t2`.`votes` ELSE 0 END) - sum(CASE  WHEN `t1`.`episode` = 5 THEN `t2`.`votes` ELSE 0 END) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much more votes for episode 1 than for episode 5?",
    "evidence": "more votes refers to SUBTRACT(SUM(votes when episode = 1), SUM(votes when episode = 5))",
    "idx": 3221
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t1`.`year` = 2009 AND `t2`.`character` = 'Homer Simpson')\nRETURN DISTINCT `t1`.`award` AS `award`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What award did the character Homer simpson 20 achieve in 2009?",
    "evidence": "in 2009 refers to year = 2009",
    "idx": 3222
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t3`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t1`.`episode_id` = `t3`.`episode_id`\nAND (`t1`.`award` = 'Outstanding Animated Program (For Programming Less Than One Hour)')\nRETURN sum(CASE  WHEN `t2`.`votes` < 100 THEN 1 ELSE 0 END) AS `num`, CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`votes` < 100 THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many episodes have won the award for Outstanding Animated Program (Programming Under One Hour) with less than 100 votes? Calculate the percentage of episodes with less than 100 votes out of total episodes.",
    "evidence": "less than 100 votes refers to votes < 100; percentage refers to DIVIDE(COUNT(episode_id when votes < 100), COUNT(episode_id)) * 100%",
    "idx": 3223
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`award_category` = 'Primetime Emmy' AND `t2`.`person` = 'Dan Castellaneta')\nRETURN sum(CASE  WHEN `t1`.`birth_country` = 'USA' THEN 1 ELSE 0 END) AS `num`, CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`birth_country` = 'USA' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many recipients of the Primetime Emmy Award category that were born in the USA? Find the percentage of Americans in the total number of the country.",
    "evidence": "born in the USA refers to birth_country = 'USA'; recipients refers to person = 'recipients'; percentage refers to DIVIDE(COUNT(birth_country = 'USA'), count(award_id))",
    "idx": 3224
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`result` = 'Nominee' AND `award`.`award` = 'Outstanding Voice-Over Performance' AND `award`.`episode_id` =~ '(?i)(?s)S20.*'\nRETURN `award`.`person` AS `person`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list two people who are the nominees for the \"Outstanding Voice-Over Performance\" award for season 20.",
    "evidence": "season 20 refers to episode_id LIKE 'S20%'",
    "idx": 3225
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`role` = 'executive producer' AND `award`.`result` = 'Nominee' AND `award`.`award` = 'Outstanding Animated Program (For Programming Less Than One Hour)'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many executive producers are the nominees for the award of \"Outstanding Animated Program (For Programming Less Than One Hour)\"?",
    "evidence": "the nominees refers to result = 'Nominee'; executive producers refers to role = 'executive producer'",
    "idx": 3226
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`person`.`birthdate`,(case when size(`person`.`birthdate`)+1+(1-1)+4 < 0 then 0 else size(`person`.`birthdate`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`person`.`birthdate`,size(`person`.`birthdate`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`person`.`birthdate`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`person`.`birthdate`,1-1,4) END = '1962' AND `person`.`birth_region` = 'California'\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the crew, who was born in 1962 in California?",
    "evidence": "born in 1962 refers to year(birthdate) = 1962; in California refers to birth_region = 'California'",
    "idx": 3227
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`height_meters` > 1.70 AND `person`.`birth_country` = 'Canada'\nRETURN COUNT(`person`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the crew members who are taller than 1.70m were born in Canada?",
    "evidence": "taller than 1.70m refers to height_meters > 1.70; born in Canada refers to birth_country = 'Canada'",
    "idx": 3228
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`award` = 'Animation' AND `award`.`result` = 'Nominee'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many people were considered as prospective recipients of the \"Animation\" award?",
    "evidence": "prospective recipients refers to result = 'Nominee'",
    "idx": 3229
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nWHERE `episode`.`rating` >= 7 AND `episode`.`rating` <= 10\nRETURN `episode`.`title` AS `title`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any three episodes that have an excellent rating.",
    "evidence": "an excellent rating refers to 7 < rating < = 10",
    "idx": 3230
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nORDER BY `episode`.`votes` IS NULL ASC, `episode`.`votes` DESC \nRETURN `episode`.`episode_id` AS `episode_id`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the top five most popular episodes?",
    "evidence": "most popular episodes refers to MAX(votes)",
    "idx": 3231
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "CALL(*) {\nMATCH (`vote_sub0`:`vote`)\nRETURN min(`vote_sub0`.`stars`) AS `_col_0`  \n}\nMATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = `_col_0`)\nORDER BY `t2`.`votes` IS NULL ASC, `t2`.`votes` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the three episodes with the highest number of votes for the worst star rating.",
    "evidence": "highest number of votes refers to MAX(COUNT(votes)); worst star rating refers to stars = 1",
    "idx": 3232
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t1`.`award` =~ '(?i)(?s).*Voice-Over.*' AND `t1`.`person` = 'Dan Castellaneta')\nRETURN DISTINCT `t2`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the character that Dan Castellaneta did the voice over for and was awarded?",
    "evidence": "voice over for and was awarded refers to award like '%Voice-Over%';",
    "idx": 3233
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Take My Life, Please')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the keywords of the episode \"Take My Life, Please\"?",
    "evidence": "episode \"Take My Life, Please\" refers to title = 'Take My Life, Please'",
    "idx": 3235
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`keyword` = '1930s to 2020s')\nRETURN `t1`.`title` AS `title`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide any two episodes' names that have the same keyword of \"1930s to 2020s\".",
    "evidence": "",
    "idx": 3236
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'Lisa the Drama Queen' AND `t2`.`stars` = 5)\nRETURN sum(`t2`.`votes`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many votes of 5-star did the episode \"Lisa the Drama Queen\" receive?",
    "evidence": "episode \"Lisa the Drama Queen\" refers to title = 'Lisa the Drama Queen';",
    "idx": 3237
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`stars` = 10 AND `t1`.`keyword` = 'reference to the fantastic four')\nRETURN `t2`.`votes` AS `votes`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the number of votes for 10-star for the episode that has the keyword \"reference to the fantastic four\"?",
    "evidence": "10-star refers to stars = 10",
    "idx": 3238
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'The Burns and the Bees')\nRETURN sum(CASE  WHEN `t2`.`stars` = 10 THEN `t2`.`votes` ELSE 0 END) - sum(CASE  WHEN `t2`.`stars` = 1 THEN `t2`.`votes` ELSE 0 END) AS `difference`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference between the number of votes for 1-star vs. 10-star for the episode \"The Burns and the Bees\"?",
    "evidence": "1-star refers to stars = 1; 10-star refers to stars = 10; episode \"The Burns and the Bees\" refers to title = 'The Burns and the Bees'; difference refers to SUBTRACT(votes when stars = 1, votes when stars = 10)",
    "idx": 3239
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nORDER BY `t1`.`votes` IS NULL DESC, `t1`.`votes`  \nRETURN `t2`.`keyword` AS `keyword`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the keywords of the least popular episode?",
    "evidence": "least popular episode refers to MIN(votes)",
    "idx": 3240
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = 2 AND `t2`.`votes` > 20 AND `t1`.`rating` > 5.0 AND `t1`.`rating` <= 7.0)\nRETURN DISTINCT `t1`.`episode_id` AS `episode_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the episodes that have the average rating with more than 20 of 2-star votes?",
    "evidence": "2-star refers to stars = 2; average rating refers to 5 < rating < = 7; more than 20 of 2-star votes refers to votes > 20",
    "idx": 3241
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "CALL(*) {\nMATCH (`episode_sub0`:`episode`)\nRETURN MAX(`episode_sub0`.`votes`) AS `_col_0`  \n}\nMATCH (`episode`:`episode`)\nWHERE `episode`.`votes` = `_col_0`\nRETURN `episode`.`episode` AS `episode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which episode has the largest number of votes?",
    "evidence": "largest number of votes refers to MAX(votes)",
    "idx": 3242
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nORDER BY `person`.`birthdate` IS NULL DESC, `person`.`birthdate`  \nRETURN `person`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the oldest among all the casts and crews?",
    "evidence": "oldest refers to MIN(birthdate)",
    "idx": 3243
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH ()-[credit:credit]->()\nWHERE `credit`.`person` = 'Oscar Cervantes' AND `credit`.`credited` = 'true'\nRETURN `credit`.`episode_id` AS `episode_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the episodes Oscar Cervantes is credited with?",
    "evidence": "is credited refers to credited = 'true';",
    "idx": 3244
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t1`.`birth_country` <> 'USA')\nRETURN `t2`.`role` AS `role`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the roles of the cast and crew from countries other than the USA?",
    "evidence": "from countries other than the USA refers to birth_country ! = 'USA'",
    "idx": 3245
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = 1)\nORDER BY `t1`.`rating` IS NULL DESC, `t1`.`rating`  \nRETURN COUNT(*) AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many 1 star ratings are there in the worst rated episode of the season?",
    "evidence": "worst rated episode refers to MIN(rating)",
    "idx": 3246
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t1`.`award` = 'Outstanding Voice-Over Performance' AND `t1`.`result` = 'Winner')\nRETURN DISTINCT `t2`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which character did the \"Outstanding Voice-Over Performance\" winner voice?",
    "evidence": "the \"Outstanding Voice-Over Performance\" refers to award = 'Outstanding Voice-Over Performance'; winner refers to result = 'Winner';",
    "idx": 3247
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`person` = 'Emily Blunt')\nRETURN `t1`.`summary` AS `summary`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the summary of the episode in which Emily Blunt is featured in?",
    "evidence": "",
    "idx": 3248
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t1`.`nickname` = 'The Tiny Canadian')\nRETURN `t2`.`role` AS `role`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who did \"The Tiny Canadian\" play as in the show?",
    "evidence": "\"The Tiny Canadian\" refers to nickname = 'The Tiny Canadian'; play as in the show refers to role\n",
    "idx": 3249
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`award`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = 5)\nORDER BY `t2`.`percent` IS NULL ASC, `t2`.`percent` DESC \nRETURN `t1`.`episode_id` AS `episode_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the episodes with an award nominee or winner, which has the highest percent of 5 star votes?",
    "evidence": "highest percent of 5 star votes refers to max(percent) where star = 5",
    "idx": 3250
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'In the Name of the Grandfather' AND `t2`.`category` = 'Cast' AND `t2`.`credited` = 'true')\nRETURN DISTINCT `t2`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the credited cast for the episode \"In the Name of the Grandfather\"?",
    "evidence": "credited cast refers to category = 'Cast' and  credited = 'true'; episode \"In the Name of the Grandfather\" refers to title = 'In the Name of the Grandfather'",
    "idx": 3251
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`result` = 'Winner')\nRETURN `t1`.`birthdate` AS `birthdate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of the award winners' birth dates.",
    "evidence": "award winner refers to result = 'Winner'",
    "idx": 3252
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`result` = 'Winner' AND `t2`.`air_date` = '2008-11-30')\nRETURN `t1`.`award` AS `award`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What award did the episode that aired on 11/30/2008 win?",
    "evidence": "aired on 11/30/2008 refers to air_date = '11/30/2008'; win refers to result = 'Winner'",
    "idx": 3253
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`category` = 'Music Department')\nRETURN DISTINCT `t2`.`person` AS `person`, `t1`.`name` AS `name`, `t1`.`birthdate` AS `birthdate`, `t1`.`birth_name` AS `birth_name`, `t1`.`birth_place` AS `birth_place`, `t1`.`birth_region` AS `birth_region`, `t1`.`birth_country` AS `birth_country`, `t1`.`height_meters` AS `height_meters`, `t1`.`nickname` AS `nickname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of the information about the music department's casts and crews.",
    "evidence": "information about the music department refers to category = 'Music Department'",
    "idx": 3254
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`number_in_series` = 426)\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the keywords for episode 426 of the series?",
    "evidence": "episode 426 refers to number_in_series = 426",
    "idx": 3255
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "CALL(*) {\nMATCH (`vote_sub0`:`vote`)\nRETURN CASE WHEN COUNT(CASE  WHEN `vote_sub0`.`stars` = 7 THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(COUNT(`vote_sub0`.`votes`)) / COUNT(CASE  WHEN `vote_sub0`.`stars` = 7 THEN 1 ELSE 0 END) END AS `_col_0`  \n}\nMATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = 7 AND `t2`.`votes` > 0.7 * `_col_0`)\nRETURN DISTINCT `t1`.`episode_id` AS `episode_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the titles of the episodes that have received more 7-star votes than the season average?",
    "evidence": "episodes that have received more 7-star votes than the season average refers to votes > DIVIDE(SUM(votes), COUNT(stars = 7))",
    "idx": 3256
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nRETURN CASE WHEN sum(`t2`.`votes`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`result` = 'Nominee' THEN `t2`.`votes` ELSE 0 END)) * 100 / sum(`t2`.`votes`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of votes are from the nominated episodes?",
    "evidence": "nominated episodes refers to result = 'Nominee'; percentage of votes = DIVIDE(SUM(result = 'Nominee), SUM(Votes)) as percentage",
    "idx": 3257
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE NOT `person`.`nickname` IS NULL\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down person's name who has nickname.",
    "evidence": "has nickname refers to nickname is NOT NULL",
    "idx": 3258
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nORDER BY `person`.`height_meters` IS NULL ASC, `person`.`height_meters` DESC \nRETURN `person`.`birth_country` AS `birth_country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country has the tallest person in the crew?",
    "evidence": "country refers to birth_country; tallest person refers to max(height_meters)",
    "idx": 3259
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`birth_country` = 'USA'\nRETURN avg(`person`.`height_meters`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average height of people from USA?",
    "evidence": "people from USA refers to birth_country = 'USA'; average height = AVG(height_meters)",
    "idx": 3260
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nRETURN CASE WHEN COUNT(`person`.`birthdate`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `person`.`birth_region` = 'California' AND CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`person`.`birthdate`,(case when size(`person`.`birthdate`)+1+(1-1)+4 < 0 then 0 else size(`person`.`birthdate`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`person`.`birthdate`,size(`person`.`birthdate`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`person`.`birthdate`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`person`.`birthdate`,1-1,4) END > '1970' THEN 1 ELSE 0 END)) * 100 / COUNT(`person`.`birthdate`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of people who were born after 1970 and from California.",
    "evidence": "born after 1970 refers to birthdate > 1970; from California refers to birth_region = 'California'; percentage = divide(count(birthdate > 1970 and birth_region = 'California'), total(birthdate)) * 100%",
    "idx": 3261
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`birth_region` <> 'Connecticut' AND `person`.`birth_country` <> 'USA'\nRETURN COUNT(`person`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many people were not born in Connecticut, USA?",
    "evidence": "not born in Connecticut, USA refers to birth_region ! = 'Connecticut' and birth_country ! = 'USA'",
    "idx": 3262
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nWHERE `episode`.`episode_id` IN ['S20-E1', 'S20-E2', 'S20-E3']\nRETURN `episode`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the title of episode S20-E1, S20-E2 & S20-E3.",
    "evidence": "episode S20-E1, S20-E2 & S20-E3 refers to episode_id = 'S20-E1' and episode_id = 'S20-E2' and episode_id = 'S20-E3'",
    "idx": 3263
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nWHERE `episode`.`episode` = 5\nRETURN `episode`.`episode_image` AS `episode_image`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the website address which stores the episode image of episode 5.",
    "evidence": "website address refers to episode_image",
    "idx": 3264
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nWHERE `episode`.`rating` > 7\nRETURN `episode`.`votes` AS `votes`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of votes for episode with rating of 7 and above.",
    "evidence": "rating of 7 and above refers to rating > 7.0",
    "idx": 3265
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`category` = 'Casting Department')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many title's crew members are working from Casting Department?",
    "evidence": "working from Casting Department refers to category = 'Casting Department'",
    "idx": 3266
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`role` = 'additional timer' AND `t1`.`birth_country` = 'USA')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many additional timers were born in USA?",
    "evidence": "additional timers refers to role = 'additional timer'; born in USA refers to birth_country = 'USA'",
    "idx": 3267
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`credited` = 'false')\nRETURN `t1`.`summary` AS `summary`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the summary of episode whereby it has crew members that are not included in the credit list.",
    "evidence": "are not included in the credit list refers to credited = ''",
    "idx": 3268
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`episode`)-[t2:credit]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`person` = 'Jason Bikowski')\nRETURN `t1`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the rating of episodes that were produced by Jason Bikowski.",
    "evidence": "produced by Jason Bikowski refers to person = 'Jason Bikowski'",
    "idx": 3269
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`category` = 'Animation Department')\nRETURN avg(`t1`.`height_meters`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average heights of crew members from Animation Department?",
    "evidence": "from Animation Department refers to category = 'Animation Department'; AVG(height_meters) where category = 'Animation Department'",
    "idx": 3270
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t1`.`award_category` = 'Primetime Emmy' AND `t1`.`year` = 2009 AND `t1`.`result` = 'Winner')\nRETURN DISTINCT `t2`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the character that won the award in Primetime Emmy 2009?",
    "evidence": "won the award in Primetime Emmy 2009 refers to award_category = 'Primetime Emmy' and year = 2009",
    "idx": 3271
  }
]