[
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t2`.`country` = `t3`.`origin`\nAND (`t3`.`country` = 'USA')\nRETURN DISTINCT `t1`.`car_name` AS `car_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the car models whose origin country is the USA.",
    "evidence": "name of car model refers to car_name; origin country is the USA refers to country = 'USA'",
    "idx": 2273
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t1`.`car_name` AS `car_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the top 3 most expensive cars.",
    "evidence": "name of the car refers to car_name; the most expensive refers to max(price)",
    "idx": 2274
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`production`)-[has_car_data_0:has_car_data]->(`t2`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`car_name` = 'chevrolet impala')\nRETURN DISTINCT `t1`.`model_year` AS `model_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the years in which the car model Chevrolet Impala was introduced in the market.",
    "evidence": "year refers to model_year; Chevrolet Impala refers to car_name = 'chevrolet impala'",
    "idx": 2275
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`acceleration` > 10 AND `t2`.`price` >= 20000 AND `t2`.`price` <= 30000)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cars with an acceleration of over 10 miles per squared hour, how many of them cost more than $20000 and less than $30000?",
    "evidence": "an acceleration of over 10 miles per squared hour refers to acceleration > 10; cost more than $20000 and less than $30000 refers to price < 30000 AND price > 20000",
    "idx": 2276
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`price` > 40000)\nRETURN `t1`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the weights of all the cars with the price over $40000.",
    "evidence": "price over $40000 refers to price > 40000",
    "idx": 2277
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`price` > 40000)\nRETURN MAX(`t1`.`acceleration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the maximum acceleration of a car with price over $40000?",
    "evidence": "the maximum acceleration refers to max(acceleration); price over $40000 refers to price > 40000",
    "idx": 2278
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`cylinders` = 8)\nRETURN avg(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average price of cars with 8 cylinders?",
    "evidence": "with 8 cylinders refers to cylinders = 8; average price = avg(price) where cylinders = 8",
    "idx": 2279
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`price` < 30000)\nRETURN MAX(CASE WHEN `t1`.`cylinders`=0 THEN NULL ELSE `t1`.`displacement` / `t1`.`cylinders` END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the maximum sweep volume of a car that costs less than $30000?",
    "evidence": "cost less than $30000 refers to price < 30000; the maximum sweep volume = max(divide(displacement, cylinders)) where price < 30000",
    "idx": 2280
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`production`)-[produced_in_0:produced_in]->(`t2`:`country`)\nWHERE `t1`.`country` = `t2`.`origin`\nAND (`t2`.`country` = 'Europe')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cars in the database are originated from Europe?",
    "evidence": "originated from Europe refers to country = 'Europe'",
    "idx": 2281
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t1`.`car_name` = 'chevrolet malibu')\nRETURN `t3`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the origin country of Chevrolet Malibu.",
    "evidence": "origin country refers to country; Chevrolet Malibu refers to car_name = 'chevrolet malibu'",
    "idx": 2282
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t1`.`mpg` AS `mpg`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the miles per gallon of the most expensive car?",
    "evidence": "miles per gallon refers to mpg; the most expensive refers to max(price)",
    "idx": 2283
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`production`)-[produced_in_0:produced_in]->(`t2`:`country`)\nWHERE `t1`.`country` = `t2`.`origin`\nAND (`t1`.`id` = 382)\nRETURN DISTINCT `t2`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the origin country of car no.382.",
    "evidence": "origin country refers to country; car no.382 refers to ID = 382",
    "idx": 2284
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_price_0:has_price]->(`t1`:`price`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t1`.`price` = 44274.40748)\nRETURN `t3`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which is the origin country of the $44274.40748 car?",
    "evidence": "origin country refers to country; the $44274.40748 car refers to price = 44274.40748",
    "idx": 2285
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'volkswagen dasher' AND `t1`.`acceleration` = '14.1')\nRETURN `t2`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the Volkswagen Dasher with 14.1 mph acceleration?",
    "evidence": "cost refers to price; Volkswagen Dasher refers to car_name = 'volkswagen dasher'; 14.1 mph acceleration refers to acceleration = 14.1",
    "idx": 2286
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`price` = '37443.85589')\nRETURN `t1`.`displacement` AS `displacement`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the engine displacement status of the $37443.85589 car.",
    "evidence": "engine displacement status refers to displacement; the $37443.85589 car refers to price = 37443.85589",
    "idx": 2287
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`price` = '32650.65157')\nRETURN `t1`.`model` AS `model`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was the $32650.65157 car introduced to the market? State the year.",
    "evidence": "the $32650.65157 car refers to price = 32650.65157; year refers to model",
    "idx": 2288
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'toyota corona hardtop')\nRETURN `t2`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the price of the only Toyota Corona hardtop in the database.",
    "evidence": "Toyota Corona hardtop refers to car_name = 'toyota corona hardtop'",
    "idx": 2289
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t2`.`price` IS NULL DESC, `t2`.`price`  \nRETURN `t1`.`cylinders` AS `cylinders`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cylinders does the cheapest car have?",
    "evidence": "the cheapest car refers to min(price)",
    "idx": 2290
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t1`.`weight` IS NULL ASC, `t1`.`weight` DESC \nRETURN `t1`.`id` AS `id`, `t2`.`price` AS `price`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which car in the database provides the best crash protection based on its weight? How much is it?",
    "evidence": "the best crash protection refers to max(weight); cost refers to price",
    "idx": 2291
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nORDER BY `t1`.`horsepower` IS NULL ASC, `t1`.`horsepower` DESC \nRETURN `t3`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the origin country of the fastest car in the database.",
    "evidence": "origin country refers to country; the fastest refers to max(horsepower)",
    "idx": 2292
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`production`)-[produced_in_0:produced_in]->(`t2`:`country`)\nWHERE `t1`.`country` = `t2`.`origin`\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`country` = 'Japan' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of Japanese cars in the database?",
    "evidence": "Japanese car refers to country = 'Japan'; percentage = divide(count(ID where country = 'Japan'), count(ID)) * 100%",
    "idx": 2293
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`price` = 34538.97449)\nRETURN CASE WHEN `t1`.`cylinders`=0 THEN NULL ELSE `t1`.`displacement` / `t1`.`cylinders` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the swept volume of the $34538.97449 car.",
    "evidence": "sweep volume = divide(displacement, cylinders); the $34538.97449 car refers to price = 34538.97449",
    "idx": 2294
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t1`.`car_name` AS `car_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the most expensive car?",
    "evidence": "name of the car refers to car_name; the most expensive refers to max(price)",
    "idx": 2295
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`production`)-[produced_in_0:produced_in]->(`t2`:`country`)\nWHERE `t1`.`country` = `t2`.`origin`\nAND (`t2`.`country` = 'USA' AND `t1`.`model_year` = 1981)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cars were released in the USA in 1981?",
    "evidence": "in the USA refers to country = 'USA'; in 1981 refers to model_year = 1981",
    "idx": 2296
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY CASE WHEN `t1`.`cylinders`=0 THEN NULL ELSE `t1`.`displacement` / `t1`.`cylinders` END IS NULL ASC, CASE WHEN `t1`.`cylinders`=0 THEN NULL ELSE `t1`.`displacement` / `t1`.`cylinders` END DESC \nRETURN `t2`.`price` AS `price`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the car with the highest sweep volume?",
    "evidence": "cost refers to price; the highest sweep volume refers to max(divide(displacement, cylinders))",
    "idx": 2297
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t3`.`country` = 'Japan')\nORDER BY `t1`.`horsepower` IS NULL ASC, `t1`.`horsepower` DESC \nRETURN `t1`.`car_name` AS `car_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the fastest car made by Japan?",
    "evidence": "the fastest refers to max(horsepower); made by Japan refers to country = 'Japan'; name of the car refers to car_name",
    "idx": 2298
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'ford maverick')\nRETURN COUNT(`t2`.`model_year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times was Ford Maverick introduced to the market?",
    "evidence": "Ford Maverick refers to car_name = 'ford maverick';",
    "idx": 2299
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nORDER BY `t1`.`mpg` IS NULL ASC, `t1`.`mpg` DESC \nRETURN `t3`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country produced the most fuel-efficient car?",
    "evidence": "the most fuel-efficient refers to max(mpg)",
    "idx": 2300
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` =~ '(?i)(?s)dodge.*')\nORDER BY `t2`.`price` IS NULL DESC, `t2`.`price`  \nRETURN `t1`.`car_name` AS `car_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which Dodge car is the cheapest?",
    "evidence": "Dodge car refers to car_name LIKE 'dodge%'; the cheapest refers to min(price); name of the car refers to car_name",
    "idx": 2301
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`displacement` > 400 AND `t2`.`price` > 30000)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cars with an engine displacement of no less than 400 cubic millimeter, how many cars cost at least 30,000?",
    "evidence": "engine displacement of no less than 400 cubic millimeter refers to displacement > 400; cost at least 30,000 refers to price > 30000",
    "idx": 2302
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'peugeot 505s turbo diesel')\nRETURN `t2`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the Peugeot 505s Turbo Diesel?",
    "evidence": "cost refers to price; Peugeot 505s Turbo Diesel refers to car_name = 'peugeot 505s turbo diesel'",
    "idx": 2303
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (CASE WHEN `t1`.`cylinders`=0 THEN NULL ELSE `t1`.`displacement` / `t1`.`cylinders` END > 30)\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t3`.`country` = 'Japan' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of cars that was produced by Japan among those that have a sweep volume of no less than 30?",
    "evidence": "produced by Japan refers to country = 'Japan'; a sweep volume of no less than 30 refers to divide(displacement, cylinders) > 30; percentage = divide(count(ID where country = 'Japan'), count(ID)) * 100% where divide(displacement, cylinders) > 30",
    "idx": 2304
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`model_year` = 1975)\nRETURN `t1`.`car_name` AS `car_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of the cars with model year 1975.",
    "evidence": "name of the car refers to car_name; model year 1975 refers to model_year = 1975",
    "idx": 2305
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_price_0:has_price]->(`t1`:`price`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t3`.`country` = 'Europe')\nRETURN avg(`t1`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average price of cars from Europe.",
    "evidence": "from Europe refers to country = 'Europe'; average price = avg(price) where country = 'Europe'",
    "idx": 2306
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`id` = 15)\nRETURN `t2`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the price of the car ID 15?",
    "evidence": "",
    "idx": 2307
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`model_year` = 1973 AND `t1`.`horsepower` < 100)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cars produced in year 1973, how many of the cars have horsepower less than 100?",
    "evidence": "produced in year 1973 refers to model_year = 1973; have horsepower less than 100 refers to horsepower < 100",
    "idx": 2308
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t1`.`weight` IS NULL ASC, `t1`.`weight` DESC \nRETURN `t2`.`model_year` AS `model_year`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the model year of the heaviest car.",
    "evidence": "the heaviest refers to max(weight)",
    "idx": 2309
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'subaru dl')\nRETURN `t1`.`horsepower` AS `horsepower`, `t2`.`model_year` AS `model_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the horsepower and model year of the car named Subaru Dl?",
    "evidence": "the car named Subaru Dl refers to car_name = 'subaru dl'",
    "idx": 2310
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`price` = 20000)\nRETURN `t1`.`car_name` AS `car_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the cars worth 20000?",
    "evidence": "name of the car refers to car_name; worth 20000 refers to price = 20000",
    "idx": 2311
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_price_0:has_price]->(`t1`:`price`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t3`.`country` = 'USA' AND `t1`.`price` > 40000)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cars worth greater than 40000 were from the USA?",
    "evidence": "worth greater than 40000 refers to price > 40000; from the USA refers to country = 'USA'",
    "idx": 2312
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "CALL(*) {\nMATCH (`price_sub0`:`price`)\nRETURN avg(`price_sub0`.`price`) * 85 AS `_col_0`  \n}\nMATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`price` * 100 > `_col_0`)\nRETURN `t1`.`car_name` AS `car_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the car's name with a price worth greater than 85% of the average price of all cars.",
    "evidence": "car's name refers to car_name; a price worth greater than 85% of the average price of all cars refers to price > multiply(avg(price), 0.85)",
    "idx": 2313
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`horsepower` = 130)\nRETURN sum(CASE  WHEN `t2`.`model_year` = 1970 THEN 1 ELSE 0 END) - sum(CASE  WHEN `t2`.`model_year` = 1976 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference between the number of cars that has a horsepower of 130 with the model year 1970 and model year 1976",
    "evidence": "a horsepower of 130 refers to horsepower = 130; difference = subtract(count(ID where model_year = 1970), count(ID where model_year = 1976)) where horsepower = 130",
    "idx": 2314
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`production`)-[produced_in_0:produced_in]->(`t2`:`country`)\nWHERE `t1`.`country` = `t2`.`origin`\nAND (`t2`.`country` = 'Japan' AND `t1`.`model_year` = 1979)\nRETURN `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cars from Asia, list the IDs of cars that were introduced in 1979.",
    "evidence": "from Asia refers to country = 'Japan'; introduced in 1979 refers to model_year = 1979",
    "idx": 2315
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nORDER BY `t1`.`mpg` IS NULL DESC, `t1`.`mpg`  \nRETURN `t3`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country produced the car with the lowest mileage per gallon?",
    "evidence": "the lowest mileage per gallon refers to min(mpg)",
    "idx": 2316
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t1`.`weight` IS NULL ASC, `t1`.`weight` DESC \nRETURN `t1`.`car_name` AS `car_name`, `t1`.`model` AS `model`, CASE WHEN `t1`.`cylinders`=0 THEN NULL ELSE `t1`.`displacement` / `t1`.`cylinders` END AS `_col_2`, `t2`.`model_year` AS `model_year`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name, model, sweep volume, and introduced year of the car with the best crash protection.",
    "evidence": "car's name refers to car_name; sweep volume = divide(displacement, cylinders); introduced year refers to model_year; the best crash protection refers to max(weight)",
    "idx": 2317
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t2`.`model_year` = 1977 AND `t3`.`country` = 'Europe')\nRETURN `t1`.`car_name` AS `car_name`, `t1`.`horsepower` AS `horsepower`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cars introduced in 1977, provide the names and the horse powers of cars from Europe.",
    "evidence": "introduced in 1977 refers to model_year = 1977; car's name refers to car_name; from Europe refers to country = 'Europe'",
    "idx": 2318
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t1`.`car_name` AS `car_name`, `t1`.`model` AS `model`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name and model of the car with the highest price.",
    "evidence": "car's name refers to car_name; the highest price refers to max(price)",
    "idx": 2319
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'chevrolet bel air')\nRETURN `t2`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the price of a Chevrolet Bel Air?",
    "evidence": "Chevrolet Bel Air refers to car_name = 'chevrolet bel air'",
    "idx": 2320
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_price_0:has_price]->(`t1`:`price`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t3`.`country` = 'Japan')\nRETURN avg(`t1`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average price per car produced in Japan?",
    "evidence": "produced in Japan refers to country = 'Japan'; average price per car = avg(price) where country = 'Japan'",
    "idx": 2321
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_price_0:has_price]->(`t1`:`price`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nORDER BY `t1`.`price` IS NULL DESC, `t1`.`price`  \nRETURN `t3`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country produced the car with the lowest price?",
    "evidence": "the lowest price refers to min(price)",
    "idx": 2322
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t2`.`model_year` = 1975)\nORDER BY `t1`.`cylinders` IS NULL ASC, `t1`.`cylinders` DESC \nRETURN `t1`.`id` AS `id`, `t1`.`car_name` AS `car_name`, `t3`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cars produced in 1975, provide IDs, names, and producing countries of the cars with the maximum number of cylinders.",
    "evidence": "produced in 1975 refers to model_year = 1975; names refers to car_name; producing countries refers to country; the maximum number of cylinders refers to max(cylinders)",
    "idx": 2323
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[has_price_0:has_price]->(`t3`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`id` = `t2`.`id`\nORDER BY `t3`.`price` IS NULL DESC, `t3`.`price`  \nRETURN `t1`.`acceleration` AS `acceleration`, `t1`.`cylinders` AS `cylinders`, `t2`.`model_year` AS `model_year`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which car is the cheapest? Provide its acceleration, number of cylinders, and producing year.",
    "evidence": "the cheapest refers to min(price); number of cylinders refers to cylinders; producing year refers to model_year",
    "idx": 2324
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`data`)-[has_price_0:has_price]->(`t1`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`model` = 82 AND `t2`.`mpg` > 30)\nRETURN `t2`.`car_name` AS `car_name`, `t1`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names and prices of the cars with model 82 and mileage per gallon of greater than 30.",
    "evidence": "car's name refers to car_name; model 82 refers to model = 82; mileage per gallon of greater than 30 refers to mpg > 30",
    "idx": 2325
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'ford maverick')\nRETURN COUNT(DISTINCT `t2`.`model_year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many models of Ford Maverick were produced?",
    "evidence": "Ford Maverick refers to car_name = 'ford maverick'",
    "idx": 2326
  }
]