[
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`tags`:`tags`)\nWHERE `tags`.`tag` =~ '(?i)(?s)1980s'\nRETURN COUNT(`tags`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many releases are tagged \"1980s\"?",
    "evidence": "tag = '1980s';",
    "idx": 1439
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`torrents`:`torrents`)\nWHERE `torrents`.`groupname` =~ '(?i)(?s)city funk'\nRETURN `torrents`.`totalsnatched` AS `totalsnatched`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times has the release \"city funk\" been downloaded?",
    "evidence": "groupName = 'city funk'; downloaded refers to totalSnatched;",
    "idx": 1440
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`torrents`:`torrents`)\nWHERE `torrents`.`totalsnatched` > 20000\nRETURN `torrents`.`groupname` AS `groupname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the releases that have been downloaded for more than 20000 times.",
    "evidence": "releases refer to groupName; downloaded for more than 20000 times refers to totalSnatched > 20000;",
    "idx": 1441
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`groupname` = 'sugarhill gang')\nRETURN `t2`.`tag` AS `tag`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the tags of the release \"sugarhill gang\"?",
    "evidence": "release \"sugarhill gang\" refers to groupName = 'sugarhill gang';",
    "idx": 1442
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`groupname` = 'city funk')\nRETURN COUNT(`t2`.`tag`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many tags does the release \"city funk\" have？",
    "evidence": "release \"city funk\" refers to groupName = 'city funk';",
    "idx": 1443
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = '1980s')\nRETURN `t1`.`groupname` AS `groupname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of all the releases with the tag \"1980s\".",
    "evidence": "titles refer to groupName;",
    "idx": 1444
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = '1980s')\nORDER BY `t1`.`totalsnatched` IS NULL ASC, `t1`.`totalsnatched` DESC \nRETURN `t1`.`groupname` AS `groupname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the releases with the tag \"1980s\", which one of them is the most downloaded? Please give its title.",
    "evidence": "title refers to groupName; the most downloaded refers to MAX(totalSnatched);",
    "idx": 1445
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = 'pop' AND `t1`.`artist` = 'michael jackson')\nRETURN COUNT(`t1`.`groupname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many releases by the artist michael jackson are tagged \"pop\"?",
    "evidence": "tag = 'pop';",
    "idx": 1446
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = 'pop' AND `t1`.`releasetype` = 'album' AND `t1`.`groupyear` = 2000)\nRETURN COUNT(`t1`.`groupname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the releases that were released in 2000, how many of them were released as an album and tagged \"pop\"?",
    "evidence": "groupYear = 2000; album refers to releaseType;",
    "idx": 1447
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = '1980s')\nRETURN CASE WHEN COUNT(`t2`.`tag`)=0 THEN NULL ELSE toFloat(sum(`t1`.`totalsnatched`)) / COUNT(`t2`.`tag`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the average download times for the a release tagged \"1980s\"?",
    "evidence": "AVG(totalSnatched where tag = '1980s');",
    "idx": 1448
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`torrents`:`torrents`)\nORDER BY `torrents`.`totalsnatched` IS NULL ASC, `torrents`.`totalsnatched` DESC \nRETURN `torrents`.`groupname` AS `groupname`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the title of the top three releases with the highest number of downloads.",
    "evidence": "title refers to groupName; the highest number of downloads refers to MAX(totalSnatched);",
    "idx": 1449
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`torrents`:`torrents`)\nWHERE `torrents`.`groupyear` = 2012 AND `torrents`.`releasetype` =~ '(?i)(?s)Single'\nORDER BY `torrents`.`totalsnatched` IS NULL ASC, `torrents`.`totalsnatched` DESC \nRETURN `torrents`.`artist` AS `artist`, `torrents`.`groupname` AS `groupname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of the artist who released his or her Single-Table in 2012 with the highest number of downloads. Name the Single-Table title as well.",
    "evidence": "title refers to groupName; the highest number of downloads refers to MAX(totalSnatched where groupYear = 2012 and releaseType = 'single');",
    "idx": 1450
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`torrents`:`torrents`)\nWHERE `torrents`.`artist` =~ '(?i)(?s)2Pac' AND `torrents`.`releasetype` =~ '(?i)(?s)Single' AND `torrents`.`groupyear` >= 2001 AND `torrents`.`groupyear` <= 2013\nRETURN avg(`torrents`.`totalsnatched`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the average number of downloads for Single-Tables released by '2Pac' between 2001 and 2013.",
    "evidence": "2Pac is an artist; releaseType = 'single'; between 2001 and 2013 refers to groupYear between 2001 and 2013; average number of downloads = AVG(totalSnatched);",
    "idx": 1453
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`torrents`:`torrents`)\nWHERE `torrents`.`groupyear` = 2016 AND `torrents`.`releasetype` =~ '(?i)(?s)bootleg'\nWITH `torrents`.`artist` AS _groupby_col_0, COUNT(`torrents`.`releasetype`) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `artist`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of artists who released at least two bootlegs in 2016.",
    "evidence": "at least two bootlegs refer to COUNT(releaseType = 'bootleg')≥ 2; groupYear = 2016;",
    "idx": 1455
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`torrents`:`torrents`)\nWHERE `torrents`.`totalsnatched` >= 20 AND `torrents`.`releasetype` =~ '(?i)(?s)single' AND `torrents`.`id` >= 10 AND `torrents`.`id` <= 20\nRETURN `torrents`.`groupname` AS `groupname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicates groups with id from 10 to 20 with singles downloaded at least 20.",
    "evidence": "releaseType = 'single'; downloaded at least 20 refers to totalSnatched ≥ 20; id from 10 to 20 refer to id between 10 and 20; groups refer to groupName;",
    "idx": 1457
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = 'disco' AND `t1`.`groupyear` >= 1980 AND `t1`.`groupyear` <= 1982)\nRETURN `t1`.`artist` AS `artist`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the artists from 1980 to 1982. Which artist was tagged as \"disco\"?",
    "evidence": "from 1980 to 1982 refers to groupYear between 1980 and 1982; tag = 'disco';",
    "idx": 1458
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = 'funk' AND `t1`.`groupyear` = 1980 AND `t1`.`totalsnatched` <= 100)\nRETURN `t1`.`artist` AS `artist`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of artists who had no more than 100 downloads and are tagged \"funk\" in 1980.",
    "evidence": "no more than 100 downloads refer to totalSnatched ≤ 100; groupYear = 1980; tag = 'funk';",
    "idx": 1459
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = 'funk' AND `t1`.`groupyear` = 1980 AND `t1`.`id` >= 10 AND `t1`.`id` <= 30)\nRETURN `t1`.`artist` AS `artist`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the artists with the id from 10 to 30. Which artist released the product with the tag \"funk\" in 1980?",
    "evidence": "id from 10 to 30 refers to id between 10 and 30; groupYear = 1980;",
    "idx": 1460
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = 'jazz' AND `t1`.`groupyear` >= 1982)\nORDER BY `t1`.`totalsnatched` IS NULL ASC, `t1`.`totalsnatched` DESC \nRETURN `t1`.`groupname` AS `groupname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the group name has the most downloaded that have released jazz genres from 1982 or later.",
    "evidence": "the most downloaded refers to MAX(totalSnatched); tag = 'jazz'; from 1982 or later refers to groupYear ≥ 1982;",
    "idx": 1461
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`id` = 16)\nRETURN `t2`.`tag` AS `tag`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which artist has id \"16\"? Provide her or his tag genre.",
    "evidence": "FALSE;",
    "idx": 1462
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = 'dance' AND `t1`.`groupyear` >= 1980 AND `t1`.`groupyear` <= 1985 AND `t1`.`releasetype` =~ '(?i)(?s)album' OR `t1`.`releasetype` =~ '(?i)(?s)mixtape')\nRETURN COUNT(`t1`.`artist`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of artists who have released albums and mixtape from 1980 to 1985 in \"dance\" genre.",
    "evidence": "albums and mixtape refer to releaseType; from 1980 to 1985 refers to groupYear between 1980 and 1985; tag = 'dance';",
    "idx": 1464
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` = 'soul' AND `t1`.`groupyear` >= 1979 AND `t1`.`groupyear` <= 1981 AND `t1`.`releasetype` =~ '(?i)(?s)single')\nRETURN COUNT(`t2`.`tag`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many singles were released between 1979 and 1981 labeled as \"soul\"?",
    "evidence": "releaseType = 'single'; between 1979 and 1981 refers to groupYear between 1979 and 1981; tag = 'soul';",
    "idx": 1465
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`groupyear` >= 2000 AND `t1`.`groupyear` <= 2010 AND `t1`.`artist` =~ '(?i)(?s)kurtis blow')\nRETURN `t2`.`tag` AS `tag`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all tags of kurtis blow from 2000 to 2010.",
    "evidence": "kurtis blow is an artist; from 2000 to 2010 refers to groupYear between 2000 and 2010;",
    "idx": 1469
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`groupyear` = 2005 AND `t2`.`tag` =~ '(?i)(?s)jazz')\nRETURN `t1`.`groupname` AS `groupname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all release titles whose tag is jazz in 2005.",
    "evidence": "release titles refer to groupName; groupYear = 2005;",
    "idx": 1471
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`lendingcategory` = 'IDA' AND `country`.`othergroups` = 'HIPC'\nRETURN COUNT(`country`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the countries in the group of Heavily Indebted Poor Countries, how many of them are under the lending category of the International Development Associations?",
    "evidence": "group of Heavily Indebted Poor Countries is OtherGroups = 'HIPC'; International Development Associations refers to lendingcategory = 'IDA'",
    "idx": 1474
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`lendingcategory` = 'IDA'\nRETURN `country`.`shortname` AS `shortname`, `country`.`externaldebtreportingstatus` AS `externaldebtreportingstatus`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the countries under the lending category of the International Development Associations and have a external debt reporting finished by estimation.",
    "evidence": "countries refer to the ShortName; International Development Associations refers to lendingcategory = 'IDA'; have a external debt reporting finished by estimation refers to ExternalDebtReportingStatus = 'Estimate'",
    "idx": 1475
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`shortname` = 'Aruba' AND `t2`.`seriescode` = 'SM.POP.TOTL')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the description of the series code SM.POP.TOTL for Aruba?",
    "evidence": "Aruba is the name of the country where ShortName = 'Aruba'",
    "idx": 1476
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`region` = 'Latin America & Caribbean' AND `t2`.`seriescode` = 'SM.POP.TOTL')\nRETURN `t1`.`shortname` AS `shortname`, `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the countries in Latin America & Caribbean with a note on the series code SM.POP.TOTL.",
    "evidence": "Countries refer to the ShortName; Latin America & Caribbean is the name of the region",
    "idx": 1477
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`seriescode` = 'SM.POP.TOTL' AND `t1`.`incomegroup` = 'Low income')\nRETURN COUNT(`t1`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the countries with note on the series code SM.POP.TOTL, how many of them are in the low-income group?",
    "evidence": "countries refer to Countrycode; low-income group refers to incomegroup = 'Low income'; with notes refers to description IS NOT NULL; series code SM.POP.TOTL refers to Seriescode = 'SM.POP.TOTL'",
    "idx": 1478
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`lendingcategory` = 'IDA' AND `t2`.`seriescode` = 'SM.POP.TOTL')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the descriptions of the series code SM.POP.TOTL for all the countries that are under the lending category of the International Development Associations.",
    "evidence": "Countries are the Countrycode; International Development Associations refers to lendingcategory = 'IDA'",
    "idx": 1479
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`lendingcategory` = 'IDA' AND `t2`.`seriescode` = 'SM.POP.TOTL' AND `t1`.`incomegroup` = 'Low income')\nRETURN COUNT(`t1`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many low-income countries under the lending category of the International Development Associations have a note on the series code SM.POP.TOTL?",
    "evidence": "low-income countries are where the incomegroup = Low income",
    "idx": 1480
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`incomegroup` = 'High income: OECD' AND `t1`.`currencyunit` = 'Euro' AND `t2`.`seriescode` = 'SP.DYN.AMRT.FE')\nRETURN COUNT(`t1`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the countries in the High income: OECD group whose currency unit is Euro, how many of them have a note on the series code SP.DYN.AMRT.FE?",
    "evidence": "countries refer to Countrycode; in the high income refers to incomegroup = 'High'; with notes refers to description IS NOT NULL; series code SP.DYN.AMRT.FE refers to Seriescode = 'SP.DYN.AMRT.FE'",
    "idx": 1481
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Estimates are derived FROM data on foreign-born population.' AND `t2`.`seriescode` = 'SM.POP.TOTL')\nRETURN `t1`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the long name of the country with the description \"Estimates are derived from data on foreign-born population.\" on the series code SM.POP.TOTL?",
    "evidence": "",
    "idx": 1482
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`shortname` = 'Aruba' AND `t2`.`seriescode` = 'AG.LND.FRST.K2' AND `t2`.`year` = 'YR1990')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the description of the footnote on the series code AG.LND.FRST.K2 in 1990 for Aruba?",
    "evidence": "Year = 1990; Aruba is the name of country where ShortName = 'Aruba'",
    "idx": 1483
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`shortname` = 'Aruba' AND `t2`.`seriescode` = 'AG.LND.FRST.K2')\nRETURN `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On which years did Aruba got a footnote on the series code AG.LND.FRST.K2?",
    "evidence": "Aruba is the name of country where ShortName = 'Aruba'",
    "idx": 1484
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Data are classified as official aid.' AND `t2`.`seriescode` = 'DC.DAC.AUSL.CD' AND `t2`.`year` =~ '(?i)(?s).*2002.*')\nRETURN `t1`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the countries that got the footnote \"Data are classified as official aid.\" on the series code DC.DAC.AUSL.CD in 2002.",
    "evidence": "countries are the Countrycode; footnote refers to Description = 'Data are classified as official aid'",
    "idx": 1485
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`shortname` = 'Aruba' AND `t2`.`year` = 'YR2002')\nRETURN COUNT(`t2`.`seriescode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many footnotes did Aruba got on different series code in the year 2002?",
    "evidence": "Aruba is the name of country where ShortName = 'Aruba'",
    "idx": 1486
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`shortname` = 'Aruba' AND `t2`.`seriescode` = 'BX.KLT.DINV.CD.WD')\nRETURN COUNT(`t2`.`year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how many consecutive years did Aruba get a footnote on the series code BX.KLT.DINV.CD.WD?",
    "evidence": "Aruba is the name of country where ShortName = 'Aruba'",
    "idx": 1487
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`alpha2code` = '1A' AND `t2`.`indicatorname` =~ '(?i)(?s)adolescent fertility rate.*')\nRETURN avg(`t2`.`value`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average adolescent fertility rate of the country whose Alpha2Code is 1A over the years this indicator was calculated.",
    "evidence": "the average adolescent fertility rate is DIVIDE(SUM(value), SUM(IndicatorName like 'adolescent fertility rate%'))",
    "idx": 1488
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "CALL(*) {\nMATCH (`indicators_sub0`:`indicators`)\nWHERE `indicators_sub0`.`indicatorname` =~ '(?i)(?s)Adolescent fertility rate.*'\nRETURN `indicators_sub0`.`value` AS `value` ORDER BY `value` IS NULL ASC, `value` DESC \nLIMIT 1\n}\nMATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`value` = `value`)\nRETURN DISTINCT `t1`.`specialnotes` AS `specialnotes`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the special notes for the country whose average adolescent fertility rate is the highest?",
    "evidence": "the average adolescent fertility rate is DIVIDE(SUM(value), SUM(IndicatorName like 'adolescent fertility rate%')); MAX(average adolescent fertility rate)",
    "idx": 1489
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`region` = 'East Asia & Pacific' AND `country`.`incomegroup` = 'High income: nonOECD'\nRETURN `country`.`countrycode` AS `countrycode`, `country`.`alpha2code` AS `alpha2code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the East Asia & Pacific countries which are under the High income: nonOECD group. Please include their alpha code.",
    "evidence": "the East Asia & Pacific countries are where Region = 'East Asia & Pacific'; High income: nonOECD group is where IncomeGroup = 'High income: nonOECD'",
    "idx": 1490
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`latesttradedata` = 2013 AND `country`.`latestwaterwithdrawaldata` = 2013\nRETURN `country`.`longname` AS `longname`, `country`.`alpha2code` AS `alpha2code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which country's latest trade data and latest water withdrawal data were both updated in the year 2013? Give its long name and Alpha 2 code.",
    "evidence": "",
    "idx": 1491
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`countryname` = 'Algeria' AND `indicators`.`year` > 1974 AND `indicators`.`year` < 1981 AND `indicators`.`indicatorname` = 'Adjusted net enrolment rate, primary, both sexes (%)'\nRETURN CASE WHEN COUNT(`indicators`.`countrycode`)=0 THEN NULL ELSE toFloat(sum(`indicators`.`value`)) / COUNT(`indicators`.`countrycode`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average value of Adjusted net enrolment rate, primary, both sexes (%) indicator in Algeria from 1975 to 1980?",
    "evidence": "the average value of Adjusted net enrolment rate, primary, both sexes (%) is DIVIDE(SUM(Value), SUM(IndicatorName = 'Adjusted net enrolment rate, primary, both sexes (%)')); Year BETWEEN 1975 AND 1980; Algeria is the name of country where CountryName = 'Algeria'",
    "idx": 1492
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`series`:`series`)\nWHERE `series`.`topic` = 'Economic Policy & Debt: Balance of payments: Capital & financial account'\nRETURN `series`.`indicatorname` AS `indicatorname`, `series`.`aggregationmethod` AS `aggregationmethod`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the Indicator names and aggregation methods when the topic is Economic Policy & Debt: Balance of payments: Capital & financial account?",
    "evidence": "",
    "idx": 1493
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`series`:`series`)\nWHERE `series`.`topic` = 'Environment: Emissions' AND `series`.`licensetype` = 'Restricted'\nRETURN `series`.`seriescode` AS `seriescode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the series codes in which the topic is about Environment: Emissions and the license type is restricted. Please include their alpha code.",
    "evidence": "",
    "idx": 1494
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`region` = 'Middle East & North Africa' AND `t1`.`indicatorname` = 'CO2 emissions FROM gaseous fuel consumption (kt)' AND `t1`.`year` = 1970 AND `t1`.`value` > 600)\nRETURN COUNT(`t2`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 1970, how many Middle Eastern & North African countries whose value for CO2 emissions from gaseous fuel consumption (kt) indicator is more than 600?",
    "evidence": "Year = 1970; Middle East & North Africa is the name of the region where Region = 'Middle East & North Africa'; CO2 emissions from gaseous fuel consumption (kt) is the name of indicator where IndicatorName = 'CO2 emissions from gaseous fuel consumption (kt)'",
    "idx": 1495
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`region` = 'Latin America & Caribbean' AND `t1`.`indicatorname` = 'CO2 emissions (kt)' AND `t1`.`year` > 1965 AND `t1`.`year` < 1980)\nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`, `t1`.`year` AS `year`, `t1`.`value` AS `value` ORDER BY `t1`.`value` IS NULL ASC, `t1`.`value` DESC \nLIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the top 3 Latin American & Caribbean countries with the highest average value in \"CO2 emissions (kt)\" indicator since 1965. Give their highest value and in what year.",
    "evidence": "Latin American & Caribbean countries is the name of the region where Region in ('Latin America' , 'Caribbean'); CO2 emissions from gaseous fuel consumption (kt) is the name of indicator where IndicatorName = 'CO2 emissions from gaseous fuel consumption (kt)'; average value in CO2 emissions (kt) = DIVIDE(SUM(Value), SUM(IndicatorName = 'CO2 emissions from gaseous fuel consumption (kt)')); Year > 1965",
    "idx": 1496
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`series`)-[has_note_0:has_note]->(`t2`:`seriesnotes`)\nWHERE `t1`.`seriescode` = `t2`.`seriescode`\nAND (`t1`.`seriescode` = 'SP.DYN.TO65.MA.ZS' AND `t1`.`topic` = 'Health: Mortality' AND `t2`.`year` = 'YR1967')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the series note description of the series \"SP.DYN.TO65.MA.ZS\" which covers the topic \"Health: Mortality\" in 1967?",
    "evidence": "in 1967 refers to Year = 'YR1967'",
    "idx": 1497
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`indicatorname` = 'Net bilateral aid flows FROM DAC donors, Sweden (current US$)' AND `t1`.`year` = 1970 AND `t1`.`value` = 570000)\nRETURN `t2`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the short name of the country in which the \"Net bilateral aid flows from DAC donors, Sweden (current US$)\" indicator hit the 570,000 value in 1970?",
    "evidence": "Net bilateral aid flows from DAC donors, Sweden (current US$) is the name of indicator where IndicatorName = 'Net bilateral aid flows from DAC donors, Sweden (current US$)'; Year = 1970; Value > 570,000",
    "idx": 1500
  }
]