[
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`goalies`)-[player_profile_0:player_profile]->(`t2`:`master`)\nMATCH (`t1`:`goalies`)-[played_for_0:played_for]->(`t3`:`teams`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND `t1`.`tmid` = `t3`.`tmid` AND `t1`.`year` = `t3`.`year`\nAND (`t3`.`name` = 'Haileybury Hockey Club' AND NOT `t2`.`hofid` IS NULL)\nRETURN COUNT(DISTINCT `t1`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Haileybury Hockey Club goalies became a hall of famer?",
    "evidence": "hall of famers refers to hofID where playerID is not NULL;",
    "idx": 5936
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE NOT `master`.`playerid` IS NULL AND NOT `master`.`coachid` IS NULL\nRETURN `master`.`playerid` AS `playerid`, `master`.`coachid` AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the player ID and coach ID of person who have become coach after retirement.",
    "evidence": "after retirement means playerID Iis not NULL and coachID is not NULL;",
    "idx": 5937
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWITH `master`.`playerid` AS _groupby_col_0, avg(toFloat(`master`.`height`)) AS _groupby_col_1\nWHERE _groupby_col_1 = 75\nRETURN DISTINCT _groupby_col_0 AS `playerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the player ID of player with average height of 75.",
    "evidence": "average height of 75 refers to AVG(height) = 75;",
    "idx": 5938
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nORDER BY `master`.`weight` IS NULL ASC, `master`.`weight` DESC \nRETURN `master`.`playerid` AS `playerid`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the heaviest player? State player ID of 5 heaviest players.",
    "evidence": "5 heaviest players refer to MAX(weight) limit to 5 playerID;",
    "idx": 5939
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`birthcountry` = 'Finland'\nRETURN DISTINCT `master`.`firstname` AS `firstname`, `master`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of players origin from Finland?",
    "evidence": "origin from Finland refers to birthCountry = 'Finland';",
    "idx": 5940
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE NOT `master`.`deathyear` IS NULL AND NOT `master`.`playerid` IS NULL\nRETURN DISTINCT `master`.`playerid` AS `playerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down player ID of players who have passed away.",
    "evidence": "passed away means deathYear is not NULL;",
    "idx": 5941
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`master`)-[coach_profile_0:coach_profile]->(`t2`:`coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`year` > 2000)\nRETURN DISTINCT `t1`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the first name of coaches who still coach after year 2000.",
    "evidence": "after year 2000 refers to year>2000;",
    "idx": 5942
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardscoaches`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`year` = '1930')\nRETURN `t1`.`height` AS `height`, `t1`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the height and weight for coaches who have won awards in 1930?",
    "evidence": "year = 1930;",
    "idx": 5943
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`scoring`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`playerid` = 'aaltoan01')\nWITH `t1`.`birthyear` AS _groupby_col_0, sum(`t2`.`g`) AS _groupby_col_1, toFloat(CASE WHEN localdatetime.realtime() is not NULL THEN apoc.temporal.format(localdatetime.realtime(),'yyyy') ELSE NULL END) - toFloat(`t1`.`birthyear`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the total goals for player with player ID aaltoan01 and how old is this person?",
    "evidence": "total goals refer to SUM(G); how old = SUBTRACT(YEAR(CURDATE, birthYear);",
    "idx": 5944
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`awardscoaches`)\nMATCH (`t1`:`master`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t1`.`playerid` IS NULL)\nRETURN DISTINCT `t2`.`coachid` AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Is there any coach who has not been a player before but has won award? State the ID.",
    "evidence": "coach who has not been a player means playerID is NULL and coachID is not NULL;",
    "idx": 5945
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`pos` =~ '(?i)(?s).*L.*' AND `master`.`weight` > '200' AND NOT `master`.`playerid` IS NULL AND `master`.`pos` = 'L'\nRETURN DISTINCT `master`.`playerid` AS `playerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which player ID are left winger and weight more than 200?",
    "evidence": "left winger refers to pos = 'L'; weight>200",
    "idx": 5946
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`scoring`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`birthcountry` = 'USA')\nRETURN COUNT(`t2`.`gp`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of game played for players from USA?",
    "evidence": "game played refers to GP; from USA refers to birthCountry = 'USA';",
    "idx": 5947
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`coaches`)\nMATCH (`t2`:`teams`)\nWHERE `t2`.`tmid` = `t1`.`tmid`\nAND (`t2`.`tmid` = 'ANA')\nWITH `t1`.`coachid` AS _groupby_col_0, sum(`t2`.`pts`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total points scored by team ID ANA and list down the coashes of the team.",
    "evidence": "points scored refers to Pts; team ID refers to tmID;",
    "idx": 5948
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`scoring`)-[played_for_0:played_for]->(`t1`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`divid` = 'EW' AND `t1`.`tmid` = 'BIR' AND `t1`.`year` = 1976)\nRETURN sum(`t2`.`g`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 1976, how many goals achieved by team 'BIR' in Division 'EW'?",
    "evidence": "year = 1976; BIR refers to tmID; Division 'EW' refers to divID = 'EW'; goals = G;",
    "idx": 5949
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`scoring`)-[played_for_0:played_for]->(`t1`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`tmid` = 'BOS' AND `t1`.`year` = 2010)\nRETURN sum(`t1`.`l`) AS `_col_0`, sum(`t2`.`a`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2010, how many loses made by team 'BOS' and how many assists were made by the players?",
    "evidence": "year = 2010; BOS refers to tmID; loses refer to L; assists refer to A;",
    "idx": 5950
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "CALL (*) {\nMATCH (`teams_sub0`:`teams`)\nWHERE `teams_sub0`.`year` = 2000\nORDER BY CASE WHEN (`teams_sub0`.`w` + `teams_sub0`.`l`)=0 THEN NULL ELSE `teams_sub0`.`w` / (`teams_sub0`.`w` + `teams_sub0`.`l`) END IS NULL ASC, CASE WHEN (`teams_sub0`.`w` + `teams_sub0`.`l`)=0 THEN NULL ELSE `teams_sub0`.`w` / (`teams_sub0`.`w` + `teams_sub0`.`l`) END DESC \nRETURN `teams_sub0`.`year` AS `year`, `teams_sub0`.`tmid` AS `tmid`  LIMIT 1\n}\nMATCH (`t2`:`scoring`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND `t2`.`tmid` = `tmid` AND `t2`.`year` = `year`\nRETURN DISTINCT `tmid`, `t1`.`birthcountry` AS `birthcountry`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team has the highest winning rate in year 2000? State the team ID and list down the birth country of it's players.",
    "evidence": "MAX(DIVIDE(COUNT(W), SUM(COUNT(W), (COUNT (L)) where year = 2000;",
    "idx": 5951
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t2`.`language` = 'English' AND `t2`.`isofficial` = 'T')\nRETURN `t1`.`name` AS `name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List any five countries which use English as an official language.",
    "evidence": "English as an official language refers to `Language` = 'English' AND IsOfficial = 'T';",
    "idx": 5953
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`district` = 'Karnataka'\nWITH `city`.`id` AS _groupby_col_0, avg(`city`.`population`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average population per city in Karnataka district.",
    "evidence": "average population = AVG(Population);",
    "idx": 5954
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`countrylanguage`:`countrylanguage`)\nWHERE `countrylanguage`.`countrycode` = 'USA'\nRETURN `countrylanguage`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the languages used in the USA.",
    "evidence": "USA refers to CountryCode = 'USA';",
    "idx": 5955
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`name` = 'Turkmenistan')\nRETURN `t2`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the languages used in Turkmenistan.",
    "evidence": "Turkmenistan is a name of country;",
    "idx": 5960
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nMATCH (`t3`:`city`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND `t1`.`code` = `t3`.`countrycode`\nAND (`t2`.`isofficial` = 'T')\nORDER BY `t1`.`lifeexpectancy` IS NULL ASC, `t1`.`lifeexpectancy` DESC \nRETURN `t1`.`name` AS `name`, `t1`.`capital` AS `capital`, `t2`.`language` AS `language`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name, capital city and its official language of the country with the highest life expectancy.",
    "evidence": "capital city refers to Capital; official language refers to IsOfficial = 'T'; highest life expectancy refers to MAX(LifeExpectancy);",
    "idx": 5961
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`continent` = 'Antarctica' AND `t2`.`isofficial` = 'T')\nRETURN `t1`.`name` AS `name`, `t2`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the countries and their official languages in Antarctica.",
    "evidence": "official language refers to IsOfficial = 'T'; Antarctica refers to Continent = 'Antarctica';",
    "idx": 5962
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`region` = 'Baltic Countries' AND `t2`.`percentage` > 80)\nRETURN `t2`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the languages used in Baltic Countries, provide the languages which are used by over 80%.\n\n",
    "evidence": "Baltic Countries refers to Region = 'Baltic Countries'; languages which are used by over 80% refers to Percentage > 80;",
    "idx": 5964
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`city`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nORDER BY `t2`.`population` IS NULL ASC, `t2`.`population` DESC \nRETURN `t2`.`name` AS `name`, `t1`.`code` AS `code`, `t1`.`lifeexpectancy` AS `lifeexpectancy`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name, located country, and life expectancy of the most populated city",
    "evidence": "most populated city refers to MAX(Population);",
    "idx": 5966
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nMATCH (`t3`:`city`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND `t1`.`code` = `t3`.`countrycode`\nORDER BY `t1`.`lifeexpectancy` IS NULL DESC, `t1`.`lifeexpectancy`  \nRETURN `t1`.`capital` AS `capital`, `t2`.`language` AS `language`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the capital city and languages used in the country with the shortest life expectancy.",
    "evidence": "capital city refers to Capital; shortest life expectancy refers to MIN(LifeExpectancy);",
    "idx": 5967
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nMATCH (`t3`:`city`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND `t1`.`code` = `t3`.`countrycode`\nAND (`t2`.`isofficial` = 'T')\nORDER BY `t1`.`surfacearea` IS NULL DESC, `t1`.`surfacearea`  \nRETURN `t1`.`name` AS `name`, `t1`.`population` AS `population`, `t1`.`capital` AS `capital`, `t2`.`language` AS `language`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the country, population, capital city, and official language of the country with the smallest surface area.",
    "evidence": "capital city refers to Capital; official language refers to IsOfficial = 'T'; smallest surface area refers to MIN(SurfaceArea);",
    "idx": 5968
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`city`:`city`)\nORDER BY `city`.`population` IS NULL DESC, `city`.`population`  \nRETURN `city`.`district` AS `district`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the district name of the city with the smallest population.",
    "evidence": "smallest population refers to MIN(Population);",
    "idx": 5970
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`city`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`lifeexpectancy` = 66.4)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the cities that belong to the country with a life expectancy of 66.4.",
    "evidence": "",
    "idx": 5974
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t2`.`language` = 'English')\nORDER BY `t2`.`percentage` IS NULL DESC, `t2`.`percentage`  \nRETURN `t1`.`headofstate` AS `headofstate`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the head of the state of the country with the lowest percentage use of English as their language.",
    "evidence": "head of the state refers to HeadOfState; lowest percentage use of English as their language refers to MIN(Percentage WHERE `Language` = 'English');",
    "idx": 5975
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`population` < 8000)\nRETURN `t2`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the languages of the countries that have population below 8000.",
    "evidence": "population below 8000 refers to Population < 8000;",
    "idx": 5977
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`city`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`localname` = 'Hajastan')\nRETURN `t2`.`name` AS `name`, `t2`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the cities and district names that belong to the country with Hajastan as its local name.",
    "evidence": "",
    "idx": 5979
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`name` = 'Belize')\nRETURN `t2`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the language used by the people of Belize.",
    "evidence": "Belize is a name of country;",
    "idx": 5981
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`city`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`headofstate` = 'Adolf Ogi')\nRETURN `t2`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the districts belong to the country headed by Adolf Ogi.",
    "evidence": "headed by Adolf Ogi refers to HeadOfState = 'Adolf Ogi';",
    "idx": 5982
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t2`.`language` = 'English')\nRETURN COUNT(`t1`.`governmentform` = 'Republic') - COUNT(`t1`.`governmentform` = 'ConstitutionalMonarchy') AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In English speaking countries, provide the difference between the number of countries with republic and constitutional monarchy as its government form.",
    "evidence": "English speaking refers to Language = 'English' ; difference = SUBTRACT(COUNT(Language = 'English' WHERE GovernmentForm = 'Republic'), COUNT(Language = 'English' WHERE GovernmentForm = 'ConstitutionalMonarchy'));",
    "idx": 5985
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`continent` = 'Asia'\nRETURN `country`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the countries in Asia.",
    "evidence": "Asia refers to Continent = 'Asia';",
    "idx": 5987
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`continent` = 'Europe')\nRETURN `t2`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the languages used in Europe.",
    "evidence": "Europe refers to Continent = 'Europe';",
    "idx": 5996
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`city`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nORDER BY `t1`.`lifeexpectancy` IS NULL ASC, `t1`.`lifeexpectancy` DESC \nRETURN `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the cities in the country where there is high life expectancy at birth.",
    "evidence": "high life expectancy at birth refers to MAX(LifeExpectancy);",
    "idx": 6000
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`indepyear` = 1830)\nWITH `t2`.`language` AS _groupby_col_0, `t2`.`isofficial` AS _groupby_col_1\nRETURN _groupby_col_0 AS `language`, _groupby_col_1 AS `isofficial`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the official and unofficial languages used by the country that declared its independence in 1830.",
    "evidence": "official language refers to IsOfficial = 'T'; unofficial language refers to IsOfficial = 'F'; declared independence in 1830 refers to IndepYear = 1830;",
    "idx": 6001
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`continent` = 'Asia' AND `t2`.`isofficial` = 'F')\nWITH `t1`.`name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the countries in the continent of Asia that use English as their unofficial language.",
    "evidence": "use English as unofficial language refers to Language = 'English' WHERE IsOfficial = 'F';",
    "idx": 6003
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t2`.`language` = 'Arabic')\nRETURN avg(`t1`.`gnp`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average GNP of all countries that use Arabic language.",
    "evidence": "average GNP = AVG(GNP); use Arabic language refers to Language = 'Arabic';",
    "idx": 6004
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nRETURN CASE WHEN sum(`t1`.`surfacearea`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`language` = 'Chinese' THEN `t1`.`surfacearea` ELSE 0 END)) * 100 / sum(`t1`.`surfacearea`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of the surface area of all countries that uses Chinese as one of their languages.",
    "evidence": "percentage = DIVIDE(MULTIPLY(SUM(SurfaceArea WHERE Language = 'Chinese'), SUM(SurfaceArea)), 1.0); Chinese as one of the languages refers to Language = 'Chinese';",
    "idx": 6005
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`country`:`country`)\nORDER BY `country`.`population` IS NULL ASC, `country`.`population` DESC \nRETURN `country`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the name of the largest population country.",
    "evidence": "largest population refers to MAX(Population);",
    "idx": 6007
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t2`.`language` = 'English' AND `t2`.`isofficial` = 'T')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the name of countries whereby English is their official language.",
    "evidence": "English is the official language refers to Language = 'English' AND IsOfficial = 'T';",
    "idx": 6009
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`indepyear` > 1990 AND `t2`.`isofficial` = 'T')\nRETURN `t1`.`name` AS `name`, `t2`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the official language of the countries which declared independence after 1990,",
    "evidence": "official lanaguage refers to IsOfficial = 'T'; declared independence after 1990 refers to IndepYear > 1990;",
    "idx": 6010
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t2`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`countrycode`\nAND (`t1`.`name` = 'Malaysia')\nRETURN `t2`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down languages used in Malaysia.",
    "evidence": "Malaysia is a name of country;",
    "idx": 6012
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t2`.`name` = 'China')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all cities of China.",
    "evidence": "China is a name of country;",
    "idx": 6017
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t2`.`localname` = 'Â´Uman')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the cities for country called \"Â´Uman\" in local name.",
    "evidence": "",
    "idx": 6018
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` = 201843\nRETURN `city`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the district of the city with a population of 201843.",
    "evidence": "",
    "idx": 6023
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t1`.`name` = 'Queimados')\nRETURN `t2`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the population of the country where Queimados city belongs.",
    "evidence": "",
    "idx": 6033
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t1`.`isofficial` = 'T' AND `t1`.`language` = 'English')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of the country that officially uses English as their language.",
    "evidence": "officially uses English as their language refers to `Language` = 'English' AND IsOfficial = 'T';",
    "idx": 6036
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t2`.`gnp` < 1000 AND `t1`.`isofficial` = 'T' AND `t1`.`language` = 'Dutch')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the country names of countries that have a GNP lower than 1000 and have Dutch as their language.",
    "evidence": "GNP lower than 1000 refers to GNP < 1000; Dutch as their language refers to `Language` = 'Dutch';",
    "idx": 6038
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t1`.`district` = 'Entre Rios')\nRETURN `t2`.`gnp` AS `gnp`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the GNP of the country where district \"Entre Rios\" belongs?",
    "evidence": "",
    "idx": 6039
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t1`.`name` = 'The Valley')\nRETURN `t2`.`localname` AS `localname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the local name of the country where \"The Valley\" city belongs?",
    "evidence": "",
    "idx": 6040
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t2`.`surfacearea` > 7000000)\nRETURN `t2`.`name` AS `name`, `t1`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the cities belongs to the country that has surface area greater than 7000000.",
    "evidence": "surface area greater than 7000000 refers to SurfaceArea > 7000000;",
    "idx": 6041
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t2`.`indepyear` >= 1980 AND `t2`.`indepyear` <= 1995)\nRETURN `t2`.`name` AS `name`, `t1`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the languages of countries with an independence year between 1980 to 1995.",
    "evidence": "independence year between 1980 to 1995 refers to IndepYear BETWEEN 1980 AND 1995;",
    "idx": 6044
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (`t1`:`countrylanguage`)-[spoken_in_0:spoken_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t2`.`headofstate` = 'Pierre Buyoya')\nRETURN `t1`.`language` AS `language`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the language used in the country ruled by Pierre Buyoya.",
    "evidence": "ruled by Pierre Buyoya refers to HeadOfState = 'Pierre Buyoya';",
    "idx": 6046
  }
]