[
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enlist`)\nMATCH (`t1`:`longest_absense_from_school`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`organ` = 'peace_corps')\nORDER BY `t1`.`month` IS NULL ASC, `t1`.`month` DESC \nRETURN COUNT(`t1`.`name`) AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the number of students who have the longest duration of absense from school and enlisted in the peace corps.",
    "evidence": "longest duration of absence refers to MAX(month); peace corps refers to organ = 'peace_corps';",
    "idx": 3467
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`enlist`)\nMATCH (`t2`:`filed_for_bankrupcy`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`organ` = 'navy')\nRETURN COUNT(`t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the number of students who filed for bankruptcy and enlisted in navy.",
    "evidence": "navy refers to organ = 'navy';",
    "idx": 3468
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`no_payment_due`)\nMATCH (`t2`:`enlist`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`bool` = 'pos' AND `t2`.`organ` = 'marines')\nRETURN COUNT(`t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of students who enlisted in marines and have payment due.",
    "evidence": "marines refers to organ = 'marines'; have payment due refers to bool = 'pos';",
    "idx": 3469
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`longest_absense_from_school`)\nMATCH (`t1`:`disabled`)\nWHERE `t1`.`name` = `t2`.`name`\nRETURN 100 * sum(CASE WHEN `t2`.`month` = 0 THEN 1 ELSE 0 END) AS `num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the ratio of disabled students who have never been absent from school.",
    "evidence": "ratio = MULTIPLY(DIVIDE(SUM(month = 0), COUNT(disabled.name)), 100); never been absent from school refers to month = 0;",
    "idx": 3470
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enlist`)-[has_person_0:has_person]->(`t1`:`person`)\nOPTIONAL MATCH (`t3`:`male`)-[has_person_1:has_person]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`organ` = 'marines' AND `t3`.`name` IS NULL) AND `t1`.`name` = `t3`.`name`\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the number of female students who belong to marines organization.",
    "evidence": "female students refers to enlist.name who are NOT in male.name; organization refers to organ; organ = 'marines';",
    "idx": 3473
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`longest_absense_from_school`)-[has_person_0:has_person]->(`t1`:`person`)\nOPTIONAL MATCH (`t3`:`male`)-[has_person_1:has_person]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t3`.`name` IS NULL) AND `t1`.`name` = `t3`.`name`\nRETURN avg(`t2`.`month`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average duration of absense of female students.",
    "evidence": "average duration = DIVIDE(SUM(month), COUNT(longest_absence_from_school.name which are NOT in male.name)); female students refers to longest_absence_from_school.name who are NOT in male.name;",
    "idx": 3474
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`filed_for_bankrupcy`)-[has_person_0:has_person]->(`t1`:`person`)\nOPTIONAL MATCH (`t3`:`male`)-[has_person_1:has_person]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t3`.`name` IS NULL) AND `t1`.`name` = `t3`.`name`\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State name of female students who filed for bankruptcy.",
    "evidence": "female students refers to filed_for_bankrupcy.name who are NOT in male.name;",
    "idx": 3475
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`no_payment_due`:`no_payment_due`)\nWHERE `no_payment_due`.`name` = 'student299'\nRETURN `no_payment_due`.`bool` AS `bool`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the status of payment of student 299.",
    "evidence": "status of payment is mentioned in no_payment_due; bool = 'pos' means the student has payment due; bool = 'neg' means the student has no payment due; student299 is a name of student;",
    "idx": 3476
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`enlist`:`enlist`)\nWHERE `enlist`.`organ` = 'fire_department'\nRETURN `enlist`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names of the students enlisted in the fire department.",
    "evidence": "department refers to organ; organ = 'fire_department';",
    "idx": 3479
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`disabled`)\nMATCH (`t1`:`enlist`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`organ` = 'navy')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of disabled students enlisted in the navy.",
    "evidence": "navy refers to organ = 'navy';",
    "idx": 3483
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`no_payment_due`)\nMATCH (`t1`:`male`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`bool` = 'pos')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the male students, list down the names of students with payment due.",
    "evidence": "male students are mentioned in male.name; with payment due refers to bool = 'pos';",
    "idx": 3484
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`person`)\nOPTIONAL MATCH (`t2`:`male`)-[has_person_0:has_person]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`name`\nRETURN CASE WHEN COUNT(`t1`.`name`)=0 THEN NULL ELSE toFloat(COUNT(`t2`.`name`)) * 100 / COUNT(`t1`.`name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all students, calculate the percentage of male students.",
    "evidence": "percentage = MULTIPLY(DIVIDE(COUNT(male.name), COUNT(person.name)), 100); male students are mentioned in male.name;",
    "idx": 3486
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enlist`)\nMATCH (`t1`:`longest_absense_from_school`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`organ` = 'fire_department')\nRETURN `t1`.`month` AS `month` ORDER BY `t1`.`month` IS NULL ASC, `t1`.`month` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the longest duration of absense for a student enlisted in the fire department.",
    "evidence": "longest duration of absence refers to MAX(month); department refers to organ; organ = 'fire_department';",
    "idx": 3488
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL (*) {\nMATCH (`enlist_sub0`:`enlist`)\nWITH `enlist_sub0`.`organ` AS _groupby_col_0, COUNT(`enlist_sub0`.`organ`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `organ`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `organ`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the organization which most of the students are enlisted in?",
    "evidence": "name of the organization refers to organ; organization which most of the students are enlisted in refers to MAX(COUNT(organ));",
    "idx": 3495
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`male`)\nMATCH (`t2_sub0`:`enlist`)\nWHERE `t1_sub0`.`name` = `t2_sub0`.`name`\nWITH `t2_sub0`.`organ` AS _groupby_col_0, COUNT(`t1_sub0`.`name`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `organ`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL DESC, `num`  \nRETURN `organ`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which organization has the least number of male students?",
    "evidence": "organization refers to organ; male students are mentioned in male.name; least number of male students refers to MIN(male.name);",
    "idx": 3499
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`disabled`)\nMATCH (`t1`:`longest_absense_from_school`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`month` > 5)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of the disabled students who were absent from school for more than 5 months.",
    "evidence": "absent for more than 5 months refers to month > 5;",
    "idx": 3502
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`enlist`)-[has_person_2:has_person]->(`t2_sub0`:`person`)\nOPTIONAL MATCH (`t3_sub0`:`male`)-[has_person_3:has_person]->(`t2_sub0`:`person`)\nWHERE `t1_sub0`.`name` = `t2_sub0`.`name`\nAND `t2_sub0`.`name` = `t3_sub0`.`name`\nWITH `t1_sub0`.`organ` AS _groupby_col_0, CASE WHEN COUNT(`t2_sub0`.`name`)=0 THEN NULL ELSE toFloat(COUNT(`t3_sub0`.`name`)) / COUNT(`t2_sub0`.`name`) END AS _groupby_col_1, COUNT(`t3_sub0`.`name`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `organ`, _groupby_col_1 AS `per`, _groupby_col_2 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `organ`, `per`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which organization has the highest number of male students? Calculate for the percentage of the male students in the said organization.",
    "evidence": "organization refers to organ; highest number of male students refers to MAX(COUNT(male.name)); percentage = DIVIDE(COUNT(male.name), COUNT(person.name)), 1.0;",
    "idx": 3506
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`answer`:`answer`)\nWHERE `answer`.`questionid` = 19 AND `answer`.`answertext` =~ '(?i)(?s)No'\nRETURN COUNT(`answer`.`questionid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many users answered \"No\" to question 19?",
    "evidence": "Question 19 refer to QuestionID = 19; No refer to AnswerText = 'No'\n",
    "idx": 3507
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`t2`:`answer`)\nMATCH (`t1`:`question`)\nWHERE `t1`.`questionid` = `t2`.`questionid`\nAND (`t1`.`questiontext` = 'Any additional notes or comments' AND `t2`.`surveyid` = 2014 AND `t2`.`answertext` <> -1)\nRETURN `t2`.`answertext` AS `answertext`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the answers to the question \"Any additional notes or comments\" that are not null in 2014's survey.",
    "evidence": "question refers to questiontext; the answers that are not null refers to AnswerText ! = -1\n",
    "idx": 3516
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`t2`:`answer`)\nMATCH (`t1`:`question`)\nWHERE `t1`.`questionid` = `t2`.`questionid`\nAND (`t2`.`surveyid` IN [2014, 2016])\nWITH `t1`.`questiontext` AS _groupby_col_0\nRETURN _groupby_col_0 AS `questiontext`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the common questions in 2014's survey and 2016's survey.",
    "evidence": "question refers to questiontext; all the common questions in 2014's survey and 2016's survey refers to QuestionID(SurveyID(2014)) = QuestionID(SurveyID(2016))\n",
    "idx": 3517
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`t2`:`survey`)\nMATCH (`t1`:`answer`)\nWHERE `t1`.`surveyid` = `t2`.`surveyid`\nAND (`t2`.`description` = 'mental health survey for 2018')\nRETURN COUNT(`t1`.`questionid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of questions that were asked in the \"mental health survey for 2018\".",
    "evidence": "mental health survey for 2018 refers to SurveyID = 2018",
    "idx": 3524
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`t2`:`survey`)\nMATCH (`t1`:`answer`)\nWHERE `t1`.`surveyid` = `t2`.`surveyid`\nAND (`t2`.`description` = 'mental health survey for 2016')\nRETURN COUNT(DISTINCT `t1`.`userid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of users who took part in the \"mental health survey for 2016\".",
    "evidence": "mental health survey for 2016 refers to SurveyID = 2016",
    "idx": 3526
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`t1`:`answer`)\nMATCH (`t2`:`question`)\nWHERE `t1`.`questionid` = `t2`.`questionid`\nAND (`t2`.`questiontext` =~ '(?i)(?s)Describe the conversation you had with your previous employer about your mental health, including their reactions and actions taken to address your mental health issue/questions.')\nRETURN COUNT(DISTINCT `t1`.`answertext`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many different answers did the question \"Describe the conversation you had with your previous employer about your mental health, including their reactions and actions taken to address your mental health issue/questions.\" get?",
    "evidence": "",
    "idx": 3527
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`t1`:`answer`)\nMATCH (`t2`:`question`)\nWHERE `t1`.`questionid` = `t2`.`questionid`\nAND (`t2`.`questiontext` =~ '(?i)(?s)What US state or territory do you work in\\?' AND `t1`.`answertext` = 'Kansas')\nRETURN COUNT(`t1`.`userid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the question “What US state or territory do you work in?”, how many people gave \"Kansas\" as the answer?",
    "evidence": "question refers to questiontext; AnswerText = 'Kansas'",
    "idx": 3528
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`t1`:`answer`)\nMATCH (`t2`:`question`)\nWHERE `t1`.`questionid` = `t2`.`questionid`\nAND (`t2`.`questiontext` =~ '(?i)(?s)Any additional notes or comments' AND NOT `t1`.`answertext` IS NULL)\nRETURN COUNT(`t1`.`userid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many people wrote comments for the question \"Any additional notes or comments.\"?",
    "evidence": "question refers to questiontext; wrote comments refers to AnswerText(QuestionID = 103) ! = -1",
    "idx": 3529
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`t2`:`survey`)\nMATCH (`t1`:`answer`)\nWHERE `t1`.`surveyid` = `t2`.`surveyid`\nAND (`t2`.`description` = 'mental health survey for 2018')\nRETURN COUNT(DISTINCT `t1`.`userid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of users who took the \"mental health survey for 2018\".",
    "evidence": "mental health survey for 2018 refers to SurveyID = 2018",
    "idx": 3531
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (`t1`:`answer`)\nMATCH (`t2`:`question`)\nWHERE `t1`.`questionid` = `t2`.`questionid`\nAND (`t2`.`questionid` = 2183 AND `t1`.`answertext` = 'Mood Disorder (Depression, Bipolar Disorder, etc)')\nRETURN `t1`.`answertext` AS `answertext`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For which question did the user No.2183 gave the answer \"Mood Disorder (Depression, Bipolar Disorder, etc)\"?",
    "evidence": "question refers to questiontext; user No.2183 refers to userID = 2183",
    "idx": 3533
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`director`)-[directed_0:directed]->(`t2`:`characters`)\nWHERE `t1`.`name` = `t2`.`movie_title`\nAND (`t1`.`director` = 'Wolfgang Reitherman' AND NOT `t2`.`villian` IS NULL)\nRETURN `t2`.`villian` AS `villian`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the villains of all the movies directed by Wolfgang Reitherman.",
    "evidence": "Wolfgang Reitherman refers to director = 'Wolfgang Reitherman';",
    "idx": 3545
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)-[directed_0:directed]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (CASE  WHEN (apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 1-1 < 0 AND 3 < 0  THEN substring(`t1`.`release_date`,(case when size(`t1`.`release_date`)+1+((apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 1-1)+3 < 0 then 0 else size(`t1`.`release_date`)+1+((apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 1-1)+3 end),-(3))  WHEN (apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 1-1 < 0 AND 3 >= 0  THEN substring(`t1`.`release_date`,size(`t1`.`release_date`)+1+((apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 1-1),3)  WHEN (apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 1-1 >= 0 AND 3 < 0  THEN substring(`t1`.`release_date`,(case when (apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 1-1+1+(3) < 0 then 0 else (apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 1-1+1+(3) end),-(3))  ELSE substring(`t1`.`release_date`,(apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 1-1,3) END = 'Dec' AND `t2`.`director` = 'Wolfgang Reitherman')\nRETURN COUNT(`t1`.`movie_title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the movies directed by Wolfgang Reitherman, how many of them were released in December?",
    "evidence": "Wolfgang Reitherman refers to director = 'Wolfgang Reitherman'; released in December refers to (release_date, instr(release_date, '-') + 1, 3) = 'Dec';",
    "idx": 3546
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`voice-actors`)-[voiced_in_0:voiced_in]->(`t2`:`characters`)\nWHERE `t1`.`movie` = `t2`.`movie_title`\nAND (`t1`.`character` =~ '(?i)(?s).*' OR `t2`.`villian` OR False AND `t2`.`movie_title` = 'Alice in Wonderland')\nRETURN `t1`.`voice-actor` AS `voice-actor`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the voice actor for the villain of the movie \"Alice in Wonderland\"?",
    "evidence": "Alice in Wonderland refers to movie_title = 'Alice in Wonderland'; villain refers to character like '%'||T1.villian||'%';",
    "idx": 3548
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`voice-actors`)-[voiced_in_0:voiced_in]->(`t2`:`characters`)\nWHERE `t1`.`movie` = `t2`.`movie_title`\nAND (`t1`.`voice-actor` = 'Alan Tudyk')\nRETURN `t2`.`release_date` AS `release_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the release dates of all the movies in which Alan Tudyk is a voice actor.",
    "evidence": "FALSE;",
    "idx": 3549
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`voice-actors`)-[voiced_in_0:voiced_in]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie`\nAND (`t2`.`voice-actor` = 'Alan Tudyk' AND CASE WHEN (apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 5-1 < 0 THEN substring(`t1`.`release_date`,size(`t1`.`release_date`)+1+((apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 5-1)) ELSE substring(`t1`.`release_date`,(apoc.text.indexOf(`t1`.`release_date`,'-') + 1) + 5-1) END > 12)\nRETURN COUNT(`t2`.`movie`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the movies in which Alan Tudyk is a voice actor, how many of them were released after 2012?",
    "evidence": "released after 2012 refers to (release_date, instr(release_date, '-') + 5) > 12;",
    "idx": 3550
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`director`)\nMATCH (`t1_sub0`:`movies_total_gross`)\nWHERE `t1_sub0`.`movie_title` = `t2_sub0`.`name`\nAND (`t2_sub0`.`director` = 'Wolfgang Reitherman' AND `t1_sub0`.`genre` = 'Comedy')\nWITH `t2_sub0`.`name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `name`  \n}\nWITH *\nRETURN COUNT(`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the movies directed by Wolfgang Reitherman, how many of them are Comedies?",
    "evidence": "directed by Wolfgang Reitherman refers to director = 'Wolfgang Reitherman'; comedies refers to genre = 'Comedy'; movies refer to movie_title;",
    "idx": 3551
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)\nMATCH (`t2`:`director`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t1`.`mpaa_rating` = 'G' AND `t2`.`director` = 'Wolfgang Reitherman')\nRETURN `t1`.`movie_title` AS `movie_title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the movies directed by Wolfgang Reitherman that can be watched by the general audience.",
    "evidence": "directed by Wolfgang Reitherman refers to director = 'Wolfgang Reitherman'; movies refer to movie_title; general audience refers to MPAA_rating = 'G';",
    "idx": 3553
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`characters`:`characters`)\nWHERE `characters`.`movie_title` = 'Beauty and the Beast'\nRETURN `characters`.`villian` AS `villian`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the villain of the movie \"Beauty and the Beast\"?",
    "evidence": "Beauty and the Beast refers to movie_title = 'Beauty and the Beast';",
    "idx": 3556
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`characters`:`characters`)\nWHERE `characters`.`song` = 'I Thought I Lost You'\nRETURN `characters`.`movie_title` AS `movie_title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the movie which the song \"I Thought I Lost You\" is associated with.",
    "evidence": "name of the movie refers to movie_title;",
    "idx": 3558
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nAND (toInteger(CASE WHEN (apoc.text.indexOf(`t1`.`release_date`,', ') + 1) + 1-1 < 0 THEN substring(`t1`.`release_date`,size(`t1`.`release_date`)+1+((apoc.text.indexOf(`t1`.`release_date`,', ') + 1) + 1-1)) ELSE substring(`t1`.`release_date`,(apoc.text.indexOf(`t1`.`release_date`,', ') + 1) + 1-1) END) >= 1970 AND toInteger(CASE WHEN (apoc.text.indexOf(`t1`.`release_date`,', ') + 1) + 1-1 < 0 THEN substring(`t1`.`release_date`,size(`t1`.`release_date`)+1+((apoc.text.indexOf(`t1`.`release_date`,', ') + 1) + 1-1)) ELSE substring(`t1`.`release_date`,(apoc.text.indexOf(`t1`.`release_date`,', ') + 1) + 1-1) END) <= 1979)\nORDER BY toFloat(replace(CASE WHEN 2-1 < 0 THEN substring(`t1`.`total_gross`,size(`t1`.`total_gross`)+1+(2-1)) ELSE substring(`t1`.`total_gross`,2-1) END,',','')) IS NULL ASC, toFloat(replace(CASE WHEN 2-1 < 0 THEN substring(`t1`.`total_gross`,size(`t1`.`total_gross`)+1+(2-1)) ELSE substring(`t1`.`total_gross`,2-1) END,',','')) DESC \nRETURN `t2`.`song` AS `song`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which song is associated with the most popular Disney movie in 1970s?",
    "evidence": "the most popular movie refers to movie_title where MAX(total_gross); in 1970s refers to (cast(SUBSTR(release_date, instr(release_date, ', ') + 1) as int) between 1970 and 1979);",
    "idx": 3561
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`voice-actors`)\nMATCH (`t1`:`director`)\nWHERE `t2`.`movie` = `t1`.`name`\nAND (`t2`.`character` = 'Aunt Sarah' AND `t2`.`voice-actor` = 'Verna Felton')\nRETURN `t1`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the director of the movie in which Verna Felton was the voice actor for its character \"Aunt Sarah\".",
    "evidence": "FALSE;",
    "idx": 3564
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)\nMATCH (`t2`:`director`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t2`.`director` = 'Wolfgang Reitherman')\nORDER BY toFloat(replace(CASE WHEN 2-1 < 0 THEN substring(`t1`.`inflation_adjusted_gross`,size(`t1`.`inflation_adjusted_gross`)+1+(2-1)) ELSE substring(`t1`.`inflation_adjusted_gross`,2-1) END,',','')) IS NULL ASC, toFloat(replace(CASE WHEN 2-1 < 0 THEN substring(`t1`.`inflation_adjusted_gross`,size(`t1`.`inflation_adjusted_gross`)+1+(2-1)) ELSE substring(`t1`.`inflation_adjusted_gross`,2-1) END,',','')) DESC \nRETURN `t1`.`movie_title` AS `movie_title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Wolfgang Reitherman has directed several Disney movies, which one has the highest grossing after accounting for inflation?",
    "evidence": "Wolfgang Reitherman refers to director = 'Wolfgang Reitherman'; the highest grossing after accounting for inflation refers to MAX(inflation_adjusted_gross);",
    "idx": 3567
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nAND (`t2`.`hero` = 'Donald Duck')\nORDER BY toFloat(replace(CASE WHEN 2-1 < 0 THEN substring(`t1`.`total_gross`,size(`t1`.`total_gross`)+1+(2-1)) ELSE substring(`t1`.`total_gross`,2-1) END,',','')) IS NULL ASC, toFloat(replace(CASE WHEN 2-1 < 0 THEN substring(`t1`.`total_gross`,size(`t1`.`total_gross`)+1+(2-1)) ELSE substring(`t1`.`total_gross`,2-1) END,',','')) DESC \nRETURN `t1`.`movie_title` AS `movie_title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "The character Donald Duck has appeared in two Disney movies, which one has more grossing?",
    "evidence": "Donald Duck is the main character of the movie which refers to hero = 'Donald Duck'; which one has more grossing refers to movie_title where MAX(total_gross);",
    "idx": 3569
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`movies_total_gross`:`movies_total_gross`)\nWHERE `movies_total_gross`.`mpaa_rating` = 'R' AND `movies_total_gross`.`genre` = 'Horror' AND toInteger(CASE WHEN (apoc.text.indexOf(`movies_total_gross`.`release_date`,', ') + 1) + 1-1 < 0 THEN substring(`movies_total_gross`.`release_date`,size(`movies_total_gross`.`release_date`)+1+((apoc.text.indexOf(`movies_total_gross`.`release_date`,', ') + 1) + 1-1)) ELSE substring(`movies_total_gross`.`release_date`,(apoc.text.indexOf(`movies_total_gross`.`release_date`,', ') + 1) + 1-1) END) >= 1990 AND toInteger(CASE WHEN (apoc.text.indexOf(`movies_total_gross`.`release_date`,', ') + 1) + 1-1 < 0 THEN substring(`movies_total_gross`.`release_date`,size(`movies_total_gross`.`release_date`)+1+((apoc.text.indexOf(`movies_total_gross`.`release_date`,', ') + 1) + 1-1)) ELSE substring(`movies_total_gross`.`release_date`,(apoc.text.indexOf(`movies_total_gross`.`release_date`,', ') + 1) + 1-1) END) <= 2015\nRETURN COUNT(`movies_total_gross`.`movie_title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many restricted horror movies were released between 1/1/1990 to 12/31/2015?",
    "evidence": "Restricted refers to MPAA_rating = 'R'; horror refers to genre = 'Horror'; released between 1/1/1990 to 12/31/2015 refers to (cast(SUBSTR(release_date, instr(release_date, ', ') + 1) as int) between 1990 and 2015);",
    "idx": 3571
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t2`.`movie_title` = `t1`.`movie_title`\nAND (`t2`.`song` = 'Little Wonders')\nRETURN `t1`.`total_gross` AS `total_gross`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the total gross of the movie with a song titled \"Little Wonders\"?",
    "evidence": "song = 'Little Wonders'",
    "idx": 3573
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`movies_total_gross`)\nMATCH (`t1_sub0`:`voice-actors`)\nWHERE `t1_sub0`.`movie` = `t2_sub0`.`movie_title`\nAND (`t2_sub0`.`mpaa_rating` = 'PG' AND `t1_sub0`.`voice-actor` = 'Bill Thompson')\nWITH `t1_sub0`.`movie` AS _groupby_col_0\nRETURN _groupby_col_0 AS `movie`  \n}\nWITH *\nRETURN COUNT(`movie`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many movies for mature audiences or parental guidance suggested did Bill Thompson work as a voice actor?",
    "evidence": "movies for mature audiences or parental guidance refer to movie_title where MPAA_rating = 'PG';",
    "idx": 3575
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`director`)\nMATCH (`t2_sub0`:`movies_total_gross`)\nWHERE `t1_sub0`.`name` = `t2_sub0`.`movie_title`\nAND (`t1_sub0`.`director` = 'Gary Trousdale' AND `t2_sub0`.`genre` = 'Adventure')\nWITH `t1_sub0`.`name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `name`  \n}\nWITH *\nRETURN COUNT(`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of Gary Trousdale's movies are adventure movies?",
    "evidence": "Gary Trousdale refers director = 'Gary Trousdale'; the adventure movie refers to genre = 'Adventure';",
    "idx": 3576
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)\nMATCH (`t1`:`movies_total_gross`)\nWHERE `t2`.`name` = `t1`.`movie_title`\nAND (`t2`.`director` = 'Ron Clements')\nORDER BY toInteger(replace(CASE WHEN 2-1 < 0 THEN substring(`t1`.`total_gross`,size(`t1`.`total_gross`)+1+(2-1)) ELSE substring(`t1`.`total_gross`,2-1) END,',','')) IS NULL ASC, toInteger(replace(CASE WHEN 2-1 < 0 THEN substring(`t1`.`total_gross`,size(`t1`.`total_gross`)+1+(2-1)) ELSE substring(`t1`.`total_gross`,2-1) END,',','')) DESC \nRETURN `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the most popular movie directed by Ron Clements?",
    "evidence": "Ron Clements refers to director = 'Ron Clements'; the most popular movie refers to movie_title where MAX(total_gross);",
    "idx": 3577
  }
]