[
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[ordered_by_0:`ordered_by`]->(t2@`customer`)\nMATCH (t1@`shipment`)-[handled_by_0:`handled_by`]->(t3@`driver`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND t3.`driver_id` = t1.`driver_id`\nAND (t2.`address` = '7052 Carroll Road' AND t2.`city` = 'San Diego' AND t2.`state` = 'CA')\nRETURN t3.`address` AS `address`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the address of the driver that delivers the shipment for the customer lives at 7052 Carroll Road, San Diego, California?",
    "evidence": "\"7052 Carroll Road\" is the address of customer; 'San Diego' is the city; 'California' is the state",
    "idx": 2998
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[handled_by_0:`handled_by`]->(t2@`driver`)\nWHERE t1.`driver_id` = t2.`driver_id`\nAND (t2.`first_name` = 'Andrea' AND t2.`last_name` = 'Simons' AND t1.`ship_date` = '2016-03-07')\nRETURN t1.`weight` AS `weight`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the weight of the shipment delivered by Andrea Simons on March 7, 2016?",
    "evidence": "on March 7, 2016 refers to ship_date = '2016-03-07'",
    "idx": 2999
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[ordered_by_0:`ordered_by`]->(t2@`customer`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND (t2.`state` = 'NY')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many shipments were delivered to a customer from New York?",
    "evidence": "\"New York\" refers to state = 'NY'",
    "idx": 3001
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (book@`book`)\nWHERE book.`publisher_id` = 1929 AND book.`num_pages` > 500\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the books published by publisher ID 1929, how many of them have over 500 pages?",
    "evidence": "books have over 500 pages refers to num_pages > 500",
    "idx": 3006
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (book@`book`)\nORDER BY book.`num_pages` DESC NULLS LAST \nRETURN book.`publication_date` AS `publication_date` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the publication date of the book with the most pages?",
    "evidence": "book with the most pages refers to Max(num_pages)",
    "idx": 3007
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[published_by_0:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nAND (t2.`publisher_name` = 'Thomas Nelson' AND t1.`num_pages` > 300)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the books published by publisher \"Thomas Nelson\", how many of them have over 300 pages?",
    "evidence": "\"Thomas Nelson\" is the publisher_name; books with over 300 pages refers to num_pages > 300",
    "idx": 3011
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[published_by_0:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nORDER BY t1.`num_pages` DESC NULLS LAST \nRETURN t2.`publisher_name` AS `publisher_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the publisher of the book with the most pages?",
    "evidence": "book with the most pages refers to Max(num_pages); name of publisher refers to publisher_name",
    "idx": 3012
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[written_in_0:`written_in`]->(t2@`book_language`)\nWHERE t1.`language_id` = t2.`language_id`\nAND (t2.`language_name` = 'English')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books are in English?",
    "evidence": "books in English refers to language_name = 'English'",
    "idx": 3013
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (address@`address`)\nWHERE address.`address_id` = 547\nRETURN address.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city does the address id 547 belong to?",
    "evidence": "",
    "idx": 3016
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`customer`)\nMATCH (t2@`cust_order`)\nWHERE t1.`customer_id` = t2.`customer_id`\nAND (t1.`first_name` = 'Cordy' AND t1.`last_name` = 'Dumbarton')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders has Cordy Dumbarton made?",
    "evidence": "",
    "idx": 3017
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[published_by_0:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nAND (t2.`publisher_name` = 'Kensington')\nRETURN COUNT(t1.`book_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books were published by Kensington?",
    "evidence": "\"Kensington\" is the publisher_name;",
    "idx": 3019
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[written_in_0:`written_in`]->(t2@`book_language`)\nWHERE t1.`language_id` = t2.`language_id`\nAND (t1.`book_id` = 1405)\nRETURN t2.`language_name` AS `language_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which language was book id 1405 written in?",
    "evidence": "language written in refers to language_name;",
    "idx": 3020
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND (t3.`author_name` = 'David Foster Wallace')\nRETURN COUNT(t1.`title`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books did David Foster Wallace write?",
    "evidence": "\"David Foster Wallace\" is the author_name;",
    "idx": 3021
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`customer`)-[t2:`has_address`]->(t3@`address`)-[located_in_0:`located_in`]->(t4@`country`)\nWHERE t1.`customer_id` = t2.`customer_id`\nAND t3.`address_id` = t2.`address_id`\nAND t4.`country_id` = t3.`country_id`\nAND (t1.`first_name` = 'Malina' AND t1.`last_name` = 'Johnson' AND t2.`status_id` = 2)\nRETURN t4.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country does Malina Johnson live in?",
    "evidence": "country refers to country_name",
    "idx": 3023
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t2@`address`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`country_id` = t2.`country_id`\nAND (t2.`city` = 'Žirovnica')\nRETURN t1.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country does Žirovnica city belong to?",
    "evidence": "\"Žirovnica\" is the city; country refers to country_name",
    "idx": 3025
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND (t3.`author_name` = 'David Coward')\nRETURN avg(t1.`num_pages`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of pages of David Coward's books?",
    "evidence": "number of pages refers to num_pages; average = Divide (Sum(num_pages), Count(book_id))",
    "idx": 3027
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (shipping_method@`shipping_method`)\nORDER BY shipping_method.`cost`  NULLS FIRST \nRETURN shipping_method.`method_name` AS `method_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the cost of the slowest and least expensive shipping method?",
    "evidence": "slowest and least expesive method refers to shipping_method = 'Standard'",
    "idx": 3028
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND (t3.`author_name` = 'J.K. Rowling')\nORDER BY t1.`publication_date`  NULLS FIRST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the first book written by J.K Rowling?",
    "evidence": "\"J.K Rowling\" is the author_name; first published book refers to book_id where Min(publication_date); name of the book refers to title",
    "idx": 3030
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH ()-[t2:`has_author`]->(t1@`author`)\nWHERE t1.`author_id` = t2.`author_id`\nAND (t1.`author_name` = 'A.R. Braunmuller')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books did A.R. Braunmuller write?",
    "evidence": "\"A.R. Braunmuller\" is the author_name",
    "idx": 3031
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nMATCH (t1@`book`)-[published_by_0:`published_by`]->(t4@`publisher`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND t4.`publisher_id` = t1.`publisher_id`\nAND (t3.`author_name` = 'Agatha Christie')\nORDER BY t1.`publication_date`  NULLS FIRST \nRETURN t4.`publisher_name` AS `publisher_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the publisher who published Agatha Christie's first book?",
    "evidence": "\"Agatha Christie\" is the author_name; name of publisher refers to publisher_name; first book refers to Min(publication_date)",
    "idx": 3032
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nMATCH (t1@`book`)-[published_by_0:`published_by`]->(t4@`publisher`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND t4.`publisher_id` = t1.`publisher_id`\nAND (t3.`author_name` = 'William Shakespeare' AND t4.`publisher_name` = 'Penguin Classics')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books by William Shakespeare were published by Penguin Classics?",
    "evidence": "\"William Shakespeare\" is the author_name; \"Penguin Classics\" is the publisher_name",
    "idx": 3034
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (publisher@`publisher`)\nWHERE publisher.`publisher_id` = 22\nRETURN publisher.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the publisher with publisher ID 22?",
    "evidence": "name of publisher refers to publisher_name",
    "idx": 3035
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND (t3.`author_name` = 'Al Gore' AND t1.`num_pages` < 400)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the books authored by Al Gore have less than 400 pages?",
    "evidence": "\"AI Gore\" is the author_name; have less than 400 pages refers to num_pages < 400",
    "idx": 3036
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[written_in_0:`written_in`]->(t2@`book_language`)\nWHERE t1.`language_id` = t2.`language_id`\nAND (t1.`isbn13` = '23755004321')\nRETURN t2.`language_name` AS `language_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the language of the book with ISBN 23755004321?",
    "evidence": "\"23755004321\" is the isbn13; language refers to language_name",
    "idx": 3038
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)\nMATCH (t2@`order_line`)\nWHERE t1.`book_id` = t2.`book_id`\nORDER BY t2.`price` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the most expensive book?",
    "evidence": "most expensive book refers to Max(price)",
    "idx": 3039
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t3@`order_line`)\nMATCH (t2@`book`)-[published_by_0:`published_by`]->(t1@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nAND t3.`book_id` = t2.`book_id`\nAND (t1.`publisher_name` = 'Berkley' AND t3.`price` < 1)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the books that cost less than 1 dollar, how many were published by Berkley Trade?",
    "evidence": "book cost less than 1 dollar refers to price < 1; 'Berkley Trade' is the publisher_name;",
    "idx": 3041
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nORDER BY t1.`num_pages` DESC NULLS LAST \nRETURN t3.`author_name` AS `author_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who authored the book with greatest number of pages?",
    "evidence": "greatest number of pages refers to Max(num_pages); who authored refers to author_name",
    "idx": 3042
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[published_by_0:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nAND (t1.`title` = 'The Illuminati')\nRETURN t2.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the publisher name of the book titled The Illuminati?",
    "evidence": "\"The Illuminati\" is the title of book",
    "idx": 3044
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[published_by_0:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nAND (t2.`publisher_name` = 'Ace Hardcover')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books were published by Ace Hardcover?",
    "evidence": "\"Ace Hardcover\" is the publisher_name",
    "idx": 3050
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nMATCH (t1@`book`)-[published_by_0:`published_by`]->(t4@`publisher`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND t4.`publisher_id` = t1.`publisher_id`\nAND (t3.`author_name` = 'Barry Eisler')\nRETURN t4.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which publisher published Barry Eisler's book?",
    "evidence": "\"Barry Eisler\" is the author_name; publisher refers to publisher_name",
    "idx": 3051
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t2@`book`)-[written_in_0:`written_in`]->(t1@`book_language`)\nWHERE t1.`language_id` = t2.`language_id`\nAND (t1.`language_name` = 'Japanese')\nRETURN COUNT(t2.`book_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books were published in Japanese?",
    "evidence": "published in Japanese refers to language_name = 'Japanese'",
    "idx": 3052
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH ()-[t1:`has_address`]->(t2@`address`)-[located_in_0:`located_in`]->(t3@`country`)\nWHERE t2.`address_id` = t1.`address_id`\nAND t3.`country_id` = t2.`country_id`\nAND (t3.`country_name` = 'Australia')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are from Australia?",
    "evidence": "\"Australia\" is the country_name;",
    "idx": 3054
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (order_line@`order_line`)\nRETURN avg(order_line.`price`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average price for the order line?",
    "evidence": "average price refers to AVG(price)",
    "idx": 3056
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`address`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t2.`country_id` = t1.`country_id`\nAND (t2.`country_name` = 'Philippines')\nRETURN COUNT(t2.`country_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many addresses are from the Philippines?",
    "evidence": "\"Philippines\" is the country_name",
    "idx": 3058
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t2@`address_status`)\nMATCH ()-[t1:`has_address`]->()\nWHERE t1.`status_id` = t2.`status_id`\nAND (t2.`address_status` = 'Inactive')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the customer addresses are inactive?",
    "evidence": "addresses are inactive refers to address_status = 'Inactive'",
    "idx": 3060
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (order_line@`order_line`)\nWHERE order_line.`price` <> 0\nRETURN min(order_line.`price`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Other than zero, what is the lowest price paid by a customer for an order?",
    "evidence": "other than 0 refers to price ! = 0; lowest price paid refers to Min(price)",
    "idx": 3062
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (address@`address`)\nWHERE address.`city` = 'Villeneuve-la-Garenne'\nRETURN COUNT(address.`address_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers have an address that is located in the city of Villeneuve-la-Garenne?",
    "evidence": "\"Villeneuve-la-Garenne\" is the city",
    "idx": 3063
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (author@`author`)\nWHERE like(author.`author_name`,'Adam%')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many authors are named Adam?",
    "evidence": "authors named Adam refers to author_name LIKE 'Adam'",
    "idx": 3064
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE like(customer.`email`,'%@yahoo.com')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers use a Yahoo! Mail e-mail address?",
    "evidence": "Yahoo! Mail e-mail address refers to email LIKE '%@yahoo.com'",
    "idx": 3065
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t2@`address`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`country_id` = t2.`country_id`\nAND (t1.`country_name` = 'United States of America')\nRETURN DISTINCT t2.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the city addresses of the customers located in the United States of America?",
    "evidence": "\"United States of America\" is the country_name",
    "idx": 3066
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`order_line`)\nMATCH (t2@`book`)\nWHERE t1.`book_id` = t2.`book_id`\nORDER BY t1.`price` DESC NULLS LAST \nRETURN t2.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which books have the most expensive price?",
    "evidence": "most expensive book refers to Max(price)",
    "idx": 3067
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t4@`order_line`)\nMATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND t4.`book_id` = t1.`book_id`\nAND (t3.`author_name` = 'Stephen King')\nORDER BY t1.`publication_date`  NULLS FIRST \nRETURN COUNT(t1.`publication_date`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers ordered Stephen King's first book?",
    "evidence": "\"Stephen King\" is the author_name; first book refers to Min(publication_date)",
    "idx": 3070
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[written_in_0:`written_in`]->(t2@`book_language`)\nWHERE t1.`language_id` = t2.`language_id`\nORDER BY t1.`publication_date`  NULLS FIRST \nRETURN t2.`language_name` AS `language_name` \nLIMIT 2",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the languages of the first two published books?",
    "evidence": "first two published book refers to Min(publication_date); language refers to language_name",
    "idx": 3071
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t3:`has_author`]->(t4@`author`)\nMATCH (t1@`book`)-[published_by_0:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nAND t3.`book_id` = t1.`book_id`\nAND t4.`author_id` = t3.`author_id`\nAND (t2.`publisher_name` = 'Scholastic' AND t4.`author_name` = 'J.K. Rowling')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the books that were published by Scholastic, how many were written by J.K Rowling?",
    "evidence": "\"J.K Rowling\" is the author_name; 'Scholastic' is the publisher_name",
    "idx": 3073
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (cust_order@`cust_order`)\nWHERE like(cast (cust_order.`order_date` as string),'2020-12%')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books were ordered in the last month of the year 2020?",
    "evidence": "ordered in last month of the year 2020 refers to Substr(order_date, 1, 7) = '2020-12'",
    "idx": 3078
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`address`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t2.`country_id` = t1.`country_id`\nAND (t2.`country_name` = 'Costa Rica')\nRETURN t1.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which cities are the customers of Costa Rica located?",
    "evidence": "\"Costa Rica\" is the country_name",
    "idx": 3080
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t3@`address_status`)\nMATCH ()-[t2:`has_address`]->(t1@`address`)\nWHERE t1.`address_id` = t2.`address_id`\nAND t3.`status_id` = t2.`status_id`\nAND (t3.`address_status` = 'Inactive')\nRETURN DISTINCT t1.`street_name` AS `street_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which customer addresses are no longer active?",
    "evidence": "no longer active refers to address_status = 'Inactive'; customer address refers to street_number, street_name, city",
    "idx": 3081
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t3@`customer`)-[t2:`has_address`]->(t1@`address`)\nWHERE t1.`address_id` = t2.`address_id`\nAND t3.`customer_id` = t2.`customer_id`\nAND (t1.`city` = 'Baiyin')\nRETURN t3.`first_name` AS `first_name`, t3.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the customers who live in Baiyin city?",
    "evidence": "full name refers to first_name, last_name; 'Baiyin' is the city",
    "idx": 3082
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t2@`address`)\nMATCH (t1@`cust_order`)\nWHERE t1.`dest_address_id` = t2.`address_id`\nAND (t2.`street_number` = '460')\nRETURN t1.`order_date` AS `order_date`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On what date did the customers who live at number 460 of their respective streets place their orders?",
    "evidence": "live at number 460 refers to street_number = '460'; date the customers placed their orders refers to order_date",
    "idx": 3083
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)\nMATCH (t2@`order_line`)\nWHERE t1.`book_id` = t2.`book_id`\nAND (t1.`title` = 'The Prophet')\nRETURN MAX(t2.`price`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the highest price at which a customer bought the book 'The Prophet'?",
    "evidence": "\"The Prophet\" is the title of the book; highest price refers to Max(price)",
    "idx": 3085
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t2@`order_line`)\nMATCH (t1@`cust_order`)\nWHERE t1.`order_id` = t2.`order_id`\nAND (t2.`price` = 16.54)\nRETURN t1.`order_date` AS `order_date`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On what dates were books ordered at a price of 16.54?",
    "evidence": "price of 16.54 refers to price = 16.54; dates the book ordered refers to order_date",
    "idx": 3086
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[published_by_0:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nAND (t2.`publisher_name` = 'HarperCollins Publishers' AND t1.`num_pages` < 300)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books under 300 pages has HarperCollins Publishers published?",
    "evidence": "under 300 pages refers to num_pages < 300; 'HarperCollins Publishers\" is the publisher_name",
    "idx": 3088
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t2@`book`)-[written_in_0:`written_in`]->(t1@`book_language`)\nWHERE t1.`language_id` = t2.`language_id`\nAND (t1.`language_name` = 'Japanese')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books have been published in Japanese?",
    "evidence": "in Japanese refers to language_name = 'Japanese",
    "idx": 3089
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND (t3.`author_name` = 'Jennifer Crusie')\nRETURN avg(t1.`num_pages`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of pages in the books written by Jennifer Crusie?",
    "evidence": "\"Jennifer Crusie\" is the author_name; average number of pages refers to AVG(num_pages)",
    "idx": 3090
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nORDER BY t1.`num_pages` DESC NULLS LAST \nRETURN t3.`author_name` AS `author_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the author of the book with the biggest page count?",
    "evidence": "author refers to author_name, biggest page count refers to Max(num_pages)",
    "idx": 3091
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH ()-[t2:`has_author`]->(t1@`author`)\nWHERE t1.`author_id` = t2.`author_id`\nAND (t1.`author_name` = 'Akira Watanabe')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books written by Akira Watanabe are available on Gravity?",
    "evidence": "\"Akira Watanabe\" is the author_name",
    "idx": 3092
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND (t1.`title` = 'The Mystery in the Rocky Mountains')\nRETURN t3.`author_name` AS `author_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the author of the book The Mystery in the Rocky Mountains?",
    "evidence": "author refers to author_name; 'The Mystery in the Rocky Mountains' is the title of the book",
    "idx": 3094
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (book@`book`)\nWHERE book.`title` = 'Seaward'\nRETURN book.`num_pages` AS `num_pages`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many pages does 'Seaward' have?",
    "evidence": "\"Seaward\" is the title of the book; pages refers to num_pages",
    "idx": 3101
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND (t1.`title` = 'First Things First')\nRETURN t3.`author_name` AS `author_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the author of First Things First?",
    "evidence": "\"First Things First\" is the title of the book; author refers to author_name",
    "idx": 3102
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND (t3.`author_name` = 'Hirohiko Araki' AND t1.`publication_date` = date('2006-06-06'))\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which book by Hirohiko Araki was published on 6/6/2006?",
    "evidence": "\"Hirohiko Araki\" is the author_name; on 6/6/2006 refers to publication_date = '2006-06-06'; which book refers to title",
    "idx": 3104
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[published_by_0:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nAND (t1.`title` = 'Hitchhiker\\'s Guide To The Galaxy: The Filming of the Douglas Adams classic')\nRETURN t2.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the publisher of Hitchhiker's Guide To The Galaxy: The Filming of the Douglas Adams classic?",
    "evidence": "\"Hitchhiker's Guide To The Galaxy: The Filming of the Douglas Adams classic\" is the title of the book; publisher refers to publisher_name",
    "idx": 3105
  }
]