[
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`obj_class` = 'keyboard')\nRETURN COUNT(t1.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many images have \"keyboard\" as their object class?",
    "evidence": "images refer to IMG_ID; \"keyboard\" as object class refers to OBJ_CLASS = 'keyboard';",
    "idx": 3668
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`obj_class` = 'keyboard' AND t1.`x` = 5 AND t1.`y` = 647)\nRETURN t1.`w` AS `w`, t1.`h` AS `h`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the width and height of the bounding box of the object with \"keyboard\" as their object class and (5, 647) as their coordinate?",
    "evidence": "The bounding box's W and H abbreviations stand for the object's width and height respectively; \"keyboard\" as object class refers to OBJ_CLASS = 'keyboard'; (5, 647) as coordinate refers to X and Y coordinates of the bounding box where X = 5 and Y = 647;",
    "idx": 3669
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t2:`has_attribute`]->(t1@`att_classes`)\nWHERE t1.`att_class_id` = t2.`att_class_id`\nAND (t1.`att_class` = 'picture')\nRETURN COUNT(t2.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many images have \"picture\" as their attribute class?",
    "evidence": "images have \"picture\" as their attribute class refer to IMG_ID where ATT_CLASS = 'picture';",
    "idx": 3674
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (img_obj@`img_obj`)\nWHERE img_obj.`img_id` = 12 AND img_obj.`y` = 0\nRETURN COUNT(img_obj.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the Y coordinate of image ID 12, how many are 0?",
    "evidence": "Y coordinate many are 0 refers to Y coordinates of the bounding box where Y = 0; image ID 12 refers to IMG_ID = 12;",
    "idx": 3681
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t1.`x` = 126 AND t1.`y` = 363)\nRETURN t1.`img_id` AS `img_id`, t2.`obj_class` AS `obj_class`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What object class is in the X and Y coordinates of 126 and 363?",
    "evidence": "object class refers to OBJ_CLASS; X and Y coordinates of 126 and 363 refer to coordinates of the bounding box where X = 126 and Y = 363;",
    "idx": 3685
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`pred_classes`)\nMATCH ()-[t1:`has_relationship`]->()\nWHERE t1.`pred_class_id` = t2.`pred_class_id`\nAND (t1.`img_id` = 68)\nRETURN t2.`pred_class` AS `pred_class`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the predicate class of image ID 68?",
    "evidence": "predicate class of image ID 68 refers to PRED_CLASS where IMG_ID = 68;",
    "idx": 3687
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`pred_classes`)\nMATCH ()-[t1:`has_relationship`]->()\nWHERE t1.`pred_class_id` = t2.`pred_class_id`\nAND (t1.`img_id` = 107 AND t2.`pred_class` = 'has')\nRETURN COUNT(t2.`pred_class`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many 'has' predicate classes does image ID 107 have?",
    "evidence": "has' predicate classes refers to PRED_CLASS = 'has'; image ID 107 refers to IMG_ID = 107;",
    "idx": 3688
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t2:`has_attribute`]->(t1@`att_classes`)\nWHERE t1.`att_class_id` = t2.`att_class_id`\nAND (t2.`img_id` = 2355735 AND t1.`att_class` = 'blue')\nRETURN COUNT(t1.`att_class`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many 'blue' attribute classes are there on image ID 2355735?",
    "evidence": "blue' attribute classes on image ID 2355735 refer to ATT_CLASS = 'blue' where IMG_ID = 2355735;",
    "idx": 3692
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nORDER BY country.`lifeexpectancy`  NULLS FIRST \nRETURN country.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country has the shortest life expectancy?",
    "evidence": "shortest life expectancy refers to MIN(LifeExpectancy);",
    "idx": 3694
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (countrylanguage@`countrylanguage`)\nRETURN sum(CASE  WHEN countrylanguage.`language` = 'Portuguese' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many countries use Portuguese?",
    "evidence": "Portuguese refers to `Language` = 'Portuguese';",
    "idx": 3697
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (city@`city`)\nWHERE city.`district` = 'England'\nRETURN COUNT(city.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities are there in England?",
    "evidence": "England refers to District = 'England';",
    "idx": 3698
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "CALL {\nMATCH (country_sub0@`country`)\nRETURN MAX(country_sub0.`surfacearea`) AS `_col_0` \n}\nMATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`surfacearea` = _col_0)\nRETURN t2.`id` AS `id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities are there in the country with the largest surface area?",
    "evidence": "largest surface area refers to MAX(SurfaceArea);",
    "idx": 3699
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`name` = 'San Marino')\nRETURN t1.`capital` AS `capital`, t2.`population` AS `population`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the capital city and population of San Marino?",
    "evidence": "capital city refers to Capital; San Marino is a name of country;",
    "idx": 3700
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nRETURN cast (sum(CASE WHEN t2.`language` = 'English' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`code`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many percent of countries in North America use English?",
    "evidence": "percentage = MULTIPLY(DIVIDE(COUNT(Language = 'English' WHERE Continent = 'North America'), COUNT(Language WHERE Continent = 'North America')), 1.0); North America refers to Continent = 'North America'; use English refers to Language = 'English';",
    "idx": 3710
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nORDER BY country.`surfacearea`  NULLS FIRST \nRETURN country.`continent` AS `continent` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which continent does the country with the smallest surface area belongs?",
    "evidence": "smallest surface area refers to MIN(smallest surface area);",
    "idx": 3712
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nORDER BY t2.`population` DESC NULLS LAST \nRETURN t1.`headofstate` AS `headofstate` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the head of the state where the most crowded city belongs?",
    "evidence": "head of the state refers to HeadOfState; most crowded city refers to MAX(Population);",
    "idx": 3713
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t2.`language` = 'English' AND t2.`isofficial` = 'T')\nORDER BY t1.`capital` DESC NULLS LAST \nRETURN t1.`code` AS `code` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the countries that officially use the English language, what country has the highest capital?",
    "evidence": "officially use the English language refers to `Language` = 'English' AND IsOfficial = 'T'; highest capital refers to MAX(Capital);",
    "idx": 3714
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t2.`name` = 'Sutton Coldfield')\nRETURN t1.`surfacearea` AS `surfacearea`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the surface area of the country where Sutton Coldfield city belongs?",
    "evidence": "",
    "idx": 3717
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`name` = 'Belgium' AND t2.`isofficial` = 'T')\nRETURN t2.`language` AS `language`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the official languages used in Belgium?",
    "evidence": "official languages refers to IsOfficial = 'T'; Belgium is a name of country;",
    "idx": 3719
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nRETURN sum(CASE  WHEN t1.`name` = 'Cyprus' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many languages are used in Cyprus?",
    "evidence": "Cyprus is a name of Country;",
    "idx": 3721
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t2.`district` = 'Santa Catarina')\nRETURN t1.`headofstate` AS `headofstate`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the head of the country where Santa Catarina district belongs?",
    "evidence": "head of the country refers to HeadOfState;",
    "idx": 3724
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`gnp` > 1500)\nRETURN cast (sum(CASE WHEN t2.`language` = 'English' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`code`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the countries that have GNP greater than 1500, what is the percentage of the countries have English as its language?",
    "evidence": "GNP greater than 1500 refers to GNP > 1500 ; percentage = MULTIPLY(DIVIDE(SUM(Code WHERE GNP > 1500 AND Language = 'English'), COUNT(Code WHERE GNP > 1500)) 1.0); English as its language refers to Language = 'English';",
    "idx": 3725
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`indepyear` = 1994\nRETURN country.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What country declared its independence in 1994?",
    "evidence": "declared independence in 1994 refers to IndepYear = 1994;",
    "idx": 3727
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`continent` = 'Asia'\nORDER BY country.`gnp` DESC NULLS LAST \nRETURN country.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What country in Asia has the largest gross national product(GNP)?",
    "evidence": "Asia refers to Continent = 'Asia'; largest gross national product refers to MAX(GNP);",
    "idx": 3729
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (city@`city`)\nWHERE city.`name` = 'PHL'\nRETURN COUNT(city.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities are in the Philippines?",
    "evidence": "Philippines refers to CountryCode = 'PHL';",
    "idx": 3730
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`name` = 'Ukraine'\nRETURN country.`localname` AS `localname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the local name of Ukraine that they are also known for?",
    "evidence": "Ukraine is a name of country;",
    "idx": 3731
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`governmentform` = 'Socialistic Republic'\nRETURN COUNT(country.`code`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many countries have Socialistic Republic form of government?",
    "evidence": "Socialistic Republic form of government refers to GovernmentForm = 'Socialistic Republic';",
    "idx": 3732
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`name` = 'China' AND t2.`isofficial` = 'T')\nRETURN t2.`language` AS `language`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the official language of China?",
    "evidence": "official language refers to IsOfficial = 'T'; China is a name of country;",
    "idx": 3733
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`name` = 'China' AND t2.`language` = 'Chinese')\nRETURN t2.`percentage` AS `percentage`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many percent of the population of China used Chinese as their language?",
    "evidence": "percent refers to Percentage; China is a name of country; use Chinese as their language refers to Language = 'Chinese';",
    "idx": 3734
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t2.`name` = 'Manila')\nRETURN t1.`governmentform` AS `governmentform`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the form of government that the city of Manila has?",
    "evidence": "form of government refers to GovernmentForm;",
    "idx": 3735
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`name` = 'Philipiines')\nRETURN t1.`capital` AS `capital`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the capital city of the Philippines?",
    "evidence": "capital city refers to Capital; Philippines is a name of country;",
    "idx": 3736
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t2.`name` = 'Pyongyang')\nRETURN t1.`headofstate` AS `headofstate`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the head of state of the country where the city of Pyongyang is under?",
    "evidence": "",
    "idx": 3738
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`name` = 'Italy')\nRETURN sum(CASE  WHEN t2.`isofficial` = 'F' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many unofficial languages are used in Italy?",
    "evidence": "unofficial languages refers to IsOfficial = 'F'; Italy is a name of country;",
    "idx": 3739
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`name` = 'Russian Federation')\nORDER BY t2.`population`  NULLS FIRST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What city in Russia has the least population?",
    "evidence": "Russia is a name of country; least population refers to MIN(Population);",
    "idx": 3740
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nORDER BY t1.`population` DESC NULLS LAST \nRETURN t1.`capital` AS `capital` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the capital city of the country with largest population?",
    "evidence": "capital city refers to Capital; largest population refers to MAX(Population);",
    "idx": 3742
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nORDER BY country.`surfacearea`  NULLS FIRST \nRETURN country.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country has the smallest surface area?",
    "evidence": "smallest surface area refers to MIN(smallest surface area);",
    "idx": 3745
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nORDER BY t1.`population`  NULLS FIRST \nRETURN t2.`language` AS `language` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the language of the smallest population country?",
    "evidence": "smallest population refers to MIN(Population);",
    "idx": 3747
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t1.`name` = 'Australia' AND t2.`language` = 'English')\nRETURN t2.`percentage` AS `percentage`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of English used in Australia?",
    "evidence": "English refers to Language = 'English'; Australia is a name of country;",
    "idx": 3750
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nORDER BY t2.`population` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country has the most crowded city in the world?",
    "evidence": "most crowded city refers to MAX(Population);",
    "idx": 3752
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nORDER BY t1.`population` DESC NULLS LAST \nRETURN t2.`lifeexpectancy` AS `lifeexpectancy` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the life expectancy of residents in the most crowded city?",
    "evidence": "most crowded city refers to MAX(Population);",
    "idx": 3753
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nORDER BY t1.`population`  NULLS FIRST \nRETURN t2.`gnp` AS `gnp` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the GNP of the least crowded city in the world?",
    "evidence": "least crowded city refers to MIN(Population);",
    "idx": 3754
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nORDER BY t1.`population` DESC NULLS LAST,t2.`surfacearea` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country has the smallest surface area and the most crowded city?",
    "evidence": "smallest surface area refers to MIN(smallest surface area); most crowded city refers to MAX(Population);",
    "idx": 3755
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t2.`language` = 'Arabic')\nRETURN avg(t1.`lifeexpectancy`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average life expentancy of countries that speak Arabic?",
    "evidence": "average life expectancy = AVG(LifeExpectancy); speak Arabic refers to `Language` = 'Arabic';",
    "idx": 3758
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t2@`city`)-[located_in_0:`located_in`]->(t1@`country`)\nWHERE t1.`code` = t2.`countrycode`\nAND (t2.`name` = 'Shanghai')\nRETURN cast ((t1.`gnp` - t1.`gnpold`) as float) / t1.`gnpold` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the GNP growth rate by the country of Shanghai?",
    "evidence": "GNP growth rate = DIVIDE(SUBTRACT(GNP, GNPOld), GNPOld); Shanghai is a name of city;",
    "idx": 3759
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (city@`city`)\nWHERE city.`name` = 'Zaanstad'\nRETURN city.`district` AS `district`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the district of Zaanstad?",
    "evidence": "Zaanstad is a name of city;",
    "idx": 3760
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (city@`city`)\nORDER BY city.`population` DESC NULLS LAST \nRETURN city.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What city has the highest population?",
    "evidence": "highest population refers to MAX(Population);",
    "idx": 3761
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nORDER BY country.`surfacearea` DESC NULLS LAST \nRETURN country.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What country has the largest surface area?",
    "evidence": "largest surface area refers to MAX(SurfaceArea);",
    "idx": 3763
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`lifeexpectancy` = 75.1\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many countries have a life expectancy of 75.1?",
    "evidence": "",
    "idx": 3764
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`name` = 'Brunei'\nRETURN country.`indepyear` AS `indepyear`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the year of independence of Brunei?",
    "evidence": "year of independence refers to IndepYear; Brunei is a name of country;",
    "idx": 3765
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`gnp` = 0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many countries have no GNP?",
    "evidence": "no GNP refers to GNP = 0;",
    "idx": 3766
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (country@`country`)\nRETURN avg(country.`surfacearea`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average surface area of all countries?",
    "evidence": "average surface area = AVG(SurfaceArea);",
    "idx": 3767
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)\nMATCH (t2@`countrylanguage`)\nWHERE t1.`countrycode` = t2.`countrycode`\nAND (t1.`district` = 'Tocantins')\nRETURN COUNT(DISTINCT t2.`language`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many languages are there in the country where Tocantins district belongs?",
    "evidence": "",
    "idx": 3768
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "CALL {\nMATCH (country_sub0@`country`)\nORDER BY country_sub0.`surfacearea` DESC NULLS LAST \nRETURN country_sub0.`name` AS `name` \nLIMIT 1\n}\nMATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nAND (t2.`name` = name)\nRETURN t1.`district` AS `district`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the districts that belong to the country with the largest surface area?",
    "evidence": "largest surface area refers to MAX(SurfaceArea);",
    "idx": 3769
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nAND (t2.`headofstate` = 'Kostis Stefanopoulos')\nRETURN COUNT(DISTINCT t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities are there in the country ruled by Kostis Stefanopoulos?",
    "evidence": "ruled by Kostis Stefanopoulos refers to HeadOfState = 'Kostis Stefanopoulos';",
    "idx": 3770
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nAND (t1.`isofficial` = 'T' AND t2.`name` = 'Greece')\nRETURN t1.`language` AS `language`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the official languages used in Greece?",
    "evidence": "official language refers to IsOfficial = 'T'; Greece is a name of country;",
    "idx": 3771
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)\nMATCH (t2@`countrylanguage`)\nWHERE t1.`countrycode` = t2.`countrycode`\nAND (t2.`isofficial` = 'T')\nORDER BY t1.`population`  NULLS FIRST \nRETURN t2.`language` AS `language` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the official languages of the country where you can find the city with the least population?",
    "evidence": "official language refers to IsOfficial = 'T'; least population refers to MIN(Population);",
    "idx": 3773
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nAND (t1.`district` = 'Namibe')\nRETURN t2.`surfacearea` AS `surfacearea`, t2.`gnp` AS `gnp`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the surface area and GNP of the country where Namibe district belongs?",
    "evidence": "",
    "idx": 3774
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nORDER BY t2.`surfacearea`  NULLS FIRST \nRETURN t1.`district` AS `district` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the districts that belong to the country with the lowest surface area?",
    "evidence": "lowest surface area refers to MIN(SurfaceArea);",
    "idx": 3776
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nAND (t1.`language` = 'Japanese')\nRETURN avg(t2.`lifeexpectancy`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the life expectancy of the countries that uses Japanese as their language?",
    "evidence": "uses Japanese as their language refers to `Language` = 'Japanese';",
    "idx": 3781
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nAND (t2.`surfacearea` = 652090)\nRETURN t2.`name` AS `name`, COUNT(t1.`name`) AS `_col_1` \nGROUP BY name",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities are there in the country with the surface area of 652090?",
    "evidence": "",
    "idx": 3782
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nAND (t1.`name` = 'Calama')\nRETURN t2.`lifeexpectancy` AS `lifeexpectancy`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the life expectancy of the people living in Calama city?",
    "evidence": "",
    "idx": 3784
  },
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`city`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nAND (t2.`governmentform` = 'Constitutional Monarchy')\nRETURN cast (sum(CASE  WHEN t1.`district` = 'England' THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In countries with constitutional monarchy, what is the percentage of cities located in the district of England?",
    "evidence": "constitutional monarchy refers to GovernmentForm = 'Constitutional Monarchy'; percentage = MULTIPLY(DIVIDE(SUM(GovernmentForm = 'Constitutional Monarchy' WHERE District = 'England'), COUNT(GovernmentForm = 'Constitutional Monarchy')), 100)",
    "idx": 3786
  }
]