[
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (dish@`dish`)\nWHERE dish.`times_appeared` > dish.`menus_appeared`\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many dishes appeared more than once on a menu?",
    "evidence": "appeared more than once on a menu refers to times_appeared > menus_appeared;",
    "idx": 2914
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE like(cast (menu.`date` as string),'2015-04%') AND menu.`sponsor` = 'Krogs Fiskerestaurant'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many menus sponsored by Krogs Fiske Restaurant were created in April 2015?",
    "evidence": "sponsored by Krogs Fiske Restaurant refers to sponsor = 'Krogs Fiskerestaurant'; created in April 2015 refers to date like '2015-04%';",
    "idx": 2915
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (dish@`dish`)\nORDER BY dish.`last_appeared` - dish.`first_appeared` DESC NULLS LAST \nRETURN dish.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which dish has the longest history?",
    "evidence": "longest history refers to MAX(SUBTRACT(last_appeared, first_appeared));",
    "idx": 2916
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE menu.`date` = date('1887-07-21') AND menu.`id` = 21380\nRETURN menu.`event` AS `event`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On 1887-07-21, what was the event that lead to the creation of menu id 21380?",
    "evidence": "On 1887-07-21 refers to date = '1887-07-21';",
    "idx": 2917
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nRETURN sum(CASE  WHEN t1.`name` = 'Puree of split peas aux croutons' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many menus include puree of split peas aux croutons?",
    "evidence": "puree of split peas aux croutons is a name of dish;",
    "idx": 2919
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nAND (CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(t2.`created_at`,length(t2.`created_at`)+1+(1-1)+4,-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(t2.`created_at`,length(t2.`created_at`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(t2.`created_at`,1-1+1+(4),-(4))  ELSE substring(t2.`created_at`,1-1,4) END = '2011' AND CASE  WHEN 7-1 < 0 AND 1 < 0  THEN substring(t2.`created_at`,length(t2.`created_at`)+1+(7-1)+1,-(1))  WHEN 7-1 < 0 AND 1 >= 0  THEN substring(t2.`created_at`,length(t2.`created_at`)+1+(7-1),1)  WHEN 7-1 >= 0 AND 1 < 0  THEN substring(t2.`created_at`,7-1+1+(1),-(1))  ELSE substring(t2.`created_at`,7-1,1) END = '4' AND t1.`highest_price` IS NULL)\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the dishes with a stable price that were created in April of 2011?",
    "evidence": "dishes with a stable price refers to highest_price is null; created in April of 2011 refers to SUBSTR(created_at,1,4) = '2011' and SUBSTR(created_at, 7, 1) = '4';",
    "idx": 2920
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t1:`has_dish`]->(t2@`dish`)\nWHERE t2.`id` = t1.`dish_id`\nAND (t2.`name` = 'Milk')\nORDER BY t1.`price` DESC NULLS LAST \nRETURN t1.`menu_page_id` AS `menu_page_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the menus that include milk, what is the menu page id of the menu that has the highest price?",
    "evidence": "milk is a name of dish; highest price refers to MAX(price);",
    "idx": 2922
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t1:`has_dish`]->(t2@`dish`)\nWHERE t2.`id` = t1.`dish_id`\nAND (t1.`xpos` > 0.75 AND t1.`ypos` > 0.75 AND t1.`menu_page_id` = 48706)\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the dishes shown in the lower right corner of menu page 48706?",
    "evidence": "shown in the lower right corner refers to xpos > 0.75 AND ypos > 0.75;",
    "idx": 2924
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[t3:`has_dish`]->(t4@`dish`)\nMATCH (t2@`menupage`)-[part_of_0:`part_of`]->(t1@`menu`)\nWHERE t1.`id` = t2.`menu_id`\nAND t2.`id` = t3.`menu_page_id`\nAND t3.`dish_id` = t4.`id`\nAND (t1.`sponsor` = 'THE SOCIETY OF THE CUMBERLAND' AND t1.`event` = '19NTH REUNION' AND t1.`place` = 'GRAND PACIFIC HOTEL,CHICAGO,ILL')\nRETURN t4.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the dishes in the menu sponsored by The Society of Cumberland that was created for the 19th reunion at Grand Pacific Hotel in Chicago, Illinois?",
    "evidence": "sponsored by The Society of Cumberland refers to sponsor = 'THE SOCIETY OF THE CUMBERLAND'; created for the 19th reunion refers to event = '19NTH REUNION'; Grand Pacific Hotel in Chicago, Illinois refers to place = 'GRAND PACIFIC HOTEL, CHICAGO, ILL';",
    "idx": 2925
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t1@`menupage`)-[t2:`has_dish`]->(t3@`dish`)\nMATCH (t1@`menupage`)-[part_of_0:`part_of`]->(t4@`menu`)\nWHERE t1.`id` = t2.`menu_page_id`\nAND t2.`dish_id` = t3.`id`\nAND t4.`id` = t1.`menu_id`\nAND (t3.`name` = 'Baked apples with cream' AND t3.`id` = 107)\nORDER BY t2.`price` DESC NULLS LAST \nRETURN t4.`sponsor` AS `sponsor` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the menus that include baked apples with cream, who is the sponsor of the menu with the highest price?",
    "evidence": "baked apples with cream is a name of dish; highest price refers to MAX(price);",
    "idx": 2926
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE menu.`event` = 'LUNCH'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many menus were created for lunch?",
    "evidence": "created for lunch refers to event = 'LUNCH';",
    "idx": 2928
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE menu.`page_count` > 10 AND menu.`dish_count` > 20\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the menus with over 10 pages, how many of them have over 20 dishes?",
    "evidence": "menus with over 10 pages refers to page_count > 10; over 20 dishes refers to dish_count > 20;",
    "idx": 2929
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nORDER BY menu.`dish_count` DESC NULLS LAST \nRETURN menu.`id` AS `id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ID of the menu with the most number of dishes?",
    "evidence": "most number of dishes refers to MAX(COUNT(dish_count));",
    "idx": 2930
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t1@`menupage`)-[part_of_0:`part_of`]->(t2@`menu`)\nWHERE t2.`id` = t1.`menu_id`\nAND (t2.`name` = 'Ritz Carlton')\nORDER BY t1.`full_height` DESC NULLS LAST \nRETURN t1.`page_number` AS `page_number` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which menu page of \"Ritz Carlton\" has the biggest height?",
    "evidence": "Ritz Carlton is a name of menu; biggest height refers to MAX(full_height);",
    "idx": 2935
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[part_of_0:`part_of`]->(t1@`menu`)\nWHERE t1.`id` = t2.`menu_id`\nAND (t2.`full_width` > 1000)\nRETURN sum(CASE  WHEN t1.`name` = 'Ritz Carlton' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the menu pages of \"Ritz Carlton\", how many of them have a width of over 1000?",
    "evidence": "Ritz Carlton is a name of menu; width of over 2490 refers to full_width > 1000;",
    "idx": 2936
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t1@`menupage`)-[t2:`has_dish`]->()\nWHERE t1.`id` = t2.`menu_page_id`\nAND (t1.`menu_id` = 12882)\nRETURN sum(CASE  WHEN t1.`page_number` = 1 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many dishes are there on page 1 of menu ID12882?",
    "evidence": "page 1 refers to page_number = 1;",
    "idx": 2937
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t1@`menupage`)-[t2:`has_dish`]->(t3@`dish`)\nWHERE t1.`id` = t2.`menu_page_id`\nAND t2.`dish_id` = t3.`id`\nAND (t3.`name` = 'Chicken gumbo')\nORDER BY t1.`full_width` DESC NULLS LAST \nRETURN t1.`id` AS `id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the menu pages on which the dish \"Chicken gumbo\" had appeared, what is the menu ID of the one with the biggest width?",
    "evidence": "Chicken gumbo is a name of dish; biggest width refers to MAX(full_width);",
    "idx": 2940
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nRETURN sum(CASE  WHEN t1.`name` = 'Chicken gumbo' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For how many times had the dish \"Chicken gumbo\" appeared on a menu page?",
    "evidence": "Chicken gumbo is a name of dish;",
    "idx": 2941
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nAND (t1.`highest_price` IS NULL)\nRETURN sum(CASE  WHEN t1.`name` = 'Paysanne Soup' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the menu pages on which the dish \"Paysanne Soup\" had appeared, how many of them had a stable price for the dish?",
    "evidence": "Paysanne Soup is a name of dish; stable price refers to highest_price is null;",
    "idx": 2942
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[t1:`has_dish`]->()\nMATCH (t2@`menupage`)-[part_of_0:`part_of`]->(t3@`menu`)\nWHERE t1.`menu_page_id` = t2.`id`\nAND t2.`menu_id` = t3.`id`\nAND (t2.`menu_id` = 12882)\nRETURN cast (COUNT(t1.`dish_id`) as float) / COUNT(t3.`page_count`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of dishes per menu page of menu ID12882?",
    "evidence": "average number of dishes per menu = DIVIDE(COUNT(dish_id), COUNT(page_count));",
    "idx": 2945
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[ordered_by_0:`ordered_by`]->(t1@`customer`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND (t1.`cust_name` = 'S K L Enterprises Inc')\nRETURN sum(t2.`weight`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of pounds being transported for S K L Enterprises Inc?",
    "evidence": "\"S K L Enterprises Inc\" is the cust_name; total number of pounds refers to Sum(weight)",
    "idx": 2946
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[ordered_by_0:`ordered_by`]->(t1@`customer`)\nMATCH (t2@`shipment`)-[handled_by_0:`handled_by`]->(t3@`driver`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND t3.`driver_id` = t2.`driver_id`\nAND (t1.`cust_name` = 'S K L Enterprises Inc' AND t3.`first_name` = 'Sue' AND t3.`last_name` = 'Newell')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the shipments done by Sue Newell, how many of them are for S K L Enterprises Inc?",
    "evidence": "\"S K L Enterprises Inc\" is the cust_name",
    "idx": 2947
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[ordered_by_0:`ordered_by`]->(t1@`customer`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND (t1.`state` = 'FL')\nRETURN COUNT(t1.`cust_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many shipments were ordered by a customer in Florida?",
    "evidence": "customer in Florida refers to state = 'FL'",
    "idx": 2948
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[destined_to_0:`destined_to`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`city_id`\nAND (t2.`city_name` = 'New York')\nRETURN MAX(t1.`weight`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the maximum weight being transported to New York during a single shipment?",
    "evidence": "\"New York\" is the city_name; maximum weight refers to Max(weight)",
    "idx": 2950
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[destined_to_0:`destined_to`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`city_id`\nRETURN sum(CASE  WHEN t2.`city_name` = 'New York' THEN t1.`weight` ELSE 0 END) - sum(CASE  WHEN t2.`city_name` = 'Chicago' THEN t1.`weight` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much more pounds in total were transported to New York than to Chicago?",
    "evidence": "\"New York\" and \"Chicago\" are both city_name; more pounds in total refers to Subtract (Sum(weight where city_name = 'New York'), Sum(weight where city_name = 'Chicago'))",
    "idx": 2951
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[ordered_by_0:`ordered_by`]->(t1@`customer`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND (t1.`cust_name` = 'S K L Enterprises Inc')\nRETURN avg(t2.`weight`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average weight of the goods being transported on a single shipment ordered by S K L Enterprises Inc?",
    "evidence": "\"S K L Enterprises Inc\" is the cust_name; average = Divide (Sum(weight), Count(ship_id))",
    "idx": 2953
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[destined_to_0:`destined_to`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`city_id`\nAND (t2.`state` = 'Florida')\nRETURN cast (sum(CASE  WHEN t2.`city_name` = 'Jacksonville' THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the shipments to Florida, what is the percentage of the shipment to Jacksonville?",
    "evidence": "\"Florida\" is the state; \"Jacksonville\" is city_name;",
    "idx": 2954
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[handled_by_0:`handled_by`]->(t2@`driver`)\nWHERE t1.`driver_id` = t2.`driver_id`\nAND (t2.`first_name` = 'Leszek' AND t2.`last_name` = 'Kieltyka' AND t1.`ship_date` = '2017-09-25')\nRETURN t1.`weight` AS `weight`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the shipment received by Leszek Kieltyka on 2017/9/25, what was its weight?",
    "evidence": "on 2017/9/25 refers to ship_date = '2017-09-25'",
    "idx": 2957
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[transported_by_0:`transported_by`]->(t1@`truck`)\nWHERE t1.`truck_id` = t2.`truck_id`\nAND (t1.`make` = 'Kenworth')\nRETURN cast (COUNT(t2.`ship_id`) as float) / COUNT(DISTINCT t1.`truck_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of shipments done by the Kenworth trucks?",
    "evidence": "\"Kenworth\" is the make of truck; average = Divide (Count(ship_id where make = 'Kenworth'), Count(truck_id where make = 'Kenworth))",
    "idx": 2959
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[handled_by_0:`handled_by`]->(t2@`driver`)\nWHERE t1.`driver_id` = t2.`driver_id`\nAND (t2.`first_name` = 'Sue' AND t2.`last_name` = 'Newell')\nORDER BY t1.`ship_date`  NULLS FIRST \nRETURN t1.`weight` AS `weight` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many pounds did Sue Newell transport during her first shipment?",
    "evidence": "first shipment refers to Min(ship_date); pounds refers to weight",
    "idx": 2960
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[ordered_by_0:`ordered_by`]->(t2@`customer`)\nWHERE t1.`cust_id` = t2.`cust_id`\nORDER BY t1.`weight` DESC NULLS LAST \nRETURN t2.`cust_name` AS `cust_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "To whom did the company transport its heaviest shipment?",
    "evidence": "heaviest shipment refers to Max(weight)",
    "idx": 2961
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[handled_by_0:`handled_by`]->(t2@`driver`)\nWHERE t1.`driver_id` = t2.`driver_id`\nORDER BY t1.`ship_date`  NULLS FIRST \nRETURN t2.`first_name` AS `first_name`, t2.`last_name` AS `last_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the driver who transported the first shipment of the company?",
    "evidence": "first shipment of the company refers to Min(ship_date); full name refers to first_name, last_name",
    "idx": 2962
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[ordered_by_0:`ordered_by`]->(t1@`customer`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND (t1.`cust_name` = 'Olympic Camper Sales Inc')\nRETURN COUNT(t2.`ship_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In total, how many shipments were transported to Olympic Camper Sales Inc?",
    "evidence": "\"Olympic Camper Sales Inc\" is the cust_name",
    "idx": 2963
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[ordered_by_0:`ordered_by`]->(t1@`customer`)\nMATCH (t2@`shipment`)-[destined_to_0:`destined_to`]->(t3@`city`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND t3.`city_id` = t2.`city_id`\nAND (t3.`city_name` = 'New York' AND t1.`cust_name` = 'Harry\\'s Hot Rod Auto & Truck Accessories')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the shipments bound for New York City were shipped to Harry's Hot Rod Auto and Truck Accessories?",
    "evidence": "\"New York\" is the city_name; 'Harry's Hot Rod Auto & Truck Accessories' is the cust_name",
    "idx": 2964
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[transported_by_0:`transported_by`]->(t1@`truck`)\nWHERE t1.`truck_id` = t2.`truck_id`\nAND (t1.`make` = 'Mack')\nORDER BY t2.`weight` DESC NULLS LAST \nRETURN COUNT(t2.`ship_id`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the top 5 heaviest shipments, how many shipments were transported via Mack?",
    "evidence": "heaviest shipment refers to Max(weight); via Mack refers to make = 'Mack'",
    "idx": 2965
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[transported_by_0:`transported_by`]->(t1@`truck`)\nWHERE t1.`truck_id` = t2.`truck_id`\nAND (t2.`weight` < 1000)\nORDER BY t1.`model_year`  NULLS FIRST \nRETURN COUNT(*) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many shipments with weight of no more than 1,000 pounds were shipped by the oldest truck?",
    "evidence": "weight of no more than 1000 pounds refers to weight < 1000; oldest truck refers to Min (model_year)",
    "idx": 2966
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[handled_by_0:`handled_by`]->(t1@`driver`)\nMATCH (t2@`shipment`)-[destined_to_0:`destined_to`]->(t3@`city`)\nWHERE t1.`driver_id` = t2.`driver_id`\nAND t3.`city_id` = t2.`city_id`\nAND (t1.`first_name` = 'Holger' AND t1.`last_name` = 'Nohr' AND t3.`city_name` = 'North Las Vegas')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many shipments did Holger Nohr transport to North Las Vegas overall?",
    "evidence": "\"North Las Vegas\" is the city_name",
    "idx": 2967
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[destined_to_0:`destined_to`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`city_id`\nORDER BY t2.`area` / t2.`population` DESC NULLS LAST \nRETURN COUNT(*) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many shipments were shipped to the most densely populated city?",
    "evidence": "most densely populated city refers to Max(Divide(area, population))",
    "idx": 2968
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[transported_by_0:`transported_by`]->(t1@`truck`)\nWHERE t1.`truck_id` = t2.`truck_id`\nAND (t1.`make` = 'Mack')\nRETURN avg(t2.`weight`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average shipment weight carried by the oldest Mack?",
    "evidence": "\"Mack\" is the make; oldest refers to Min(model_year); average shipment weight refers to AVG(weight)",
    "idx": 2971
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[handled_by_0:`handled_by`]->(t2@`driver`)\nWHERE t1.`driver_id` = t2.`driver_id`\nRETURN cast (COUNT(*) as float) / (12 * COUNT(t2.`driver_id`)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many shipments does each driver deliver per month on average?",
    "evidence": "shipment data was for 24 months in 2016 and 2017 respectively; deliver per month on average refers to Divide(Count(ship_id), Multiply (24, Count(driver_id)))",
    "idx": 2974
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[handled_by_0:`handled_by`]->(t2@`driver`)\nWHERE t1.`driver_id` = t2.`driver_id`\nAND (t1.`ship_id` = 1028)\nRETURN t2.`first_name` AS `first_name`, t2.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the first name of the driver who transported shipment id 1028?",
    "evidence": "shipment id 1028 refers to ship_id = 1028",
    "idx": 2977
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[ordered_by_0:`ordered_by`]->(t1@`customer`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND (t2.`weight` < 65000)\nRETURN avg(t1.`annual_revenue`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average annual revenue of customers who have shipment weight of less than 65000 pounds?",
    "evidence": "weight of less than 65000 pounds refers to weight < 65000; average annual revenue refers to AVG(annual_revenue)",
    "idx": 2979
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[ordered_by_0:`ordered_by`]->(t1@`customer`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND (t1.`cust_type` = 'wholesaler')\nRETURN cast (sum(CASE  WHEN t2.`weight` < 70000 THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of wholesaler customers who have shipment weight of not greater than 70000 pounds?",
    "evidence": "\"wholesaler\" is the cust_type; weight of not greater than 70000 pounds refers to weight < 70000; percentage = Divide (Count(cust_id where weight < 70000), Count(cust_id)) * 100",
    "idx": 2980
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (truck@`truck`)\nWHERE truck.`model_year` = 2009\nRETURN COUNT(truck.`truck_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many trucks were manufactured in year 2009?",
    "evidence": "manufactured in year 2009 refers to model_year = 2009",
    "idx": 2981
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`cust_type` = 'manufacturer'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are manufacturer?",
    "evidence": "\"manufacturer\" is the cust_type",
    "idx": 2982
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`cust_type` = 'retailer' AND customer.`state` = 'CA'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers who live in California that are retailers?",
    "evidence": "\"retailer\" is the cust_type; live in California refers to state = 'CA'",
    "idx": 2983
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (city@`city`)\nWHERE city.`state` = 'Connecticut'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities are in Connecticut?",
    "evidence": "\"Connecticut\" is the state",
    "idx": 2984
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "CALL {\nMATCH (city_sub0@`city`)\nWHERE city_sub0.`state` = 'California'\nRETURN MAX(city_sub0.`population`) AS `_col_0` \n}\nMATCH (city@`city`)\nWHERE city.`state` = 'California' AND city.`population` = _col_0\nRETURN city.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the most populated city in California?",
    "evidence": "in California refers to state = 'CA'; most populated city refers to Max(population)",
    "idx": 2985
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`cust_name` = 'Klett & Sons Repair'\nRETURN customer.`annual_revenue` AS `annual_revenue`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the annual revenue of Klett & Sons Repair?",
    "evidence": "\"Klett & Sons Repair\" is the cust_name",
    "idx": 2986
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[transported_by_0:`transported_by`]->(t1@`truck`)\nMATCH (t2@`shipment`)-[handled_by_0:`handled_by`]->(t3@`driver`)\nWHERE t1.`truck_id` = t2.`truck_id`\nAND t3.`driver_id` = t2.`driver_id`\nAND (t3.`first_name` = 'Zachery' AND t3.`last_name` = 'Hicks')\nRETURN DISTINCT t1.`make` AS `make`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the brand of the truck that is used to ship by Zachery Hicks?",
    "evidence": "brand of truck refers to make",
    "idx": 2988
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[handled_by_0:`handled_by`]->(t2@`driver`)\nWHERE t1.`driver_id` = t2.`driver_id`\nAND (t2.`first_name` = 'Zachery' AND t2.`last_name` = 'Hicks')\nORDER BY t1.`weight` DESC NULLS LAST \nRETURN t1.`ship_id` AS `ship_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the shipment ID of the heaviest shipment that Zachery Hicks transported?",
    "evidence": "shipment ID refers to ship_id; heaviest shipment refers to Max(weight)",
    "idx": 2990
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t2@`shipment`)-[ordered_by_0:`ordered_by`]->(t1@`customer`)\nMATCH (t2@`shipment`)-[destined_to_0:`destined_to`]->(t3@`city`)\nWHERE t1.`cust_id` = t2.`cust_id`\nAND t3.`city_id` = t2.`city_id`\nAND (t3.`state` = 'California')\nORDER BY t3.`population`  NULLS FIRST \nRETURN COUNT(t3.`city_name`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many shipments were shipped to the least populated city in California?",
    "evidence": "\"California\" is the state; least populated city refers to Min(population)",
    "idx": 2991
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[destined_to_0:`destined_to`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`city_id`\nORDER BY t1.`weight` DESC NULLS LAST \nRETURN t2.`city_name` AS `city_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which city did the heaviest shipment transported?",
    "evidence": "heaviest shipment refers to Max(weight); city refers to city_name",
    "idx": 2992
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[handled_by_0:`handled_by`]->(t2@`driver`)\nWHERE t1.`driver_id` = t2.`driver_id`\nAND (t1.`driver_id` = 23)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many shipments were shipped by the driver named Zachary Hicks?",
    "evidence": "",
    "idx": 2994
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[destined_to_0:`destined_to`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`city_id`\nORDER BY t2.`area` DESC NULLS LAST \nRETURN t1.`ship_id` AS `ship_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ship ID of shipments shipped to the city with the largest area?",
    "evidence": "city with largest area refers to Max(area)",
    "idx": 2995
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (t1@`shipment`)-[destined_to_0:`destined_to`]->(t2@`city`)\nWHERE t1.`city_id` = t2.`city_id`\nAND (t2.`city_name` = 'Cicero' AND t2.`state` = 'Illinois' AND t1.`weight` >= 9000 AND t1.`weight` <= 15000)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the shipments shipped to Cicero, Illinois, how many shipments weighed between 9,000 to 15,000?",
    "evidence": "\"Cicero\" is the city; 'Illinois' is the state",
    "idx": 2997
  }
]