[
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[t2:represented_by]->(`t3`:`congress`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`district` = `t3`.`cognress_rep_id`\nAND (`t1`.`population_2020` > 30000)\nWITH `t3`.`first_name` AS _groupby_col_0, `t3`.`last_name` AS _groupby_col_1\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all representatives of districts which have more than 30 000 population in 2020.",
    "evidence": "more than 30000 population in 2020 refers to population_2020 > 30000; representative refers to first_name, last_name",
    "idx": 4012
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`state` = 'MA')\nWITH `t1`.`zip_code` AS _groupby_col_0, COUNT(`t1`.`area_code`) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `zip_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which zip code in Massachusetts that have more than 1 area code?",
    "evidence": "\"Massachusetts\" is the state; zip code more than 1 area code refers to Count (zip_code) > 1",
    "idx": 4013
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`city` = 'Arecibo')\nRETURN DISTINCT `t1`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the county for Arecibo City.",
    "evidence": "\"Arecibo\" is the city",
    "idx": 4014
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t1`.`cbsa_name` = 'Barre, VT')\nRETURN COUNT(`t2`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many zip codes are under Barre, VT?",
    "evidence": "\"Barre, VT\" is the CBSA_name",
    "idx": 4015
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`county` = 'SAINT CROIX')\nORDER BY `t2`.`land_area` IS NULL ASC, `t2`.`land_area` DESC \nRETURN `t1`.`zip_code` AS `zip_code`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the zip code under Saint Croix county, which zip code has the biggest land area?",
    "evidence": "biggest land area refers to Max(land_area); \"SAINT CROIX\" is the county",
    "idx": 4016
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[t2:represented_by]->(`t3`:`congress`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`district` = `t3`.`cognress_rep_id`\nAND (`t3`.`first_name` = 'Griffin' AND `t3`.`last_name` = 'Tim')\nRETURN `t1`.`population_2020` - `t1`.`population_2010` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference between the 2020 population and the 2010 population for the districts represented by Griffin Tim.",
    "evidence": "difference = Subtract (population_2020, population_2010)",
    "idx": 4017
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t1`.`cbsa_name` = 'Atmore, AL')\nRETURN CASE WHEN `t2`.`population_2010`=0 THEN NULL ELSE toFloat(`t2`.`asian_population`) * 100 / `t2`.`population_2010` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Based on the population in 2020, calculate the percentage for the population of Asian in the zip code where the CBSA was Atmore, AL.",
    "evidence": "\"Atmore, AL\" is CBSA_name; percentage = Divide(asian_population, population_2020) * 100",
    "idx": 4018
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`area_code` = 939)\nORDER BY `t2`.`asian_population` IS NULL ASC, `t2`.`asian_population` DESC \nRETURN `t2`.`city` AS `city`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cities with an area code 939, which city has the highest Asian population?",
    "evidence": "highest asian population refers to Max(asian_population)",
    "idx": 4019
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nMATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t3`:`zip_data`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND `t2`.`zip_code` = `t3`.`zip_code`\nAND (`t3`.`elevation` = 1039)\nRETURN DISTINCT `t1`.`name` AS `name`, `t2`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the country and state of the city with elevation of 1039.",
    "evidence": "elevation of 1039 refers to elevation = 1039",
    "idx": 4020
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`zip_code` = 1028)\nRETURN `t1`.`alias` AS `alias`, `t2`.`elevation` AS `elevation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the alias and elevation of the city with zip code 1028.",
    "evidence": "",
    "idx": 4021
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "CALL(*) {\nMATCH (`zip_data_sub0`:`zip_data`)\nRETURN MAX(`zip_data_sub0`.`land_area`) AS `_col_0`  \n}\nMATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`land_area` = `_col_0`)\nRETURN `t1`.`area_code` AS `area_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the area code of the city with the largest land area?",
    "evidence": "largest land area refers to Max(land_area)",
    "idx": 4022
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`white_population` >= 1700 AND `t2`.`white_population` <= 2000)\nRETURN `t1`.`area_code` AS `area_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the area code of the city with the white population ranging between 1700 to 2000.",
    "evidence": "",
    "idx": 4023
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`alias` = 'Leeds')\nRETURN sum(`t2`.`asian_population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the Asian population in the city with the alias Leeds?",
    "evidence": "",
    "idx": 4024
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t3`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t1`.`zip_code` = `t3`.`zip_code`\nAND (`t3`.`city` = 'Savoy')\nRETURN `t1`.`area_code` AS `area_code`, `t2`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the area code and country of the city named Savoy.",
    "evidence": "Savoy is the city;",
    "idx": 4025
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`population_2010` = 0)\nRETURN DISTINCT `t1`.`alias` AS `alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the alias of the cities with 0 population in 2010?",
    "evidence": "with 0 population in 2010 refers to population_2010 = 0;",
    "idx": 4026
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`area_code` = 608 AND `t2`.`daylight_savings` = 'Yes')\nRETURN COUNT(`t2`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cities with area code 608, how many cities implement daylight savings?",
    "evidence": "implement daylight savings refers to daylight_savings = 'Yes';",
    "idx": 4027
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`alias` = 'Amherst')\nRETURN avg(`t2`.`elevation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the average elevation of the cities with alias Amherst.",
    "evidence": "AVG(elevation) where alias = 'Amherst';",
    "idx": 4028
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nMATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t3`:`zip_data`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND `t2`.`zip_code` = `t3`.`zip_code`\nAND (`t3`.`city` = 'Dalton')\nWITH `t2`.`county` AS _groupby_col_0\nRETURN _groupby_col_0 AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the country and state of the city named Dalton?",
    "evidence": "Dalton is the city;",
    "idx": 4029
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`type` = 'Post Office')\nRETURN `t1`.`alias` AS `alias`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give at least five alias of cities with a postal point of post office.",
    "evidence": "postal point of post office refers to type = 'Post Office';",
    "idx": 4030
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`area_code` = 787)\nRETURN COUNT(CASE  WHEN `t2`.`type` = 'P.O. Box Only' THEN 1 ELSE NULL END) - COUNT(CASE  WHEN `t2`.`type` = 'Post Office' THEN 1 ELSE NULL END) AS `difference`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference in the number of cities with P.O. box only and cities with Post Office among the cities with area code 787?",
    "evidence": "SUBTRACT(COUNT(type = 'P.O. Box Only'), COUNT(type = 'Post Office')) where area_code = 787;",
    "idx": 4031
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`city` = 'Arroyo')\nRETURN CASE WHEN sum(`t2`.`population_2010`)=0 THEN NULL ELSE toFloat((sum(`t2`.`population_2020`) - sum(`t2`.`population_2010`))) * 100 / sum(`t2`.`population_2010`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cities belonging to the country named Arroyo, calculate the percentage of increase in the population in these cities from 2010 to 2020.",
    "evidence": "DIVIDE(SUBTRACT(SUM(population_2020)), SUM(population_2010)), SUM(population_2010) as percentage where county = 'ARROYO';",
    "idx": 4032
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'Texas' AND `t2`.`total_beneficiaries` > 10000)\nRETURN `t2`.`zip_code` AS `zip_code`, `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the postal points in Texas, provide the zip codes and cities of postal points which have total beneficiaries of above 10000.",
    "evidence": "Texas is the name of the state, in which name = 'Texas'; total beneficiaries of above 10000 refer to total_beneficiaries > 10000;",
    "idx": 4033
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`county` = 'DISTRICT OF COLUMBIA' AND `t2`.`black_population` > 20000)\nRETURN COUNT(`t1`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the postal points in the District of Columbia, how many of them have an area with above 20000 black population?",
    "evidence": "District of Columbia refers to county = 'DISTRICT OF COLUMBIA'; postal points refer to zip_code; area with above 20000 black population refers to black_population > 20000;",
    "idx": 4034
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`zip_code` = 19019)\nRETURN `t2`.`city` AS `city`, `t1`.`alias` AS `alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the city where zip code 19019 is located and the alias of that city.",
    "evidence": "",
    "idx": 4035
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`city` = 'Camuy')\nRETURN `t1`.`bad_alias` AS `bad_alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the bad alias of the postal point located in Camuy.",
    "evidence": "postal points refer to zip_code; Camuy is the city;",
    "idx": 4036
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'Illinois' AND `t2`.`daylight_savings` = 'Yes' AND `t2`.`region` = 'Midwest')\nRETURN COUNT(`t2`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the daylight savings areas in the Midwest region, how many postal points are there in Illinois?",
    "evidence": "postal points refer to zip_code; the daylight savings areas refer to daylight_savings = 'Yes'; Illinois is the name of the state, in which name = 'Illinois';",
    "idx": 4037
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'Virgin Islands')\nRETURN `t2`.`county` AS `county`, `t2`.`zip_code` AS `zip_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the countries and the zip codes in the Virgin Islands.",
    "evidence": "the Virgin Islands refer to state where name = 'Virgin Islands';",
    "idx": 4038
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`city` = 'Greeneville')\nRETURN `t2`.`zip_code` AS `zip_code`, `t1`.`alias` AS `alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the zip codes and the alias of Greeneville.",
    "evidence": "Greeneville is the city;",
    "idx": 4039
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t2`.`city` = 'Oxford')\nRETURN `t2`.`zip_code` AS `zip_code`, `t1`.`cbsa_name` AS `cbsa_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the zip codes and CBSA officers of the postal point in Oxford.",
    "evidence": "CBSA officers refer to CBSA_name; postal point refers to zip_code; Oxford is the city;",
    "idx": 4041
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t1`.`cbsa_name` = 'Kingsport-Bristol, TN-VA')\nRETURN `t2`.`zip_code` AS `zip_code`, `t2`.`organization` AS `organization`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the zip codes and their affiliated organization for the postal point under Kingsport-Bristol, TN-VA.",
    "evidence": "postal point under Kingsport-Bristol, TN-VA refers to zip_code where CBSA_name = 'Kingsport-Bristol, TN-VA'; affiliated organization refers to organization from CBSA;",
    "idx": 4042
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[t2:represented_by]->(`t3`:`congress`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`district` = `t3`.`cognress_rep_id`\nAND (`t1`.`organization` = 'Readers Digest')\nRETURN `t1`.`zip_code` AS `zip_code`, `t3`.`first_name` AS `first_name`, `t3`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the zip codes and the congress representatives' names of the postal points which are affiliated with Readers Digest.",
    "evidence": "representative's full names refer to first_name, last_name; postal points affiliated with Readers Digest refer to zip_code where organization = 'Readers Digest';",
    "idx": 4043
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'California')\nRETURN CASE WHEN COUNT(`t2`.`zip_code`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t2`.`type` = 'Post Office' THEN `t2`.`zip_code` ELSE NULL END)) * 100 / COUNT(`t2`.`zip_code`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the postal points in California, calculate the percentage of them in post office types.",
    "evidence": "DIVIDE(COUNT(zip_code where type = 'Post Office'), COUNT(zip_code)) as percentage where name = 'California';",
    "idx": 4044
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH ()-[t2:represented_by]->(`t1`:`congress`)\nWHERE `t1`.`cognress_rep_id` = `t2`.`district`\nAND (`t1`.`house` = 'House of Repsentatives')\nWITH `t2`.`zip_code` AS _groupby_col_0\nRETURN _groupby_col_0 AS `zip_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the zip code for the Senate house?",
    "evidence": "House of Repsentatives can stand for senate house",
    "idx": 4045
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'Georgia')\nWITH `t2`.`county` AS _groupby_col_0\nRETURN _groupby_col_0 AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the counties in Georgia.",
    "evidence": "Georgia is the name of the state, in which name = 'Georgia';",
    "idx": 4046
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`area_code` = 410)\nRETURN `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the locations of postal points with the area code \"410\".",
    "evidence": "latitude and longitude coordinates can be used to identify the location; postal points refer to zip_code;",
    "idx": 4047
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "CALL(*) {\nMATCH (`zip_data_sub0`:`zip_data`)\nRETURN MAX(`zip_data_sub0`.`avg_house_value`) AS `_col_0`  \n}\nMATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t2`.`avg_house_value` = `_col_0`)\nRETURN DISTINCT `t1`.`cbsa_name` AS `cbsa_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the CBSA of the city with the highest average house value?",
    "evidence": "the highest average house value refers to avg_house_value;",
    "idx": 4048
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`city` = 'East Setauket')\nRETURN `t1`.`bad_alias` AS `bad_alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the bad aliases of the postal points from East Setauket?",
    "evidence": "East Setauket is the city;",
    "idx": 4049
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`county` = 'WILCOX')\nRETURN sum(`t2`.`population_2010`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the population of Wilcox County in 2010?",
    "evidence": "population of Wilcox County in 2010 refers to SUM(population_2010) where county = 'WILCOX';",
    "idx": 4050
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t1`.`cbsa_type` = 'Micro')\nRETURN `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the cities with micro CBSA.",
    "evidence": "micro CBSA refers to CBSA_type = 'Micro';",
    "idx": 4051
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[t2:represented_by]->()\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nRETURN sum(CASE  WHEN `t2`.`district` = 'FL-10' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the number of households in the \"FL-10\" district?",
    "evidence": "",
    "idx": 4052
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`bad_alias` = 'Danzig')\nRETURN `t2`.`avg_income_per_household` AS `avg_income_per_household`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average household income in the city known as \"Danzig\"?",
    "evidence": "average household income refers to avg_income_per_household; city known as \"Danzig\" refers to bad_alias = 'Danzig';",
    "idx": 4053
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "CALL(*) {\nMATCH (`zip_data_sub0`:`zip_data`)\nRETURN avg(`zip_data_sub0`.`female_population`) AS `_col_0`  \n}\nMATCH (`t2`:`zip_data`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t2`.`female_population` > `_col_0`)\nRETURN DISTINCT `t2`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the states with an above-average female population?",
    "evidence": "above-average female population refers to female_population > DIVIDE(SUM(female_population), COUNT(state));",
    "idx": 4054
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nRETURN CASE WHEN sum(`t2`.`households`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`county` = 'CORYELL' THEN `t2`.`households` ELSE 0 END)) * 100 / sum(`t2`.`households`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of households are in \"Coroyell\" out of its state?",
    "evidence": "DIVIDE(SUM(households where county = 'CORYELL'), SUM(households)) as percentage;",
    "idx": 4055
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t2`.`city` = 'Cabo Rojo')\nWITH `t1`.`cbsa_name` AS _groupby_col_0, `t1`.`cbsa_type` AS _groupby_col_1\nRETURN _groupby_col_0 AS `cbsa_name`, _groupby_col_1 AS `cbsa_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name and the position of the CBSA officer in the city of Cabo Rojo?",
    "evidence": "name of the CBSA officer refers to CBSA_name; position of the CBSA officer refers to CBSA_type;",
    "idx": 4056
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`city` = 'Las Marias')\nRETURN `t1`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the country name of the city Las Marias.",
    "evidence": "",
    "idx": 4057
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[t2:represented_by]->(`t3`:`congress`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`district` = `t3`.`cognress_rep_id`\nAND (`t3`.`first_name` = 'Pierluisi' AND `t3`.`last_name` = 'Pedro')\nRETURN COUNT(DISTINCT `t1`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cities does congressman Pierluisi Pedro represent?",
    "evidence": "",
    "idx": 4058
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`city` = 'Aguadilla')\nRETURN `t1`.`bad_alias` AS `bad_alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names of bad aliases in the city of Aguadilla.",
    "evidence": "",
    "idx": 4059
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[t2:represented_by]->(`t3`:`congress`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`district` = `t3`.`cognress_rep_id`\nAND (`t1`.`city` = 'Guanica')\nRETURN `t3`.`first_name` AS `first_name`, `t3`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the name of the congressman represent in Guanica.",
    "evidence": "name of congressman implies full name which refers to first_name, last_name; Guanica is the city;",
    "idx": 4060
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nRETURN COUNT(CASE  WHEN `t2`.`city` = 'Aguada' THEN `t1`.`bad_alias` ELSE NULL END) - COUNT(CASE  WHEN `t2`.`city` = 'Aguadilla' THEN `t1`.`bad_alias` ELSE NULL END) AS `difference`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference in the number of bad alias between Aguada city and Aguadilla city?",
    "evidence": "SUBTRACT(COUNT(bad_alias where city = 'Aguada'), COUNT(bad_alias where city = 'Aguadilla'));",
    "idx": 4061
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t1`.`cbsa_type` = 'Metro')\nWITH `t2`.`state` AS _groupby_col_0, COUNT(`t1`.`cbsa_type`) AS _groupby_col_1\nWHERE _groupby_col_1 > 50\nRETURN _groupby_col_0 AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which state has greater than 50 CBSA officers of metro type?",
    "evidence": "greater than 50 CBSA officers of metro type refers to COUNT(CBSA_type = 'Metro') > 50;",
    "idx": 4062
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`county` = 'ARECIBO')\nRETURN sum(`t2`.`population_2020`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the population of Arecibo in 2020.",
    "evidence": "population of Arecibo in 2020 refers to SUM(population_2020) where county = 'ARECIBO';",
    "idx": 4063
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`population_2010` > 10000)\nRETURN DISTINCT `t1`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the name of the country with a population greater than 10000 in 2010.",
    "evidence": "population greater than 10000 in 2010 refers to population_2010 > 10000;",
    "idx": 4064
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nWITH `t1`.`county` AS _groupby_col_0\nORDER BY `t2`.`households` IS NULL ASC, `t2`.`households` DESC \nRETURN _groupby_col_0 AS `county`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the country with the largest number of households in a residential area.",
    "evidence": "the largest number of households refers to MAX(households);",
    "idx": 4065
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nRETURN CASE WHEN COUNT(`t1`.`zip_code`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t2`.`households` > 10000 THEN `t1`.`zip_code` ELSE NULL END)) * 100 / COUNT(`t1`.`zip_code`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of households in residential areas of countries over 10000.",
    "evidence": "DIVIDE(SUM(households > 10000), SUM(households)) as percentage;",
    "idx": 4066
  }
]