[
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game_platform`)-[available_on_0:available_on]->(`t1`:`platform`)\nMATCH (`t2`:`game_platform`)-[has_sales_0:has_sales]->(`t3`:`region_sales`)\nWHERE `t1`.`id` = `t2`.`platform_id`\nAND `t2`.`id` = `t3`.`game_platform_id`\nAND (`t1`.`platform_name` = 'PS2')\nRETURN CASE WHEN COUNT(`t1`.`id`)=0 THEN NULL ELSE sum(`t3`.`num_sales` * 100000) / COUNT(`t1`.`id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average game sales for the PS2 platform.",
    "evidence": "average = AVG(MULTIPLY(num_sales), 100000); PS2 refers to platform_name = 'PS2';",
    "idx": 2617
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t_sub0`:`game`)\nWHERE `t_sub0`.`game_name` =~ '(?i)(?s).*FIFA.*'\nRETURN `t_sub0`.`game_name` AS `game_name`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many FIFA games are there across all platforms?",
    "evidence": "FIFA games refers to game_name LIKE '%FIFA%';",
    "idx": 2620
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t3_sub0`:`game_platform`)-[has_sales_1:has_sales]->(`t2_sub0`:`region_sales`)-[sold_in_1:sold_in]->(`t1_sub0`:`region`)\nMATCH (`t3_sub0`:`game_platform`)-[available_on_1:available_on]->(`t4_sub0`:`platform`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`region_id`\nAND `t2_sub0`.`game_platform_id` = `t3_sub0`.`id`\nAND `t3_sub0`.`platform_id` = `t4_sub0`.`id`\nAND (`t1_sub0`.`region_name` = 'Europe')\nORDER BY `t2_sub0`.`num_sales` IS NULL ASC, `t2_sub0`.`num_sales` DESC \nRETURN `t4_sub0`.`platform_name` AS `platform_name`  LIMIT 1\n}\nWITH *\nRETURN `platform_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which platform is the most popular in Europe?",
    "evidence": "platform that is the most popular refers to platform_name WHERE MAX(num_sales); in Europe refers to region_name = 'Europe' ;",
    "idx": 2621
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t3`:`game_platform`)-[has_sales_0:has_sales]->(`t2`:`region_sales`)-[sold_in_0:sold_in]->(`t1`:`region`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`game_platform_id` = `t3`.`id`\nAND (`t2`.`num_sales` * 100000 > 200000 AND `t1`.`region_name` = 'Japan')\nRETURN DISTINCT `t3`.`release_year` AS `release_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the release year of the game with more than 200000 sales in Japan.",
    "evidence": "more than 200000 sales refers to SUM(num_sales) > 2; Japan refers to region_name = 'Japan';",
    "idx": 2628
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`region_sales`)\nWHERE `t`.`region_id` = 1\nRETURN `t`.`game_platform_id` AS `game_platform_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the game platform IDs of games with a region ID of 1.",
    "evidence": "",
    "idx": 2634
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`region_sales`)\nRETURN sum(CASE  WHEN `t`.`region_id` = 2 THEN `t`.`num_sales` ELSE 0 END) - sum(CASE  WHEN `t`.`region_id` = 3 THEN `t`.`num_sales` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference between sales of games from region ID 2 and region ID 3.",
    "evidence": "difference = SUBTRACT(SUM(num_sales WHERE region_id = 2), SUM(num_sales WHERE region_id = 3));",
    "idx": 2635
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game_platform`)\nWHERE `t`.`release_year` = 2007\nRETURN DISTINCT `t`.`platform_id` AS `platform_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the platform IDs of the games released in 2007.",
    "evidence": "released in 2007 refers to release_year = 2007;",
    "idx": 2636
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game_platform`)\nWHERE `t`.`platform_id` = 16\nRETURN `t`.`game_publisher_id` AS `game_publisher_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the game publisher IDs of the games with a platform ID of 16.",
    "evidence": "",
    "idx": 2637
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game_platform`)\nWHERE `t`.`release_year` = 1984\nRETURN COUNT(`t`.`game_publisher_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the number of game publisher IDs for games released in 1984.",
    "evidence": "released in 1984 refers to release_year = 1984;",
    "idx": 2638
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game_platform`)-[has_sales_0:has_sales]->(`t1`:`region_sales`)\nWHERE `t1`.`game_platform_id` = `t2`.`id`\nAND (`t1`.`region_id` = 3)\nRETURN `t2`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the platform IDs of the games with a region ID of 3.",
    "evidence": "",
    "idx": 2639
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game_platform`)-[available_on_0:available_on]->(`t2`:`platform`)\nWHERE `t1`.`platform_id` = `t2`.`id`\nAND (`t1`.`release_year` = 2000)\nRETURN DISTINCT `t2`.`platform_name` AS `platform_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of the platforms for games released in 2000.",
    "evidence": "name of the platforms refers to platform_name; released in 2000 refers to release_year = 2000;",
    "idx": 2642
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game_platform`)-[available_on_0:available_on]->(`t2`:`platform`)\nWHERE `t1`.`platform_id` = `t2`.`id`\nRETURN COUNT(CASE  WHEN `t2`.`platform_name` = 'PS3' THEN `t1`.`game_publisher_id` ELSE NULL END) - COUNT(CASE  WHEN `t2`.`platform_name` = 'X360' THEN `t1`.`game_publisher_id` ELSE NULL END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find out the difference between the number of publishers who released the games on the PS3 and X360.",
    "evidence": "difference = SUBTRACT(SUM(platform_name = 'PS3'), SUM(platform_name = 'X360')); PS3 refers to platform_name = 'PS3'; X360 refers to platform_name = 'X360';",
    "idx": 2643
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[belongs_to_0:belongs_to]->(`t2`:`genre`)\nWHERE `t1`.`genre_id` = `t2`.`id`\nAND (`t1`.`game_name` = 'Grand Theft Auto V')\nRETURN `t2`.`genre_name` AS `genre_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the genre of the game \"Grand Theft Auto V\"?",
    "evidence": "genre refers to genre_name; \"Grand Theft Auto V\" refers to game_name = 'Grand Theft Auto V';",
    "idx": 2646
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[belongs_to_0:belongs_to]->(`t2`:`genre`)\nWHERE `t1`.`genre_id` = `t2`.`id`\nAND (`t2`.`genre_name` = 'Racing')\nRETURN `t1`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the names of the games in the racing genre.",
    "evidence": "name of games refers to game_name; racing genre refers to genre_name = 'Racing';",
    "idx": 2647
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[belongs_to_0:belongs_to]->(`t2`:`genre`)\nWHERE `t1`.`genre_id` = `t2`.`id`\nAND (`t2`.`genre_name` = 'Fighting')\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the number of games in the fighting genre.",
    "evidence": "fighting genre refers to genre_name = 'Fighting';",
    "idx": 2648
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[t2:published_by]->()\nMATCH (`t3`:`game_platform`)-[available_on_0:available_on]->(`t4`:`platform`)\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`id` = `t3`.`game_publisher_id`\nAND `t3`.`platform_id` = `t4`.`id`\nAND (`t1`.`game_name` = 'Final Fantasy XIII-2')\nRETURN `t4`.`platform_name` AS `platform_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find out the platform of the game \"Final Fantasy XIII-2\".",
    "evidence": "platform of the game refers to platform_name; \"Final Fantasy XIII-2\" refers to game_name = 'Final Fantasy XIII-2';",
    "idx": 2650
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game_platform`)-[has_sales_0:has_sales]->(`t1`:`region_sales`)\nWHERE `t1`.`game_platform_id` = `t2`.`id`\nAND (`t2`.`release_year` = 2000)\nRETURN sum(`t1`.`num_sales`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total sales made by the games released in 2000.",
    "evidence": "total sales = SUM(num_sales); released in 2000 refers to release_year = 2000;",
    "idx": 2651
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game_platform`)-[has_sales_0:has_sales]->(`t1`:`region_sales`)\nWHERE `t1`.`game_platform_id` = `t2`.`id`\nRETURN sum(CASE  WHEN `t2`.`release_year` = 2000 THEN `t1`.`num_sales` ELSE 0 END) - sum(CASE  WHEN `t2`.`release_year` = 1990 THEN `t1`.`num_sales` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference in sales between the games released in 1990 and 2000.",
    "evidence": "difference = SUBTRACT(SUM(num_sales WHERE release_year = 2000), SUM(num_sales WHERE release_year = 1990));",
    "idx": 2652
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`region_sales`)\nWHERE `t`.`region_id` = 3\nRETURN avg(`t`.`num_sales` * 100000) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compute the average number of sales in region ID 3.",
    "evidence": "average = AVG(MULTIPLY(num_sales, 100000));",
    "idx": 2654
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`region_sales`)\nWHERE `t`.`game_platform_id` = 66\nRETURN sum(`t`.`num_sales`) * 100000 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total sales in all regions with game platform ID 66.",
    "evidence": "total sales in all regions = MULTIPLY(SUM(num_sales), 100000);",
    "idx": 2656
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game`)\nWHERE `t`.`id` = 44\nRETURN `t`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the game name of the game ID 44.",
    "evidence": "",
    "idx": 2657
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game_platform`)-[available_on_0:available_on]->(`t1`:`platform`)\nMATCH ()-[t3:publishes]->(`t4`:`game`)\nWHERE `t1`.`id` = `t2`.`platform_id`\nAND `t2`.`game_publisher_id` = `t3`.`id`\nAND `t3`.`game_id` = `t4`.`id`\nAND (`t1`.`platform_name` = 'Wii')\nRETURN `t4`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the games available on Wii.",
    "evidence": "games available refers to game_name; Wii refers to platform_name = 'Wii';",
    "idx": 2658
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game_platform`)\nMATCH ()-[t2:publishes]->(`t3`:`game`)\nWHERE `t1`.`game_publisher_id` = `t2`.`id`\nAND `t2`.`game_id` = `t3`.`id`\nAND (`t1`.`release_year` = 2015)\nRETURN `t3`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of games released in 2015.",
    "evidence": "names of games refers to game_name; released in 2015 refers to release_year = 2015;",
    "idx": 2659
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`region_sales`)-[sold_in_0:sold_in]->(`t1`:`region`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND (`t2`.`num_sales` * 100000 <= 20000)\nRETURN `t2`.`game_platform_id` AS `game_platform_id`, `t1`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the game platform ID and region name where the games achieved 20000 sales and below.",
    "evidence": "20000 sales and below refers to num_sales < 0.2;",
    "idx": 2662
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[belongs_to_0:belongs_to]->(`t2`:`genre`)\nWHERE `t1`.`genre_id` = `t2`.`id`\nAND (`t2`.`genre_name` = 'Strategy')\nRETURN `t1`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the name of strategy games.",
    "evidence": "strategy games refers to game_name WHERE genre_name = 'Strategy';",
    "idx": 2666
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[belongs_to_0:belongs_to]->(`t2`:`genre`)\nWHERE `t1`.`genre_id` = `t2`.`id`\nAND (`t1`.`game_name` IN ['Airlock', 'Airline Tycoon', 'Airblade'])\nRETURN `t2`.`genre_name` AS `genre_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the genre of the following game titled 'Airlock' , 'Airline Tycoon' , and 'Airblade', respectively.",
    "evidence": "genre refers to genre_name; 'Airlock', 'Airline Tycoon' , and 'Airblade' refers to game_name IN ('Airlock', 'Airline Tycoon', 'Airblade');",
    "idx": 2668
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`region_sales`)-[sold_in_0:sold_in]->(`t1`:`region`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND (`t1`.`region_name` = 'North America')\nRETURN sum(`t2`.`num_sales`) * 100000 AS `nums`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total number of sales in North America.",
    "evidence": "total number of sales = MULTIPLY(SUM(num_sales), 100000); North America refers to region_name = 'North America';",
    "idx": 2669
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game_platform`)\nMATCH ()-[t2:publishes]->(`t3`:`game`)\nWHERE `t1`.`game_publisher_id` = `t2`.`id`\nAND `t2`.`game_id` = `t3`.`id`\nAND (`t3`.`game_name` = 'Airborne Troops: Countdown to D-Day')\nRETURN `t1`.`platform_id` AS `platform_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the platform ID of the game titled Airborne Troops: Countdown to D-Day.",
    "evidence": "Airborne Troops: Countdown to D-Day refers to game_name = 'Airborne Troops: Countdown to D-Day';",
    "idx": 2671
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL(*) {\nMATCH (`t2_sub0`:`region_sales`)-[sold_in_1:sold_in]->(`t1_sub0`:`region`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`region_id`\nAND (`t1_sub0`.`region_name` = 'Europe')\nRETURN avg(`t2_sub0`.`num_sales` * 100000) * 30 AS `_col_0`  \n}\nMATCH (`t3`:`game_platform`)-[has_sales_0:has_sales]->(`t2`:`region_sales`)-[sold_in_0:sold_in]->(`t1`:`region`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`game_platform_id` = `t3`.`id`\nAND (`t1`.`region_name` = 'Europe' AND `t2`.`num_sales` * 100 * 100000 < `_col_0`)\nRETURN DISTINCT `t3`.`platform_id` AS `platform_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among games sold in Europe, list the platform ID of games with sales lesser than 30% of the average number of sales.",
    "evidence": "Europe refers to region_name = 'Europe'; sales lesser than 30% of the average number of sales refers to SUM(num_sales) < MULTIPLY(AVG(num_sales), 0.3);",
    "idx": 2677
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`title` = 'Stitching videos streamed by mobile phones in real-time'\nRETURN `paper`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the paper \"Stitching videos streamed by mobile phones in real-time\" about?",
    "evidence": "\"Stitching videos streamed by mobile phones in real-time\" is the Title of paper; what the paper is about refers to Keywords",
    "idx": 2679
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`fullname` = 'Concepts in Magnetic Resonance Part A' AND `t2`.`year` = 2008)\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of the papers published in the journal \"Concepts in Magnetic Resonance Part A\" in 2008.",
    "evidence": "journal \"Concepts in Magnetic Resonance Part A\" refers to FullName = 'Concepts in Magnetic Resonance Part A'; in 2018 refers to Year = 2018",
    "idx": 2680
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`fullname` = 'Concepts in Magnetic Resonance Part A')\nRETURN COUNT(`t2`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many papers were published in the journal \"Concepts in Magnetic Resonance Part A\"?",
    "evidence": "journal \"Concepts in Magnetic Resonance Part A\" refers to FullName = 'Concepts in Magnetic Resonance Part A'",
    "idx": 2681
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t2`.`title` = 'Area Effects in Cepaea')\nRETURN `t1`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the url of the journal in which the paper \"Area Effects in Cepaea\" was published?",
    "evidence": "url refers to HomePage; 'Area Effects in Cepaea' is the Title of paper",
    "idx": 2682
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t2`.`year` = 2011 AND `t1`.`shortname` = 'Mol Brain')\nRETURN COUNT(`t2`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many papers were published in 2011 in the journal whose short name is \"Mol Brain\"?",
    "evidence": "in 2011 refers to Year = 2011; 'Mol Brain' is the ShortName of journal",
    "idx": 2684
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nRETURN sum(CASE  WHEN `t1`.`fullname` = 'Cases Journal' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t1`.`fullname` = 'Molecular Brain' THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many more papers in total were published in the journal \"Cases Journal\" than in the journal \"Molecular Brain\" in percentage?",
    "evidence": "\"Cases Journal\" and \"Molecular Brain\" are FullName of journal; more paper in percentage = Subtract(Count(Id(FullName = 'Cases Journal')), Count(Id(FullName = 'Molecular Brain')))/ Count(Id(FullNmae = 'Molecular Brain')) * 100",
    "idx": 2693
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`journal`:`journal`)\nWHERE `journal`.`fullname` =~ '(?i)(?s).*computing.*'\nRETURN COUNT(`journal`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many journals have a word \"computing\" in its full name?",
    "evidence": "word computing refers to FullName LIKE '%computing%'",
    "idx": 2694
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`conference`:`conference`)\nWHERE `conference`.`homepage` = 'http://www.informatik.uni-trier.de/~ley/db/conf/ices/index.html'\nRETURN `conference`.`shortname` AS `shortname`, `conference`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the short name and full name of conference uses the homepage \"http://www.informatik.uni-trier.de/~ley/db/conf/ices/index.html\"?",
    "evidence": "",
    "idx": 2696
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`conferenceid` >= 160 AND `t1`.`conferenceid` <= 170)\nRETURN DISTINCT `t1`.`title` AS `title`, `t2`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the title of papers with a conference ID from 160 to 170, include their conference short name.",
    "evidence": "conference ID from 160 to 170 refers to ConferenceId BETWEEN 160 AND 170",
    "idx": 2698
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nMATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t3`:`conference`)\nWHERE `t1`.`id` = `t2`.`paperid`\nAND `t1`.`conferenceid` = `t3`.`id`\nAND (`t1`.`year` = 1999 AND `t2`.`name` =~ '(?i)(?s)Philip.*')\nRETURN `t1`.`title` AS `title`, `t3`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In year 1999, list the titles and conference's short name of paper authored by someone named \"Philip\".",
    "evidence": "in year 1999 refers to Year = 1999;  someone named \"Philip\" refers to Name LIKE 'Philip%'",
    "idx": 2700
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t1`.`id` = `t2`.`paperid`\nAND `t1`.`journalid` = `t3`.`id`\nAND (`t1`.`journalid` >= 245 AND `t1`.`journalid` <= 250 AND `t1`.`title` =~ '(?i)(?s).*chemiluminescence.*')\nRETURN `t2`.`name` AS `name`, `t3`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the authors and journal short name of the papers with \"chemiluminescence\" in its title and has a journal ID from 245 to 250.",
    "evidence": "with \"chemiluminescence\" in its title refers to Title LIKE 'chemiluminescence%'; journal ID from 245 to 250 refers to JournalId BETWEEN 245 AND 250",
    "idx": 2703
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`conferenceid` = 0 AND `t1`.`journalid` < 100)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the papers with conference ID of 0, list down the authors of papers with a journal ID less than 100.",
    "evidence": "Conference ID of 0 refers to ConferenceId = 0; journal ID of less than 100 refers to JournalId < 100",
    "idx": 2704
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t2`.`homepage` =~ '(?i)(?s)http://www.informatik.uni-trier.de/~ley/db/conf/.*')\nRETURN `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the paper IDs of papers presented in conferences has a homepage starts with \"http://www.informatik.uni-trier.de/~ley/db/conf/\"?",
    "evidence": "homepage starts with \"http://www.informatik.uni-trier.de/~ley/db/conf/\" refers to HomePage LIKE 'http://www.informatik.uni-trier.de/~ley/db/conf/%'",
    "idx": 2706
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t1`.`id` = `t2`.`paperid`\nAND `t1`.`journalid` = `t3`.`id`\nAND (`t1`.`year` >= 2000 AND `t1`.`year` <= 2005 AND `t1`.`title` =~ '(?i)(?s).*SOCIAL.*')\nRETURN `t3`.`homepage` AS `homepage`, `t2`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the journal homepages and author ID of the papers published in 2000 to 2005 with a word \"social\" in its title?",
    "evidence": "in 2000 to 2005 refers to Year BETWEEN 2000 AND 2005; a word \"social\" in its title refers to Title = '%SOCIAL%'",
    "idx": 2707
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`journalid` = 0 AND `t1`.`year` = 2009 AND NOT `t2`.`affiliation` IS NULL)\nRETURN DISTINCT `t2`.`authorid` AS `authorid`, `t2`.`affiliation` AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the author ID and their affiliations of authors of the papers with a journal ID of 0 and published in 2009.",
    "evidence": "published in 2009 refers to Year = 2009; journal ID of 0 refers to JournalId = 0",
    "idx": 2708
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`year` >= 2001 AND `paper`.`year` < 2011\nRETURN CASE WHEN COUNT(`paper`.`id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `paper`.`year` = 2001 THEN 1 ELSE 0 END)) / COUNT(`paper`.`id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Within the year of 2001 to 2010, find the paper published rate of 2001.",
    "evidence": "year of 2001 to 2010 refers to Year BETWEEN 2001 AND 2010; Percentage = Divide(Count (PaperId(Year = 2001)), Count (PaperID(Year BETWEEN 2001 AND 2010))) * 100",
    "idx": 2710
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`conference`:`conference`)\nWHERE `conference`.`shortname` = 'ICWE'\nRETURN `conference`.`fullname` AS `fullname`, `conference`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the conference full name of \"ICWE\" and it's homepage address.",
    "evidence": "\"ICWE\" is the ShortName of conference",
    "idx": 2711
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`author`:`author`)\nWHERE `author`.`affiliation` = 'University of Oulu'\nRETURN `author`.`name` AS `name`, `author`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the author's name and IDs who are affiliated with Univeristiy of Oulu.",
    "evidence": "\"University of Oulu\" is the Affiliation Organization",
    "idx": 2713
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t2`.`name` = 'Roger J. Marshall' AND `t1`.`conferenceid` = 0 AND `t1`.`journalid` = 0)\nRETURN `t1`.`title` AS `title`, `t2`.`affiliation` AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the title and affiliation of the preprinted paper written by \"Roger J.Marshal\".",
    "evidence": "\"Roger J. Marshall\" is the name of author; preprinted paper refers to ConferenceId = 0 AND JournalId = 0",
    "idx": 2714
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nMATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t3`:`conference`)\nWHERE `t1`.`id` = `t2`.`paperid`\nAND `t1`.`conferenceid` = `t3`.`id`\nAND (`t1`.`id` = 15)\nRETURN DISTINCT `t1`.`title` AS `title`, `t1`.`year` AS `year`, `t3`.`shortname` AS `shortname`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the paper title, published year, conference's short name and included author names in the paper ID of 15.",
    "evidence": "paper ID of 15 refers to PaperId = 15",
    "idx": 2715
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`title` = 'Inspection resistant memory: Architectural support for security FROM physical examination' AND `t2`.`affiliation` = 'Microsoft Research, USA')\nRETURN `t2`.`name` AS `name`, `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the author included in the paper of \"Inspection resistant memory: Architectural support for security from physical examination\", write down the author name and ID who were affiliated with Microsoft Research, USA.",
    "evidence": "\"Inspection resistant memory: Architectural support for security from physical examination\" is the title of paper;  'Microsoft Research, USA' is the Affiliation",
    "idx": 2717
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t1`.`id` = `t2`.`paperid`\nAND `t1`.`journalid` = `t3`.`id`\nAND (`t1`.`title` = 'Decreased Saliva Secretion and Down-Regulation of AQP5 in Submandibular Gland in Irradiated Rats')\nRETURN `t2`.`name` AS `name`, `t2`.`affiliation` AS `affiliation`, `t3`.`shortname` AS `shortname`, `t3`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the author name, affiliation, jounal short name and full name of the paper \"Decreased Saliva Secretion and Down-Regulation of AQP5 in Submandibular Gland in Irradiated Rats\".",
    "evidence": "\"Decreased Saliva Secretion and Down-Regulation of AQP5 in Submandibular Gland in Irradiated Rats\" is the Title of paper",
    "idx": 2718
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[presented_at_0:presented_at]->(`t1`:`conference`)\nWHERE `t1`.`id` = `t2`.`conferenceid`\nAND (`t1`.`fullname` = 'International Symposium of Robotics Research' AND `t2`.`year` = 2003)\nRETURN DISTINCT `t2`.`title` AS `title`, `t2`.`journalid` AS `journalid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the paper title and journal ID which were published under the conference name of \"International Symposium of Robotics Research\".",
    "evidence": "\"International Symposium of Robotics Research\" is the FullName of conference;",
    "idx": 2719
  }
]