[
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`essays`)\nMATCH (`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`school_city` =~ '(?i)(?s)Abington')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of projects by which schools in Abington was donated.",
    "evidence": "Abington is school_city;",
    "idx": 2398
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`teacher_acctid` = '822b7b8768c17456fdce78b65abcc18e')\nRETURN `t1`.`item_name` AS `item_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the resource names of project that teacher \"822b7b8768c17456fdce78b65abcc18e\" created.",
    "evidence": "teacher \"822b7b8768c17456fdce78b65abcc18e\" refers to teacher_acctid = '822b7b8768c17456fdce78b65abcc18e';",
    "idx": 2399
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nMATCH (`t3`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND `t2`.`projectid` = `t3`.`projectid`\nAND (`t3`.`donationid` =~ '(?i)(?s)b39547f29dfc25fb13c6e9e8d940dc43')\nRETURN DISTINCT `t1`.`project_resource_type` AS `project_resource_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the type of resource that donation \"b39547f29dfc25fb13c6e9e8d940dc43\" contain.",
    "evidence": "donation \"b39547f29dfc25fb13c6e9e8d940dc43\" refers to donationid = 'b39547f29dfc25fb13c6e9e8d940dc43'; type of resource refers to project_resource_type;",
    "idx": 2401
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`essays`)\nMATCH (`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`title` =~ '(?i)(?s)iMath')\nRETURN `t1`.`school_city` AS `school_city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which city does the school that project \"iMath\" donated to in?",
    "evidence": "iMath is the title; city refers to school_city;",
    "idx": 2406
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`donations`)-[donated_to_0:donated_to]->(`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`teacher_acctid` = '822b7b8768c17456fdce78b65abcc18e')\nRETURN `t2`.`payment_method` AS `payment_method`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How to pay the donation of the project that teacher \"822b7b8768c17456fdce78b65abcc18e\" created?",
    "evidence": "teacher \"822b7b8768c17456fdce78b65abcc18e\" refers to teacher_acctid = '822b7b8768c17456fdce78b65abcc18e'; how to pay the donation refers to payment_method;",
    "idx": 2407
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`donations`)-[donated_to_0:donated_to]->(`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`teacher_acctid` = '822b7b8768c17456fdce78b65abcc18e')\nRETURN `t2`.`donation_total` AS `donation_total`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much did the project that teacher \"822b7b8768c17456fdce78b65abcc18e\" created donate?",
    "evidence": "teacher \"822b7b8768c17456fdce78b65abcc18e\" refers to teacher_acctid = '822b7b8768c17456fdce78b65abcc18e'; donated refers to donation_total;",
    "idx": 2408
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`donations`)-[donated_to_0:donated_to]->(`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`schoolid` = 'd4af834b1d3fc8061e1ee1b3f1a77b85')\nRETURN `t2`.`is_teacher_acct` AS `is_teacher_acct`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Is the donor who donated to school \"d4af834b1d3fc8061e1ee1b3f1a77b85\" a teacher?",
    "evidence": "school \"d4af834b1d3fc8061e1ee1b3f1a77b85\" refers to schoolid = 'd4af834b1d3fc8061e1ee1b3f1a77b85'; donor is a teacher refers to is_teacher_acct = 't';",
    "idx": 2409
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`projects`:`projects`)\nWHERE `projects`.`school_county` = 'New York (Manhattan)' AND `projects`.`school_magnet` = 't'\nRETURN COUNT(`projects`.`schoolid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of public magnet schools in New York Manhattan.",
    "evidence": "public magnet school refers to school_magnet = 't'; in New York Manhattan refers to school_country = 'New York(Manhattan)';",
    "idx": 2414
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`donations`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (toString(`t2`.`donation_timestamp`) =~ '(?i)(?s)2012-09-06 14:44:29')\nRETURN `t1`.`short_description` AS `short_description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the short description for the project which got the donation at 14:44:29 on 2012/9/6.",
    "evidence": "donation at 14:44:29 on 2012/9/6 refers to donation_timestamp = '2012/9/6 14:44:29';",
    "idx": 2425
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`projects`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`title` =~ '(?i)(?s)Virtual Aquarium Needs Help!')\nRETURN `t2`.`schoolid` AS `schoolid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the school id for the project 'Virtual Aquarium Needs Help!'.",
    "evidence": "Virtual Aquarium Needs Help!' is the title;",
    "idx": 2428
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`essays`:`essays`)\nWHERE `essays`.`title` = 'Family History Project'\nRETURN `essays`.`need_statement` AS `need_statement`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the need statement of Family History Project.",
    "evidence": "Family History Project refer to title, need statement refer to need_statement",
    "idx": 2432
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`resources`:`resources`)\nWHERE `resources`.`item_name` = 'Classroom Keepers Management Center'\nRETURN DISTINCT `resources`.`vendor_name` AS `vendor_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the vendors that sell the item Classroom Keepers Management Center.",
    "evidence": "vendor refer to vendor_name; Classroom Keepers Management Center refer to item_name",
    "idx": 2434
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`resources`:`resources`)\nWHERE `resources`.`vendor_name` = 'Sax Arts & Crafts'\nRETURN DISTINCT `resources`.`project_resource_type` AS `project_resource_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the resource types available at Sax Arts & Crafts.",
    "evidence": "Sax Arts & Crafts refer to vendor_name; resource type available refer to project_resource_type\n",
    "idx": 2435
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`vendor_name` = 'Barnes and Noble')\nRETURN `t2`.`school_district` AS `school_district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the school districts that have bought resources from Barnes and Noble.",
    "evidence": "Barnes and Noble refer to vendor_name",
    "idx": 2439
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`item_name` = 'R & A Plant Genetics' AND `t1`.`vendor_name` = 'Benchmark Education')\nRETURN `t2`.`school_latitude` AS `school_latitude`, `t2`.`school_longitude` AS `school_longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the coordinates of the buyer of R & A Plant Genetics from Benchmark Education.",
    "evidence": "coordinates refer to (school_latitude, school_longitude); R & A Plant Genetics refer to item_name; Benchmark Education refer to vendor_name",
    "idx": 2440
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`school_latitude` = 40.735332 AND `t2`.`school_longitude` = -74.196014 AND `t2`.`school_district` = 'Newark School District')\nRETURN `t1`.`donation_message` AS `donation_message`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the messages of those who donated to the Newark School District in the coordinates of 40.735332, -74.196014.",
    "evidence": "message refer to donation_message; Newark School District refer to school_district; 40.735332, -74.196014 refer to (school latitude, school_longitude)",
    "idx": 2442
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`essays`)\nMATCH (`t3`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND `t2`.`projectid` = `t3`.`projectid`\nAND (`t1`.`title` = 'Lets Share Ideas' AND `t3`.`payment_method` = 'creditcard')\nRETURN `t3`.`donation_message` AS `donation_message`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the message of the donor of the project with the title of Lets Share Ideas who paid with a credit card.",
    "evidence": "message of the donor refer to donation_message; Lets Share Ideas refer to title; paid with a credit card refer to payment_method",
    "idx": 2444
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`resources`)-[requested_for_0:requested_for]->(`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`vendor_name` = 'ABC School Supply' AND `t2`.`project_resource_type` = 'Other' AND `t1`.`school_district` = 'Hillsborough Co Pub Sch Dist')\nRETURN `t2`.`item_unit_price` * `t2`.`item_quantity` AS `price`, `t1`.`school_latitude` AS `school_latitude`, `t1`.`school_longitude` AS `school_longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total price of items brought from ABC School Supply with a listed type of Other? Also include the list of the buyers' coordinates and school districts they belong to.",
    "evidence": "ABC School Supply refer to vendor_name; listed type as Other refer to project_resource_type = 'Other'; coordinates refer to coordinates(school_latitude, school_longitude); total price of items refer to SUM(MULTIPLY(item_unit_price, item_quantity where vendor_name = ’ABC School Supply’))\n\n",
    "idx": 2446
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`essays`)\nMATCH (`t3`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND `t2`.`projectid` = `t3`.`projectid`\nAND (`t1`.`title` = 'Lets Share Ideas' AND `t3`.`payment_method` = 'paypal')\nRETURN sum(`t3`.`donation_total`) AS `_col_0`, `t2`.`school_city` AS `school_city`, `t2`.`poverty_level` AS `poverty_level`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the sum of all the total amount donated to the essay project titled 'Lets Share Ideas' which were paid through paypal and indicate the city and poverty level.",
    "evidence": "paypal refer to payment method; Lets Share Ideas refer to title; city refer to school_city; total amount donated refer to SUM(donation_total of paypal where payment_method = ’paypal’)",
    "idx": 2447
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`resources`:`resources`)\nWHERE `resources`.`project_resource_type` = 'Technology' AND `resources`.`item_unit_price` <= 15\nRETURN `resources`.`vendorid` AS `vendorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many resources with a unit price less than 15 are not technology type? List them by vendor id",
    "evidence": "unit price less than 15 refers to item_unit_price< = 15; are not technology type refers to project_resource_type = 'technology'",
    "idx": 2452
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`projects`:`projects`)\nWHERE `projects`.`school_district` = 'Union Pub School District I-9' AND `projects`.`teacher_ny_teaching_fellow` = 't'\nRETURN `projects`.`schoolid` AS `schoolid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List by school id projects from schools located in the Union Pub School District I-9 that have a New York teaching fellow",
    "evidence": "located in the Union Pub School District I-9 refers to school_district = 'Union Pub School District I-9'; New York teaching fellow refers to teacher_ny_teaching_fellow = 't'",
    "idx": 2454
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`resources`:`resources`)\nWHERE `resources`.`project_resource_type` = 'Books'\nRETURN DISTINCT `resources`.`vendorid` AS `vendorid`, `resources`.`projectid` AS `projectid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the vendors of the book-type projects? List them with the project ID.",
    "evidence": "book-type projects refers to project_resource_type = 'Books'",
    "idx": 2456
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`projects`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`title` =~ '(?i)(?s)Team More Books!')\nRETURN `t2`.`teacher_ny_teaching_fellow` AS `teacher_ny_teaching_fellow`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find out if the project with the title Team More Books! has a New York teaching fellow.",
    "evidence": "title Team More Books! Refers to title = 'Team More Books!'; as a New York teaching fellow refers to teacher_ny_teaching_fellow = 't'",
    "idx": 2464
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`essays`)\nMATCH (`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`title` =~ '(?i)(?s)Photojournalists Want to Exhibit Their Best Works')\nRETURN `t1`.`date_posted` AS `date_posted`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did the project \"Photojournalists Want to Exhibit Their Best Works\" go live?",
    "evidence": "project \"Photojournalists Want to Exhibit Their Best Works\" refers to title = 'Photojournalists Want to Exhibit Their Best Works'; when project go live refers to datePosted",
    "idx": 2472
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`item_name` = 'Viewscreen LCD FROM Texas Instruments, TI-84 Plus')\nRETURN `t2`.`school_city` AS `school_city`, `t2`.`school_latitude` AS `school_latitude`, `t2`.`school_longitude` AS `school_longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where is the school that needs a \"Viewscreen LCD from Texas Instruments, TI-84 Plus\"? Provide the latitude and longitude of that school.",
    "evidence": "needs a \"Viewscreen LCD from Texas Instruments, TI-84 Plus\" refers to item_name = 'Viewscreen LCD from Texas Instruments, TI-84 Plus'; where is the school refers to school_city; latitude refers to school_latitude; longtitude refers to school_longitude",
    "idx": 2474
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`essays`)\nMATCH (`t3`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND `t2`.`projectid` = `t3`.`projectid`\nAND (`t1`.`title` = 'Look, Look, We Need a Nook!')\nRETURN sum(`t3`.`donation_total`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many donations does the project \"Look, Look, We Need a Nook!\" have?",
    "evidence": "project \"Look, Look, We Need a Nook!\" refers to title = 'Look, Look, We Need a Nook!'",
    "idx": 2475
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`donor_zip` = '7079')\nRETURN DISTINCT `t2`.`poverty_level` AS `poverty_level`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the poverty level of all the schools that received donations with the zip code \"7079\".",
    "evidence": "zip code \"7079\" refers to donor_zip = '7079'",
    "idx": 2476
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`vendor_name` = 'Sax Arts & Crafts')\nRETURN `t2`.`school_zip` AS `school_zip`, `t1`.`item_name` AS `item_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the items from \"Sax Arts & Crafts\" and the zip code of the schools that received them.",
    "evidence": "from \"Sax Arts & Crafts\" refers to vendor_name = 'Sax Arts & Crafts'; zip code of the schools refers school_zip",
    "idx": 2478
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`essays`)\nMATCH (`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`title` =~ '(?i)(?s)Wiping Away Bad Grades')\nRETURN `t1`.`school_longitude` AS `school_longitude`, `t1`.`school_latitude` AS `school_latitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the coordinates of the school with the project \"Wiping Away Bad Grades\"?",
    "evidence": "project \"Wiping Away Bad Grades\" title = 'Wiping Away Bad Grades'; coordinates refers to school_longitude, school_latitude",
    "idx": 2479
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`payment_included_campaign_gift_card` = 't')\nRETURN DISTINCT `t2`.`primary_focus_subject` AS `primary_focus_subject`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the primary subject of all the donations with a corporate sponsored giftcard.",
    "evidence": "corporate sponsored giftcard refers to payment_included_campaign_gift_card = 't'; primary subject refers to primary_focus_subject",
    "idx": 2480
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`essays`)\nMATCH (`t1`:`resources`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`project_resource_type` = 'Books')\nORDER BY `t1`.`item_unit_price` IS NULL ASC, `t1`.`item_unit_price` DESC \nRETURN `t1`.`item_name` AS `item_name`, `t2`.`short_description` AS `short_description`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the most expensive book item? Please provide a short description of projects related to those.",
    "evidence": "book item refers to project_resource_type = 'Books'; most expensive refers to MAX(item_unit_price)",
    "idx": 2481
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`essays`)\nMATCH (`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`title` =~ '(?i)(?s)Too Close for Comfort')\nRETURN `t1`.`grade_level` AS `grade_level`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For what grade was the project \"Too Close for Comfort\" for?",
    "evidence": "project \"Too Close for Comfort\" refers to title = 'Too Close for Comfort'; grade refers to grade_level",
    "idx": 2482
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`donor_zip` = '22205')\nRETURN sum(`t2`.`students_reached`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of students impacted by the projects with a donation from a donor with zip code \"22205\"?",
    "evidence": "zip code \"22205\" refers to donor_zip = '22205'; students impacted refers to students_reached",
    "idx": 2483
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`donations`)-[donated_to_1:donated_to]->(`t2_sub0`:`projects`)\nWHERE `t1_sub0`.`projectid` = `t2_sub0`.`projectid`\nAND (`t1_sub0`.`via_giving_page` = 't')\nWITH `t2_sub0`.`primary_focus_area` AS _groupby_col_0, sum(`t1_sub0`.`donation_total`) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `primary_focus_area`  LIMIT 1\n}\nMATCH (`t1`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nRETURN CASE WHEN COUNT(`t1`.`donation_total`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`via_giving_page` = 't' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`donation_total`) END AS `_col_0`, primary_focus_area  AS `result`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of donations are given via a giving or campaign page? List the primary area of those donations.",
    "evidence": "given via a giving or campaign page refers to via_giving_page = 't'; percentage refers to DIVIDE(count(case when via_giving_page = 't' then donationid else null end),count(donationid))*100; primary area of donation refers to primary_focus_area",
    "idx": 2484
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`resources`)-[requested_for_0:requested_for]->(`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`project_resource_type` = 'Technology')\nRETURN CASE WHEN COUNT(`t1`.`projectid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`vendor_name` = 'Best Buy for Business' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`projectid`) END AS `_col_0`   \nUNION ALL\nMATCH (`t2`:`resources`)-[requested_for_1:requested_for]->(`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`vendor_name` = 'Best Buy for Business' AND `t2`.`project_resource_type` = 'Technology')\nRETURN DISTINCT `t1`.`date_posted` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the technology items, what percentage of them are from Best Buy for Business? Provide the date of the project related to those items.",
    "evidence": "technology items refers to project_resource_type = 'Technology'; from Best Buy for Business refers to vendor_name = 'Best Buy for Business'; percentage refers to DIVIDE(count(case when vendor_name = 'Best Buy for Business'),count(projectid))",
    "idx": 2485
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL(*) {\nMATCH (`t_sub0`:`game`)\nWHERE `t_sub0`.`game_name` = '3D Lemmings'\nRETURN `t_sub0`.`genre_id` AS `genre_id`  \n}\nMATCH (`t1`:`game`)\nWHERE `t1`.`genre_id` = `genre_id`\nRETURN `t1`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the games that have the same game genre as 3D Lemmings.",
    "evidence": "game refers to game_name; 3D Lemmings refers to game_name = '3D Lemmings'",
    "idx": 2487
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[t2:published_by]->(`t3`:`publisher`)\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`publisher_id` = `t3`.`id`\nAND (`t3`.`publisher_name` = '10TACLE Studios')\nRETURN `t1`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the games published by 10TACLE Studios.",
    "evidence": "name refers to game_name; published by 10TACLE Studios refers to publisher_name = '10TACLE Studios'",
    "idx": 2491
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[t2:published_by]->(`t3`:`publisher`)\nMATCH (`t1`:`game`)-[belongs_to_0:belongs_to]->(`t4`:`genre`)\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`publisher_id` = `t3`.`id`\nAND `t1`.`genre_id` = `t4`.`id`\nAND (`t3`.`publisher_name` = '10TACLE Studios' AND `t4`.`genre_name` = 'Puzzle')\nRETURN `t1`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the games published by 10TACLE Studios and are puzzles.",
    "evidence": "name refers to game_name; published by 10TACLE Studios refers to publisher_name = '10TACLE Studios'; puzzle refers to genre_name = 'Puzzle'",
    "idx": 2493
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[t2:published_by]->(`t3`:`publisher`)\nMATCH (`t1`:`game`)-[belongs_to_0:belongs_to]->(`t4`:`genre`)\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`publisher_id` = `t3`.`id`\nAND `t1`.`genre_id` = `t4`.`id`\nAND (`t4`.`genre_name` = 'Puzzle')\nRETURN DISTINCT `t3`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the publishers of all the puzzle games.",
    "evidence": "name of publisher refers to publisher_name; puzzle refers to genre_name = 'Puzzle'",
    "idx": 2494
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`game`)-[t2_sub0:published_by]->(`t3_sub0`:`publisher`)\nMATCH (`t1_sub0`:`game`)-[belongs_to_1:belongs_to]->(`t4_sub0`:`genre`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`game_id`\nAND `t2_sub0`.`publisher_id` = `t3_sub0`.`id`\nAND `t1_sub0`.`genre_id` = `t4_sub0`.`id`\nAND (`t4_sub0`.`genre_name` = 'Puzzle')\nWITH `t3_sub0`.`publisher_name` AS _groupby_col_0, COUNT(DISTINCT `t1_sub0`.`id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `publisher_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the publisher that has published the most puzzle games?",
    "evidence": "name of publisher refers to publisher_name; puzzle refers to genre_name = 'Puzzle'; the most puzzle games refers to max(count(game_id where genre_name = 'Puzzle'))",
    "idx": 2495
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`game`)-[t2_sub0:published_by]->(`t3_sub0`:`publisher`)\nMATCH (`t1_sub0`:`game`)-[belongs_to_1:belongs_to]->(`t4_sub0`:`genre`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`game_id`\nAND `t2_sub0`.`publisher_id` = `t3_sub0`.`id`\nAND `t1_sub0`.`genre_id` = `t4_sub0`.`id`\nAND (`t4_sub0`.`genre_name` = 'Puzzle')\nWITH `t3_sub0`.`publisher_name` AS _groupby_col_0, COUNT(DISTINCT `t1_sub0`.`id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `publisher_name`, _groupby_col_1 AS `_col_1`  \n}\nWITH *\nRETURN COUNT(`publisher_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many publishers have published more than 3 puzzle games?",
    "evidence": "puzzle refers to genre_name = 'Puzzle'; more than 3 puzzle games refers to count(game_id where genre_name = 'Puzzle') > 3",
    "idx": 2496
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game`)\nWHERE `t`.`game_name` = 'Pro Evolution Soccer 2012'\nRETURN `t`.`genre_id` AS `genre_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the genre id of the game Pro Evolution Soccer 2012.",
    "evidence": "Pro Evolution Soccer 2012 refers to game_name = 'Pro Evolution Soccer 2012'",
    "idx": 2500
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`region`)\nWHERE `t`.`region_name` = 'Japan'\nRETURN `t`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the region id of Japan.",
    "evidence": "region id refers to region.id; Japan refers to region_name = 'Japan'",
    "idx": 2501
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t_sub0`:`region_sales`)\nWHERE `t_sub0`.`region_id` = 2\nWITH `t_sub0`.`game_platform_id` AS _groupby_col_0, sum(`t_sub0`.`num_sales`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `game_platform_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `game_platform_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the id of the game platform with the most sales in region 2.",
    "evidence": "id of the game platform refers to game_platform_id; the most sales refers to max(num_sales); region 2 refers to region_id = '2'",
    "idx": 2502
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t_sub0`:`game`)\nWITH `t_sub0`.`genre_id` AS _groupby_col_0, COUNT(`t_sub0`.`id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `genre_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `genre_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which genre has the most games? Show its id.",
    "evidence": "the most games refers to max(game_id); genre id refers to genre_id",
    "idx": 2503
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game`)\nWHERE `t`.`game_name` = 'Resident Evil Archives: Resident Evil'\nRETURN `t`.`genre_id` AS `genre_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the id of the game \"Resident Evil Archives: Resident Evil\"?",
    "evidence": "id of game refers to game.id; \"Resident Evil Archives: Resident Evil\" refers to game_name = 'Resident Evil Archives: Resident Evil'",
    "idx": 2504
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game_platform`)-[available_on_0:available_on]->(`t1`:`platform`)\nMATCH ()-[t3:published_by]->()\nWHERE `t1`.`id` = `t2`.`platform_id`\nAND `t2`.`game_publisher_id` = `t3`.`id`\nAND (`t1`.`platform_name` = 'X360' AND `t2`.`release_year` = 2010)\nRETURN COUNT(DISTINCT `t3`.`game_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the number of games which were released on X360 in 2010.",
    "evidence": "on X360 refers to platform_name = 'X360'; in 2010 refers to release_year = '2010'",
    "idx": 2505
  }
]