[
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`demog`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`geoid` = `t2`.`geoid`\nWITH `t2`.`income_k` AS _groupby_col_0, `t2`.`inhabitants_k` AS _groupby_col_1, `t1`.`age` AS _groupby_col_2, 0.8 * avg(`t1`.`age`) AS _groupby_col_3\nWHERE _groupby_col_2 > _groupby_col_3\nRETURN _groupby_col_0 AS `income_k`, _groupby_col_1 AS `inhabitants_k`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the income and number of inhabitants of customers with an age greater than the 80% of average age of all customers?",
    "evidence": "age greater than the 80% of average age refers to age > (AVG(age) * 0.8); income refers to INCOME_K; number of inhabitants refers to INHABITANTS_K;",
    "idx": 6519
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`educationnum` < 3 AND `customers`.`age` > 65\nRETURN `customers`.`id` AS `id`, `customers`.`geoid` AS `geoid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find and list the id and geographic ID of the elderly customers with an education level below 3.",
    "evidence": "elderly customers with an education level below 3 refer to age > 65 where EDUCATIONNUM < 3; geographic ID refers to GEOID;",
    "idx": 6521
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`demog`:`demog`)\nRETURN avg(`demog`.`income_k`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the geographic id of places where the income is above average.",
    "evidence": "geographic ID refers to GEOID; income is above average refers to INCOME_K > DIVIDE(SUM(INCOME_K), COUNT(GEOID));",
    "idx": 6522
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`mailings1_2`:`mailings1_2`)\nWHERE `mailings1_2`.`response` = 'false' AND `mailings1_2`.`ref_date` >= localdatetime('2007-02-01T00:00:00') AND `mailings1_2`.`ref_date` <= localdatetime('2007-02-28T00:00:00')\nRETURN COUNT(`mailings1_2`.`refid`) AS `custmoer_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the number of customers who did not respond in February of 2007.",
    "evidence": "did not respond refers to RESPONSE = 'false'; February of 2007 refers to REF_DATE BETWEEN '2007-02-01 12:00:00.0'AND '2007-02-28 12:00:00.0';",
    "idx": 6523
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`mailings1_2`:`mailings1_2`)\nWHERE `mailings1_2`.`response` = 'true'\nRETURN `mailings1_2`.`refid` AS `refid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the customer's reference ID with true response.",
    "evidence": "reference ID refers to REFID;",
    "idx": 6530
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`demog`:`demog`)\nWHERE `demog`.`inhabitants_k` < 30\nRETURN `demog`.`geoid` AS `geoid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the geographic identifier with an number of inhabitants less than 30.",
    "evidence": "geographic identifier with an number of inhabitants less than 30 refers to GEOID where INHABITANTS_K < 30;",
    "idx": 6532
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "WITH *, COLLECT { MATCH (`customers_sub0`:`customers`)\nWHERE `customers_sub0`.`educationnum` < 3 AND `customers_sub0`.`sex` = 'Female'\nRETURN `customers_sub0`.`geoid` AS `geoid`   } AS in_collect_0\nMATCH (`demog`:`demog`)\nWHERE `demog`.`geoid` IN in_collect_0\nRETURN `demog`.`income_k` AS `income_k`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the female customers with an level of education of 3 and below, list their income.",
    "evidence": "female customers with level of education of 3 and below refer to SEX = 'Female' where EDUCATIONNUM ≤ 3; income refers to INCOME_K;",
    "idx": 6535
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t1`:`customers`)\nMATCH (`t2`:`mailings1_2`)\nWHERE `t1`.`id` = `t2`.`refid`\nAND (`t1`.`educationnum` > 8 AND `t1`.`sex` = 'Female')\nRETURN DISTINCT `t1`.`marital_status` AS `marital_status`, `t2`.`response` AS `response`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the marital status and response of female customers with an level of education of 8 and above.",
    "evidence": "female customers with an level of education of 8 and above refer to SEX = 'Female' where EDUCATIONNUM ≥ 8;",
    "idx": 6538
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`demog`:`demog`)\nWHERE `demog`.`income_k` > 3300\nRETURN `demog`.`geoid` AS `geoid`, `demog`.`inhabitants_k` * `demog`.`income_k` * 12 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the geographic ID and total income per year when the average income is above 3300 dollar.",
    "evidence": "total income per year refers to MULTIPLY(12, INHABITANTS_K, INCOME_K) where INCOME_K > 3300; geographic ID refers to GEOID;",
    "idx": 6542
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`demog`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`geoid` = `t2`.`geoid`\nAND (`t1`.`sex` = 'Female' AND `t1`.`occupation` = 'Sales')\nRETURN `t2`.`inhabitants_k` * `t2`.`income_k` * 12 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find out the yearly income of geographic ID when the customer is female and occupation as sales.",
    "evidence": "yearly income of geographic ID refers to GEOID where MULTIPLY(INHABITANTS_K, INCOME_K, 12); SEX = 'Female';",
    "idx": 6543
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`demog`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`geoid` = `t2`.`geoid`\nAND (`t2`.`inhabitants_k` = 33.658 AND `t1`.`sex` = 'Female' AND `t1`.`marital_status` = 'Widowed')\nRETURN `t1`.`educationnum` AS `educationnum`, `t1`.`occupation` AS `occupation`, `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the geographic ID which has 33.658K of inhabitants, describe the education, occupation and age of female widow.",
    "evidence": "geographic ID which has 33.658K of inhabitants refers to GEOID where INHABITANTS_K = 33.658; education refers to EDUCATIONNUM; female widow refers to SEX = 'Female' where MARITAL_STATUS = 'Widowed';",
    "idx": 6544
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`mailings3`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`id` = `t2`.`refid`\nAND (`t1`.`geoid` = 134)\nRETURN `t2`.`response` AS `response`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the response status to customer whose geographic ID of 134.",
    "evidence": "GEOID = 134;",
    "idx": 6545
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t2`:`demog`)\nMATCH (`t1`:`customers`)\nWHERE `t1`.`geoid` = `t2`.`geoid`\nAND (`t1`.`id` = 209556 OR `t1`.`id` = 290135)\nRETURN `t2`.`income_k` AS `income_k`, `t2`.`inhabitants_k` * `t2`.`income_k` * 12 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the average income per month and yearly income of the geographic ID in which customer of ID \"209556\" and \"290135\".",
    "evidence": "the average income per month refers to INCOME_K; yearly income of geographic ID refers to GEOID where MULTIPLY(INHABITANTS_K, INCOME_K, 12);",
    "idx": 6546
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (`t1`:`customers`)\nMATCH (`t2`:`mailings1_2`)\nWHERE `t1`.`id` = `t2`.`refid`\nAND (`t2`.`refid` < 10 AND `t2`.`response` = 'true')\nRETURN `t1`.`educationnum` AS `educationnum`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the reference ID of under 10 who got response by marketing department, compare their education status.",
    "evidence": "reference ID of under 10 refers to REFID < 10; got response refers to RESPONSE = 'true'; education status refers to EDUCATIONNUM;",
    "idx": 6547
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nWHERE `community_area`.`side` = 'Central'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many community areas are there in Central Chicago?",
    "evidence": "Central Chicago refers to side = 'Central'",
    "idx": 6548
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nWHERE `community_area`.`community_area_name` = 'Lincoln Square'\nRETURN `community_area`.`side` AS `side`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which district is the community area Lincoln Square grouped into?",
    "evidence": "district refers to side; community area Lincoln Square refers to community_area_name = 'Lincoln Square'",
    "idx": 6549
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nORDER BY `community_area`.`population` IS NULL DESC, `community_area`.`population`  \nRETURN `community_area`.`community_area_name` AS `community_area_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which community area has the least population?",
    "evidence": "community area refers to community_area_name; the least population refers to min(population)",
    "idx": 6550
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`district_name` = 'Central'\nRETURN `district`.`commander` AS `commander`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the person responsible for the crime cases in Central Chicago?",
    "evidence": "the person responsible for the crime cases refers to commander; Central Chicago refers to district_name = 'Central'",
    "idx": 6551
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`district_name` = 'Central'\nRETURN `district`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the email address to contact the administrator of Central Chicago?",
    "evidence": "email address refers to email; Central Chicago refers to district_name = 'Central'",
    "idx": 6552
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`neighborhood`)-[located_in_0:located_in]->(`t2`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND (`t1`.`neighborhood_name` = 'Albany Park')\nRETURN `t2`.`community_area_name` AS `community_area_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "To which community area does the neighborhood Albany Park belong?",
    "evidence": "community area refers to community_area_name; the neighborhood Albany Park refers to neighborhood_name = 'Albany Park'",
    "idx": 6553
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`neighborhood`)-[located_in_0:located_in]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND (`t1`.`side` = 'Central')\nRETURN `t2`.`neighborhood_name` AS `neighborhood_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the neighborhoods in Central Chicago.",
    "evidence": "name of neighborhood refers to neighborhood_name; Central Chicago refers to side = 'Central'",
    "idx": 6554
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t1`.`district_name` = 'Central')\nRETURN `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the precise location coordinates of all the crimes in Central Chicago.",
    "evidence": "location coordinates refers to latitude, longitude; Central Chicago refers to district_name = 'Central'",
    "idx": 6555
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[handled_by_district_0:handled_by_district]->(`t2`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t2`.`district_name` = 'Central')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crimes had happened in Central Chicago?",
    "evidence": "Central Chicago refers to district_name = 'Central'",
    "idx": 6556
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[handled_by_district_0:handled_by_district]->(`t2`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t2`.`district_name` = 'Central' AND `t1`.`domestic` = 'TRUE')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the crimes that had happened in Central Chicago, how many of them were cases of domestic violence?",
    "evidence": "Central Chicago refers to district_name = 'Central'; case of domestic violence refers to domestic = 'TRUE'",
    "idx": 6557
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[handled_by_district_0:handled_by_district]->(`t2`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t2`.`district_name` = 'Central' AND `t1`.`arrest` = 'FALSE')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the case numbers of all the crimes with no arrest made in Central Chicago.",
    "evidence": "no arrest made refers to arrest = 'FALSE'; Central Chicago refers to district_name = 'Central'",
    "idx": 6558
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND (`t2`.`date` =~ '(?i)(?s).*1/2018.*')\nRETURN sum(CASE  WHEN `t1`.`community_area_name` = 'Woodlawn' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the crimes in Woodlawn, how many of them happened in January, 2018?",
    "evidence": "Woodlawn refers to community_area_name = 'Woodlawn'; in January 2018 refers to date like '%1/2018%'",
    "idx": 6559
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t2`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND (`t2`.`side` = 'Central')\nRETURN CASE WHEN COUNT(`t2`.`community_area_no`)=0 THEN NULL ELSE toFloat(COUNT(`t1`.`report_no`)) / COUNT(`t2`.`community_area_no`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of crimes in a neighborhood in Central Chicago?",
    "evidence": "Central Chicago refers to side = 'Central'; average number = divide(count(report_no), count(community_area_no))",
    "idx": 6560
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[handled_by_district_0:handled_by_district]->(`t2`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nRETURN CASE WHEN COUNT(`t1`.`case_number`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`district_name` = 'Central' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`case_number`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the crimes in all the districts in Chicago, what is the percentage of them happening in the Central district?",
    "evidence": "the Central district refers to district_name = 'Central'; percentage = divide(count(case_number where district_name = 'Central'), count(case_number)) * 100%",
    "idx": 6561
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nWHERE `community_area`.`side` = 'Far North '\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many community areas are in the Far North side?",
    "evidence": "the Far North side refers to side = 'Far North'",
    "idx": 6562
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`district_name` = 'Morgan Park'\nRETURN `district`.`commander` AS `commander`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the commander of Morgan Park district?",
    "evidence": "Morgan Park district refers to district_name = 'Morgan Park'",
    "idx": 6563
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t2`.`case_number` = 'JB100065')\nRETURN `t1`.`district_name` AS `district_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where did case No. JB100065 happen? Give the name of the district.",
    "evidence": "case No. JB100065 refers to case_number = 'JB100065'; name of the district refers to district_name",
    "idx": 6564
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[handled_by_district_0:handled_by_district]->(`t2`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t1`.`longitude` = '-87.63470194' AND `t1`.`latitude` = '41.66236555')\nRETURN `t2`.`district_name` AS `district_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where is the coordinate (41.66236555, -87.63470194) located? Give the name of the district.",
    "evidence": "coordinate (41.66236555, -87.63470194) refers to latitude = '41.66236555' AND longitude = '-87.63470194'; name of the district refers to district_name",
    "idx": 6565
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t2`.`case_number` = 'JB524952')\nRETURN `t1`.`commander` AS `commander`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the person who was responsible for case No.JB524952.",
    "evidence": "name of the person refers to commander; case No.JB524952 refers to case_number = 'JB524952'",
    "idx": 6566
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[classified_as_0:classified_as]->(`t2`:`iucr`)\nWHERE `t1`.`iucr_no` = `t2`.`iucr_no`\nAND (`t1`.`date` =~ '(?i)(?s).*9/8/2018.*' AND `t2`.`primary_description` = 'ASSAULT')\nRETURN sum(CASE  WHEN `t2`.`secondary_description` = 'SIMPLE' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many simple assaults happened on 2018/9/8?",
    "evidence": "simple assault refers to primary_description = 'ASSAULT'AND secondary_description = 'SIMPLE'; on 2018/9/8 refers to date like '%9/8/2018%'",
    "idx": 6567
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[classified_as_0:classified_as]->(`t2`:`iucr`)\nWHERE `t1`.`iucr_no` = `t2`.`iucr_no`\nAND (`t1`.`case_number` = 'JB296775')\nRETURN `t2`.`iucr_no` AS `iucr_no`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How severe was case JB296775? Give the index code for severity.",
    "evidence": "index code refers to iucr_no; case JB296775 refers to case_number = 'JB296775'",
    "idx": 6568
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t2`.`case_number` = 'JB103470')\nRETURN `t1`.`alderman_first_name` AS `alderman_first_name`, `t1`.`alderman_last_name` AS `alderman_last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who was the alderman of the legislative district where case No. JB103470 took place? Give the full name.",
    "evidence": "case No. JB103470 refers to case_number = 'JB103470'; full name refers to alderman_first_name, alderman_last_name",
    "idx": 6569
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`neighborhood`)-[located_in_0:located_in]->(`t2`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND (`t2`.`community_area_name` = 'West Englewood')\nRETURN `t1`.`neighborhood_name` AS `neighborhood_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the neighborhood name of West Englewood community.",
    "evidence": "West Englewood community refers to community_area_name = 'West Englewood'",
    "idx": 6570
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`neighborhood`)-[located_in_0:located_in]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nRETURN sum(CASE  WHEN `t1`.`community_area_name` = 'Roseland' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many different neighborhoods are there in Roseland community?",
    "evidence": "Roseland community refers to community_area_name = 'Roseland'",
    "idx": 6571
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[categorized_as_0:categorized_as]->(`t2`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t1`.`case_number` = 'JB134191')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the FBI code description of case No.JB134191.",
    "evidence": "case No.JB134191 refers to case_number = 'JB134191'",
    "idx": 6572
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND (`t2`.`arrest` = 'TRUE')\nRETURN sum(CASE  WHEN `t1`.`community_area_name` = 'North Lawndale' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of cases with arrests in North Lawndale community.",
    "evidence": "number of cases refers to count(case_number); arrest refers to arrest = 'TRUE'; North Lawndale community refers to community_area_name = 'North Lawndale'",
    "idx": 6573
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[classified_as_0:classified_as]->(`t2`:`iucr`)\nMATCH (`t1`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t3`:`community_area`)\nWHERE `t1`.`iucr_no` = `t2`.`iucr_no`\nAND `t1`.`community_area_no` = `t3`.`community_area_no`\nAND (`t2`.`primary_description` = 'THEFT' AND `t3`.`community_area_name` = 'West Englewood')\nRETURN CASE WHEN COUNT(`t1`.`case_number`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`secondary_description` = '$500 AND UNDER' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`case_number`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of under $500 thefts among all cases that happened in West Englewood?",
    "evidence": "under $500 refers to secondary_description = '$500 AND UNDER'; theft refers to primary_description = 'THEFT'; West Englewood refers to community_area_name = 'West Englewood'; percentage = divide(count(case_number where secondary_description = '$500 AND UNDER'), count(case_number)) where primary_description = 'THEFT' and community_area_name = 'West Englewood' * 100%",
    "idx": 6574
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nMATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t3`:`fbi_code`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND `t2`.`fbi_code_no` = `t3`.`fbi_code_no`\nAND (`t1`.`community_area_name` = 'Edgewater')\nRETURN CASE WHEN COUNT(`t2`.`case_number`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t3`.`title` = 'Larceny' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`case_number`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of larceny cases among all cases that happened in Edgewater community?",
    "evidence": "larceny case refers to title = 'Larceny'; Edgewater community refers to community_area_name = 'Edgewater'; percentage = divide(count(case_number where title = 'Larceny'), count(case_number)) where community_area_name = 'Edgewater' * 100%",
    "idx": 6575
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`crime`:`crime`)\nWHERE `crime`.`block` = '018XX S KOMENSKY AVE'\nRETURN sum(CASE  WHEN `crime`.`date` =~ '(?i)(?s)5/.*/2018.*' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crimes were committed at 018XX S KOMENSKY AVEin May 2018?",
    "evidence": " in May 2018 refers to date LIKE '5/%/2018%'",
    "idx": 6576
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nORDER BY `community_area`.`population` IS NULL ASC, `community_area`.`population` DESC \nRETURN `community_area`.`community_area_name` AS `community_area_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the community with the highest population?",
    "evidence": "name of the community refers to community_area_name; the highest population refers to max(population)",
    "idx": 6577
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`crime`:`crime`)\nWHERE `crime`.`date` =~ '(?i)(?s).*2018.*' AND `crime`.`domestic` = 'TRUE'\nRETURN sum(CASE  WHEN `crime`.`location_description` = 'ABANDONED BUILDING' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many incidents of domestic violence occurred in an abandoned building in 2018?",
    "evidence": "domestic violence refers to domestic = 'TRUE'; in an abandoned building refers to location_description = 'ABANDONED BUILDING'; in 2018 refers to date LIKE '%2018%'",
    "idx": 6578
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`crime`:`crime`)\nWHERE `crime`.`date` =~ '(?i)(?s).*2018.*' AND `crime`.`location_description` = 'ANIMAL HOSPITAL' AND `crime`.`fbi_code_no` = '08B'\nRETURN sum(CASE  WHEN `crime`.`arrest` = 'TRUE' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many arrests were made in 2018 in an animal hospital under FBI code 08B?",
    "evidence": "arrest refers to arrest = 'TRUE'; in 2018 refers to date LIKE '%2018%'; in an animal hospital refers to location_description = 'ANIMAL HOSPITAL'; FBI code 08B refers to fbi_code_no = '08B'",
    "idx": 6579
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`fbi_code`:`fbi_code`)\nWHERE `fbi_code`.`crime_against` = 'Society'\nRETURN `fbi_code`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the detailed description of all the crimes against society.",
    "evidence": "crime against society refers to crime_against = 'Society'",
    "idx": 6580
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[categorized_as_0:categorized_as]->(`t2`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nORDER BY `t2`.`fbi_code_no` IS NULL ASC, `t2`.`fbi_code_no` DESC \nRETURN `t2`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which crime was committed the most by criminals?",
    "evidence": "crime refers to title; committed the most refers to max(fbi_code_no)",
    "idx": 6581
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nMATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t3`:`fbi_code`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND `t2`.`fbi_code_no` = `t3`.`fbi_code_no`\nAND (`t1`.`district_name` = 'Albany Park' AND `t2`.`arrest` = 'TRUE' AND `t2`.`location_description` = 'APARTMENT')\nRETURN sum(CASE  WHEN `t3`.`title` = 'Criminal Sexual Abuse' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In Albany Park, how many arrests were made in an apartment due to criminal sexual abuse?",
    "evidence": "Albany Park refers to district_name = 'Albany Park'; in an apartment refers to location_description = 'APARTMENT'; criminal sexual abuse refers to title = 'Criminal Sexual Abuse'",
    "idx": 6582
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nMATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t3`:`fbi_code`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND `t2`.`fbi_code_no` = `t3`.`fbi_code_no`\nAND (`t1`.`community_area_name` = 'Rogers Park' AND `t3`.`title` = 'Robbery' AND `t3`.`fbi_code_no` = '3')\nRETURN `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the precise location or coordinate where most of the robberies in Rogers Park occurred?",
    "evidence": "precise location or coordinate refers to latitude, longitude; most refers to fbi_code_no = 3; robbery refers to title = 'Robbery'; Rogers Park refers to community_area_name = 'Rogers Park'",
    "idx": 6583
  }
]