[
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nWHERE CASE WHEN `lineitem`.`l_shipdate` is not NULL THEN apoc.temporal.format(`lineitem`.`l_shipdate`,'yyyy') ELSE NULL END < 1997 AND `lineitem`.`l_shipmode` = 'truck'\nRETURN `lineitem`.`l_linenumber` AS `l_linenumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List line items shipped by truck with delivery time before 1997.",
    "evidence": "line item refers to l_linenumber; shipped by truck refers to l_shipmode = 'truck'; delivery time before 1997 refers to year(l_shipdate) < 1997",
    "idx": 5115
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nWHERE CASE WHEN `lineitem`.`l_shipdate` is not NULL THEN apoc.temporal.format(`lineitem`.`l_shipdate`,'yyyy') ELSE NULL END < 1997 AND `lineitem`.`l_shipmode` = 'TRUCK'\nRETURN `lineitem`.`l_linenumber` AS `l_linenumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many line items were returned in 1998?",
    "evidence": "line item refers to l_linenumber; returned refers to returnflag = 'R'; in 1998 refers to year(l_shipdate) = 1998",
    "idx": 5116
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`c_acctbal` < 0\nRETURN `customer`.`c_name` AS `c_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of customers whose accounts are in debt.",
    "evidence": "name of customer refers to c_name; account in debt refers to c_acctbal < 0",
    "idx": 5118
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t1`.`o_orderpriority` = '1-URGENT')\nRETURN `t2`.`c_phone` AS `c_phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the phone numbers of customers whose order priority is urgent.",
    "evidence": "phone number refers to c_phone; order priority is urgent refers to o_orderpriority = '1-URGENT'",
    "idx": 5120
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`lineitem`)-[belongs_to_order_0:belongs_to_order]->(`t1`:`orders`)-[placed_by_0:placed_by]->(`t3`:`customer`)\nWHERE `t1`.`o_orderkey` = `t2`.`l_orderkey`\nAND `t1`.`o_custkey` = `t3`.`c_custkey`\nORDER BY `t2`.`l_discount` IS NULL ASC, `t2`.`l_discount` DESC \nRETURN `t3`.`c_name` AS `c_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name of customer whose order is applied with the highest discount.",
    "evidence": "customer name refers to c_name; the highest discount refers to max(l_discount)",
    "idx": 5121
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`lineitem`)-[belongs_to_order_0:belongs_to_order]->(`t1`:`orders`)\nWHERE `t1`.`o_orderkey` = `t2`.`l_orderkey`\nORDER BY `t1`.`o_totalprice` IS NULL ASC, `t1`.`o_totalprice` DESC \nRETURN `t1`.`o_orderkey` AS `o_orderkey`, `t2`.`l_shipdate` AS `l_shipdate`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the 5 orders with the highest total price, indicating the delivery date.",
    "evidence": "order refers to o_orderkey; the highest total price refers to max(o_totalprice); delivery date refers to l_shipdate",
    "idx": 5122
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t2`.`c_mktsegment` = 'FURNITURE')\nRETURN `t1`.`o_comment` AS `o_comment`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the comments describing orders from customers in the furniture segment.",
    "evidence": "comment refers to o_comment; furniture segment refers to c_mktsegment = 'FURNITURE'",
    "idx": 5123
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t1`.`o_totalprice` > 300000)\nRETURN `t2`.`c_name` AS `c_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate the names of the customers whose order with a total price over $300000.",
    "evidence": "customer name refers to c_name; a total price over $300000 refers to o_totalprice > 300000",
    "idx": 5124
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`customer`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`c_nationkey` = `t2`.`n_nationkey`\nAND (`t1`.`c_acctbal` > 5000 AND `t2`.`n_name` = 'INDIA')\nRETURN `t1`.`c_name` AS `c_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name customers in India with account balances over $5000.",
    "evidence": "customer name refers to c_name; India refers to n_name = 'INDIA'; account balance over $5000 refers to c_acctbal > 5000",
    "idx": 5125
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`supplier`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`s_nationkey` = `t2`.`n_nationkey`\nAND (`t2`.`n_name` = 'JAPAN')\nRETURN `t1`.`s_phone` AS `s_phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the phone numbers of suppliers from Japan.",
    "evidence": "phone number refers to s_phone; Japan refers to n_name = 'JAPAN'",
    "idx": 5126
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`lineitem`)-[belongs_to_order_0:belongs_to_order]->(`t1`:`orders`)-[placed_by_0:placed_by]->(`t3`:`customer`)\nWHERE `t1`.`o_orderkey` = `t2`.`l_orderkey`\nAND `t1`.`o_custkey` = `t3`.`c_custkey`\nAND (`t2`.`l_discount` = 0.1 AND CASE WHEN `t1`.`o_orderdate` is not NULL THEN apoc.temporal.format(`t1`.`o_orderdate`,'yyyy') ELSE NULL END >= 1994 AND CASE WHEN `t1`.`o_orderdate` is not NULL THEN apoc.temporal.format(`t1`.`o_orderdate`,'yyyy') ELSE NULL END <= 1995)\nRETURN `t3`.`c_name` AS `c_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate the names of customers whose orders are eligible for 10% discount with order dates between 1/1/1994 and 1/1/1995.",
    "evidence": "customer name refers to c_name; 10% discount refers to l_discount = 0.1; order dates between 1/1/1994 and 1/1/1995 refers to year(o_orderdate) = 1994 OR o_orderdate = '1995-01-01'",
    "idx": 5129
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`nation`)-[in_region_0:in_region]->(`t1`:`region`)\nWHERE `t1`.`r_regionkey` = `t2`.`n_regionkey`\nRETURN CASE WHEN COUNT(`t2`.`n_name`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t1`.`r_name` = 'America' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`n_name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of countries that belong to the American region.",
    "evidence": "the American region refers to r_name = 'America'; percentage = divide(count(n_name where r_name = 'America'), count(n_name)) * 100%",
    "idx": 5130
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`customer`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`c_nationkey` = `t2`.`n_nationkey`\nAND (`t2`.`n_name` = 'INDONESIA')\nRETURN CASE WHEN COUNT(`t1`.`c_mktsegment`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t1`.`c_mktsegment` = 'HOUSEHOLD' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`c_mktsegment`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate percentage of household segment in Indonesia.",
    "evidence": "household segment refers to c_mktsegment = 'HOUSEHOLD'; Indonesia refers to n_name = 'Indonesia'; percentage = divide(count(c_mktsegment = 'HOUSEHOLD'), count(c_mktsegment)) where n_name = 'Indonesia' * 100%",
    "idx": 5131
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`part`:`part`)\nWHERE `part`.`p_type` = 'PROMO BRUSHED STEEL'\nRETURN `part`.`p_name` AS `p_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the products under the type \"promo brushed steel\".",
    "evidence": "product name refers to p_name; type \"promo brushed steel\" refers to p_type = 'PROMO BRUSHED STEEL'",
    "idx": 5132
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`part`:`part`)\nWHERE `part`.`p_name` = 'burlywood plum powder puff mint'\nRETURN `part`.`p_comment` AS `p_comment`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the comment of the product \"burlywood plum powder puff mint\"?",
    "evidence": "comment refers to p_comment; product \"burlywood plum powder puff mint\" refers to p_name = 'burlywood plum powder puff mint'",
    "idx": 5133
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`part`:`part`)\nWHERE `part`.`p_type` = 'PROMO BRUSHED STEEL'\nRETURN `part`.`p_brand` AS `p_brand`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the brands that contain a part under the type \"promo brushed steel\".",
    "evidence": "brand refers to p_brand; type \"promo brushed steel\" refers to p_type = 'PROMO BRUSHED STEEL'",
    "idx": 5136
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`part_sub0`:`part`)\nWHERE `part_sub0`.`p_name` IN ['pink powder drab lawn cyan', 'cornflower sky burlywood green beige']\nRETURN `part_sub0`.`p_name` AS `p_name`, `part_sub0`.`p_size` AS `p_size`  \n}\nWITH *\nORDER BY `p_size` IS NULL ASC, `p_size` DESC \nRETURN `p_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which part has a bigger size, \"pink powder drab lawn cyan\" or \"cornflower sky burlywood green beige\"?",
    "evidence": "size refers to p_size; \"pink powder drab lawn cyan\" or \"cornflower sky burlywood green beige\" refers to p_name in ('pink powder drab lawn cyan', 'cornflower sky burlywood green beige')",
    "idx": 5138
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`supplier`:`supplier`)\nORDER BY `supplier`.`s_acctbal` IS NULL ASC, `supplier`.`s_acctbal` DESC \nRETURN `supplier`.`s_name` AS `s_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the top 3 suppliers with the most amount of money in their accounts.",
    "evidence": "supplier name refers to s_name; the most amount of money refers to max(s_acctbal)",
    "idx": 5142
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`supplier`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`s_nationkey` = `t2`.`n_nationkey`\nAND (`t2`.`n_name` = 'Germany')\nRETURN `t1`.`s_phone` AS `s_phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the phone numbers of all the suppliers in Germany.",
    "evidence": "phone number refers to s_phone; Germany refers to n_name = 'Germany'",
    "idx": 5143
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->(`t3`:`supplier`)\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND `t2`.`ps_suppkey` = `t3`.`s_suppkey`\nAND (`t1`.`p_name` = 'hot spring dodger dim light')\nORDER BY `t2`.`ps_availqty` IS NULL ASC, `t2`.`ps_availqty` DESC \nRETURN `t3`.`s_phone` AS `s_phone`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which supplier can provide the most number of \"hot spring dodger dim light\"? Please give the supplier's phone number.",
    "evidence": "the most number refers to max(ps_availqty); \"hot spring dodger dim light\" refers to p_name = 'hot spring dodger dim light'; phone number refers to s_phone",
    "idx": 5148
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->(`t3`:`supplier`)\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND `t2`.`ps_suppkey` = `t3`.`s_suppkey`\nAND (`t1`.`p_name` = 'hot spring dodger dim light')\nORDER BY `t1`.`p_size` IS NULL ASC, `t1`.`p_size` DESC \nRETURN `t3`.`s_phone` AS `s_phone`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the suppliers for the part with the highest retail price.",
    "evidence": "supplier name refers to s_name; the highest retail price refers to max(p_retailprice)",
    "idx": 5149
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->(`t3`:`supplier`)-[located_in_0:located_in]->(`t4`:`nation`)\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND `t2`.`ps_suppkey` = `t3`.`s_suppkey`\nAND `t3`.`s_nationkey` = `t4`.`n_nationkey`\nAND (`t1`.`p_name` = 'hot spring dodger dim light' AND `t4`.`n_name` = 'VIETNAM')\nRETURN COUNT(`t3`.`s_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many suppliers for the part \"hot spring dodger dim light\" are in Vietnam?",
    "evidence": "part \"hot spring dodger dim light\" refers to p_name = 'hot spring dodger dim light'; Vietnam refers to n_name = 'VIETNAM'",
    "idx": 5150
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->(`t3`:`supplier`)\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND `t2`.`ps_suppkey` = `t3`.`s_suppkey`\nAND (`t1`.`p_brand` = 'Brand#55')\nRETURN `t3`.`s_name` AS `s_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the suppliers for parts under Brand#55.",
    "evidence": "supplier name refers to s_name; Brand#55 refers to p_brand = 'Brand#55'",
    "idx": 5152
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`part`)-[t2_sub0:supplied_by]->(`t3_sub0`:`supplier`)\nWHERE `t1_sub0`.`p_partkey` = `t2_sub0`.`ps_partkey`\nAND `t2_sub0`.`ps_suppkey` = `t3_sub0`.`s_suppkey`\nAND (`t1_sub0`.`p_type` = 'PROMO BRUSHED STEEL')\nWITH `t2_sub0`.`ps_partkey` AS _groupby_col_0, sum(`t2_sub0`.`ps_availqty`) AS _groupby_col_1, COUNT(`t3_sub0`.`s_name`) AS _groupby_col_2\nWHERE _groupby_col_1 < 5000\nRETURN _groupby_col_2 AS `num`  \n}\nWITH *\nRETURN sum(`num`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the parts under the type \"promo brushed steel\", how many of them have a total available quantity from all suppliers of under 5000?",
    "evidence": "type \"promo brushed steel\" refers to p_type = 'PROMO BRUSHED STEEL'; a total available quantity of under 5000 refers to sum(ps_availqty) < 5000",
    "idx": 5153
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`lineitem`)\nMATCH (`t1_sub0`:`part`)\nWHERE `t1_sub0`.`p_partkey` = `t2_sub0`.`l_partkey`\nAND (`t1_sub0`.`p_container` = 'JUMBO CASE')\nWITH `t2_sub0`.`l_orderkey` AS _groupby_col_0, COUNT(`t2_sub0`.`l_partkey`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `l_orderkey`, _groupby_col_1 AS `num`  \n}\nWITH *\nWHERE `num` > 2\nRETURN `l_orderkey`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the order keys of all the orders that have more than 2 parts with a jumbo case container.",
    "evidence": "order key refers to l_orderkey; jumbo case container refers to p_container = 'JUMBO CASE'; more than 2 parts refers to count(l_partkey) > 2",
    "idx": 5156
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`lineitem`)\nMATCH (`t2`:`supplier`)\nWHERE `t1`.`l_suppkey` = `t2`.`s_suppkey`\nAND (`t1`.`l_orderkey` = 1)\nRETURN `t2`.`s_phone` AS `s_phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the phone numbers of all the suppliers for the parts ordered in order no.1.",
    "evidence": "phone number refers to s_phone; order no.1 refers to l_orderkey = 1",
    "idx": 5159
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`lineitem`)\nMATCH (`t2`:`part`)\nWHERE `t1`.`l_partkey` = `t2`.`p_partkey`\nAND (`t2`.`p_name` = 'burnished seashell gainsboro navajo chocolate')\nRETURN MAX(`t1`.`l_discount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the biggest discount among all orders for the part \"burnished seashell gainsboro navajo chocolate\"?",
    "evidence": "the biggest discount refers to max(l_discount); part \"burnished seashell gainsboro navajo chocolate\" refers to p_name = 'burnished seashell gainsboro navajo chocolate'",
    "idx": 5164
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`lineitem`)\nMATCH (`t2`:`part`)\nWHERE `t1`.`l_partkey` = `t2`.`p_partkey`\nAND (`t2`.`p_name` = 'burnished seashell gainsboro navajo chocolate')\nRETURN DISTINCT `t1`.`l_shipmode` AS `l_shipmode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the modes of shipping for the part \"burnished seashell gainsboro navajo chocolate\".",
    "evidence": "mode of shipping refers to l_shipmode; part \"burnished seashell gainsboro navajo chocolate\" refers to p_name = 'burnished seashell gainsboro navajo chocolate'",
    "idx": 5165
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`lineitem`)\nMATCH (`t2`:`part`)\nWHERE `t1`.`l_partkey` = `t2`.`p_partkey`\nAND (`t2`.`p_name` = 'burnished seashell gainsboro navajo chocolate' AND `t1`.`l_orderkey` = 1)\nRETURN `t1`.`l_extendedprice` * (1 - `t1`.`l_discount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the discounted price of the part \"burnished seashell gainsboro navajo chocolate\" in order no.1?",
    "evidence": "part \"burnished seashell gainsboro navajo chocolate\" refers to p_name = 'burnished seashell gainsboro navajo chocolate'; order no.1 refers to l_orderkey = 1; discounted price refers to multiply(l_extendedprice, subtract(1, l_discount))",
    "idx": 5169
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nWHERE CASE WHEN `lineitem`.`l_shipdate` is not NULL THEN apoc.temporal.format(`lineitem`.`l_shipdate`,'yyyy') ELSE NULL END = '1997' AND `lineitem`.`l_shipmode` = 'MAIL'\nRETURN COUNT(`lineitem`.`l_orderkey`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 1997, how many orders were shipped via mail?",
    "evidence": "1997 refers to year(l_shipdate) = 1997; shipped via mail refers to l_shipmode = 'MAIL'",
    "idx": 5171
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nWHERE CASE WHEN `lineitem`.`l_shipdate` is not NULL THEN apoc.temporal.format(`lineitem`.`l_shipdate`,'yyyy') ELSE NULL END = '1994' AND `lineitem`.`l_returnflag` = 'R' AND `lineitem`.`l_shipmode` = 'TRUCK'\nRETURN COUNT(`lineitem`.`l_orderkey`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the items shipped in 1994 via truck, how many items were returned?",
    "evidence": "1994 refers to year(l_shipdate) = 1994; via truck refers to l_shipmode = 'TRUCK'; returned refers to l_returnflag = 'R'",
    "idx": 5173
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`orders`:`orders`)\nWHERE CASE WHEN `orders`.`o_orderdate` is not NULL THEN apoc.temporal.format(`orders`.`o_orderdate`,'yyyy') ELSE NULL END = '1997' AND `orders`.`o_clerk` = 'Clerk#000000001' AND `orders`.`o_orderpriority` = '1-URGENT'\nRETURN COUNT(`orders`.`o_orderkey`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many urgent orders did Clerk#000000001 handle in 1997?",
    "evidence": "urgent order refers to o_orderpriority = '1-URGENT'; Clerk#000000001 refers to o_clerk = 'Clerk#000000001'; 1997 refers to year(o_orderdate) = 1997",
    "idx": 5175
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t3`:`part`)\nMATCH (`t2`:`lineitem`)-[belongs_to_order_0:belongs_to_order]->(`t1`:`orders`)\nWHERE `t1`.`o_orderkey` = `t2`.`l_orderkey`\nAND `t2`.`l_partkey` = `t3`.`p_partkey`\nAND (`t1`.`o_custkey` = 111511 AND `t1`.`o_orderkey` = 53159)\nRETURN `t2`.`l_extendedprice` * (1 - `t2`.`l_discount`) AS `_col_0`, `t3`.`p_name` AS `p_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the discounted price of every item that customer 111511 ordered in order 53159? List the names of the parts of every item.",
    "evidence": "discounted price refers to multiply(l_extendedprice, subtract(1, l_discount)); customer 111511 refers to o_custkey = 111511; order 53159 refers to o_orderkey = 53159; name of the part refers to p_name",
    "idx": 5185
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`playerinfo`)-[has_height_0:has_height]->(`t2`:`height_info`)\nWHERE `t1`.`height` = `t2`.`height_id`\nAND (`t2`.`height_in_inch` > '6\\'2\"')\nRETURN DISTINCT `t1`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the players with a height of over 6'2\" inches.",
    "evidence": "name of the players refers to PlayerName; height of over 6'2\" inches refers to height_in_inch > '6''2\"' ;",
    "idx": 5187
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`playerinfo`)-[has_weight_0:has_weight]->(`t2`:`weight_info`)\nWHERE `t1`.`weight` = `t2`.`weight_id`\nAND (`t2`.`weight_in_kg` > 90 AND `t1`.`shoots` = 'R')\nRETURN `t1`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the players that are over 90 kg and are right-shooted.",
    "evidence": "names of the players refers to PlayerName; over 90 kg refers to weight_in_kg > 90; right-shooted refers to shoots = 'R';",
    "idx": 5197
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`seasonstatus`:`seasonstatus`)\nWHERE `seasonstatus`.`season` = '2007-2008' AND `seasonstatus`.`gametype` = 'Playoffs'\nRETURN CASE WHEN COUNT(`seasonstatus`.`team`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `seasonstatus`.`gp` > 20 THEN `seasonstatus`.`team` ELSE NULL END)) * 100 / COUNT(`seasonstatus`.`team`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the teams that made the playoffs in the 2007-2008 season, identify the percentage that played over 20 games.",
    "evidence": "playoffs refers to GAMETYPE = 'Playoffs'; percentage = MULTIPLY(DIVIDE(SUM(GP > 20), COUNT(ELITEID)), 100); played over 20 games refers to GP > 20; 2007-2008 season refers to SEASON = '2007-2008';",
    "idx": 5212
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`team` = 'Chilliwack Chiefs' AND `t1`.`p` >= 100)\nRETURN `t2`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the Chilliwack Chiefs players who have scored 100 points or more in the NHL.",
    "evidence": "name of the player refers to PlayerName; Chilliwack Chiefs refers to TEAM = 'Chilliwack Chiefs'; scored 100 points or more in the NHL refers to P > 100;",
    "idx": 5214
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t2`:`playerinfo`)-[has_weight_0:has_weight]->(`t1`:`weight_info`)\nWHERE `t1`.`weight_id` = `t2`.`weight`\nAND (`t1`.`weight_in_kg` = 120)\nRETURN `t2`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the players who weigh 120 kg.",
    "evidence": "players refers to PlayerName; weigh 120 kg refers to weight_in_kg = 120;",
    "idx": 5215
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL(*) {\nMATCH (`seasonstatus_sub0`:`seasonstatus`)\nRETURN MAX(`seasonstatus_sub0`.`pim`) AS `_col_0`  \n}\nMATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`pim` = `_col_0`)\nRETURN `t2`.`playername` AS `playername`, `t2`.`position_info` AS `position_info`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the name and position of the player who has committed the most rule violations.",
    "evidence": "name of the player refers to PlayerName; position of the player refers to position_info; committed the most rule violations refers to MAX(PIM);",
    "idx": 5217
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL(*) {\nMATCH (`seasonstatus_sub0`:`seasonstatus`)\nRETURN MAX(`seasonstatus_sub0`.`p`) AS `_col_0`  \n}\nMATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`p` = `_col_0`)\nRETURN `t2`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the player who has the most NHL points in draft year.",
    "evidence": "name of the player refers to PlayerName; most NHL points in draft year refers to MAX(P);",
    "idx": 5218
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`playerinfo`:`playerinfo`)\nWHERE `playerinfo`.`overallby` = 'Toronto Maple Leafs'\nRETURN CASE WHEN COUNT(`playerinfo`.`eliteid`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `playerinfo`.`nation` IN ['Belarus', 'Czech Rep.', 'Slovakia', 'Ukraine'] THEN `playerinfo`.`eliteid` ELSE NULL END)) * 100 / COUNT(`playerinfo`.`eliteid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all players drafted by the Toronto Maple Leafs, identify the percentage who are from Eastern Europe.",
    "evidence": "players refers to PlayerName; drafted by the Toronto Maple Leafs refers to overallby = 'Toronto Maple Leafs'; percentage = MULTIPLY(DIVIDE(SUM(nation = 'Eastern Europe'), COUNT(ELITEID) WHERE overallby = 'Toronto Maple Leafs'), 100); from Eastern Europe refers to nation in ('Belarus', 'Bulgaria', 'Czech Republic', 'Hungary', 'Moldova', 'Poland', 'Romania', 'Slovakia', 'Ukraine'); countries in a continent can be identified by referring to https://worldpopulationreview.com/country-rankings/list-of-countries-by-continent;",
    "idx": 5219
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`playerinfo`:`playerinfo`)\nWHERE `playerinfo`.`overallby` = 'Toronto Maple Leafs' AND `playerinfo`.`draftyear` = '2008'\nORDER BY `playerinfo`.`css_rank` IS NULL ASC, `playerinfo`.`css_rank` DESC \nRETURN `playerinfo`.`playername` AS `playername`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all players drafted by the Toronto Maple Leafs in 2008, identify the player with the highest prospects for the draft.",
    "evidence": "players refers to PlayerName; drafted by the Toronto Maple Leafs refers to overallby = 'Toronto Maple Leafs'; highest prospects for the draft refers to MAX(CSS_rank);",
    "idx": 5220
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`season` = '2006-2007' AND `t1`.`gametype` = 'Playoffs' AND `t1`.`league` = 'SuperElit')\nORDER BY `t1`.`p` IS NULL ASC, `t1`.`p` DESC \nRETURN `t2`.`playername` AS `playername`, `t1`.`team` AS `team`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the player and his team who made the playoffs in the 2006-2007 season of SuperElit league with the highest points.",
    "evidence": "name of the player refers to PlayerName; playoffs refers to GAMETYPE = 'Playoffs'; highest points refers to MAX(P); 2006-2007 season refers to SEASON = '2006-2007'; SuperElit league refers to LEAGUE = 'SuperElit';",
    "idx": 5221
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`season` = '2007-2008' AND `t1`.`team` = 'Calgary Hitmen')\nRETURN CASE WHEN sum(`t1`.`g`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`playername` = 'Ian Schultz' THEN `t1`.`g` ELSE 0 END)) * 100 / sum(`t1`.`g`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all goals scored by Calgary Hitmen in the 2007-2008 season, identify the percentage scored by Ian Schultz.",
    "evidence": "goals scored refers to G; Calgary Hitmen refers to TEAM = 'Calgary Hitmen'; percentage = MULTIPLY(DIVIDE(SUM(G WHERE PlayerName = 'Ian Schultz'), SUM(G)), 100); 2007-2008 season refers to SEASON = '2007-2008';",
    "idx": 5224
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`season` = '1999-2000' AND `t1`.`team` = 'Ak Bars Kazan')\nRETURN CASE WHEN sum(`t1`.`pim`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`playername` = 'Yevgeni Muratov' THEN `t1`.`pim` ELSE 0 END)) * 100 / sum(`t1`.`pim`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all penalty minutes picked up by Ak Bars Kazan in the 1999-2000 season, identify the percentage picked up by Yevgeni Muratov.",
    "evidence": "penalty minutes refers to PIM; Ak Bars Kazan refers to TEAM = 'Ak Bars Kazan'; percentage = MULTIPLY(DIVIDE(SUM(PIM WHERE PlayerName = 'Yevgeni Muratov'), SUM(PIM)), 100.0); 1999-2000 season refers to SEASON = '1999-2000';",
    "idx": 5225
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`playerinfo`)-[has_weight_0:has_weight]->(`t2`:`weight_info`)\nWHERE `t1`.`weight` = `t2`.`weight_id`\nAND (`t2`.`weight_in_lbs` = 190)\nRETURN `t1`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the name of players who weight 190 lbs.",
    "evidence": "name of players refers to PlayerName; weight 190 lbs refers to weight_in_lbs = 190;",
    "idx": 5228
  }
]