[
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`county_public_safety`:`county_public_safety`)\nORDER BY `county_public_safety`.`population` IS NULL ASC, `county_public_safety`.`population` DESC \nRETURN `county_public_safety`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of the county with the largest population.",
    "evidence": "",
    "idx": 3407
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`city`:`city`)\nORDER BY `city`.`white` IS NULL ASC, `city`.`white` DESC \nRETURN `city`.`name` AS `name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of the city with the top 5 white percentages.",
    "evidence": "",
    "idx": 3409
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`t1`:`city`)-[in_county_0:in_county]->(`t2`:`county_public_safety`)\nWHERE `t1`.`county_id` = `t2`.`county_id`\nRETURN `t1`.`name` AS `name`, `t2`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of cities and names of counties they are in.",
    "evidence": "",
    "idx": 3411
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`t1`:`city`)-[in_county_0:in_county]->(`t2`:`county_public_safety`)\nWHERE `t1`.`county_id` = `t2`.`county_id`\nRETURN `t1`.`white` AS `white`, `t2`.`crime_rate` AS `crime_rate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show white percentages of cities and the crime rates of counties they are in.",
    "evidence": "",
    "idx": 3413
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "CALL(*) {\nMATCH (`county_public_safety_sub0`:`county_public_safety`)\nORDER BY `county_public_safety_sub0`.`police_officers` IS NULL ASC, `county_public_safety_sub0`.`police_officers` DESC \nRETURN `county_public_safety_sub0`.`county_id` AS `county_id`  LIMIT 1\n}\nMATCH (`city`:`city`)\nWHERE `city`.`county_id` = `county_id`\nRETURN `city`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of cities in the county that has the largest number of police officers.",
    "evidence": "",
    "idx": 3415
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "CALL(*) {\nMATCH (`county_public_safety_sub0`:`county_public_safety`)\nORDER BY `county_public_safety_sub0`.`police_officers` IS NULL ASC, `county_public_safety_sub0`.`police_officers` DESC \nRETURN `county_public_safety_sub0`.`county_id` AS `county_id`  LIMIT 1\n}\nMATCH (`city`:`city`)\nWHERE `city`.`county_id` = `county_id`\nRETURN `city`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of cities that are in the county with the most police officers?",
    "evidence": "",
    "idx": 3416
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "WITH *, COLLECT { MATCH (`county_public_safety_sub0`:`county_public_safety`)\nWHERE `county_public_safety_sub0`.`population` > 20000\nRETURN `county_public_safety_sub0`.`county_id` AS `county_id`   } AS in_collect_0\nMATCH (`city`:`city`)\nWHERE `city`.`county_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of cities in counties that have a population more than 20000.",
    "evidence": "",
    "idx": 3417
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "WITH *, COLLECT { MATCH (`county_public_safety_sub0`:`county_public_safety`)\nWHERE `county_public_safety_sub0`.`population` > 20000\nRETURN `county_public_safety_sub0`.`county_id` AS `county_id`   } AS in_collect_0\nMATCH (`city`:`city`)\nWHERE `city`.`county_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many cities are in counties that have populations of over 20000?",
    "evidence": "",
    "idx": 3418
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`t1`:`city`)-[in_county_0:in_county]->(`t2`:`county_public_safety`)\nWHERE `t1`.`county_id` = `t2`.`county_id`\nAND (`t1`.`white` > 90)\nRETURN `t2`.`crime_rate` AS `crime_rate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the crime rate of counties with a city having white percentage more than 90.",
    "evidence": "",
    "idx": 3419
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`county_public_safety`:`county_public_safety`)\nWITH `county_public_safety`.`police_force` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `police_force`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the police forces and the number of counties with each police force.",
    "evidence": "",
    "idx": 3421
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "WITH *, COLLECT { MATCH (`city_sub0`:`city`)\nRETURN `city_sub0`.`county_id` AS `county_id`   } AS in_collect_0\nMATCH (`county_public_safety`:`county_public_safety`)\nWHERE NOT `county_public_safety`.`county_id` IN in_collect_0\nRETURN `county_public_safety`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of counties that do not have any cities.",
    "evidence": "",
    "idx": 3423
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "WITH *, COLLECT { MATCH (`county_public_safety_sub0`:`county_public_safety`)\nWHERE `county_public_safety_sub0`.`crime_rate` < 100\nRETURN `county_public_safety_sub0`.`county_id` AS `county_id`   } AS in_collect_0\nMATCH (`city`:`city`)\nWHERE `city`.`county_id` IN in_collect_0\nRETURN `city`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of cities in counties that have a crime rate less than 100.",
    "evidence": "",
    "idx": 3425
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "WITH *, COLLECT { MATCH (`county_public_safety_sub0`:`county_public_safety`)\nWHERE `county_public_safety_sub0`.`crime_rate` < 100\nRETURN `county_public_safety_sub0`.`county_id` AS `county_id`   } AS in_collect_0\nMATCH (`city`:`city`)\nWHERE `city`.`county_id` IN in_collect_0\nRETURN `city`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of cities that are in counties that have a crime rate below 100?",
    "evidence": "",
    "idx": 3426
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`county_public_safety`:`county_public_safety`)\nORDER BY `county_public_safety`.`population` IS NULL ASC, `county_public_safety`.`population` DESC \nRETURN `county_public_safety`.`case_burden` AS `case_burden`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the case burden of counties in descending order of population.",
    "evidence": "",
    "idx": 3427
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`baseprice` < 160 AND `rooms`.`beds` = 2 AND `rooms`.`decor` = 'modern'\nRETURN `rooms`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all modern rooms with a base price below $160 and two beds.",
    "evidence": "",
    "idx": 3429
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`baseprice` < 160 AND `rooms`.`beds` = 2 AND `rooms`.`decor` = 'modern'\nRETURN `rooms`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of modern rooms that have a base price lower than $160 and two beds.",
    "evidence": "",
    "idx": 3430
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`baseprice` > 160 AND `rooms`.`maxoccupancy` > 2\nRETURN `rooms`.`roomname` AS `roomname`, `rooms`.`roomid` AS `roomid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the rooms that have a price higher than 160 and can accommodate more than 2 people. Report room names and ids.",
    "evidence": "",
    "idx": 3431
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`baseprice` > 160 AND `rooms`.`maxoccupancy` > 2\nRETURN `rooms`.`roomname` AS `roomname`, `rooms`.`roomid` AS `roomid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the room names and ids of all the rooms that cost more than 160 and can accommodate more than two people.",
    "evidence": "",
    "idx": 3432
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`reservations`:`reservations`)\nWHERE `reservations`.`firstname` = 'ROY' AND `reservations`.`lastname` = 'SWEAZY'\nRETURN `reservations`.`kids` AS `kids`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of kids staying in the rooms reserved by a person called ROY SWEAZ.",
    "evidence": "",
    "idx": 3434
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`reservations`:`reservations`)\nWHERE `reservations`.`firstname` = 'ROY' AND `reservations`.`lastname` = 'SWEAZY'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many times does ROY SWEAZY has reserved a room.",
    "evidence": "",
    "idx": 3435
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`reservations`:`reservations`)\nWHERE `reservations`.`firstname` = 'ROY' AND `reservations`.`lastname` = 'SWEAZY'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of times ROY SWEAZY has reserved a room.",
    "evidence": "",
    "idx": 3436
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`reservations`:`reservations`)\nWHERE `reservations`.`checkin` = '2010-10-23' AND `reservations`.`firstname` = 'CONRAD' AND `reservations`.`lastname` = 'SELBIG'\nRETURN `reservations`.`adults` AS `adults`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of adults for the room reserved and checked in by CONRAD SELBIG on Oct 23, 2010.",
    "evidence": "",
    "idx": 3438
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`reservations`:`reservations`)\nWHERE `reservations`.`checkin` = '2010-09-21' AND `reservations`.`firstname` = 'DAMIEN' AND `reservations`.`lastname` = 'TRACHSEL'\nRETURN `reservations`.`kids` AS `kids`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the number of kids for the room reserved and checked in by DAMIEN TRACHSEL on  Sep 21, 2010.",
    "evidence": "",
    "idx": 3440
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`bedtype` = 'King'\nRETURN sum(`rooms`.`beds`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many king beds are there?",
    "evidence": "",
    "idx": 3441
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`bedtype` = 'King'\nRETURN sum(`rooms`.`beds`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of king beds available.",
    "evidence": "",
    "idx": 3442
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`bedtype` = 'King'\nORDER BY `rooms`.`baseprice` IS NULL DESC, `rooms`.`baseprice`  \nRETURN `rooms`.`roomname` AS `roomname`, `rooms`.`decor` AS `decor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names and decor of rooms that have a king bed. Sort the list by their price.",
    "evidence": "",
    "idx": 3443
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nRETURN `rooms`.`roomname` AS `roomname`, `rooms`.`baseprice` AS `baseprice` ORDER BY `baseprice` IS NULL DESC, `baseprice`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which room has cheapest base price? List the room's name and the base price.",
    "evidence": "",
    "idx": 3445
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`roomname` = 'Recluse and defiance'\nRETURN `rooms`.`decor` AS `decor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the decor of the room named \"Recluse and defiance\".",
    "evidence": "",
    "idx": 3448
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWITH `rooms`.`bedtype` AS _groupby_col_0, avg(`rooms`.`baseprice`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `bedtype`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average base price of different bed type? List bed type and average base price.",
    "evidence": "",
    "idx": 3449
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWITH `rooms`.`bedtype` AS _groupby_col_0, avg(`rooms`.`baseprice`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `bedtype`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each bed type, find the average base price of different bed type.",
    "evidence": "",
    "idx": 3450
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`decor` = 'modern'\nRETURN sum(`rooms`.`maxoccupancy`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of people who could stay in the modern rooms in this inn?",
    "evidence": "",
    "idx": 3451
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`decor` = 'modern'\nRETURN sum(`rooms`.`maxoccupancy`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many people in total can stay in the modern rooms of this inn?",
    "evidence": "",
    "idx": 3452
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`t1`:`reservations`)-[for_room_0:for_room]->(`t2`:`rooms`)\nWHERE `t1`.`room` = `t2`.`roomid`\nAND (`t2`.`maxoccupancy` = `t1`.`adults` + `t1`.`kids`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List how many times the number of people in the room reached the maximum occupancy of the room. The number of people include adults and kids.",
    "evidence": "",
    "idx": 3453
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`t1`:`reservations`)-[for_room_0:for_room]->(`t2`:`rooms`)\nWHERE `t1`.`room` = `t2`.`roomid`\nAND (`t1`.`rate` - `t2`.`baseprice` > 0)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first and last names of people who payed more than the rooms' base prices.",
    "evidence": "",
    "idx": 3455
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`t1`:`reservations`)-[for_room_0:for_room]->(`t2`:`rooms`)\nWHERE `t1`.`room` = `t2`.`roomid`\nAND (`t1`.`rate` - `t2`.`baseprice` > 0)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first and last names of people who payed more than the rooms' base prices?",
    "evidence": "",
    "idx": 3456
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`bedtype` = 'King'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of rooms with a king bed.",
    "evidence": "",
    "idx": 3459
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWITH `rooms`.`bedtype` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `bedtype`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of rooms for each bed type.",
    "evidence": "",
    "idx": 3461
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nORDER BY `rooms`.`maxoccupancy` IS NULL ASC, `rooms`.`maxoccupancy` DESC \nRETURN `rooms`.`roomname` AS `roomname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the room with the maximum occupancy.",
    "evidence": "",
    "idx": 3463
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nORDER BY `rooms`.`baseprice` IS NULL ASC, `rooms`.`baseprice` DESC \nRETURN `rooms`.`roomid` AS `roomid`, `rooms`.`roomname` AS `roomname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id and name of the most expensive base price room.",
    "evidence": "",
    "idx": 3465
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`decor` = 'traditional'\nRETURN `rooms`.`roomname` AS `roomname`, `rooms`.`bedtype` AS `bedtype`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the type of bed and name of all traditional rooms.",
    "evidence": "",
    "idx": 3467
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`bedtype` = 'King'\nWITH `rooms`.`decor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `decor`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of rooms with king bed for each decor type.",
    "evidence": "",
    "idx": 3469
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWITH `rooms`.`decor` AS _groupby_col_0, avg(`rooms`.`baseprice`) AS _groupby_col_1, min(`rooms`.`baseprice`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `decor`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average and minimum price of the rooms in different decor.",
    "evidence": "",
    "idx": 3471
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nORDER BY `rooms`.`baseprice` IS NULL DESC, `rooms`.`baseprice`  \nRETURN `rooms`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of all rooms sorted by their prices.",
    "evidence": "",
    "idx": 3473
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nORDER BY `rooms`.`baseprice` IS NULL DESC, `rooms`.`baseprice`  \nRETURN `rooms`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort all the rooms according to the price. Just report the room names.",
    "evidence": "",
    "idx": 3474
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`baseprice` > 120\nWITH `rooms`.`decor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `decor`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of rooms with price higher than 120 for different decor.",
    "evidence": "",
    "idx": 3475
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`bedtype` = 'King' OR `rooms`.`bedtype` = 'Queen'\nRETURN `rooms`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of rooms with king or queen bed.",
    "evidence": "",
    "idx": 3479
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nRETURN COUNT(DISTINCT `rooms`.`bedtype`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of distinct bed types available in this inn.",
    "evidence": "",
    "idx": 3482
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nORDER BY `rooms`.`baseprice` IS NULL ASC, `rooms`.`baseprice` DESC \nRETURN `rooms`.`roomid` AS `roomid`, `rooms`.`roomname` AS `roomname`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and id of the top 3 expensive rooms.",
    "evidence": "",
    "idx": 3483
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "CALL(*) {\nMATCH (`rooms_sub0`:`rooms`)\nRETURN avg(`rooms_sub0`.`baseprice`) AS `_col_0`  \n}\nMATCH (`rooms`:`rooms`)\nWHERE `rooms`.`baseprice` > `_col_0`\nRETURN `rooms`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of rooms whose price is higher than the average price.",
    "evidence": "",
    "idx": 3485
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "CALL(*) {\nMATCH (`rooms_sub0`:`rooms`)\nRETURN avg(`rooms_sub0`.`baseprice`) AS `_col_0`  \n}\nMATCH (`rooms`:`rooms`)\nWHERE `rooms`.`baseprice` > `_col_0`\nRETURN `rooms`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the name of rooms that cost more than the average.",
    "evidence": "",
    "idx": 3486
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`reservations_sub0`:`reservations`)\nRETURN DISTINCT `reservations_sub0`.`room` AS `room`   } AS in_collect_0\nMATCH (`rooms`:`rooms`)\nWHERE NOT `rooms`.`roomid` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of rooms that do not have any reservation.",
    "evidence": "",
    "idx": 3487
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`baseprice` >= 120 AND `rooms`.`baseprice` <= 150\nRETURN `rooms`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of rooms whose base price is between 120 and 150.",
    "evidence": "",
    "idx": 3489
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`rooms`:`rooms`)\nWHERE `rooms`.`baseprice` >= 120 AND `rooms`.`baseprice` <= 150\nRETURN `rooms`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which rooms cost between 120 and 150? Give me the room names.",
    "evidence": "",
    "idx": 3490
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`t1`:`reservations`)-[for_room_0:for_room]->(`t2`:`rooms`)\nWHERE `t1`.`room` = `t2`.`roomid`\nAND (`t1`.`firstname` =~ '(?i)(?s).*ROY.*')\nRETURN `t2`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of rooms booked by some customers whose first name contains ROY.",
    "evidence": "",
    "idx": 3491
  },
  {
    "filename": "train_spider.json",
    "db_id": "inn_1",
    "gql_statement": "MATCH (`t1`:`reservations`)-[for_room_0:for_room]->(`t2`:`rooms`)\nWHERE `t1`.`room` = `t2`.`roomid`\nAND (`t1`.`firstname` =~ '(?i)(?s).*ROY.*')\nRETURN `t2`.`roomname` AS `roomname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the name of rooms booked by customers whose first name has \"ROY\" in part?",
    "evidence": "",
    "idx": 3492
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_mdm",
    "gql_statement": "MATCH (`t2`:`benefits_overpayments`)-[has_cross_reference_0:has_cross_reference]->(`t1`:`cmi_cross_references`)\nWHERE `t1`.`cmi_cross_ref_id` = `t2`.`cmi_cross_ref_id`\nRETURN `t1`.`source_system_code` AS `source_system_code`, `t2`.`council_tax_id` AS `council_tax_id` ORDER BY `t2`.`council_tax_id` IS NULL DESC, `t2`.`council_tax_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the tax source system code related to the benefits and overpayments? List the code and the benifit id, order by benifit id.",
    "evidence": "",
    "idx": 3494
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_mdm",
    "gql_statement": "MATCH (`customer_master_index`:`customer_master_index`)\nRETURN `customer_master_index`.`master_customer_id` AS `master_customer_id`, `customer_master_index`.`cmi_details` AS `cmi_details` ORDER BY `customer_master_index`.`cmi_details` IS NULL ASC, `customer_master_index`.`cmi_details` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all information about customer master index, and sort them by details in descending order.",
    "evidence": "",
    "idx": 3499
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_mdm",
    "gql_statement": "MATCH (`parking_fines`:`parking_fines`)\nRETURN `parking_fines`.`council_tax_id` AS `council_tax_id`, `parking_fines`.`cmi_cross_ref_id` AS `cmi_cross_ref_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the council tax ids and their related cmi cross references of all the parking fines.",
    "evidence": "",
    "idx": 3500
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "MATCH (`party`:`party`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of parties.",
    "evidence": "",
    "idx": 3505
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "MATCH (`party`:`party`)\nORDER BY `party`.`number_of_hosts` IS NULL DESC, `party`.`number_of_hosts`  \nRETURN `party`.`party_theme` AS `party_theme`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the themes of parties in ascending order of number of hosts.",
    "evidence": "",
    "idx": 3506
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "MATCH (`party`:`party`)\nRETURN `party`.`party_theme` AS `party_theme`, `party`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the theme and location of each party.",
    "evidence": "",
    "idx": 3509
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "MATCH (`party`:`party`)\nWHERE `party`.`party_theme` = 'Spring' OR `party`.`party_theme` = 'Teqnology'\nRETURN `party`.`first_year` AS `first_year`, `party`.`last_year` AS `last_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the first year and last year of parties with theme \"Spring\" or \"Teqnology\".",
    "evidence": "",
    "idx": 3510
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "MATCH (`party`:`party`)\nRETURN avg(`party`.`number_of_hosts`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the average number of hosts for parties.",
    "evidence": "",
    "idx": 3513
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "MATCH (`party`:`party`)\nORDER BY `party`.`number_of_hosts` IS NULL ASC, `party`.`number_of_hosts` DESC \nRETURN `party`.`location` AS `location`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which party had the most hosts? Give me the party location.",
    "evidence": "",
    "idx": 3515
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "MATCH (`host`:`host`)\nWITH `host`.`nationality` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `nationality`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different nationalities along with the number of hosts of each nationality.",
    "evidence": "",
    "idx": 3516
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "MATCH (`host`:`host`)\nWITH `host`.`nationality` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `nationality`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many hosts does each nationality have? List the nationality and the count.",
    "evidence": "",
    "idx": 3517
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "MATCH (`host`:`host`)\nORDER BY `host`.`age` IS NULL ASC, `host`.`age` DESC \nRETURN `host`.`name` AS `name`, `host`.`nationality` AS `nationality`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and the nationality of the oldest host.",
    "evidence": "",
    "idx": 3526
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_host",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[party_host_sub0:hosts]->()\nRETURN `party_host_sub0`.`host_id` AS `host_id`   } AS in_collect_0\nMATCH (`host`:`host`)\nWHERE NOT `host`.`host_id` IN in_collect_0\nRETURN `host`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of hosts who did not serve as a host of any party in our record.",
    "evidence": "",
    "idx": 3528
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`region`:`region`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of regions.",
    "evidence": "",
    "idx": 3531
  }
]