[
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`c_name` = 'Customer#000000001'\nRETURN customer.`c_phone` AS `c_phone`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the phone number of Customer#000000001?",
    "evidence": "customer phone refers to c_phone; Customer#000000001 refers to c_name;",
    "idx": 3302
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)\nWHERE t1.`o_custkey` = t2.`c_custkey`\nAND (t2.`c_mktsegment` = 'HOUSEHOLD')\nRETURN COUNT(t1.`o_orderkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders in total have the customers in the household segment made?",
    "evidence": "orders in household segment refer to o_orderkey where c_mktsegment = 'HOUSEHOLD';",
    "idx": 3303
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)\nWHERE t1.`o_custkey` = t2.`c_custkey`\nAND (t2.`c_mktsegment` = 'HOUSEHOLD')\nRETURN MAX(t1.`o_totalprice`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the orders made by a customer in the household segment, what is the highest total price?",
    "evidence": "orders in household segment refer to o_orderkey where c_mktsegment = 'HOUSEHOLD'; the highest total price refers to MAX(o_totalprice);",
    "idx": 3304
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)\nWHERE t1.`o_custkey` = t2.`c_custkey`\nAND (t2.`c_mktsegment` = 'HOUSEHOLD' AND t1.`o_orderpriority` = '1-URGENT')\nRETURN COUNT(t1.`o_orderpriority`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the orders made by customers in the household segment, how many of them are urgent?",
    "evidence": "orders in household segment refer to o_orderkey where c_mktsegment = 'HOUSEHOLD'; the order is urgent if o_orderpriority = '1-URGENT' ;",
    "idx": 3308
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t2.`n_name` = 'BRAZIL')\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are in Brazil?",
    "evidence": "Brazil is the name of the nation which refers to n_name = 'BRAZIL'",
    "idx": 3309
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t2.`n_name` = 'GERMANY' AND t1.`c_acctbal` > 1000)\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the customers in Germany, how many of them have an account balance of over 1000?",
    "evidence": "Germany is the name of the nation which refers to n_name = 'GERMANY'; account balance of over 1000 refers to c_acctbal > 1000;",
    "idx": 3311
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)-[located_in_1_0:`located_in_1`]->(t1@`nation`)\nWHERE t1.`n_nationkey` = t2.`c_nationkey`\nAND t2.`c_custkey` = t3.`o_custkey`\nAND (t1.`n_name` = 'GERMANY')\nRETURN COUNT(t2.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders in total are made by customers in Germany?",
    "evidence": "orders refer to o_orderkey; Germany is the name of the nation which refers to n_name = 'GERMANY';",
    "idx": 3312
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)-[located_in_1_0:`located_in_1`]->(t1@`nation`)\nWHERE t1.`n_nationkey` = t2.`c_nationkey`\nAND t2.`c_custkey` = t3.`o_custkey`\nAND (t1.`n_name` = 'GERMANY')\nRETURN sum(t3.`o_totalprice`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total price of all the orders made by customers in Germany?",
    "evidence": "orders refer to o_orderkey; total price refers to o_totalprice; Germany is the name of the nation which refers to n_name = 'GERMANY';",
    "idx": 3313
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)-[located_in_1_0:`located_in_1`]->(t1@`nation`)\nWHERE t1.`n_nationkey` = t2.`c_nationkey`\nAND t2.`c_custkey` = t3.`o_custkey`\nAND (t1.`n_name` = 'GERMANY')\nRETURN avg(t3.`o_totalprice`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average price of the orders made by a customer in Germany?",
    "evidence": "DIVIDE(SUM(o_totalprice), COUNT(o_orderkey)) where n_name = 'GERMANY';",
    "idx": 3315
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nRETURN cast (sum(CASE WHEN t2.`n_name` = 'GERMANY' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the customers, what is the percentage of the customer's nation being Germany?",
    "evidence": "DIVIDE(COUNT(c_custkey when n_name = 'GERMANY'), COUNT(c_custkey)) as percentage;",
    "idx": 3316
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (nation@`nation`)\nWHERE nation.`n_regionkey` = 2\nRETURN COUNT(nation.`n_nationkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many countries are there in the No.2 region?",
    "evidence": "No.2 region refers to n_regionkey = 2;",
    "idx": 3317
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)\nWHERE t1.`s_nationkey` = t2.`n_nationkey`\nAND (t1.`s_suppkey` = 34)\nRETURN t2.`n_name` AS `n_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country does supplier No.34 come from?",
    "evidence": "supplier No.34 refers to s_suppkey = 34; country refers to n_name;",
    "idx": 3318
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t2@`orders`)\nWHERE t2.`o_orderkey` = t1.`l_orderkey`\nAND (t1.`l_suppkey` = 9397 AND t2.`o_totalprice` = 231499.38)\nRETURN t1.`l_extendedprice` * (1 - t1.`l_discount`) AS `discounterprice`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the order with the total price of 231499.38, what was the discounted price for supplier No. 9397?",
    "evidence": "MULTIPLY(l_extendedprice, SUBTRACT(1, l_discount)) where o_totalprice = 231499.38 AND l_suppkey = 9397;",
    "idx": 3321
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND (t1.`o_clerk` = 'Clerk#000000936' AND t2.`l_shipmode` = 'TRUCK' AND t1.`o_orderstatus` = '4-NOT SPECIFIED' AND t1.`o_orderdate` = date('1995-03-13'))\nRETURN t2.`l_extendedprice` * (1 - t2.`l_discount`) * (1 + t2.`l_tax`) AS `num`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Clerk#000000936 dealt with a \"Not Specified\" order on 1995/3/13, what was the charge for the part of the order shipped by truck?",
    "evidence": "MULTIPLY(MULTIPLY(l_extendedprice, SUBTRACT(1, l_discount)), SUM(1, l_tax)) WHERE o_clerk = 'Clerk#000000936', o_orderstatus = '4-NOT SPECIFIED', o_orderdate = '1995-03-13' AND l_shipmode = 'TRUCK';",
    "idx": 3323
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`nation`)-[in_region_0:`in_region`]->(t2@`region`)\nWHERE t1.`n_regionkey` = t2.`r_regionkey`\nRETURN cast (sum(CASE WHEN t2.`r_name` = 'EUROPE' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`n_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of the European countries among the given countries?",
    "evidence": "DIVIDE(COUNT(n_name where r_name = 'EUROPE'), COUNT(n_name)) as percentage;",
    "idx": 3326
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL {\nMATCH (customer_sub0@`customer`)\nRETURN min(customer_sub0.`c_acctbal`) AS `_col_0` \n}\nMATCH (customer@`customer`)\nWHERE customer.`c_acctbal` = _col_0\nRETURN customer.`c_name` AS `c_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the customer with the highest amount of debt?",
    "evidence": "customer with the highest amount of debt refers to c_name where MIN(c_acctbal);",
    "idx": 3328
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`c_acctbal` < 0\nRETURN COUNT(customer.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are in debt?",
    "evidence": "customers are in debt refer to c_custkey where c_acctbal < 0;",
    "idx": 3329
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`c_mktsegment` = 'AUTOMOBILE'\nRETURN COUNT(customer.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are in the automobile market segment?",
    "evidence": "automobile market segment refers to c_mktsegment = 'AUTOMOBILE';",
    "idx": 3330
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nORDER BY lineitem.`l_extendedprice` DESC NULLS LAST \nRETURN lineitem.`l_orderkey` AS `l_orderkey` \nLIMIT 2",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the top 2 order keys of the item with the highest amount of extended price?",
    "evidence": "the highest amount of extended price refers to MAX(l_extendedprice);",
    "idx": 3331
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nORDER BY t1.`o_totalprice` DESC NULLS LAST \nRETURN t2.`l_shipdate` AS `l_shipdate` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When was the order with the highest amount of total price shipped?",
    "evidence": "when shipped refers to l_shipdate; the highest amount of total price refers to MAX(o_totalprice);",
    "idx": 3332
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t1.`c_acctbal` < 0 AND t1.`c_mktsegment` = 'HOUSEHOLD' AND t2.`n_name` = 'RUSSIA')\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many in debt customers in the household market segment are from Russia?",
    "evidence": "in debt customers refer to c_custkey where c_acctbal < 0; c_mktsegment = 'HOUSEHOLD'; Russian is the name of the nation which refers to n_name = 'RUSSIA';",
    "idx": 3333
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t2.`n_name` = 'JAPAN')\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many suppliers are from Japan?",
    "evidence": "suppliers refer to s_nationkey; Japan is the name of the nation which refers to n_name = 'JAPAN';",
    "idx": 3334
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND (t2.`l_shipmode` = 'SHIP' AND t1.`o_orderpriority` = '3-MEDIUM')\nRETURN COUNT(t1.`o_orderkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders shipped via ship have a medium priority?",
    "evidence": "orders shipped via ship refer to o_orderkey where l_shipmode = 'SHIP'; medium priority refers to o_orderpriority = '3-MEDIUM';",
    "idx": 3335
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`nation`)-[in_region_0:`in_region`]->(t2@`region`)\nWHERE t1.`n_regionkey` = t2.`r_regionkey`\nAND (t2.`r_name` = 'ASIA')\nRETURN t1.`n_name` AS `n_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the countries in the region of Asia?",
    "evidence": "countries in the region of Asia refer to n_name where r_name = 'ASIA';",
    "idx": 3336
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH ()-[t1:`supplies`]->(t2@`part`)\nWHERE t1.`ps_partkey` = t2.`p_partkey`\nAND (t1.`ps_supplycost` = 1000 AND t2.`p_mfgr` = 'Manufacturer#3')\nRETURN t2.`p_name` AS `p_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the parts manufactured by manufacturer 3 that have a supply cost of 1,000?",
    "evidence": "names of the parts refer to p_name; manufacturer 3 refers to p_mfgr = 'Manufacturer#3'; ps_supplycost = 1000;",
    "idx": 3337
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)\nMATCH ()-[t1:`supplies`]->(t3@`part`)\nWHERE t1.`ps_suppkey` = t2.`l_suppkey`\nAND t1.`ps_partkey` = t3.`p_partkey`\nAND (t3.`p_mfgr` = 'Manufacturer#5' AND t3.`p_retailprice` < 1000 AND t2.`l_shipmode` = 'RAIL')\nRETURN COUNT(t1.`ps_partkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the products manufactured by manufacturer 5 that have a retail price of no more than 1,000, how many products were shipped via rail?",
    "evidence": "manufacturer 5 refers to p_mfgr = 'Manufacturer#5'; retail price of no more than 1,000 refers to p_retailprice < 1000; shipped via rail refers to shipmode = 'RAIL';",
    "idx": 3339
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`lineitem`)\nMATCH ()-[t2:`supplies`]->(t3@`part`)\nWHERE t1.`l_suppkey` = t2.`ps_suppkey`\nAND t2.`ps_partkey` = t3.`p_partkey`\nAND (t1.`l_receiptdate` = date('1996-05-07') AND t1.`l_shipinstruct` = 'DELIVER IN PERSON' AND t3.`p_name` = 'smoke turquoise purple blue salmon')\nRETURN t1.`l_extendedprice` * (1 - t1.`l_discount`) - t2.`ps_supplycost` * t1.`l_quantity` AS `num`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the profit for smoke turquoise purple blue salmon that was delivered in person on 5/7/1996?",
    "evidence": "SUBTRACT(MULTIPLY(l_extendedprice, (SUBTRACT(1, l_discount)), MULTIPLY(ps_supplycost, l_quantity))) where p_name = 'smoke turquoise purple blue salmon' and l_receiptdate = '1996-05-07' and l_shipinstruct = 'DELIVER IN PERSON';",
    "idx": 3340
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nORDER BY t1.`o_totalprice` DESC NULLS LAST \nRETURN sum(t2.`l_extendedprice`) / 10 AS `_col_0` \nLIMIT 10",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average price before discount of the top 10 orders with the highest total price?",
    "evidence": "DIVIDE(SUM(l_extendedprice), 10) where MAX(o_totalprice);",
    "idx": 3341
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_shipdate` = date('1993-12-04')\nRETURN COUNT(lineitem.`l_linenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many items were shipped on 4th December, 1993?",
    "evidence": "items shipped on 4th December, 1993 refer to l_linenumber where l_shipdate = '1993-12-04';",
    "idx": 3342
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL {\nMATCH (orders_sub0@`orders`)\nRETURN MAX(orders_sub0.`o_totalprice`) AS `_col_0` \n}\nMATCH (orders@`orders`)\nWHERE orders.`o_totalprice` = _col_0\nRETURN orders.`o_orderdate` AS `o_orderdate`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the order date of items with the highest total price?",
    "evidence": "the highest total price refers to MAX(o_totalprice);",
    "idx": 3343
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH ()-[partsupp:`supplied_by`]->()\nWHERE partsupp.`ps_availqty` < 10\nRETURN COUNT(partsupp.`ps_suppkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many part supplies were nearly out of stock?",
    "evidence": "supplies nearly out of stock refer to ps_partkey where ps_availqty < 10;",
    "idx": 3345
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t2.`n_name` = 'INDIA')\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are there in India?",
    "evidence": "customers refer to c_custkey; India is the name of the nation which refers to n_name = 'INDIA';",
    "idx": 3348
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t1.`c_acctbal` < 0 AND t2.`n_name` = 'MOROCCO')\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers from Morocco, how many customers were in debt?",
    "evidence": "customers refer to c_custkey; Morocco is the name of the nation which refers to n_name = 'MOROCCO'; in debt refers to c_acctbal < 0;",
    "idx": 3349
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)-[in_region_0:`in_region`]->(t1@`region`)\nWHERE t1.`r_regionkey` = t2.`n_regionkey`\nAND t2.`n_nationkey` = t3.`s_nationkey`\nAND (t3.`s_acctbal` < 0 AND t1.`r_name` = 'MIDDLE EAST')\nRETURN COUNT(t3.`s_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the suppliers from Middle East region, how many suppliers were in debt?",
    "evidence": "suppliers from Middle East region refer to s_name where r_name = 'MIDDLE EAST'; in debt refers to s_acctbal < 0;",
    "idx": 3355
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_quantity` < 30 AND lineitem.`l_shipmode` = 'RAIL'\nRETURN COUNT(lineitem.`l_linenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the line items have been shipped by rail with a quantity less than 30?",
    "evidence": "shipped by rail refers to l_shipmode = 'RAIL'; quantity less than 30 refers to l_quantity < 30;",
    "idx": 3358
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`c_mktsegment` = 'FURNITURE' AND customer.`c_nationkey` = 1\nRETURN COUNT(customer.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers in the furniture market segment, how many of them have a nation key of 1?",
    "evidence": "furniture market segment refers to c_mktsegment = 'FURNITURE';",
    "idx": 3359
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL {\nMATCH (orders_sub0@`orders`)\nRETURN MAX(orders_sub0.`o_totalprice`) AS `_col_0` \n}\nMATCH (orders@`orders`)\nWHERE orders.`o_totalprice` = _col_0\nRETURN orders.`o_orderpriority` AS `o_orderpriority`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the order priority of the order with the highest total price?",
    "evidence": "order with the highest total price refers to MAX(o_totalprice);",
    "idx": 3361
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)-[located_in_1_0:`located_in_1`]->(t3@`nation`)\nWHERE t1.`o_custkey` = t2.`c_custkey`\nAND t2.`c_nationkey` = t3.`n_nationkey`\nAND (t3.`n_name` = 'UNITED STATES')\nRETURN COUNT(t1.`o_orderkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of orders made by customers in United States?",
    "evidence": "orders refer to o_orderkey; the United States is the name of the nation which refers to n_name = 'UNITED STATES';",
    "idx": 3362
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t1.`c_mktsegment` = 'AUTOMOBILE' AND t2.`n_name` = 'BRAZIL')\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers from Brazil, how many customers are in automobile market segment?",
    "evidence": "customers refer to c_custkey; Brazil is the name of the nation which refers to n_name = 'BRAZIL'; c_mktsegment = 'automobile';",
    "idx": 3363
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)\nWHERE t1.`s_nationkey` = t2.`n_nationkey`\nAND (t2.`n_name` = 'GERMANY')\nRETURN COUNT(t1.`s_suppkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of suppliers from Germany?",
    "evidence": "suppliers refer to s_suppkey; Germany is the name of the nation which refers to n_name = 'GERMANY';",
    "idx": 3367
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`customer`)-[located_in_1_0:`located_in_1`]->(t1@`nation`)-[in_region_0:`in_region`]->(t3@`region`)\nWHERE t1.`n_nationkey` = t2.`c_nationkey`\nAND t1.`n_regionkey` = t3.`r_regionkey`\nAND (t2.`c_acctbal` < 0 AND t3.`r_name` = 'ASIA')\nRETURN COUNT(t1.`n_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers in Asia, how many customers are in debt?",
    "evidence": "customers in Asia refer to n_name where r_name = 'ASIA'; customers in debt refer to c_acctbal < 0;",
    "idx": 3368
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)\nMATCH ()-[t1:`supplies`]->(t3@`part`)\nWHERE t1.`ps_suppkey` = t2.`l_suppkey`\nAND t1.`ps_partkey` = t3.`p_partkey`\nAND (t3.`p_retailprice` > 1000 AND t2.`l_shipmode` = 'SHIP')\nRETURN COUNT(t1.`ps_suppkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the products that have a retail price greater than 1,000, how many products were shipped via ship?",
    "evidence": "products refer to l_partkey; retail price greater than 1,000 refers to p_retailprice > 1000; shipped via ship refers to l_shipmode = 'SHIP';",
    "idx": 3370
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)\nWHERE t1.`o_custkey` = t2.`c_custkey`\nAND (t1.`o_totalprice` = 199180.63)\nRETURN t2.`c_name` AS `c_name`, t2.`c_mktsegment` AS `c_mktsegment`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name and marketing segment of the customer with the total order price of 199180.63?",
    "evidence": "name of the customer refers to c_name; total order price of 199180.63 refers o_totalprice = 199180.63; marketing segment refers to c_mktsegment;",
    "idx": 3371
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`customer`)-[located_in_1_0:`located_in_1`]->(t1@`nation`)-[in_region_0:`in_region`]->(t3@`region`)\nWHERE t1.`n_nationkey` = t2.`c_nationkey`\nAND t1.`n_regionkey` = t3.`r_regionkey`\nAND (t2.`c_address` = 'wH55UnX7 VI')\nRETURN t1.`n_name` AS `n_name`, t3.`r_name` AS `r_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Provide the nation and region of the customer with the address of wH55UnX7 VI?",
    "evidence": "nation refers to n_name; region refers to r_name; address of wH55UnX7 VI refers to c_address = 'wH55UnX7 VI';",
    "idx": 3372
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t2.`n_name` = 'BRAZIL' AND t1.`c_acctbal` < 1000)\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the customers in Brazil, how many of them have an account balance of less than 1000?",
    "evidence": "customers refer to c_custkey; Brazil is the name of the nation which refers to n_name = 'BRAZIL'; account balance of less than 1000 refers to c_acctbal < 1000;",
    "idx": 3373
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t1.`c_acctbal` < 4000)\nRETURN cast (sum(CASE WHEN t2.`n_name` = 'United States' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers with an account balance lower than 4000, what is the percentage of the customers in the US?",
    "evidence": "DIVIDE(COUNT(c_custkey where n_name = 'United States' and c_acctbal < 4000), COUNT(c_custkey where c_acctbal < 4000)) as percentage;",
    "idx": 3375
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_shipdate` >= date('1994-01-01') AND lineitem.`l_shipdate` <= date('1994-01-30')\nRETURN avg(lineitem.`l_linenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of items shipped each day in April of 1994?",
    "evidence": "AVG(l_linenumber) where l_shipdate between '1994-01-01' and '1994-01-30';",
    "idx": 3377
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)\nWHERE t1.`o_custkey` = t2.`c_custkey`\nAND (t2.`c_acctbal` > 0 AND t1.`o_orderpriority` = '1-URGENT')\nRETURN COUNT(t2.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers who are not in debt ordered an urgent order?",
    "evidence": "customers who are not in debt refer to c_custkey where c_acctbal > 0; the order is urgent if o_orderpriority = '1-URGENT' ;",
    "idx": 3382
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t2.`n_name` = 'FRANCE')\nRETURN cast (sum(CASE WHEN t1.`c_mktsegment` = 'AUTOMOBILE' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`c_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of customers from France is in the automobile segment?",
    "evidence": "DIVIDE(COUNT(c_name where c_mktsegment = 'AUTOMOBILE' and n_name = 'FRANCE'), COUNT(c_name where n_name = 'FRANCE')) as percentage;",
    "idx": 3385
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`customer`)-[located_in_1_0:`located_in_1`]->(t1@`nation`)-[in_region_0:`in_region`]->(t2@`region`)\nWHERE t1.`n_regionkey` = t2.`r_regionkey`\nAND t1.`n_nationkey` = t3.`c_nationkey`\nAND (t3.`c_mktsegment` = 'HOUSEHOLD')\nRETURN cast (sum(CASE WHEN t2.`r_name` = 'AFRICA' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`n_nationkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of customers from the African region is in the household segment?",
    "evidence": "DIVIDE(COUNT(c_custkey where c_mktsegment = 'HOUSEHOLD' and r_name = 'AFRICA'), COUNT(c_custkey where r_name = 'AFRICA')) as percentage;",
    "idx": 3386
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`lineitem`)\nMATCH (t1@`part`)-[t2:`supplied_by`]->()\nWHERE t1.`p_partkey` = t2.`ps_partkey`\nAND t2.`ps_suppkey` = t3.`l_suppkey`\nAND (t1.`p_mfgr` = 'Manufacturer#5')\nRETURN avg(t3.`l_discount`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average discount for the parts made by Manufacturer#5?",
    "evidence": "DIVIDE(SUM(l_discount), COUNT(l_partkey)) where p_mfgr = 'Manufacturer#5';",
    "idx": 3389
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND (t2.`l_shipmode` = 'RAIL' AND t1.`o_orderpriority` = '3-MEDIUM')\nRETURN COUNT(t2.`l_partkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the parts shipped by rail, how many are of medium priority?",
    "evidence": "parts shipped by rail refer to l_partkey where l_shipmode = 'RAIL'; medium priority refers to o_orderpriority = '3-MEDIUM';",
    "idx": 3390
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL {\nMATCH (supplier_sub0@`supplier`)\nRETURN avg(supplier_sub0.`s_acctbal`) AS `_col_0_1` \n}\nMATCH (t3@`supplier`)-[located_in_2_0:`located_in_2`]->(t1@`nation`)-[in_region_0:`in_region`]->(t2@`region`)\nWHERE t1.`n_regionkey` = t2.`r_regionkey`\nAND t1.`n_nationkey` = t3.`s_nationkey`\nAND (t2.`r_name` = 'EUROPE')\nRETURN cast (sum(CASE WHEN t3.`s_acctbal` < _col_0_1 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`n_nationkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the suppliers in the European region, what percentage have a below-average account balance?",
    "evidence": "DIVIDE(COUNT(s_acctbal < AVG(s_acctbal)), COUNT(s_suppkey)) as percentage where r_name = 'EUROPE';",
    "idx": 3391
  }
]