[
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`t2`:`state`)-[t1:borders]->()\nWHERE `t2`.`state_name` = `t1`.`border`\nAND (`t1`.`state_name` = 'texas')\nRETURN `t2`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the capital cities of the states which border texas",
    "evidence": "",
    "idx": 263
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`t2`:`state`)-[t1:borders]->()\nWHERE `t2`.`state_name` = `t1`.`border`\nAND (`t1`.`state_name` = 'texas')\nRETURN `t2`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the capitals of the states that border texas",
    "evidence": "",
    "idx": 264
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`t2`:`state`)-[t1:borders]->()\nWHERE `t2`.`state_name` = `t1`.`border`\nAND (`t1`.`state_name` = 'texas')\nRETURN `t2`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which capitals are in the states that border texas",
    "evidence": "",
    "idx": 265
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'mississippi'\nRETURN `river`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` IN in_collect_0\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the cities in states through which the mississippi runs",
    "evidence": "",
    "idx": 266
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the highest points of all the states",
    "evidence": "",
    "idx": 267
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'kansas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major cities in kansas",
    "evidence": "",
    "idx": 268
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'kansas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major cities in the state of kansas",
    "evidence": "",
    "idx": 269
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'kansas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what major cities are located in kansas",
    "evidence": "",
    "idx": 270
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'kansas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "show major cities in kansas",
    "evidence": "",
    "idx": 271
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'kansas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the names of the major cities in kansas",
    "evidence": "",
    "idx": 272
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'kansas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major cities of kansas",
    "evidence": "",
    "idx": 273
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'kansas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the major cities in kansas",
    "evidence": "",
    "idx": 274
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`length` > 750 AND `river`.`river_name` = 'mississippi'\nRETURN `river`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` IN in_collect_0\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major cities in states through which the mississippi runs",
    "evidence": "",
    "idx": 275
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major cities in the usa",
    "evidence": "",
    "idx": 276
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major cities of the united states",
    "evidence": "",
    "idx": 277
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major cities of the us",
    "evidence": "",
    "idx": 278
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN `state`.`density` AS `density`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the population densities of each us state",
    "evidence": "",
    "idx": 279
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'mississippi'\nRETURN `river`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH (`state`:`state`)\nWHERE `state`.`state_name` IN in_collect_0\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the populations of states through which the mississippi river run",
    "evidence": "",
    "idx": 280
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'mississippi'\nRETURN `river`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH (`state`:`state`)\nWHERE `state`.`state_name` IN in_collect_0\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the populations of the states through which the mississippi runs",
    "evidence": "",
    "idx": 282
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`t2`:`state`)-[t1:borders]->()\nWHERE `t2`.`state_name` = `t1`.`border`\nAND (`t1`.`state_name` = 'texas')\nRETURN `t2`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the populations of states which border texas",
    "evidence": "",
    "idx": 288
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'wisconsin'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the populations of the major cities of wisconsin",
    "evidence": "",
    "idx": 289
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'wisconsin'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the populations of all the major cities in wisconsin",
    "evidence": "",
    "idx": 290
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'wisconsin'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population of the major cities in wisconsin",
    "evidence": "",
    "idx": 291
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what city has the most people",
    "evidence": "",
    "idx": 292
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what city in the united states has the highest population density",
    "evidence": "",
    "idx": 293
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the most populous city",
    "evidence": "",
    "idx": 294
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which us city has the highest population density",
    "evidence": "",
    "idx": 295
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the biggest city in the usa",
    "evidence": "",
    "idx": 296
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "whats the largest city",
    "evidence": "",
    "idx": 297
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what city has the largest population",
    "evidence": "",
    "idx": 298
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the biggest city in the us",
    "evidence": "",
    "idx": 299
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the biggest city in usa",
    "evidence": "",
    "idx": 300
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`state`)\nWHERE `t2`.`state_name` = `t1`.`state_name`\nAND (`t1`.`city_name` = 'durham')\nRETURN `t2`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of states that have cities named durham",
    "evidence": "",
    "idx": 301
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of the smallest state",
    "evidence": "",
    "idx": 302
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN DISTINCT `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of the state with the largest population density",
    "evidence": "",
    "idx": 303
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of the state with the largest population",
    "evidence": "",
    "idx": 304
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of the state with the most inhabitants",
    "evidence": "",
    "idx": 305
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN sum(`state`.`area`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the combined area of all 50 states",
    "evidence": "",
    "idx": 306
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN sum(`state`.`area`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the area of all the states combined",
    "evidence": "",
    "idx": 307
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN sum(`state`.`area`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many square kilometers in the us",
    "evidence": "",
    "idx": 308
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN sum(`state`.`area`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the total area of the usa",
    "evidence": "",
    "idx": 309
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'wyoming'\nRETURN `state`.`density` AS `density`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the density of the wyoming",
    "evidence": "",
    "idx": 310
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'wyoming'\nRETURN `state`.`density` AS `density`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population density of wyoming",
    "evidence": "",
    "idx": 311
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'wyoming'\nRETURN `state`.`density` AS `density`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the density of wyoming",
    "evidence": "",
    "idx": 312
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`mountain_sub0`:`mountain`)\nRETURN MAX(`mountain_sub0`.`mountain_altitude`) AS `_col_0`  \n}\nMATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_altitude` = `_col_0`\nRETURN `mountain`.`mountain_name` AS `mountain_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest mountain in the us",
    "evidence": "",
    "idx": 313
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`mountain_sub0`:`mountain`)\nRETURN MAX(`mountain_sub0`.`mountain_altitude`) AS `_col_0`  \n}\nMATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_altitude` = `_col_0`\nRETURN `mountain`.`mountain_name` AS `mountain_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the tallest mountain in america",
    "evidence": "",
    "idx": 315
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`state`:`state`)\nWHERE `state`.`capital` = 'des moines'\nRETURN `state`.`state_name` AS `state_name`   } AS in_collect_0\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` IN in_collect_0\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in the state with capital des moines",
    "evidence": "",
    "idx": 317
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in the usa",
    "evidence": "",
    "idx": 319
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point of the usa",
    "evidence": "",
    "idx": 320
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in the country",
    "evidence": "",
    "idx": 321
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in the us",
    "evidence": "",
    "idx": 322
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in the united states",
    "evidence": "",
    "idx": 323
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nWHERE `city_sub0`.`population` > 150000\nWITH `city_sub0`.`state_name` AS _groupby_col_0, COUNT(`city_sub0`.`city_name`) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `state_name`  LIMIT 1\n}\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = `state_name`\nORDER BY `river`.`length` IS NULL ASC, `river`.`length` DESC \nRETURN `river`.`river_name` AS `river_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the longest river in the state with the most major cities",
    "evidence": "",
    "idx": 324
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'iowa'\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the lowest point in iowa",
    "evidence": "",
    "idx": 325
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'iowa'\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the lowest point in iowa in meters",
    "evidence": "",
    "idx": 326
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'iowa'\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the lowest point in the state of iowa",
    "evidence": "",
    "idx": 327
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'iowa'\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the lowest point in iowa",
    "evidence": "",
    "idx": 328
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'iowa'\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the lowest point of iowa",
    "evidence": "",
    "idx": 329
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'iowa'\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the lowest spot in iowa",
    "evidence": "",
    "idx": 330
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN min(`highlow_sub0`.`lowest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_elevation` = `_col_0`\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the lowest point in usa",
    "evidence": "",
    "idx": 331
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN min(`highlow_sub0`.`lowest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_elevation` = `_col_0`\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the lowest point in the united states",
    "evidence": "",
    "idx": 332
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN min(`highlow_sub0`.`lowest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_elevation` = `_col_0`\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the lowest point in the us",
    "evidence": "",
    "idx": 333
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN min(`highlow_sub0`.`lowest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_elevation` = `_col_0`\nRETURN `highlow`.`lowest_point` AS `lowest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the lowest point of the us",
    "evidence": "",
    "idx": 334
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'mississippi'\nRETURN `river`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` IN in_collect_0\nORDER BY `highlow`.`lowest_elevation` IS NULL DESC, `highlow`.`lowest_elevation`  \nRETURN `highlow`.`lowest_point` AS `lowest_point`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the lowest point of all states through which the mississippi river runs through",
    "evidence": "",
    "idx": 335
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the most dense state in the usa",
    "evidence": "",
    "idx": 337
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the highest population density",
    "evidence": "",
    "idx": 338
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the greatest density",
    "evidence": "",
    "idx": 339
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the highest population density",
    "evidence": "",
    "idx": 340
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the greatest population density",
    "evidence": "",
    "idx": 341
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the largest population density",
    "evidence": "",
    "idx": 342
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the state with the largest density in usa",
    "evidence": "",
    "idx": 343
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the state with the largest population density",
    "evidence": "",
    "idx": 344
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the largest density",
    "evidence": "",
    "idx": 345
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`density` AS `density`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population density of the largest state",
    "evidence": "",
    "idx": 346
  }
]