[
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t2`:`student`)-[t1:enrolled_in]->(`t3`:`class`)\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND `t1`.`class_code` = `t3`.`class_code`\nAND (`t3`.`crs_code` = 'ACCT-211')\nRETURN avg(`t2`.`stu_gpa`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average gpa of the students enrolled in the course with code ACCT-211?",
    "evidence": "",
    "idx": 3991
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t2`:`student`)-[t1:enrolled_in]->(`t3`:`class`)\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND `t1`.`class_code` = `t3`.`class_code`\nAND (`t3`.`crs_code` = 'ACCT-211')\nRETURN avg(`t2`.`stu_gpa`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average GPA of students taking ACCT-211?",
    "evidence": "",
    "idx": 3992
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "CALL(*) {\nMATCH (`student_sub0`:`student`)\nRETURN avg(`student_sub0`.`stu_gpa`) AS `_col_0`  \n}\nMATCH (`student`:`student`)\nWHERE `student`.`stu_gpa` < `_col_0`\nRETURN `student`.`stu_fname` AS `stu_fname`, `student`.`stu_gpa` AS `stu_gpa`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name and gpa of the students whose gpa is lower than the average gpa of all students.",
    "evidence": "",
    "idx": 3997
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t2`:`professor`)-[is_a_0:is_a]->(`t1`:`employee`)\nMATCH (`t2`:`professor`)-[works_in_0:works_in]->(`t3`:`department`)\nWHERE `t1`.`emp_num` = `t2`.`emp_num`\nAND `t3`.`dept_code` = `t2`.`dept_code`\nAND (`t3`.`dept_name` = 'History' AND `t2`.`prof_high_degree` = 'Ph.D.')\nRETURN `t1`.`emp_fname` AS `emp_fname`, `t2`.`prof_office` AS `prof_office`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name and office of the professor who is in the history department and has a Ph.D. degree.",
    "evidence": "",
    "idx": 3999
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t2`:`professor`)-[is_a_0:is_a]->(`t1`:`employee`)\nMATCH (`t2`:`professor`)-[works_in_0:works_in]->(`t3`:`department`)\nWHERE `t1`.`emp_num` = `t2`.`emp_num`\nAND `t3`.`dept_code` = `t2`.`dept_code`\nAND (`t3`.`dept_name` = 'History' AND `t2`.`prof_high_degree` = 'Ph.D.')\nRETURN `t1`.`emp_fname` AS `emp_fname`, `t2`.`prof_office` AS `prof_office`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names and office of the professors who are in the history department and have a Ph.D?",
    "evidence": "",
    "idx": 4000
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`class`)-[taught_by_0:taught_by]->(`t2`:`employee`)\nWHERE `t1`.`prof_num` = `t2`.`emp_num`\nRETURN `t2`.`emp_fname` AS `emp_fname`, `t1`.`crs_code` AS `crs_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of all instructors who have taught some course and the course code.",
    "evidence": "",
    "idx": 4001
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`class`)-[taught_by_0:taught_by]->(`t2`:`employee`)\nMATCH (`t1`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t3`:`course`)\nWHERE `t1`.`prof_num` = `t2`.`emp_num`\nAND `t1`.`crs_code` = `t3`.`crs_code`\nRETURN `t2`.`emp_fname` AS `emp_fname`, `t3`.`crs_description` AS `crs_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of all instructors who have taught some course and the course description.",
    "evidence": "",
    "idx": 4003
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`class`)-[taught_by_0:taught_by]->(`t2`:`employee`)\nMATCH (`t1`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t3`:`course`)\nWHERE `t1`.`prof_num` = `t2`.`emp_num`\nAND `t1`.`crs_code` = `t3`.`crs_code`\nRETURN `t2`.`emp_fname` AS `emp_fname`, `t3`.`crs_description` AS `crs_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names of all teachers who have taught a course and the corresponding descriptions?",
    "evidence": "",
    "idx": 4004
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:enrolled_in]->(`t3`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t4`:`course`)\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND `t2`.`class_code` = `t3`.`class_code`\nAND `t3`.`crs_code` = `t4`.`crs_code`\nRETURN `t1`.`stu_fname` AS `stu_fname`, `t1`.`stu_lname` AS `stu_lname`, `t4`.`crs_description` AS `crs_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find names of all students who took some course and the course description.",
    "evidence": "",
    "idx": 4005
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:enrolled_in]->(`t3`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t4`:`course`)\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND `t2`.`class_code` = `t3`.`class_code`\nAND `t3`.`crs_code` = `t4`.`crs_code`\nRETURN `t1`.`stu_fname` AS `stu_fname`, `t1`.`stu_lname` AS `stu_lname`, `t4`.`crs_description` AS `crs_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all students who took a class and the corresponding course descriptions?",
    "evidence": "",
    "idx": 4006
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:enrolled_in]->()\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND (`t2`.`enroll_grade` = 'C' OR `t2`.`enroll_grade` = 'A')\nRETURN `t1`.`stu_fname` AS `stu_fname`, `t1`.`stu_lname` AS `stu_lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find names of all students who took some course and got A or C.",
    "evidence": "",
    "idx": 4007
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:enrolled_in]->()\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND (`t2`.`enroll_grade` = 'A' AND `t2`.`class_code` = 10018)\nRETURN `t1`.`stu_lname` AS `stu_lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the last name of the student who got a grade A in the class with code 10018.",
    "evidence": "",
    "idx": 4009
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:enrolled_in]->()\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND (`t2`.`enroll_grade` = 'A' AND `t2`.`class_code` = 10018)\nRETURN `t1`.`stu_lname` AS `stu_lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the last name of the student who received an A in the class with the code 10018?",
    "evidence": "",
    "idx": 4010
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`professor`)-[is_a_0:is_a]->(`t2`:`employee`)\nMATCH (`t1`:`professor`)-[works_in_0:works_in]->(`t3`:`department`)\nWHERE `t1`.`emp_num` = `t2`.`emp_num`\nAND `t1`.`dept_code` = `t3`.`dept_code`\nAND (`t3`.`dept_name` = 'History' AND `t1`.`prof_high_degree` <> 'Ph.D.')\nRETURN `t2`.`emp_fname` AS `emp_fname`, `t1`.`prof_office` AS `prof_office`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name and office of history professor who did not get a Ph.D. degree.",
    "evidence": "",
    "idx": 4011
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`professor`)-[is_a_0:is_a]->(`t2`:`employee`)\nMATCH (`t1`:`professor`)-[works_in_0:works_in]->(`t3`:`department`)\nWHERE `t1`.`emp_num` = `t2`.`emp_num`\nAND `t1`.`dept_code` = `t3`.`dept_code`\nAND (`t3`.`dept_name` = 'History' AND `t1`.`prof_high_degree` <> 'Ph.D.')\nRETURN `t2`.`emp_fname` AS `emp_fname`, `t1`.`prof_office` AS `prof_office`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names and offices of history professors who don't have Ph.D.s?",
    "evidence": "",
    "idx": 4012
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`course`)-[offered_by_0:offered_by]->(`t2`:`department`)\nWHERE `t1`.`dept_code` = `t2`.`dept_code`\nAND (`t1`.`crs_description` =~ '(?i)(?s).*Statistics.*')\nRETURN `t2`.`dept_name` AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of department that offers the class whose description has the word \"Statistics\".",
    "evidence": "",
    "idx": 4013
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:enrolled_in]->(`t3`:`class`)\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND `t2`.`class_code` = `t3`.`class_code`\nAND (`t3`.`crs_code` = 'ACCT-211' AND `t1`.`stu_lname` =~ '(?i)(?s)S.*')\nRETURN `t1`.`stu_fname` AS `stu_fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name of the student whose last name starting with the letter S and is taking ACCT-211 class?",
    "evidence": "",
    "idx": 4015
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:enrolled_in]->(`t3`:`class`)\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND `t2`.`class_code` = `t3`.`class_code`\nAND (`t3`.`crs_code` = 'ACCT-211' AND `t1`.`stu_lname` =~ '(?i)(?s)S.*')\nRETURN `t1`.`stu_fname` AS `stu_fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name of the student whose last name starts with the letter S and is taking ACCT-211?",
    "evidence": "",
    "idx": 4016
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`club`:`club`)\nRETURN DISTINCT `club`.`region` AS `region` ORDER BY `region` IS NULL DESC, `region`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the distinct region of clubs in ascending alphabetical order.",
    "evidence": "",
    "idx": 4019
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`competition`:`competition`)\nWHERE `competition`.`competition_type` <> 'Tournament'\nRETURN DISTINCT `competition`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct years in which the competitions type is not \"Tournament\"?",
    "evidence": "",
    "idx": 4025
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`club_rank`:`club_rank`)\nRETURN MAX(`club_rank`.`silver`) AS `_col_0`, min(`club_rank`.`silver`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum and minimum number of silver medals for clubs.",
    "evidence": "",
    "idx": 4027
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`club`:`club`)\nORDER BY `club`.`start_year` IS NULL DESC, `club`.`start_year`  \nRETURN `club`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all club names in ascending order of start year.",
    "evidence": "",
    "idx": 4031
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`club`:`club`)\nRETURN `club`.`name` AS `name` ORDER BY `name` IS NULL ASC, `name` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all club names in descending alphabetical order.",
    "evidence": "",
    "idx": 4033
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`t2`:`player`)-[plays_for_0:plays_for]->(`t1`:`club`)\nWHERE `t1`.`club_id` = `t2`.`club_id`\nRETURN `t1`.`name` AS `name`, `t2`.`player_id` AS `player_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the names and the players of clubs.",
    "evidence": "",
    "idx": 4035
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`t2`:`player`)-[plays_for_0:plays_for]->(`t1`:`club`)\nWHERE `t1`.`club_id` = `t2`.`club_id`\nAND (`t2`.`position` = 'Right Wing')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of clubs that have players with position \"Right Wing\".",
    "evidence": "",
    "idx": 4037
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`t2`:`player`)-[plays_for_0:plays_for]->(`t1`:`club`)\nWHERE `t1`.`club_id` = `t2`.`club_id`\nAND (`t2`.`position` = 'Right Wing')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the clubs that have players in the position of \"Right Wing\"?",
    "evidence": "",
    "idx": 4038
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`t2`:`player`)-[plays_for_0:plays_for]->(`t1`:`club`)\nWHERE `t1`.`club_id` = `t2`.`club_id`\nAND (`t1`.`name` = 'AIB')\nRETURN avg(`t2`.`points`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average points of players from club with name \"AIB\".",
    "evidence": "",
    "idx": 4039
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`t2`:`player`)-[plays_for_0:plays_for]->(`t1`:`club`)\nWHERE `t1`.`club_id` = `t2`.`club_id`\nAND (`t1`.`name` = 'AIB')\nRETURN avg(`t2`.`points`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average number of points for players from the \"AIB\" club?",
    "evidence": "",
    "idx": 4040
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`player`:`player`)\nWITH `player`.`position` AS _groupby_col_0, avg(`player`.`points`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `position`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the position of players and the average number of points of players of each position.",
    "evidence": "",
    "idx": 4041
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`competition`:`competition`)\nWITH `competition`.`competition_type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `competition_type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the types of competition and the number of competitions of each type.",
    "evidence": "",
    "idx": 4043
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`competition`:`competition`)\nWITH `competition`.`competition_type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 <= 5\nRETURN _groupby_col_0 AS `competition_type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the types of competition that have at most five competitions of that type.",
    "evidence": "",
    "idx": 4045
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "WITH *, COLLECT { MATCH (`player_sub0`:`player`)\nRETURN `player_sub0`.`club_id` AS `club_id`   } AS in_collect_0\nMATCH (`club`:`club`)\nWHERE NOT `club`.`club_id` IN in_collect_0\nRETURN `club`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of clubs that do not have any players.",
    "evidence": "",
    "idx": 4047
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`player`:`player`)\nRETURN sum(`player`.`points`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show total points of all players.",
    "evidence": "",
    "idx": 4049
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`player`:`player`)\nRETURN sum(`player`.`points`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of points for all players?",
    "evidence": "",
    "idx": 4050
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "CALL(*) {\nMATCH (`player_sub0`:`player`)\nRETURN avg(`player_sub0`.`points`) AS `_col_0`  \n}\nMATCH (`player`:`player`)\nWHERE `player`.`points` > `_col_0`\nRETURN `player`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the name of players who get more than the average points.",
    "evidence": "",
    "idx": 4053
  },
  {
    "filename": "train_spider.json",
    "db_id": "sports_competition",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`points` < 30\nWITH `player`.`position` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `position`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the number of players whose points are lower than 30 in each position.",
    "evidence": "",
    "idx": 4055
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`furniture`:`furniture`)\nRETURN sum(`furniture`.`num_of_component`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many furniture components are there in total?",
    "evidence": "",
    "idx": 4057
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`furniture`:`furniture`)\nORDER BY `furniture`.`market_rate` IS NULL ASC, `furniture`.`market_rate` DESC \nRETURN `furniture`.`name` AS `name`, `furniture`.`furniture_id` AS `furniture_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name and id of the furniture with the highest market rate.",
    "evidence": "",
    "idx": 4058
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`furniture`:`furniture`)\nORDER BY `furniture`.`market_rate` IS NULL ASC, `furniture`.`market_rate` DESC \nRETURN sum(`furniture`.`market_rate`) AS `_col_0`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the total market rate of the furnitures that have the top 2 market shares.",
    "evidence": "",
    "idx": 4059
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`furniture`:`furniture`)\nWHERE `furniture`.`num_of_component` > 10\nRETURN `furniture`.`num_of_component` AS `num_of_component`, `furniture`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the component amounts and names of all furnitures that have more than 10 components.",
    "evidence": "",
    "idx": 4060
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`furniture`:`furniture`)\nORDER BY `furniture`.`market_rate` IS NULL DESC, `furniture`.`market_rate`  \nRETURN `furniture`.`name` AS `name`, `furniture`.`num_of_component` AS `num_of_component`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and component amount of the least popular furniture.",
    "evidence": "",
    "idx": 4061
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "CALL(*) {\nMATCH ()-[furniture_manufacte_sub0:manufactures]->()\nRETURN MAX(`furniture_manufacte_sub0`.`price_in_dollar`) AS `_col_0`  \n}\nMATCH (`t1`:`furniture`)-[t2:manufactured_by]->()\nWHERE `t1`.`furniture_id` = `t2`.`furniture_id`\nAND (`t2`.`price_in_dollar` < `_col_0`)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of furnitures whose prices are lower than the highest price.",
    "evidence": "",
    "idx": 4062
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`manufacturer`:`manufacturer`)\nORDER BY `manufacturer`.`num_of_shops` IS NULL ASC, `manufacturer`.`num_of_shops` DESC \nRETURN `manufacturer`.`open_year` AS `open_year`, `manufacturer`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which manufacturer has the most number of shops? List its name and year of opening.",
    "evidence": "",
    "idx": 4063
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`manufacturer`:`manufacturer`)\nWHERE `manufacturer`.`num_of_shops` > 20\nRETURN avg(`manufacturer`.`num_of_factories`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average number of factories for the manufacturers that have more than 20 shops.",
    "evidence": "",
    "idx": 4064
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`manufacturer`:`manufacturer`)\nORDER BY `manufacturer`.`open_year` IS NULL DESC, `manufacturer`.`open_year`  \nRETURN `manufacturer`.`name` AS `name`, `manufacturer`.`manufacturer_id` AS `manufacturer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all manufacturer names and ids ordered by their opening year.",
    "evidence": "",
    "idx": 4065
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`manufacturer`:`manufacturer`)\nWHERE `manufacturer`.`num_of_shops` > 10 OR `manufacturer`.`num_of_factories` < 10\nRETURN `manufacturer`.`name` AS `name`, `manufacturer`.`open_year` AS `open_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the name and year of opening of the manufacturers that have either less than 10 factories or more than 10 shops.",
    "evidence": "",
    "idx": 4066
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`manufacturer`:`manufacturer`)\nWHERE `manufacturer`.`open_year` < 1990\nRETURN MAX(`manufacturer`.`num_of_shops`) AS `_col_0`, avg(`manufacturer`.`num_of_factories`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the average number of factories and maximum number of shops for manufacturers that opened before 1990.",
    "evidence": "",
    "idx": 4067
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`t1`:`manufacturer`)-[t2:manufactures]->()\nWHERE `t1`.`manufacturer_id` = `t2`.`manufacturer_id`\nORDER BY `t2`.`price_in_dollar` IS NULL ASC, `t2`.`price_in_dollar` DESC \nRETURN `t1`.`manufacturer_id` AS `manufacturer_id`, `t1`.`num_of_shops` AS `num_of_shops`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id and number of shops for the company that produces the most expensive furniture.",
    "evidence": "",
    "idx": 4068
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "MATCH (`t1`:`furniture`)-[t2:manufactured_by]->()\nWHERE `t1`.`furniture_id` = `t2`.`furniture_id`\nRETURN `t1`.`name` AS `name`, `t2`.`price_in_dollar` AS `price_in_dollar`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the names and prices of furnitures which some companies are manufacturing.",
    "evidence": "",
    "idx": 4069
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufacturer",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[furniture_manufacte_sub0:manufactures]->()\nRETURN `furniture_manufacte_sub0`.`furniture_id` AS `furniture_id`   } AS in_collect_0\nMATCH (`furniture`:`furniture`)\nWHERE NOT `furniture`.`furniture_id` IN in_collect_0\nRETURN `furniture`.`market_rate` AS `market_rate`, `furniture`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the market shares and names of furnitures which no any company is producing in our records.",
    "evidence": "",
    "idx": 4070
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nRETURN `t1`.`first_name` AS `first_name`, `t2`.`department_name` AS `department_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Display the first name and department name for each employee.",
    "evidence": "",
    "idx": 4071
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nRETURN `t1`.`first_name` AS `first_name`, `t2`.`department_name` AS `department_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first name and department name of all employees?",
    "evidence": "",
    "idx": 4072
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`salary` < 6000\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the full name (first and last name), and salary for those employees who earn below 6000.",
    "evidence": "",
    "idx": 4073
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`salary` < 6000\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full names and salaries for any employees earning less than 6000?",
    "evidence": "",
    "idx": 4074
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`last_name` = 'McEwen'\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Display the first name, and department number for all employees whose last name is \"McEwen\".",
    "evidence": "",
    "idx": 4075
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`department_id` = 'null'\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return all the information for all employees without any department number.",
    "evidence": "",
    "idx": 4077
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`department_id` = 'null'\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the employees without a department number?",
    "evidence": "",
    "idx": 4078
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`departments`:`departments`)\nWHERE `departments`.`department_name` = 'Marketing'\nRETURN `departments`.`department_id` AS `department_id`, `departments`.`department_name` AS `department_name`, `departments`.`manager_id` AS `manager_id`, `departments`.`location_id` AS `location_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Display all the information about the department Marketing.",
    "evidence": "",
    "idx": 4079
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`departments`:`departments`)\nWHERE `departments`.`department_name` = 'Marketing'\nRETURN `departments`.`department_id` AS `department_id`, `departments`.`department_name` AS `department_name`, `departments`.`manager_id` AS `manager_id`, `departments`.`location_id` AS `location_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information about the Marketing department?",
    "evidence": "",
    "idx": 4080
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE NOT `employees`.`first_name` =~ '(?i)(?s).*M.*'\nRETURN `employees`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "when is the hire date for those employees whose first name does not containing the letter M?",
    "evidence": "",
    "idx": 4081
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE NOT `employees`.`first_name` =~ '(?i)(?s).*M.*'\nRETURN `employees`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "On what dates were employees without the letter M in their first names hired?",
    "evidence": "",
    "idx": 4082
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE NOT `employees`.`first_name` =~ '(?i)(?s).*M.*'\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`hire_date` AS `hire_date`, `employees`.`salary` AS `salary`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the full name (first and last), hire date, salary, and department number for those employees whose first name does not containing the letter M.",
    "evidence": "",
    "idx": 4083
  }
]