[
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nMATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t3`:`iucr`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND `t2`.`iucr_no` = `t3`.`iucr_no`\nAND (`t1`.`community_area_name` = 'West Garfield Park' AND `t3`.`secondary_description` = 'SOLICIT ON PUBLIC WAY' AND `t3`.`primary_description` = 'PROSTITUTION')\nRETURN sum(CASE  WHEN `t2`.`arrest` = 'TRUE' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many solicit on public way prostitution crimes were arrested in West Garfield Park?",
    "evidence": "solicit on public way prostitution crime refers to secondary_description = 'SOLICIT ON PUBLIC WAY' AND primary_description = 'PROSTITUTION'; arrested refers to arrest = 'TRUE'; West Garfield Park refers to community_area_name = 'West Garfield Park'",
    "idx": 6584
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t2`.`domestic` = 'TRUE' AND `t2`.`location_description` = 'BAR OR TAVERN')\nORDER BY `t1`.`population` IS NULL ASC, `t1`.`population` DESC \nRETURN COUNT(`t2`.`report_no`) AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the most populated ward, how many incidents of domestic violence were reported in a bar or tavern?",
    "evidence": "the most populated refers to max(population); domestic violence refers to domestic = 'TRUE'; in a bar or tavern refers to location_description = 'BAR OR TAVERN'",
    "idx": 6585
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`neighborhood`)-[located_in_0:located_in]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nRETURN sum(CASE  WHEN `t1`.`community_area_name` = 'Near North Side' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many neighborhoods are there in Near North Side?",
    "evidence": "Near North Side refers to community_area_name = 'Near North Side'",
    "idx": 6586
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t1`.`alderman_first_name` = 'Walter' AND `t1`.`alderman_last_name` = 'Burnett' AND `t1`.`alderman_name_suffix` = 'Jr.' AND `t2`.`domestic` = 'TRUE')\nRETURN sum(CASE  WHEN `t2`.`arrest` = 'TRUE' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Out of all the incidents of domestic violence reported at the ward represented by alderman Walter Burnett Jr., how many were arrested?",
    "evidence": "domestic violence refers to domestic = 'TRUE'; arrested refers to arrest = 'TRUE'",
    "idx": 6587
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nMATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t3`:`fbi_code`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND `t2`.`fbi_code_no` = `t3`.`fbi_code_no`\nWITH `t3`.`title` AS _groupby_col_0\nORDER BY `t1`.`population` IS NULL DESC, `t1`.`population` , `t3`.`fbi_code_no` IS NULL ASC, `t3`.`fbi_code_no` DESC \nRETURN _groupby_col_0 AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the short description of the crime committed the most by criminals in the least populated community?",
    "evidence": "short description refers to title; committed the most refers to max(fbi_code_no); the least populated community refers to min(population)",
    "idx": 6588
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t2`.`block` = '010XX W LAKE ST')\nWITH `t1`.`ward_office_address` AS _groupby_col_0\nRETURN _groupby_col_0 AS `ward_office_address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the legislative district's office address where 010XX W LAKE ST is located?",
    "evidence": "the legislative district's office address refers to ward_office_address; 010XX W LAKE ST refers to block = '010XX W LAKE ST'",
    "idx": 6589
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nMATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t3`:`fbi_code`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND `t2`.`fbi_code_no` = `t3`.`fbi_code_no`\nAND (`t3`.`title` = 'Vandalism' AND `t2`.`arrest` = 'TRUE' AND `t1`.`alderman_first_name` = 'Edward')\nRETURN sum(CASE  WHEN `t1`.`alderman_last_name` = 'Burke' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many vandalisms were arrested in the ward represented by Edward Burke?",
    "evidence": "vandalism refers to title = 'Vandalism'; arrested refers to arrest = 'TRUE'",
    "idx": 6590
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`crime`:`crime`)\nWHERE `crime`.`date` =~ '(?i)(?s)5/.*/2018.*' AND `crime`.`domestic` = 'TRUE'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many domestic violence cases were reported in May 2018?",
    "evidence": "domestic violence refers to domestic = 'TRUE'; in May 2018 refers to date LIKE '5/%/2018%'",
    "idx": 6591
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`iucr`:`iucr`)\nWHERE `iucr`.`primary_description` = 'HOMICIDE'\nRETURN `iucr`.`index_code` AS `index_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the IUCR numbers and index status of homicide incidents.",
    "evidence": "index status refers to index_code; homicide incident refers to primary_description = 'HOMICIDE'",
    "idx": 6592
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`district_name` = 'Chicago Lawn'\nRETURN `district`.`commander` AS `commander`, `district`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the responsible person and his/her email address of Chicago Lawn.",
    "evidence": "responsible person refers to commander; email address refers to email; Chicago Lawn refers to district_name = 'Chicago Lawn'",
    "idx": 6593
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`ward`:`ward`)\nORDER BY `ward`.`population` IS NULL ASC, `ward`.`population` DESC \nRETURN `ward`.`alderman_name_suffix` AS `alderman_name_suffix`, `ward`.`alderman_first_name` AS `alderman_first_name`, `ward`.`alderman_last_name` AS `alderman_last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the alderman's full name of the most crowded ward?",
    "evidence": "alderman's full name refers to alderman_name_suffix, alderman_first_name, alderman_last_name; the most crowded refers to max(population)",
    "idx": 6594
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nWHERE `community_area`.`side` = 'Northwest'\nRETURN `community_area`.`community_area_name` AS `community_area_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the community area names in the Northwest.",
    "evidence": "the Northwest refers to side = 'Northwest'",
    "idx": 6595
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`fbi_code`:`fbi_code`)\nWHERE `fbi_code`.`crime_against` = 'Persons'\nRETURN `fbi_code`.`title` AS `title`, `fbi_code`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the titles and descriptions of the crimes cases against persons.",
    "evidence": "crime case against persons refers to crime_against = 'Persons'",
    "idx": 6596
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nWHERE `t1`.`iucr_no` = `t2`.`iucr_no`\nAND (`t2`.`iucr_no` = '142')\nRETURN `t1`.`secondary_description` AS `secondary_description`, `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the specific description and case locations under IUCR 142.",
    "evidence": "specific description refers to secondary_description; location refers to latitude, longitude; IUCR 142 refers to iucr_no = 142",
    "idx": 6597
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t2`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t2`.`alderman_name_suffix` IS NULL AND `t2`.`alderman_first_name` = 'Brendan' AND `t1`.`date` =~ '(?i)(?s)10/7/2018.*')\nRETURN sum(CASE  WHEN `t2`.`alderman_last_name` = 'Reilly' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crimes were handled by Brendan Reilly on 7th October 2018?",
    "evidence": "7th October 2018 refers to date like '10/7/2018%'",
    "idx": 6598
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[handled_by_district_0:handled_by_district]->(`t2`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t2`.`district_name` = 'Englewood' AND `t1`.`location_description` = 'RESTAURANT')\nRETURN sum(CASE  WHEN `t1`.`arrest` = 'TRUE' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cases have been arrested among the crimes that happened in the restaurant of Englewood?",
    "evidence": "arrested refers to arrest = 'TRUE'; restaurant refers to location_description = 'RESTAURANT'; Englewood refers to district_name = 'Englewood'",
    "idx": 6599
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nMATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t3`:`ward`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND `t2`.`ward_no` = `t3`.`ward_no`\nAND (`t2`.`block` = '0000X N FRANCISCO AVE')\nWITH `t2`.`case_number` AS _groupby_col_0, `t3`.`alderman_first_name` AS _groupby_col_1, `t3`.`alderman_last_name` AS _groupby_col_2, `t1`.`district_name` AS _groupby_col_3\nRETURN _groupby_col_0 AS `case_number`, _groupby_col_1 AS `alderman_first_name`, _groupby_col_2 AS `alderman_last_name`, _groupby_col_3 AS `district_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide case numbers, aldermen's full names, and district names of the crimes that happened in 0000X N FRANCISCO AVE.",
    "evidence": "aldermen's full name refers to alderman_name_suffix, alderman_first_name, alderman_last_name; 0000X N FRANCISCO AVE refers to block = '0000X N FRANCISCO AVE'",
    "idx": 6600
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t2`.`fbi_code_no` = `t1`.`fbi_code_no`\nRETURN sum(CASE  WHEN `t1`.`title` = 'Misc Non-Index Offense' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crimes were Misc Non-Index Offense?",
    "evidence": "Misc Non-Index Offense refers to title = 'Misc Non-Index Offense'",
    "idx": 6601
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`neighborhood`)-[located_in_0:located_in]->(`t1`:`community_area`)\nWHERE `t2`.`community_area_no` = `t1`.`community_area_no`\nAND (`t1`.`community_area_name` = 'Douglas')\nRETURN `t2`.`neighborhood_name` AS `neighborhood_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the neighborhood areas of Douglas.",
    "evidence": "neighborhood area refers to neighborhood_name; Douglas refers to community_area_name = 'Douglas'",
    "idx": 6602
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nMATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t3`:`fbi_code`)\nWHERE `t2`.`community_area_no` = `t1`.`community_area_no`\nAND `t3`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t1`.`side` = 'Central')\nRETURN CASE WHEN COUNT(`t2`.`report_no`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t3`.`title` = 'Larceny' THEN `t2`.`report_no`  END)) * 100 / COUNT(`t2`.`report_no`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the crimes in the Central, calculate the percentage of larceny incidents.",
    "evidence": "Central refers to side = 'Central'; larceny refers to title = 'Larceny'; percentage = divide(count(report_no where title = 'Larceny'), count(report_no)) where side = 'Central' * 100%",
    "idx": 6603
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nMATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t3`:`iucr`)\nWHERE `t2`.`ward_no` = `t1`.`ward_no`\nAND `t3`.`iucr_no` = `t2`.`iucr_no`\nAND (`t3`.`primary_description` = 'ARSON' AND `t3`.`secondary_description` = 'BY EXPLOSIVE')\nRETURN `t2`.`location_description` AS `location_description`, `t1`.`alderman_first_name` AS `alderman_first_name`, `t1`.`alderman_last_name` AS `alderman_last_name`, `t1`.`alderman_name_suffix` AS `alderman_name_suffix`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the location descriptions and aldermen's full names of the arson by explosive.",
    "evidence": "aldermen's full name refers to alderman_name_suffix, alderman_first_name, alderman_last_name; arson by explosive refers to primary_description = 'ARSON' AND secondary_description = 'BY EXPLOSIVE'",
    "idx": 6604
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nWHERE `t2`.`iucr_no` = `t1`.`iucr_no`\nAND (`t1`.`primary_description` = 'DECEPTIVE PRACTICE' AND `t1`.`secondary_description` = 'UNLAWFUL USE OF RECORDED SOUND')\nRETURN `t2`.`date` AS `date`, `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the occurrence date and location of the deceptive practice due to the unlawful use of recorded sound.",
    "evidence": "location refers to latitude, longitude; deceptive practice refers to primary_description = 'DECEPTIVE PRACTICE'; unlawful use of recorded sound refers to secondary_description = 'UNLAWFUL USE OF RECORDED SOUND'",
    "idx": 6605
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nMATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t3`:`fbi_code`)\nWHERE `t2`.`district_no` = `t1`.`district_no`\nAND `t3`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t3`.`title` = 'Criminal Sexual Assault' AND `t1`.`commander` = 'Adnardo Gutierrez' AND `t2`.`location_description` = 'RESIDENCE')\nRETURN COUNT(`t2`.`report_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the criminal sexual assaults in the district of Adnardo Gutierrez, how many cases happened in the residence?",
    "evidence": "criminal sexual assault refers to title = 'Criminal Sexual Assault'; Adnardo Gutierrez refers to commander = 'Adnardo Gutierrez'; in the residence refers to location_description = 'RESIDENCE'",
    "idx": 6606
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t2`.`community_area_no` = `t1`.`community_area_no`\nAND (`t1`.`community_area_name` = 'West Pullman' AND `t2`.`domestic` = 'TRUE')\nRETURN CASE WHEN COUNT(`t2`.`report_no`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t2`.`arrest` = 'TRUE' THEN `t2`.`report_no`  END)) * 100 / COUNT(`t2`.`report_no`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many percent of domestic violence cases were arrested in West Pullman?",
    "evidence": "domestic violence refers to domestic = 'TRUE'; arrested refers to arrest = 'TRUE'; West Pullman refers to community_area_name = 'West Pullman'; percent = divide(count(report_no where arrest = 'TRUE'), count(report_no)) where domestic = 'TRUE' and community_area_name = 'West Pullman' * 100%",
    "idx": 6607
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t2`:`ward`)\nWHERE `t2`.`ward_no` = `t1`.`ward_no`\nAND (`t2`.`alderman_first_name` = 'Christopher' AND `t2`.`alderman_last_name` = 'Taliaferro')\nRETURN CASE WHEN COUNT(`t1`.`report_no`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`domestic` = 'TRUE' THEN `t1`.`report_no`  END)) * 100 / COUNT(`t1`.`report_no`) END AS `_col_0`, COUNT(CASE  WHEN `t1`.`domestic` = 'TRUE' AND `t1`.`location_description` = 'BANK' THEN `t1`.`report_no`  END) AS `number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of the domestic violence cases handled by Christopher Taliaferro. Among them, list report numbers of cases that happened in the bank.",
    "evidence": "domestic violence refers to domestic = 'TRUE'; report number refers to report_no; in the bank refers to location_description = 'BANK'; percentage = divide(count(report_no where domestic = 'TRUE'), count(report_no)) * 100%",
    "idx": 6608
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`crime`:`crime`)\nWHERE `crime`.`date` =~ '(?i)(?s)1/1/2018.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crimes are commited on January 1, 2018?",
    "evidence": "on January 1 2018 refers to date LIKE '1/1/2018%'",
    "idx": 6610
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nWHERE `community_area`.`side` = 'West '\nRETURN avg(toFloat(`community_area`.`population`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average population of community areas in the West side.",
    "evidence": "the West side refers to side = 'West'; average population = avg(population) where side = 'West'",
    "idx": 6611
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t3`:`community_area`)\nWHERE `t2`.`ward_no` = `t1`.`ward_no`\nAND `t3`.`community_area_no` = `t2`.`community_area_no`\nAND (`t1`.`alderman_first_name` = 'Edward' AND `t1`.`alderman_last_name` = 'Burke')\nORDER BY `t2`.`beat` IS NULL ASC, `t2`.`beat` DESC, `t3`.`population` IS NULL ASC, `t3`.`population` DESC \nRETURN `t2`.`report_no` AS `report_no`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cases reported in the ward with Edward Burke as the alderman and happened in the community area with the highest population, provide the report number of the crime with the highest beat.",
    "evidence": "the highest population refers to max(population); report number refers to report_no; the highest beat refers to max(beat)",
    "idx": 6612
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t2`.`fbi_code_no` = `t1`.`fbi_code_no`\nAND (`t1`.`title` = 'Homicide 1st & 2nd Degree')\nRETURN sum(CASE  WHEN `t2`.`location_description` = 'STREET' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the crimes that happened in the street have FBI title \"Homicide 1st & 2nd Degree\"?",
    "evidence": "in the street refers to location_description = 'STREET'",
    "idx": 6613
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t2`:`ward`)\nWHERE `t2`.`ward_no` = `t1`.`ward_no`\nAND (`t1`.`report_no` = 23769)\nRETURN `t2`.`alderman_first_name` AS `alderman_first_name`, `t2`.`alderman_last_name` AS `alderman_last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the alderman in the ward associated with the crime with report number 23769?",
    "evidence": "alderman refers to alderman_suffix, alderman_first_name, alderman_last_name; report number 23769 refers to report_no = 23769",
    "idx": 6614
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t2`.`community_area_no` = `t1`.`community_area_no`\nAND (`t1`.`community_area_name` = 'Lincoln Square' AND `t2`.`domestic` = 'TRUE')\nRETURN `t2`.`case_number` AS `case_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the case numbers of domestic violence crimes reported in Lincoln Square.",
    "evidence": "domestic violence refers to domestic = 'TRUE'; Lincoln Square refers to community_area_name = 'Lincoln Square'",
    "idx": 6615
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t2`:`ward`)\nWHERE `t2`.`ward_no` = `t1`.`ward_no`\nAND (`t1`.`location_description` = 'APARTMENT' AND `t2`.`ward_office_address` = '1958 N. Milwaukee Ave.')\nRETURN `t1`.`case_number` AS `case_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the crimes reported to the ward located at 1958 N. Milwaukee Ave., list down the report number of the crimes happened inside the apartment.",
    "evidence": "1958 N. Milwaukee Ave. refers to ward_office_address = '1958 N. Milwaukee Ave.'; report number refers to case_number; inside the apartment refers to location_description = 'APARTMENT'",
    "idx": 6616
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t2`.`community_area_no` = `t1`.`community_area_no`\nAND (`t1`.`community_area_name` = 'Bridgeport')\nRETURN sum(CASE  WHEN `t2`.`beat` < 1000 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of crimes that happened in Bridgeport with beat less than 1000?",
    "evidence": "Bridgeport refers to community_area_name = 'Bridgeport'; with beat less than 1000 refers to beat < 1000; total number = count(beat) where community_area_name = 'Bridgeport' and beat < 1000",
    "idx": 6617
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t2`.`community_area_no` = `t1`.`community_area_no`\nAND (`t1`.`side` = 'Far North ')\nRETURN sum(CASE  WHEN `t1`.`population` > '60000' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the report number of crimes reported in a community area in the far north side with a population greater than 60,000.",
    "evidence": "report number refers to report_no; the far north side refers to side = 'Far North'; population greater than 60,000 refers to population > '60000'",
    "idx": 6618
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t3`:`community_area`)\nWHERE `t2`.`fbi_code_no` = `t1`.`fbi_code_no`\nAND `t3`.`community_area_no` = `t2`.`community_area_no`\nAND (`t3`.`community_area_name` = 'Riverdale')\nRETURN sum(CASE  WHEN `t1`.`crime_against` = 'Property' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the report number of crimes against property happened in Riverdale.",
    "evidence": "crime against property refers to crime_against = 'Property'; Riverdale refers to community_area_name = 'Riverdale'",
    "idx": 6619
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nWHERE `t2`.`ward_no` = `t1`.`ward_no`\nAND (`t1`.`ward_email` = 'ward13@cityofchicago.org')\nRETURN sum(CASE  WHEN `t2`.`domestic` = 'TRUE' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many domestic violence cases were brought in the ward that uses \"ward13@cityofchicago.org\"?",
    "evidence": "domestic violence refers to domestic = 'TRUE'; uses \"ward13@cityofchicago.org\" refers to ward_email = 'ward13@cityofchicago.org'",
    "idx": 6620
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t2`.`district_no` = `t1`.`district_no`\nAND (`t2`.`case_number` = 'JB107731')\nRETURN `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the district address associated with the case JB107731?",
    "evidence": "case JB107731 refers to case_number = 'JB107731'",
    "idx": 6621
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t2`.`community_area_no` = `t1`.`community_area_no`\nAND (`t1`.`side` = 'Central')\nRETURN 1.0 * sum(CASE  WHEN `t1`.`population` > '50000' THEN `t2`.`beat` ELSE 0 END) AS `sum`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total beat of the crimes reported in a community area in the central side with population of 50,000 and above.",
    "evidence": "the central side refers to side = 'Central'; population of 50,000 and above refers to population > '50000'; total beat = sum(beat) where side = 'Central' and population > '50000'",
    "idx": 6622
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t2`.`fbi_code_no` = `t1`.`fbi_code_no`\nAND (`t2`.`date` =~ '(?i)(?s)6/.*/2018.*' AND `t1`.`crime_against` = 'Society')\nRETURN `t2`.`case_number` AS `case_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the case number of crimes against society that happened in June 2018.",
    "evidence": "crime against society refers to crime_against = 'Society'; in June 2018 refers to date LIKE '6/%/2018%'",
    "idx": 6623
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`crime`)-[occurred_in_ward_1:occurred_in_ward]->(`t2_sub0`:`ward`)\nWHERE `t1_sub0`.`ward_no` = `t2_sub0`.`ward_no`\nAND (`t2_sub0`.`population` < 52000)\nRETURN avg(`t1_sub0`.`beat`) * 0.9 AS `_col_0_1`  \n}\nMATCH (`t1`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t2`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t2`.`population` < 52000 AND `t1`.`beat` > `_col_0_1`)\nRETURN COUNT(`t1`.`report_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the case number of the crimes in wards with population below 52000 that have beat greater than the 90% of the average beat of all crimes.",
    "evidence": "population below 52000 refers to population < 52000; beat greater than the 90% of the average beat refers to beat > multiply(avg(beat), 0.9) where population < 52000",
    "idx": 6624
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nWHERE `community_area`.`side` = 'Far North ' AND `community_area`.`population` >= '50000' AND `community_area`.`population` <= '70000'\nRETURN `community_area`.`community_area_name` AS `community_area_name`, `community_area`.`side` AS `side`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the area name of the communities in the Far north side, which has a population of more than 50000 but less than 70000.",
    "evidence": "area name refers to community_area_name; the Far north side refers to side = 'Far North'; a population of more than 50000 but less than 70000 refers to population BETWEEN '50000' AND '70000'",
    "idx": 6625
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`crime`:`crime`)\nWHERE `crime`.`location_description` = 'ALLEY' AND `crime`.`arrest` = 'TRUE'\nWITH `crime`.`latitude` AS _groupby_col_0, `crime`.`longitude` AS _groupby_col_1\nRETURN _groupby_col_0 AS `latitude`, _groupby_col_1 AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the coordinate of the alleys where a crime was reported and an arrest was made.",
    "evidence": "coordinate refers to latitude, longitude; alley refers to location_description = 'ALLEY'; an arrest was made refers to arrest = 'TRUE'",
    "idx": 6626
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`district_name` = 'Ogden'\nRETURN `district`.`commander` AS `commander`, `district`.`email` AS `email`, `district`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the commander's name, email address, and phone number of the Ogden district.",
    "evidence": "commander's name refers to commander; email address refers to email; phone number refers to phone",
    "idx": 6627
  }
]