[
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`characters`:`characters`)\nWHERE `characters`.`movie_title` = 'The Great Mouse Detective'\nRETURN `characters`.`villian` AS `villian`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the villain in the movie \"The Great Mouse Detective\"?",
    "evidence": "The Great Mouse Detective refers to movie_title = 'The Great Mouse Detective';",
    "idx": 3580
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nAND (`t1`.`genre` = 'Drama')\nWITH `t2`.`song` AS _groupby_col_0\nRETURN _groupby_col_0 AS `song`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the songs associated with drama movies.",
    "evidence": "drama refers to genre = 'Drama';",
    "idx": 3584
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`voice-actors`)-[voiced_in_0:voiced_in]->(`t2`:`characters`)\nWHERE `t2`.`movie_title` = `t1`.`movie`\nAND (`t2`.`movie_title` = 'The Rescuers' AND `t1`.`character` = `t2`.`villian`)\nRETURN `t1`.`voice-actor` AS `voice-actor`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who voiced the villain in \"The Rescuers\"?",
    "evidence": "The Rescuers refers to movie_title = 'The Rescuers'; who voiced refers to voice-actor;",
    "idx": 3586
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`voice-actors`)\nMATCH (`t1`:`director`)\nWHERE `t1`.`name` = `t2`.`movie`\nAND (`t1`.`director` = 'Wolfgang Reitherman')\nRETURN `t1`.`name` AS `name`, `t2`.`voice-actor` AS `voice-actor`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of Wolfgang Reitherman's movies and their voice actors.",
    "evidence": "Wolfgang Reitherman refers to director = 'Wolfgang Reitherman';",
    "idx": 3587
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t2`.`movie_title` = `t1`.`movie_title`\nAND (`t2`.`song` IS NULL)\nORDER BY toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) IS NULL ASC, toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) DESC \nRETURN `t1`.`movie_title` AS `movie_title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest grossing movie without a song?",
    "evidence": "the highest grossing movie without song refers to movie_title where MAX(total_gross) and song = 'null';",
    "idx": 3589
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)-[directed_0:directed]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (NOT `t1`.`song` IS NULL)\nWITH `t2`.`director` AS _groupby_col_0\nRETURN _groupby_col_0 AS `director`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the directors of movies that feature a song.",
    "evidence": "movies that feature a song refer to movie_title where song is not NULL;",
    "idx": 3592
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`movies_total_gross`)\nMATCH (`t1`:`voice-actors`)\nWHERE `t2`.`movie_title` = `t1`.`movie`\nAND (`t1`.`voice-actor` = 'Jim Cummings')\nORDER BY toFloat(replace(trim(BOTH '$' FROM `t2`.`total_gross`),',','')) IS NULL ASC, toFloat(replace(trim(BOTH '$' FROM `t2`.`total_gross`),',','')) DESC \nRETURN `t2`.`movie_title` AS `movie_title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the total grosses for the movies with Jim Cummings as the voice actor?",
    "evidence": "FALSE;",
    "idx": 3593
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`movies_total_gross`)\nMATCH (`t1`:`director`)\nWHERE `t1`.`name` = `t2`.`movie_title`\nAND (`t1`.`director` = 'Ron Clements')\nORDER BY toFloat(replace(trim(BOTH '$' FROM `t2`.`total_gross`),',','')) IS NULL ASC, toFloat(replace(trim(BOTH '$' FROM `t2`.`total_gross`),',','')) DESC \nRETURN `t2`.`movie_title` AS `movie_title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which of the movies directed by Ron Clements has the highest total gross?",
    "evidence": "Ron Clements refer to director = 'Ron Clements'; the highest total gross refers to MAX(total_gross);",
    "idx": 3594
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`movies_total_gross`)\nMATCH (`t1`:`voice-actors`)\nWHERE `t1`.`movie` = `t2`.`movie_title`\nAND (`t1`.`voice-actor` = 'Sterling Holloway')\nRETURN CASE WHEN COUNT(`t2`.`movie_title`)=0 THEN NULL ELSE sum(toFloat(replace(trim(BOTH '$' FROM `t2`.`total_gross`),',',''))) / COUNT(`t2`.`movie_title`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average total gross for the movies featuring Sterling Holloway?",
    "evidence": "DIVIDE(SUM(total_gross where voice-actor = 'Sterling Holloway'); COUNT(movie_title where voice-actor = 'Sterling Holloway'));",
    "idx": 3595
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`movies_total_gross`:`movies_total_gross`)\nWHERE CASE  WHEN char_length(`movies_total_gross`.`release_date`) - 3-1 < 0 AND char_length(`movies_total_gross`.`release_date`) < 0  THEN substring(`movies_total_gross`.`release_date`,(case when size(`movies_total_gross`.`release_date`)+1+(char_length(`movies_total_gross`.`release_date`) - 3-1)+char_length(`movies_total_gross`.`release_date`) < 0 then 0 else size(`movies_total_gross`.`release_date`)+1+(char_length(`movies_total_gross`.`release_date`) - 3-1)+char_length(`movies_total_gross`.`release_date`) end),-(char_length(`movies_total_gross`.`release_date`)))  WHEN char_length(`movies_total_gross`.`release_date`) - 3-1 < 0 AND char_length(`movies_total_gross`.`release_date`) >= 0  THEN substring(`movies_total_gross`.`release_date`,size(`movies_total_gross`.`release_date`)+1+(char_length(`movies_total_gross`.`release_date`) - 3-1),char_length(`movies_total_gross`.`release_date`))  WHEN char_length(`movies_total_gross`.`release_date`) - 3-1 >= 0 AND char_length(`movies_total_gross`.`release_date`) < 0  THEN substring(`movies_total_gross`.`release_date`,(case when char_length(`movies_total_gross`.`release_date`) - 3-1+1+(char_length(`movies_total_gross`.`release_date`)) < 0 then 0 else char_length(`movies_total_gross`.`release_date`) - 3-1+1+(char_length(`movies_total_gross`.`release_date`)) end),-(char_length(`movies_total_gross`.`release_date`)))  ELSE substring(`movies_total_gross`.`release_date`,char_length(`movies_total_gross`.`release_date`) - 3-1,char_length(`movies_total_gross`.`release_date`)) END = '2016'\nRETURN `movies_total_gross`.`movie_title` AS `movie_title`, `movies_total_gross`.`genre` AS `genre`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the movies and genres released in 2016.",
    "evidence": "released in 2016 refers to substr(release_date, length(release_date) - 3, length(release_date)) = '2016'; movies refer to the movie_title;",
    "idx": 3597
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`director`:`director`)\nWHERE `director`.`director` = 'Jack Kinney'\nRETURN `director`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the movie titles directed by Jack Kinney.",
    "evidence": "Jack Kinney refers to director = 'Jack Kinney';",
    "idx": 3599
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`movies_total_gross`:`movies_total_gross`)\nORDER BY toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`total_gross`),',','')) IS NULL ASC, toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`total_gross`),',','')) DESC \nRETURN `movies_total_gross`.`movie_title` AS `movie_title`, CASE WHEN toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`total_gross`),',',''))=0 THEN NULL ELSE toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`inflation_adjusted_gross`),',','')) / toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`total_gross`),',','')) END AS `_col_1`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the movie titles and the estimated inflation rate of the highest total grossed movie.",
    "evidence": "The highest grossed movie refers to MAX(total_gross); DIVIDE(inflation_adjusted_gross, total_gross) as percentage;",
    "idx": 3600
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`movies_total_gross`:`movies_total_gross`)\nWHERE `movies_total_gross`.`mpaa_rating` = 'PG-13' AND `movies_total_gross`.`genre` = 'Romantic Comedy'\nRETURN `movies_total_gross`.`movie_title` AS `movie_title`, `movies_total_gross`.`release_date` AS `release_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the PG-13 romantic comedy movie titles and their release dates.",
    "evidence": "PG-13 refers to MPAA_rating = 'PG-13'; romantic comedy refers to genre = 'Romantic Comedy';",
    "idx": 3601
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)-[directed_0:directed]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t2`.`director` = 'Ron Clements')\nRETURN `t1`.`movie_title` AS `movie_title`, `t1`.`song` AS `song`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the movie titles and associated songs directed by Ron Clements.",
    "evidence": "Ron Clements refers director = 'Ron Clements';",
    "idx": 3603
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t3`:`director`)\nMATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nAND `t1`.`movie_title` = `t3`.`name`\nAND (`t3`.`director` = 'Wolfgang Reitherman' AND CASE  WHEN char_length(`t1`.`release_date`) - 3-1 < 0 AND char_length(`t1`.`release_date`) < 0  THEN substring(`t1`.`release_date`,(case when size(`t1`.`release_date`)+1+(char_length(`t1`.`release_date`) - 3-1)+char_length(`t1`.`release_date`) < 0 then 0 else size(`t1`.`release_date`)+1+(char_length(`t1`.`release_date`) - 3-1)+char_length(`t1`.`release_date`) end),-(char_length(`t1`.`release_date`)))  WHEN char_length(`t1`.`release_date`) - 3-1 < 0 AND char_length(`t1`.`release_date`) >= 0  THEN substring(`t1`.`release_date`,size(`t1`.`release_date`)+1+(char_length(`t1`.`release_date`) - 3-1),char_length(`t1`.`release_date`))  WHEN char_length(`t1`.`release_date`) - 3-1 >= 0 AND char_length(`t1`.`release_date`) < 0  THEN substring(`t1`.`release_date`,(case when char_length(`t1`.`release_date`) - 3-1+1+(char_length(`t1`.`release_date`)) < 0 then 0 else char_length(`t1`.`release_date`) - 3-1+1+(char_length(`t1`.`release_date`)) end),-(char_length(`t1`.`release_date`)))  ELSE substring(`t1`.`release_date`,char_length(`t1`.`release_date`) - 3-1,char_length(`t1`.`release_date`)) END = '1977')\nRETURN `t1`.`movie_title` AS `movie_title`, `t2`.`hero` AS `hero`, `t2`.`song` AS `song`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the titles, main characters, and associated songs of the movies directed by Wolfgang Reitherman in 1977.",
    "evidence": "Wolfgang Reitherman refers to director = 'Wolfgang Reitherman'; 1997 refers to substr(release_date, length(release_date) - 3, length(release_date)) = '1977'; the titles refer to movie_title; main characters refer to hero;",
    "idx": 3604
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)-[directed_0:directed]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t1`.`movie_title` = 'Mulan')\nRETURN `t1`.`hero` AS `hero`, `t2`.`director` AS `director`, `t1`.`release_date` AS `release_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the hero, director, and the release date of Mulan.",
    "evidence": "Mulan refers to movie_title = 'Mulan';",
    "idx": 3606
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t3`:`director`)\nMATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nAND `t3`.`name` = `t1`.`movie_title`\nAND (`t2`.`hero` = 'Elsa')\nRETURN `t1`.`movie_title` AS `movie_title`, `t1`.`total_gross` AS `total_gross`, `t1`.`mpaa_rating` AS `mpaa_rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the title, total gross, and MPAA rating of the movie which has a hero named Elsa.",
    "evidence": "Elsa is the main character of the movie which refers to hero = 'Elsa'; title refers to movie_title;",
    "idx": 3607
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`voice-actors`)-[voiced_in_0:voiced_in]->(`t2`:`characters`)\nMATCH (`t3`:`director`)-[directed_0:directed]->(`t2`:`characters`)\nWHERE `t1`.`movie` = `t2`.`movie_title`\nAND `t3`.`name` = `t2`.`movie_title`\nAND (`t1`.`voice-actor` = 'Freddie Jones')\nRETURN `t1`.`movie` AS `movie`, `t3`.`director` AS `director`, `t2`.`release_date` AS `release_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the title, director, and release date of the movie voice-acted by Freddie Jones.",
    "evidence": "Freddie Jones refers to voice-actor = 'Freddie Jones'; title refers to movie_title;",
    "idx": 3608
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)\nMATCH (`t2`:`voice-actors`)\nWHERE `t1`.`movie_title` = `t2`.`movie`\nAND (`t2`.`voice-actor` = 'Frank Welker' AND CASE WHEN toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',',''))=0 THEN NULL ELSE toFloat(replace(trim(BOTH '$' FROM `t1`.`inflation_adjusted_gross`),',','')) * 1.0 / toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) END * 1.0 < 2)\nRETURN `t1`.`movie_title` AS `movie_title`, `t1`.`total_gross` AS `total_gross`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among Frank Welker's voice-acted movies, list the movie titles and the total gross when the estimated inflation rate was less than 2.",
    "evidence": "Frank Welker refers to voice-actor = 'Frank Welker'; estimated inflation rate was less than 2 can be computed as follows DIVIDE(inflation_adjusted_gross, total_gross) as percentage < 2;",
    "idx": 3609
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)\nMATCH (`t2`:`director`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nORDER BY toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) IS NULL ASC, toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) DESC \nRETURN `t2`.`director` AS `director`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who directed the most popular movie?",
    "evidence": "The most popular movie refers MAX(total_gross); who directed refers to director;",
    "idx": 3610
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`voice-actors`)-[voiced_in_0:voiced_in]->(`t2`:`characters`)\nWHERE `t1`.`movie` = `t2`.`movie_title`\nAND (`t2`.`movie_title` = 'Cinderella')\nRETURN `t1`.`voice-actor` AS `voice-actor`, `t2`.`villian` AS `villian`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the voice actors and villains in Cinderella.",
    "evidence": "Cinderella refers to movie_title = ' Cinderella';",
    "idx": 3611
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)\nMATCH (`t2`:`director`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t1`.`genre` = 'Musical' AND CASE  WHEN char_length(`t1`.`release_date`) - 3-1 < 0 AND char_length(`t1`.`release_date`) < 0  THEN substring(`t1`.`release_date`,(case when size(`t1`.`release_date`)+1+(char_length(`t1`.`release_date`) - 3-1)+char_length(`t1`.`release_date`) < 0 then 0 else size(`t1`.`release_date`)+1+(char_length(`t1`.`release_date`) - 3-1)+char_length(`t1`.`release_date`) end),-(char_length(`t1`.`release_date`)))  WHEN char_length(`t1`.`release_date`) - 3-1 < 0 AND char_length(`t1`.`release_date`) >= 0  THEN substring(`t1`.`release_date`,size(`t1`.`release_date`)+1+(char_length(`t1`.`release_date`) - 3-1),char_length(`t1`.`release_date`))  WHEN char_length(`t1`.`release_date`) - 3-1 >= 0 AND char_length(`t1`.`release_date`) < 0  THEN substring(`t1`.`release_date`,(case when char_length(`t1`.`release_date`) - 3-1+1+(char_length(`t1`.`release_date`)) < 0 then 0 else char_length(`t1`.`release_date`) - 3-1+1+(char_length(`t1`.`release_date`)) end),-(char_length(`t1`.`release_date`)))  ELSE substring(`t1`.`release_date`,char_length(`t1`.`release_date`) - 3-1,char_length(`t1`.`release_date`)) END = '1993')\nRETURN `t2`.`director` AS `director`, `t1`.`mpaa_rating` AS `mpaa_rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the directors and MPAA ratings of the musical movies released in 1993.",
    "evidence": "Musical movies refer to genre = 'Musical'; released in 1993 refers to substr(release_date, length(release_date) - 3, length(release_date)) = '1993';",
    "idx": 3613
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`director`:`director`)\nWHERE `director`.`name` = 'Wreck-It Ralph'\nRETURN `director`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the director's name of Wreck-It Ralph movie.",
    "evidence": "Wreck-It Ralph is the name of the movies which refers to name = 'Wreck-It Ralph';",
    "idx": 3617
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)-[directed_0:directed]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t2`.`director` = 'Ben Sharpsteen')\nRETURN `t1`.`song` AS `song`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of the song from the movie directed by Ben Sharpsteen.",
    "evidence": "Ben Sharpsteen refers to director = 'Ben Sharpsteen';",
    "idx": 3620
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)-[directed_0:directed]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t2`.`director` = 'Roger Allers' AND `t1`.`movie_title` = 'The Lion King')\nRETURN `t1`.`release_date` AS `release_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the release date of the film The Lion King directed by Roger Allers.",
    "evidence": "The Lion King refers to movie_title = 'The Lion King'; Roger Allers refers to director = 'Roger Allers';",
    "idx": 3621
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`voice-actors`)-[voiced_in_0:voiced_in]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie`\nAND (`t2`.`voice-actor` = 'Scott Weinger Brad Kane')\nRETURN `t1`.`villian` AS `villian`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the villain of the movie with Scott Weinger and Brad Kane as voice actors.",
    "evidence": "FALSE;",
    "idx": 3622
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)-[directed_0:directed]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t2`.`director` = 'Jack Kinney' AND CASE  WHEN char_length(`t1`.`release_date`) - 1-1 < 0 AND char_length(`t1`.`release_date`) < 0  THEN substring(`t1`.`release_date`,(case when size(`t1`.`release_date`)+1+(char_length(`t1`.`release_date`) - 1-1)+char_length(`t1`.`release_date`) < 0 then 0 else size(`t1`.`release_date`)+1+(char_length(`t1`.`release_date`) - 1-1)+char_length(`t1`.`release_date`) end),-(char_length(`t1`.`release_date`)))  WHEN char_length(`t1`.`release_date`) - 1-1 < 0 AND char_length(`t1`.`release_date`) >= 0  THEN substring(`t1`.`release_date`,size(`t1`.`release_date`)+1+(char_length(`t1`.`release_date`) - 1-1),char_length(`t1`.`release_date`))  WHEN char_length(`t1`.`release_date`) - 1-1 >= 0 AND char_length(`t1`.`release_date`) < 0  THEN substring(`t1`.`release_date`,(case when char_length(`t1`.`release_date`) - 1-1+1+(char_length(`t1`.`release_date`)) < 0 then 0 else char_length(`t1`.`release_date`) - 1-1+1+(char_length(`t1`.`release_date`)) end),-(char_length(`t1`.`release_date`)))  ELSE substring(`t1`.`release_date`,char_length(`t1`.`release_date`) - 1-1,char_length(`t1`.`release_date`)) END < '47')\nRETURN `t1`.`movie_title` AS `movie_title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the titles of movies directed by Jack Kinney that were released before 1947.",
    "evidence": "Jack Kinney refers to director = 'Jack Kinney'; released before 1947 refers to substr(release_date, length(release_date) - 1, length(release_date)) < '47';",
    "idx": 3624
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)-[directed_0:directed]->(`t1`:`characters`)\nMATCH (`t3`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND `t1`.`movie_title` = `t3`.`movie_title`\nAND (toFloat(replace(trim(BOTH '$' FROM `t3`.`total_gross`),',','')) > 100000000)\nRETURN DISTINCT `t2`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of the directors whose films grossed over $100 million.",
    "evidence": "films grossed over $100 million refer to movie_title where total_gross > 100000000;",
    "idx": 3625
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nORDER BY toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) IS NULL ASC, toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) DESC \nRETURN `t2`.`song` AS `song`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which movie's song title has the highest total gross?",
    "evidence": "The highest total gross refers to MAX(total_gross);",
    "idx": 3626
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t2`:`director`)-[directed_0:directed]->(`t1`:`characters`)\nMATCH (`t3`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t1`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND `t3`.`movie_title` = `t1`.`movie_title`\nAND (CASE  WHEN char_length(`t3`.`release_date`) - 3-1 < 0 AND char_length(`t3`.`release_date`) < 0  THEN substring(`t3`.`release_date`,(case when size(`t3`.`release_date`)+1+(char_length(`t3`.`release_date`) - 3-1)+char_length(`t3`.`release_date`) < 0 then 0 else size(`t3`.`release_date`)+1+(char_length(`t3`.`release_date`) - 3-1)+char_length(`t3`.`release_date`) end),-(char_length(`t3`.`release_date`)))  WHEN char_length(`t3`.`release_date`) - 3-1 < 0 AND char_length(`t3`.`release_date`) >= 0  THEN substring(`t3`.`release_date`,size(`t3`.`release_date`)+1+(char_length(`t3`.`release_date`) - 3-1),char_length(`t3`.`release_date`))  WHEN char_length(`t3`.`release_date`) - 3-1 >= 0 AND char_length(`t3`.`release_date`) < 0  THEN substring(`t3`.`release_date`,(case when char_length(`t3`.`release_date`) - 3-1+1+(char_length(`t3`.`release_date`)) < 0 then 0 else char_length(`t3`.`release_date`) - 3-1+1+(char_length(`t3`.`release_date`)) end),-(char_length(`t3`.`release_date`)))  ELSE substring(`t3`.`release_date`,char_length(`t3`.`release_date`) - 3-1,char_length(`t3`.`release_date`)) END >= '1937' AND CASE  WHEN char_length(`t3`.`release_date`) - 3-1 < 0 AND char_length(`t3`.`release_date`) < 0  THEN substring(`t3`.`release_date`,(case when size(`t3`.`release_date`)+1+(char_length(`t3`.`release_date`) - 3-1)+char_length(`t3`.`release_date`) < 0 then 0 else size(`t3`.`release_date`)+1+(char_length(`t3`.`release_date`) - 3-1)+char_length(`t3`.`release_date`) end),-(char_length(`t3`.`release_date`)))  WHEN char_length(`t3`.`release_date`) - 3-1 < 0 AND char_length(`t3`.`release_date`) >= 0  THEN substring(`t3`.`release_date`,size(`t3`.`release_date`)+1+(char_length(`t3`.`release_date`) - 3-1),char_length(`t3`.`release_date`))  WHEN char_length(`t3`.`release_date`) - 3-1 >= 0 AND char_length(`t3`.`release_date`) < 0  THEN substring(`t3`.`release_date`,(case when char_length(`t3`.`release_date`) - 3-1+1+(char_length(`t3`.`release_date`)) < 0 then 0 else char_length(`t3`.`release_date`) - 3-1+1+(char_length(`t3`.`release_date`)) end),-(char_length(`t3`.`release_date`)))  ELSE substring(`t3`.`release_date`,char_length(`t3`.`release_date`) - 3-1,char_length(`t3`.`release_date`)) END <= '1990')\nORDER BY toFloat(replace(trim(BOTH '$' FROM `t3`.`total_gross`),',','')) IS NULL ASC, toFloat(replace(trim(BOTH '$' FROM `t3`.`total_gross`),',','')) DESC \nRETURN `t2`.`director` AS `director`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which director had the most popular film from 1937 to 1990?",
    "evidence": "from 1937 to 1990 refers to substr(release_date, length(release_date) - 3, length(release_date)) between '1937' and '1990'; the most popular film refers to movie_title where MAX(total_gross);",
    "idx": 3627
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nAND (`t1`.`genre` = 'Comedy')\nRETURN `t2`.`hero` AS `hero`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the main characters of the movie that are comedy genre.",
    "evidence": "Comedy refers to genre = 'Comedy'; the main character of the movie refers to hero;",
    "idx": 3628
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`voice-actors`)-[voiced_in_0:voiced_in]->(`t2`:`characters`)\nMATCH (`t3`:`director`)-[directed_0:directed]->(`t2`:`characters`)\nWHERE `t1`.`movie` = `t2`.`movie_title`\nAND `t3`.`name` = `t2`.`movie_title`\nAND (`t3`.`director` = 'Wolfgang Reitherman')\nRETURN `t2`.`hero` AS `hero`, `t1`.`voice-actor` AS `voice-actor`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names of voice actors for the characters of films directed by Wolfgang Reitherman.",
    "evidence": "Wolfgang Reitherman refers to director = 'Wolfgang Reitherman';",
    "idx": 3629
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t3`:`director`)\nMATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nAND `t1`.`movie_title` = `t3`.`name`\nRETURN CASE WHEN COUNT(DISTINCT `t3`.`director`)=0 THEN NULL ELSE toFloat(COUNT(DISTINCT CASE  WHEN toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) > 100000000 THEN `t3`.`director` ELSE NULL END)) * 100 / COUNT(DISTINCT `t3`.`director`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of directors whose films grossed over $100 million.",
    "evidence": "DIVIDE(COUNT(director where total_gross > 100000000), COUNT(director)) as percentage;",
    "idx": 3632
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t3`:`voice-actors`)\nMATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nAND `t3`.`movie` = `t1`.`movie_title`\nRETURN CASE WHEN COUNT(`t3`.`voice-actor`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`genre` = 'Drama' THEN `t3`.`voice-actor` ELSE NULL END)) * 100 / COUNT(`t3`.`voice-actor`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of voice actors whose main character in the movie is in the Drama genre.",
    "evidence": "DIVIDE(COUNT(voice-actor where genre = 'Drama'), COUNT(voice-actor)) as percentage;",
    "idx": 3633
  }
]