[
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the largest state in usa",
    "evidence": "",
    "idx": 177
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the biggest state",
    "evidence": "",
    "idx": 178
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the biggest state in the usa",
    "evidence": "",
    "idx": 179
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the largest state",
    "evidence": "",
    "idx": 180
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the largest state in the us",
    "evidence": "",
    "idx": 181
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the largest state",
    "evidence": "",
    "idx": 182
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'mississippi'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` IN in_collect_0\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the highest points of states surrounding mississippi",
    "evidence": "",
    "idx": 183
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'mississippi'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` IN in_collect_0\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the high points of states surrounding mississippi",
    "evidence": "",
    "idx": 184
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'colorado'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` IN in_collect_0\nORDER BY `highlow`.`highest_elevation` IS NULL ASC, `highlow`.`highest_elevation` DESC \nRETURN `highlow`.`highest_point` AS `highest_point`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in states bordering colorado",
    "evidence": "",
    "idx": 185
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the state with the lowest population density",
    "evidence": "",
    "idx": 187
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the lowest population density",
    "evidence": "",
    "idx": 188
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the lowest population density",
    "evidence": "",
    "idx": 189
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the smallest population density",
    "evidence": "",
    "idx": 190
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the sparsest population density",
    "evidence": "",
    "idx": 191
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the sparsest population density",
    "evidence": "",
    "idx": 192
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the least population density",
    "evidence": "",
    "idx": 193
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the least population density",
    "evidence": "",
    "idx": 194
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the smallest population density",
    "evidence": "",
    "idx": 195
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'texas'\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the highest point in texas",
    "evidence": "",
    "idx": 196
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'texas'\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in texas",
    "evidence": "",
    "idx": 197
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'texas'\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the high point of texas",
    "evidence": "",
    "idx": 198
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'texas'\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest mountain in texas",
    "evidence": "",
    "idx": 199
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'texas'\nRETURN `highlow`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "could you tell me what is the highest point in the state of texas",
    "evidence": "",
    "idx": 200
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info_sub0:borders]->()\nRETURN `border_info_sub0`.`state_name` AS `state_name_1`   } AS in_collect_0\nMATCH (`state`:`state`)\nWHERE NOT `state`.`state_name` IN in_collect_0\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states have no bordering state",
    "evidence": "",
    "idx": 201
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info_sub0:borders]->()\nRETURN `border_info_sub0`.`state_name` AS `state_name_1`   } AS in_collect_0\nMATCH (`state`:`state`)\nWHERE NOT `state`.`state_name` IN in_collect_0\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "name the states which have no surrounding states",
    "evidence": "",
    "idx": 202
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info_sub0:borders]->()\nRETURN `border_info_sub0`.`state_name` AS `state_name_1`   } AS in_collect_0\nMATCH (`state`:`state`)\nWHERE NOT `state`.`state_name` IN in_collect_0\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states border no other states",
    "evidence": "",
    "idx": 203
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the area of the state with the smallest population density",
    "evidence": "",
    "idx": 204
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'alabama'\nRETURN `highlow`.`lowest_elevation` AS `lowest_elevation`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_elevation` < `lowest_elevation`\nRETURN COUNT(`highlow`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "count the states which have elevations lower than what alabama has",
    "evidence": "",
    "idx": 205
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_point` = 'guadalupe peak'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how high is guadalupe peak",
    "evidence": "",
    "idx": 206
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_point` = 'guadalupe peak'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how tall is guadalupe peak",
    "evidence": "",
    "idx": 207
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_point` = 'guadalupe peak'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the maximum elevation of guadalupe peak",
    "evidence": "",
    "idx": 208
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nRETURN MAX(`highlow`.`highest_elevation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how high is the highest point in america",
    "evidence": "",
    "idx": 209
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nRETURN MAX(`highlow`.`highest_elevation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest elevation in the united states",
    "evidence": "",
    "idx": 210
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nRETURN MAX(`highlow`.`highest_elevation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the elevation of the highest point in the usa",
    "evidence": "",
    "idx": 211
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nRETURN MAX(`highlow`.`highest_elevation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the height of the highest point in the usa",
    "evidence": "",
    "idx": 212
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'rio grande'\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how long is the rio grande river",
    "evidence": "",
    "idx": 213
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'rio grande'\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the length of the rio grande river",
    "evidence": "",
    "idx": 214
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'rio grande'\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what length is the rio grande",
    "evidence": "",
    "idx": 215
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'rio grande'\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how long is the rio grande",
    "evidence": "",
    "idx": 216
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'rio grande'\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how long is the rio grande river in miles",
    "evidence": "",
    "idx": 217
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'rio grande'\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how long is rio grande",
    "evidence": "",
    "idx": 218
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN MAX(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0` AND `river`.`traverse` = 'texas'\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how long is the longest river in texas",
    "evidence": "",
    "idx": 219
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN MAX(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0` AND `river`.`traverse` = 'texas'\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the length of the longest river that runs through texas",
    "evidence": "",
    "idx": 220
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'rhode island'\nRETURN COUNT(`state`.`capital`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many capitals does rhode island have",
    "evidence": "",
    "idx": 221
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many cities are there in the united states",
    "evidence": "",
    "idx": 222
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many cities does the usa have",
    "evidence": "",
    "idx": 223
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many cities are there in the us",
    "evidence": "",
    "idx": 224
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many cities are there in usa",
    "evidence": "",
    "idx": 225
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many cities are there in us",
    "evidence": "",
    "idx": 226
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many major cities are there",
    "evidence": "",
    "idx": 227
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many citizens does the biggest city have in the usa",
    "evidence": "",
    "idx": 228
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'colorado'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many colorado rivers are there",
    "evidence": "",
    "idx": 229
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'colorado'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers are called colorado",
    "evidence": "",
    "idx": 230
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'seattle' AND `city`.`state_name` = 'washington'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population of seattle washington",
    "evidence": "",
    "idx": 231
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'seattle' AND `city`.`state_name` = 'washington'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people live in seattle washington",
    "evidence": "",
    "idx": 232
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'alaska'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'alaska'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people live in the biggest city in alaska state",
    "evidence": "",
    "idx": 233
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'alaska'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'alaska'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how large is the largest city in alaska",
    "evidence": "",
    "idx": 234
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'texas'\nRETURN `state`.`capital` AS `capital`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`city_name` = `capital`\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people live in the capital of texas",
    "evidence": "",
    "idx": 235
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'texas'\nRETURN `state`.`capital` AS `capital`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`city_name` = `capital`\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the size of the capital of texas",
    "evidence": "",
    "idx": 236
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN sum(`state`.`population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people live in the united states",
    "evidence": "",
    "idx": 237
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN sum(`state`.`population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the combined population of all 50 states",
    "evidence": "",
    "idx": 238
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN COUNT(`state`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states are in the usa",
    "evidence": "",
    "idx": 239
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN COUNT(`state`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states are there",
    "evidence": "",
    "idx": 240
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN COUNT(`state`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states are there in the usa",
    "evidence": "",
    "idx": 241
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN COUNT(`state`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states does usa have",
    "evidence": "",
    "idx": 242
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN COUNT(`state`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states are in the united states",
    "evidence": "",
    "idx": 243
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN COUNT(`state`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states are there in united states",
    "evidence": "",
    "idx": 244
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river_sub0`:`river`)\nRETURN `river_sub0`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH (`state`:`state`)\nWHERE NOT `state`.`state_name` IN in_collect_0\nRETURN COUNT(DISTINCT `state`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states do not have rivers",
    "evidence": "",
    "idx": 250
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`length` > 750 AND `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "name the major rivers in illinois",
    "evidence": "",
    "idx": 251
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`length` > 750 AND `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major rivers in illinois",
    "evidence": "",
    "idx": 252
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`length` > 750 AND `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are major rivers in illinois",
    "evidence": "",
    "idx": 253
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`length` > 750 AND `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what major rivers run through illinois",
    "evidence": "",
    "idx": 254
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN MAX(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "through which states does the longest river in texas run",
    "evidence": "",
    "idx": 255
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'texas'\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the capital city in texas",
    "evidence": "",
    "idx": 256
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'texas'\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of texas",
    "evidence": "",
    "idx": 257
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'texas'\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of the texas state",
    "evidence": "",
    "idx": 258
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'texas'\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is capital of texas",
    "evidence": "",
    "idx": 259
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'texas'\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of the state texas",
    "evidence": "",
    "idx": 260
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'texas'\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "can you tell me the capital of texas",
    "evidence": "",
    "idx": 261
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`t2`:`state`)-[t1:borders]->()\nWHERE `t2`.`state_name` = `t1`.`border`\nAND (`t1`.`state_name` = 'texas')\nRETURN `t2`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the capitals of states that border texas",
    "evidence": "",
    "idx": 262
  }
]