[
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nMATCH (t2@`sales`)-[made_by_0:`made_by`]->(t3@`employees`)\nWHERE t1.`productid` = t2.`productid`\nAND t2.`salespersonid` = t3.`employeeid`\nAND (t3.`firstname` = 'Innes' AND t3.`lastname` = 'del Castillo' AND t1.`name` = 'Short-Sleeve Classic Jersey, L' AND t3.`middleinitial` = 'e')\nRETURN COUNT(t2.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all customers handled by Innes E. del Castillo, how many have purchased Short-Sleeve Classic Jersey, L?",
    "evidence": "Short-Sleeve Classic Jersey, L' is name of product;",
    "idx": 2788
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t1.`name` = 'Headlights - Weatherproof')\nRETURN COUNT(t2.`salespersonid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales people managed to sell Headlights - Weatherproof?",
    "evidence": "Headlights - Weatherproof' is name of product",
    "idx": 2789
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[sold_to_0:`sold_to`]->(t2@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`firstname` = 'Joe' AND t2.`middleinitial` = 'L' AND t2.`lastname` = 'Lopez')\nRETURN COUNT(t1.`salesid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales transactions were given by the customer named Joe L. Lopez?",
    "evidence": "sales transactions refers to SalesID;",
    "idx": 2791
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (employees@`employees`)\nRETURN COUNT(employees.`employeeid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales people are handling all the customers?",
    "evidence": "",
    "idx": 2793
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nMATCH (t2@`sales`)-[made_by_0:`made_by`]->(t3@`employees`)\nWHERE t1.`productid` = t2.`productid`\nAND t2.`salespersonid` = t3.`employeeid`\nAND (t1.`name` = 'ML Bottom Bracket')\nRETURN cast (sum(CASE WHEN t3.`firstname` = 'Albert' AND t3.`middleinitial` = 'I' AND t3.`lastname` = 'Ringer' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the customers who have purchased ML Bottom Bracket, identify the percentage of sales by Albert I. Ringer?",
    "evidence": "ML Bottom Bracket' is name of product; percentage = MULTIPLY(DIVIDE(SUM(CustomerID WHERE FirstName = 'Albert' AND MiddleInitial = 'I' AND LastName = 'Ringer'), COUNT(CustomerID)), 1.0);",
    "idx": 2795
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`firstname` = 'Abigail'\nRETURN COUNT(customers.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers have the first name Abigail?",
    "evidence": "",
    "idx": 2796
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t2.`salespersonid` = 20)\nORDER BY t2.`quantity` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the product that is most sold by sale person id 20?",
    "evidence": "most sold refers to MAX(Quantity);",
    "idx": 2800
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[sold_to_0:`sold_to`]->(t1@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`firstname` = 'Cameron')\nORDER BY t2.`quantity` DESC NULLS LAST \nRETURN t1.`firstname` AS `firstname`, t1.`lastname` AS `lastname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers whose first name is Cameron, who bought the product in the most quantity?",
    "evidence": "most quantity refers to MAX(Quantity); who refers to FirstName, LastName;",
    "idx": 2805
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (products@`products`)\nWHERE products.`productid` < 15 AND products.`price` <= 10\nRETURN COUNT(products.`productid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the products with product ID lower than 15, how many of them costs 10 and below?",
    "evidence": "product ID lower than 15 refers to ProductID < 15; costs 10 and below refers to Price; Price < = 10;",
    "idx": 2812
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[sold_to_0:`sold_to`]->(t2@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`firstname` = 'Kate')\nORDER BY t1.`quantity` DESC NULLS LAST \nRETURN t2.`firstname` AS `firstname`, t2.`lastname` AS `lastname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among customers named Kate, who has the highest quantity?",
    "evidence": "highest quantity refers to MAX(Quantity);",
    "idx": 2815
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t1.`price` >= 100 AND t1.`price` <= 150 AND t2.`quantity` < 25)\nRETURN t2.`customerid` AS `customerid`, t2.`salesid` AS `salesid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the products that have price ranges from 100 to 150, what is the customer ID and sales ID of the product with a quantity lower than 25?",
    "evidence": "price ranges from 100 to 150 refers to Price BETWEEN 100 AND 150; quantity lower than 25 refers to Quantity < 25;",
    "idx": 2816
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t2.`quantity` = 60 AND t1.`price` <= 500)\nRETURN COUNT(t1.`productid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In sales with a quantity of 60, how many of them have a price not greater than 500?",
    "evidence": "",
    "idx": 2818
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[sold_to_0:`sold_to`]->(t2@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`firstname` = 'Erica' AND t1.`quantity` < 200)\nRETURN COUNT(t1.`productid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In customers with the first name of Erica, how many of them bought a quantity below 200?",
    "evidence": "quantity below 200 refers to quantity < 200;",
    "idx": 2819
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nMATCH (t2@`sales`)-[sold_to_0:`sold_to`]->(t3@`customers`)\nWHERE t1.`productid` = t2.`productid`\nAND t2.`customerid` = t3.`customerid`\nAND (t3.`firstname` = 'Kathryn' AND t3.`lastname` = 'Ashe')\nORDER BY t2.`quantity` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among products bought by Kathryn Ashe, what is the name of the product with the highest quantity?",
    "evidence": "highest quantity refers to MAX(Quantity);",
    "idx": 2820
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[includes_0:`includes`]->(t2@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t2.`name` = 'Seat Tube')\nRETURN DISTINCT t2.`price` AS `price`, t1.`quantity` AS `quantity`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the price and quantity of the product named Seat Tube?",
    "evidence": "",
    "idx": 2821
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[sold_to_0:`sold_to`]->(t2@`customers`)\nMATCH (t1@`sales`)-[includes_0:`includes`]->(t3@`products`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t1.`productid` = t3.`productid`\nAND (t2.`firstname` = 'Erica' AND t2.`lastname` = 'Xu')\nRETURN t3.`price` AS `price`, t3.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the price and name of the product bought by Erica Xu?",
    "evidence": "",
    "idx": 2822
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[sold_to_0:`sold_to`]->(t2@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`quantity` = 403 AND t1.`salesid` >= 30 AND t1.`salesid` <= 40)\nRETURN t2.`firstname` AS `firstname`, t2.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In sales ID between 30 and 40, who is the customer that bought a total quantity of 403?",
    "evidence": "who refers to FirstName, LastName;",
    "idx": 2824
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[includes_0:`includes`]->(t2@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t1.`salesid` >= 1 AND t1.`salesid` <= 200)\nRETURN cast (sum(CASE WHEN t2.`price` >= 200 AND t2.`price` <= 300 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`price`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the sales ID ranges from 1 to 200, what is the percentage of the products with a price ranging from 200 to 300?",
    "evidence": "sales ID ranges from 1 to 200 refers to SalesID between 1 and 200; percentage = MULTIPLY(DIVIDE(SUM(Price between 200 and 300), COUNT(Price)), 1.0);",
    "idx": 2826
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`firstname` = 'Madison'\nRETURN COUNT(customers.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are named Madison?",
    "evidence": "",
    "idx": 2828
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (products@`products`)\nWHERE products.`price` = 0\nRETURN COUNT(products.`productid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many free or gift products are there?",
    "evidence": "free gift refers to Price = 0;",
    "idx": 2830
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t1.`name` = 'Mountain-500 Black, 42')\nRETURN sum(t2.`quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many \"Mountain-500 Black 42\" were sold in total?",
    "evidence": "Mountain-500 Black 42' is name of product; sold in total = SUM(Quantity);",
    "idx": 2831
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[made_by_0:`made_by`]->(t1@`employees`)\nMATCH (t2@`sales`)-[includes_0:`includes`]->(t3@`products`)\nWHERE t1.`employeeid` = t2.`salespersonid`\nAND t2.`productid` = t3.`productid`\nAND (t1.`firstname` = 'Heather' AND t1.`lastname` = 'McBadden')\nRETURN sum(t2.`quantity` * t3.`price`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the total amount of sales handled by Heather McBadden?",
    "evidence": "total amount of sales = SUM(MULTIPLY(Quantity, Price));",
    "idx": 2832
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[made_by_0:`made_by`]->(t1@`employees`)\nMATCH (t2@`sales`)-[includes_0:`includes`]->(t3@`products`)\nWHERE t1.`employeeid` = t2.`salespersonid`\nAND t2.`productid` = t3.`productid`\nAND (t1.`firstname` = 'Stearns' AND t1.`lastname` = 'MacFeather' AND t3.`name` = 'Mountain-100 Silver, 38')\nRETURN sum(t2.`quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many \"Mountain-100 Silver, 38\" were sold by Stearns MacFeather?",
    "evidence": "Mountain-100 Silver, 38' is name of product;",
    "idx": 2833
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[sold_to_0:`sold_to`]->(t1@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`firstname` = 'Dalton' AND t1.`middleinitial` = 'M' AND t1.`lastname` = 'Coleman')\nRETURN COUNT(t2.`productid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many type of products did Dalton M. Coleman purchase?",
    "evidence": "",
    "idx": 2834
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[includes_0:`includes`]->(t2@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t2.`name` = 'Chainring Bolts' AND t1.`salesid` = 551971)\nRETURN t1.`quantity` AS `quantity`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many chainring bolts were sold under sales ID 551971?",
    "evidence": "Chainring Bolts' is name of product;",
    "idx": 2836
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[made_by_0:`made_by`]->(t1@`employees`)\nMATCH (t2@`sales`)-[includes_0:`includes`]->(t3@`products`)\nWHERE t1.`employeeid` = t2.`salespersonid`\nAND t2.`productid` = t3.`productid`\nAND (t1.`firstname` = 'Abraham' AND t1.`middleinitial` = 'e' AND t1.`lastname` = 'Bennet' AND t3.`name` = 'Road-650 Red, 60')\nRETURN sum(t2.`quantity` * t3.`price`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total cost of all the \"Road-650, Red, 60\" products that Abraham E. Bennet sold?",
    "evidence": "total cost = SUM(MULTIPLY(Quantity, Price)); 'Road-650, Red, 60' is name of product;",
    "idx": 2837
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (products@`products`)\nWHERE products.`price` >= 100 AND products.`price` <= 200\nRETURN avg(products.`price`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average price of products that cost between 100 and 200?",
    "evidence": "average price = DIVIDE(SUM(Price, COUNT(Price))); cost refers to Price; Price BETWEEN 100 AND 200;",
    "idx": 2839
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[made_by_0:`made_by`]->(t1@`employees`)\nMATCH (t2@`sales`)-[includes_0:`includes`]->(t3@`products`)\nWHERE t1.`employeeid` = t2.`salespersonid`\nAND t2.`productid` = t3.`productid`\nORDER BY t2.`quantity` * t3.`price` DESC NULLS LAST \nRETURN t1.`firstname` AS `firstname`, t1.`middleinitial` AS `middleinitial`, t1.`lastname` AS `lastname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the employees who sold Blade, who has the most amount of sales?",
    "evidence": "Blade' is name of product; most amount of sales refers to MAX(MULTIPLY(Quantity, Price));",
    "idx": 2841
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (dish@`dish`)\nWHERE dish.`first_appeared` < 1851 OR dish.`first_appeared` > 2012\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many dishes do not have correct data for the year in which it appeared first?",
    "evidence": "do not have correct data refers to first_appeared < 1851 or first_appeared > 2012;",
    "idx": 2845
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (dish@`dish`)\nWHERE dish.`name` IN ['Fresh lobsters in every style', 'Anchovies']\nRETURN CASE  WHEN sum(CASE  WHEN dish.`name` = 'Anchovies' THEN dish.`last_appeared` - dish.`first_appeared` ELSE 0 END) - sum(CASE  WHEN dish.`name` = 'Fresh lobsters in every style' THEN dish.`last_appeared` - dish.`first_appeared` ELSE 0 END) > 0 THEN 'Anchovies' ELSE 'Fresh lobsters in every style' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which dish lasted longer, Anchovies or Fresh lobsters in every style?",
    "evidence": "if (SUBTRACT(last_appeared, first_appeared) WHERE name = 'Anchovies') > (SUBTRACT(last_appeared, first_appeared) WHERE name = 'Fresh lobsters in every style'), it means 'Anchovies' lasted longer; if (SUBTRACT(last_appeared , first_appeared) WHERE name = 'Fresh lobsters in every style') > (SUBTRACT(last_appeared , first_appeared) WHERE name = 'Anchovies') it means 'Fresh lobsters in every style' last longer;",
    "idx": 2846
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (dish@`dish`)\nWHERE dish.`lowest_price` = 0\nORDER BY dish.`menus_appeared` DESC NULLS LAST \nRETURN dish.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the dishes that were once free, what is the name of the dish that had appeared on most menus?",
    "evidence": "dishes that were once free refers to lowest_price = 0; appeared on most menus refers to MAX(menus_appeared);",
    "idx": 2847
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nAND (t2.`menu_page_id` = 1389 AND t2.`xpos` < 0.25 AND t2.`ypos` < 0.25)\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the dish that appeared on the upper left corner on menu page no. 1389?",
    "evidence": "appeared on the upper left corner on menu refers to xpos < 0.25 AND ypos < 0.25; menu page no. refers to menu_page_id; menu_page_id = 1389;",
    "idx": 2849
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nAND (t1.`highest_price` IS NULL)\nRETURN sum(CASE  WHEN t1.`name` = 'Clear green turtle' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the menu pages with the appearance of the dish \"Clear green turtle\", how many of them have the dish at a stable price?",
    "evidence": "Clear green turtle is a name of dish; stable price refers to highest_price is null;",
    "idx": 2851
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[t1:`has_dish`]->(t4@`dish`)\nMATCH (t2@`menupage`)-[part_of_0:`part_of`]->(t3@`menu`)\nWHERE t1.`menu_page_id` = t2.`id`\nAND t2.`menu_id` = t3.`id`\nAND t1.`dish_id` = t4.`id`\nAND (t4.`name` = 'Clear green turtle')\nRETURN sum(CASE  WHEN t3.`currency` = 'Dollars' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the menus in which the dish \"Clear green turtle\" had appeared, how many of them used the dollar as their currency?",
    "evidence": "Clear green turtle is a name of dish; dollar as currency refers to currency = 'Dollars';",
    "idx": 2854
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[t1:`has_dish`]->(t4@`dish`)\nMATCH (t2@`menupage`)-[part_of_0:`part_of`]->(t3@`menu`)\nWHERE t1.`menu_page_id` = t2.`id`\nAND t2.`menu_id` = t3.`id`\nAND t1.`dish_id` = t4.`id`\nAND (t3.`call_number` IS NULL)\nRETURN sum(CASE  WHEN t4.`name` = 'Clear green turtle' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the menus in which the dish \"Clear green turtle\" had appeared, how many of them did not support taking out or booking in advance?",
    "evidence": "Clear green turtle is a name of dish; not support taking out or booking in advance refers to call_number is null;",
    "idx": 2855
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[menuitem:`has_dish`]->()\nWHERE like(menuitem.`created_at`,'2011-03-28%')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many menu items were created on 28th March 2011?",
    "evidence": "created on 28th March 2011 refers to created_at like '2011-03-28%';",
    "idx": 2863
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[menuitem:`has_dish`]->()\nWHERE menuitem.`menu_page_id` = 144\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many dishes are included in the menu page ID 144?",
    "evidence": "FALSE;",
    "idx": 2864
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE menu.`location` = 'Dutcher House'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many menus were used in Dutcher House?",
    "evidence": "Dutcher House refers to location = 'Dutcher House';",
    "idx": 2865
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (dish@`dish`)\nWHERE dish.`times_appeared` > dish.`menus_appeared`\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many dishes appeared on a menu more than once?",
    "evidence": "appeared on a menu more than once refers to times_appeared > menus_appeared;",
    "idx": 2866
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE menu.`venue` = 'STEAMSHIP'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many menus were created for steamship?",
    "evidence": "steamship refers to venue = 'STEAMSHIP';",
    "idx": 2867
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[part_of_0:`part_of`]->(t1@`menu`)\nWHERE t1.`id` = t2.`menu_id`\nRETURN sum(CASE  WHEN t1.`date` = date('1898-11-17') THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many pages were there on the menu created on 17th November 1898?",
    "evidence": "created on 17th November 1898 refers to date = '1898-11-17';",
    "idx": 2868
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nAND (like(t1.`name`,'%BLuefish%'))\nRETURN cast (sum(CASE  WHEN t2.`xpos` >= 0.25 AND t2.`xpos` <= 0.75 AND t2.`ypos` >= 0.25 AND t2.`ypos` <= 0.75 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many percent of Bluefish dishes are located at the center of the menu page?",
    "evidence": "percent = MULTIPLY(DIVIDE(SUM(xpos BETWEEN 0.25 AND 0.75 and ypos BETWEEN 0.25 AND 0.75), COUNT(id)), 1.0); Bluefish is a sub name of dish; located at the center of the menu page refers to xpos BETWEEN 0.25 AND 0.75 and ypos BETWEEN 0.25 AND 0.75;",
    "idx": 2877
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE menu.`id` = 12463\nRETURN menu.`sponsor` AS `sponsor`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the sponsor of menu with ID 12463?",
    "evidence": "FALSE;",
    "idx": 2878
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE menu.`sponsor` = 'REPUBLICAN HOUSE'\nRETURN menu.`event` AS `event`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the event sponsored by the Republican House?",
    "evidence": "sponsored by the Republican House refers to sponsor = 'REPUBLICAN HOUSE';",
    "idx": 2879
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE menu.`id` = 12472\nRETURN menu.`location` AS `location`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Where is the place that menu with ID 12472 was created for?",
    "evidence": "place refers to location;",
    "idx": 2880
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (menu@`menu`)\nWHERE menu.`id` = 12463\nRETURN menu.`occasion` AS `occasion`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the occasion for menu with ID 12463?",
    "evidence": "FALSE;",
    "idx": 2882
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t1@`menupage`)-[part_of_0:`part_of`]->(t2@`menu`)\nWHERE t2.`id` = t1.`menu_id`\nAND (t2.`sponsor` = 'Occidental & Oriental')\nRETURN t2.`id` AS `id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List down the menu page IDs for menu sponsored by Occidental & Oriental?",
    "evidence": "menu page IDs refers to MenuPage.id; sponsored by Occidental & Oriental refers to sponsor = 'Occidental & Oriental';",
    "idx": 2884
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[part_of_0:`part_of`]->(t1@`menu`)\nWHERE t1.`id` = t2.`menu_id`\nAND (t2.`id` = 130)\nRETURN t1.`page_count` AS `page_count`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the page count for menu with page ID of 130?",
    "evidence": "page ID of 130 refers MenuPage.id = 130;",
    "idx": 2889
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[part_of_0:`part_of`]->(t1@`menu`)\nMATCH (t2@`menupage`)-[t3:`has_dish`]->()\nWHERE t1.`id` = t2.`menu_id`\nAND t2.`id` = t3.`menu_page_id`\nAND (t2.`image_id` = 4000009194)\nRETURN t3.`price` AS `price`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the price of menu with image ID 4000009194?",
    "evidence": "FALSE;",
    "idx": 2890
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nAND (t2.`id` >= 1 AND t2.`id` <= 5)\nORDER BY t2.`price` DESC NULLS LAST \nRETURN t2.`price` AS `price` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the highest price of dishes with menu item ID 1 to 5?",
    "evidence": "highest price refers to MAX(price); menu item ID 1 to 5 refers to MenuItem.id BETWEEN 1 AND 5;",
    "idx": 2894
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (dish@`dish`)\nWHERE dish.`lowest_price` = 0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the dishes, how many of them are for free?",
    "evidence": "free refers to lowest_price = 0;",
    "idx": 2899
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (dish@`dish`)\nWHERE dish.`first_appeared` = 1855 AND dish.`last_appeared` = 1900\nRETURN dish.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What dishes made their first and last appearances in 1855 and 1900, respectively?",
    "evidence": "first appearance in 1855 refers to first_appeared = 1855; last appearance in 1900 refers to last_appeared = 1900;",
    "idx": 2900
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t1:`has_dish`]->(t2@`dish`)\nWHERE t1.`dish_id` = t2.`id`\nAND (t1.`xpos` > 0.75 AND t1.`ypos` < 0.25)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many dishes appear in the right upper corner of the menu page?",
    "evidence": "appear in the right upper corner of the menu page refers to xpos > 0.75 and ypos < 0.25;",
    "idx": 2901
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nAND (t1.`name` = 'Clear green turtle')\nRETURN t1.`last_appeared` - t1.`first_appeared` AS `_col_0`, t2.`updated_at` AS `updated_at`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How long has the \"Clear Green Turtle\" dish appeared on the menu, and tell me when its latest update was?",
    "evidence": "Clear Green Turtle is a name of dish; how long a dish appeared on the menu = SUBTRACT(last_appeared, first_appeared); latest update refers to latest updated_at;",
    "idx": 2902
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nAND (t1.`last_appeared` - t1.`first_appeared` < 5)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many dishes have appeared on the menu in less than 5 years?",
    "evidence": "appeared on the menu in less than 5 years = SUBTRACT(last_appeared, first_appeared) < 5;",
    "idx": 2904
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[t1:`has_dish`]->()\nWHERE t2.`id` = t1.`menu_page_id`\nAND (t2.`menu_id` = 12474 AND t2.`page_number` = 2)\nRETURN t1.`price` AS `price`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much does the dish on page 2 of menu ID 12474 cost?",
    "evidence": "page 2 refers to page_number = 2;",
    "idx": 2906
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t1@`menupage`)-[part_of_0:`part_of`]->(t2@`menu`)\nWHERE t2.`id` = t1.`menu_id`\nAND (t1.`full_height` = 10000)\nRETURN t2.`sponsor` AS `sponsor`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who are the sponsors of the menu whose image full height is more than 10000 mm?",
    "evidence": "image full height is more than 10000 mm refers to full_height > 10000;",
    "idx": 2908
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (t2@`menupage`)-[part_of_0:`part_of`]->(t1@`menu`)\nWHERE t1.`id` = t2.`menu_id`\nAND (t2.`full_width` = 2000)\nRETURN t1.`event` AS `event`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Under what events was the menu page's full width less than 2000 mm?",
    "evidence": "full width less than 2000 mm refers to full_width < 2000;",
    "idx": 2910
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH ()-[t2:`has_dish`]->(t1@`dish`)\nWHERE t1.`id` = t2.`dish_id`\nAND (t1.`name` = 'Small Hominy')\nRETURN t2.`xpos` AS `xpos`, t2.`ypos` AS `ypos`, t1.`last_appeared` - t1.`first_appeared` AS `_col_2`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the position coordinate on the page menu of the \"Small Hominy\" dish and how long did it appear?",
    "evidence": "position coordinate = xpos, ypos; Small Hominy is a name of dish; how long it appear = SUBTRACT(last_appeared, first_appeared);",
    "idx": 2912
  }
]