[
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (cars@`cars`)\nWHERE cars.`len` = 'long'\nRETURN sum(cars.`wheels`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many wheels do the long cars have?",
    "evidence": "long cars refers to len = 'long'",
    "idx": 427
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL {\nMATCH (cars_sub0@`cars`)\nRETURN cars_sub0.`train_id` AS `train_id`, COUNT(cars_sub0.`id`) AS `carsnum` \nGROUP BY train_id\n}\nMATCH (t1@`trains`)\nWHERE t1.`id` = train_id\nAND (carsnum >= 4)\nRETURN sum(CASE  WHEN t1.`direction` = 'east' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the trains running east, how many trains have at least 4 cars?",
    "evidence": "east is a direction; at least 4 cars refers to carsNum > = 4",
    "idx": 428
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t1.`position` = 1 AND t1.`load_num` = 3)\nRETURN COUNT(DISTINCT t1.`train_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many trains with fully loaded head cars are running east?",
    "evidence": "fully loaded refers to load_num = 3; head cars refers to position = 1",
    "idx": 429
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL {\nMATCH (cars_sub0@`cars`)\nRETURN cars_sub0.`train_id` AS `train_id`, MAX(cars_sub0.`position`) AS `trailposi` \nGROUP BY train_id\n}\nMATCH (t2@`cars`)-[belongs_to_0:`belongs_to`]->(t1@`trains`)\nWHERE t1.`id` = t2.`train_id`\nAND t1.`id` = train_id\nAND (t1.`direction` = 'east' AND t2.`position` = trailposi AND t2.`sides` = 'double')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cars running east have double-sided tail cars?",
    "evidence": "east is an direction; double-sided refers to sides = 'double'; tail refers to carsposition = trailPosi",
    "idx": 430
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t1.`position` = 2 AND t1.`shape` = 'diamond')\nRETURN t2.`direction` AS `direction`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the direction of the train with a diamond-shaped load in its 2nd car?",
    "evidence": "2nd car refers to position = 2",
    "idx": 432
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t1.`wheels` = 3 AND t1.`roof` = 'jagged')\nRETURN sum(CASE  WHEN t2.`direction` = 'west' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the trains running west, how many trains have three-wheeled, jagged roof cars?",
    "evidence": "west is an direction; three-wheeled refers to wheels = 3; jagged roof refers to roof = 'jagged'",
    "idx": 433
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`title` = 'Batman')\nORDER BY t2.`screentime` DESC NULLS LAST \nRETURN t2.`character name` AS `character name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which character has the longest screen time in the movie Batman?",
    "evidence": "longest screen time refers to max(screentime); movie Batman refers to title = 'Batman'",
    "idx": 436
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t1.`title` = 'Batman' AND t2.`character name` = 'Joker')\nRETURN t3.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which actor played the role of Joker in the movie Batman?",
    "evidence": "role of Joker refers to character_name = 'Joker'; movie Batman refers to title = 'Batman'",
    "idx": 437
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND (t2.`character name` = 'Dr. Archibald \\'Moonlight\\' Graham')\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which movie is the character Dr. Archibald 'Moonlight' Graham from?",
    "evidence": "movie name refers to title; character Dr. Archibald 'Moonlight' Graham refers to character_name = 'Dr. Archibald 'Moonlight' Graham'",
    "idx": 439
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t3.`name` = 'Morgan Freeman' AND t1.`mpaa rating` = 'PG')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies starring Morgan Freeman are suggested by parental guidance?",
    "evidence": "'suggested by parental guidance' refers to mpaa_rating = 'PG'",
    "idx": 441
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t3.`name` = 'Tom Cruise')\nORDER BY t1.`rating` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the movies starring Tom Cruise, which one of them has the best quality?",
    "evidence": "starring Tom Cruise refers to name = 'Tom Cruise'; best quality refers to max(rating)",
    "idx": 442
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t3.`name` = 'Tom Cruise' AND t1.`title` = 'Born on the Fourth of July')\nRETURN t2.`character name` AS `character name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the character played by Tom Cruise in the movie Born on the Fourth of July?",
    "evidence": "played by Tom Cruise refers to name = 'Tom Cruise'; movie Born on the Fourth of July refers to title = 'Born on the Fourth of July'",
    "idx": 443
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t1.`title` = 'Batman')\nORDER BY t3.`height (inches)` DESC NULLS LAST \nRETURN t3.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the actors who starred in the movie Batman, which one of them is the tallest?",
    "evidence": "movie Batman refers to title = 'Batman'; tallest refers to max(height_inches)",
    "idx": 445
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH ()-[t1:`features`]->(t2@`actor`)\nWHERE t1.`actorid` = t2.`actorid`\nAND (t2.`gender` = 'Male' AND t2.`ethnicity` = 'African American')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies star a male African American actor?",
    "evidence": "male refers to gender = 'Male'; African American refers to ethnicity = 'African American'",
    "idx": 446
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t3.`name` = 'Tom Cruise')\nRETURN avg(t1.`rating`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average rating of all the movies starring Tom Cruise?",
    "evidence": "starring Tom Cruise refers to name = 'Tom Cruise'; average rating = divide(sum(rating where name = 'Tom Cruise'), count(movieid where name = 'Tom Cruise'))",
    "idx": 447
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND (t1.`title` = 'Batman')\nRETURN (MAX(cast (CASE  WHEN 3-1 < 0 AND 2 < 0  THEN substring(t2.`screentime`,length(t2.`screentime`)+1+(3-1)+2,-(2))  WHEN 3-1 < 0 AND 2 >= 0  THEN substring(t2.`screentime`,length(t2.`screentime`)+1+(3-1),2)  WHEN 3-1 >= 0 AND 2 < 0  THEN substring(t2.`screentime`,3-1+1+(2),-(2))  ELSE substring(t2.`screentime`,3-1,2) END as float)) - min(cast (CASE  WHEN 3-1 < 0 AND 2 < 0  THEN substring(t2.`screentime`,length(t2.`screentime`)+1+(3-1)+2,-(2))  WHEN 3-1 < 0 AND 2 >= 0  THEN substring(t2.`screentime`,length(t2.`screentime`)+1+(3-1),2)  WHEN 3-1 >= 0 AND 2 < 0  THEN substring(t2.`screentime`,3-1+1+(2),-(2))  ELSE substring(t2.`screentime`,3-1,2) END as float))) * 100 / min(cast (CASE  WHEN 3-1 < 0 AND 2 < 0  THEN substring(t2.`screentime`,length(t2.`screentime`)+1+(3-1)+2,-(2))  WHEN 3-1 < 0 AND 2 >= 0  THEN substring(t2.`screentime`,length(t2.`screentime`)+1+(3-1),2)  WHEN 3-1 >= 0 AND 2 < 0  THEN substring(t2.`screentime`,3-1+1+(2),-(2))  ELSE substring(t2.`screentime`,3-1,2) END as float)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much longer in percentage is the screen time of the most important character in Batman than the least important one?",
    "evidence": "most important character refers to max(screentime); least important character refers to min(screentime); movie Batman refers to title = 'Batman'; percentage = divide(subtract(max(screentime) , min(screentime)) , min(screentime)) * 100%",
    "idx": 448
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t3@`movie`)-[t1:`features`]->(t2@`actor`)\nWHERE t1.`actorid` = t2.`actorid`\nAND t3.`movieid` = t1.`movieid`\nAND (t3.`title` = 'Batman')\nORDER BY t1.`screentime` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who was the actor that played in the movie \"Batman\" with the longest screentime?",
    "evidence": "movie \"Batman\" refers to Title = 'Batman'; longest screentime refers to max(screentime)",
    "idx": 451
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (movie@`movie`)\nWHERE movie.`mpaa rating` = 'PG' AND like(movie.`release date`,'1990-06%')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In rated PG movies, how many of them released in June 1990?",
    "evidence": "rated PG refers to MPAA Rating = 'PG'; released in June 1990 refers to Release Date BETWEEN '1990-06-01' and '1990-06-30'",
    "idx": 460
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (actor@`actor`)\nWHERE actor.`actorid` = 439 AND actor.`gender` = 'Male' AND actor.`ethnicity` = 'White'\nRETURN actor.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of male and white actor with actor ID 439?",
    "evidence": "male refers to Gender = 'Male'; white refers to Ethnicity = 'White'",
    "idx": 461
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t1.`genre` = 'Romance' AND t3.`name` = 'John Travolta')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In romantic movies, how many of them starred by John Travolta?",
    "evidence": "romantic movies refers to Genre = 'Romance'; starred by John Travolta refers to Name = 'John Travolta'",
    "idx": 463
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t1.`title` = 'Misery' AND t3.`height (inches)` >= 60 AND t3.`height (inches)` <= 70 AND t3.`gender` = 'Male')\nRETURN t3.`networth` AS `networth`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the net worth of the actor starred in Misery who has a height ranging from 60 to 70 inches tall?",
    "evidence": "Misery refers to Title = 'Misery'; height ranging from 60 to 70 inches refers to Height (Inches) BETWEEN 60 and 70",
    "idx": 465
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t3.`name` = 'Leonardo DiCaprio')\nORDER BY t1.`budget` DESC NULLS LAST \nRETURN t1.`mpaa rating` AS `mpaa rating`, t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the MPAA rating and title of the movie starred by Leonardo DiCaprio with highest budget?",
    "evidence": "starred by Leonardo DiCaprio refers to Name = 'Leonardo Dicaprio'; highest budget refers to max(Budget)",
    "idx": 467
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`features`]->()\nMATCH (t3@`actor`)-[t2:`acted_in`]->()\nWHERE t1.`movieid` = t2.`movieid`\nAND t3.`actorid` = t2.`actorid`\nAND (t3.`name` = 'Jackie Chan' AND t1.`rating` > 7)\nRETURN t1.`runtime` AS `runtime`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the runtime of the movie starred by Jackie Chan with a rating greater than 7?",
    "evidence": "starred by Jackie Chan refers to Name = 'Jackie Chan'; rating greater than 7 refers to Rating > 7",
    "idx": 471
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`lang` = 'en'\nRETURN COUNT(twitter.`tweetid`) AS `tweet_number`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many tweets are in English?",
    "evidence": "english is the language and refers to Lang = 'en'",
    "idx": 472
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`reach` > 1000\nRETURN COUNT(twitter.`tweetid`) AS `tweet_number`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many tweets are seen by more than 1000 unique users?",
    "evidence": "seen by more than 1000 unique users refers to Reach > 1000",
    "idx": 474
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`sentiment` > 0 AND twitter.`weekday` = 'Thursday'\nRETURN COUNT(twitter.`tweetid`) AS `tweet_number`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the tweets that have a positive sentiment, how many of them are posted on Thursday?",
    "evidence": "positive sentiment refers to Sentiment > 0; posted on Thursday refers to Weekday = 'Thursday'",
    "idx": 475
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "CALL {\nMATCH (twitter_sub0@`twitter`)\nRETURN MAX(twitter_sub0.`likes`) AS `_col_0` \n}\nMATCH (twitter@`twitter`)\nWHERE twitter.`likes` = _col_0\nRETURN twitter.`text` AS `text`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the text of the tweet that got the most `likes`?",
    "evidence": "got the most like refers to Max(Likes)",
    "idx": 476
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t2.`locationid` = t1.`locationid`\nAND (t2.`country` = 'Argentina')\nRETURN COUNT(t1.`tweetid`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many tweets in total were posted by a user in Argentina?",
    "evidence": "\"Argentina\" is the Country",
    "idx": 478
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t2.`locationid` = t1.`locationid`\nAND (t2.`city` = 'Buenos Aires' AND t1.`isreshare` = 'TRUE')\nRETURN COUNT(t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the tweets that are reshared, how many of them are posted by a user in Buenos Aires?",
    "evidence": "reshared refers to Isreshare = 'TRUE'; 'Buenos Aires' is the City",
    "idx": 479
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t2.`locationid` = t1.`locationid`\nORDER BY t1.`likes` DESC NULLS LAST \nRETURN t2.`country` AS `country` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From which country is the tweet with the most likes posted?",
    "evidence": "tweet with the most likes refers to Max(Likes)",
    "idx": 481
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t2.`locationid` = t1.`locationid`\nAND (t2.`city` = 'Buenos Aires' AND t1.`weekday` = 'Thursday')\nRETURN COUNT(t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the tweets posted from Buenos Aires, how many of them were posted on Thursdays?",
    "evidence": "\"Buenos Aires\" is the City; posted on Thursday refers to Weekday = 'Thursday'",
    "idx": 482
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`likes` > 10 AND t2.`gender` = 'Male')\nRETURN COUNT(t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the users that have posted a tweet with over 1000 likes, how many of them are male?",
    "evidence": "over 1000 likes refers to Likes > 1000; 'Male' is the Gender of user",
    "idx": 483
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t2.`gender` = 'Male')\nRETURN COUNT(t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many tweets have the male users posted in total?",
    "evidence": "male users refers to Gender = 'Male'; total tweets refers to Count(TweetID)",
    "idx": 484
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nORDER BY t1.`reach` DESC NULLS LAST \nRETURN t2.`gender` AS `gender` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the gender of the user who has posted the tweet that is seen by the most number of unique users?",
    "evidence": "seen by the most number of unique users refers to Max(Reach)",
    "idx": 485
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nMATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t3@`user`)\nWHERE t2.`locationid` = t1.`locationid`\nAND t1.`userid` = t3.`userid`\nAND (t3.`gender` = 'Male' AND t2.`country` = 'Argentina')\nRETURN COUNT(t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many tweets are posted by male users in Argentina?",
    "evidence": "\"Argentina\" is the Country; male user refers to Gender = 'Male'",
    "idx": 486
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t2.`locationid` = t1.`locationid`\nAND (t2.`country` = 'Argentina')\nRETURN sum(CASE  WHEN t2.`city` = 'Buenos Aires' THEN 1.0 ELSE 0 END) / COUNT(t1.`tweetid`) AS `avg`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of tweets posted by the users in a city in Argentina?",
    "evidence": "\"Argentina\" is the Country; average number of tweets in a city = Divide (Count(TweetID where Country = 'Argentina'), Count (City))",
    "idx": 487
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`sentiment` > 0)\nRETURN sum(CASE  WHEN t2.`gender` = 'Male' THEN 1.0 ELSE 0 END) / COUNT(t1.`tweetid`) AS `per`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the tweets with a positive sentiment, what is the percentage of those posted by a male user?",
    "evidence": "positive sentiment refers to Sentiment > 0; male user refers to Gender = 'Male'; percentage = Divide (Count(TweetID where Gender = 'Male'), Count (TweetID)) * 100",
    "idx": 488
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (location@`location`)\nWHERE location.`state` = 'Gwynedd'\nRETURN DISTINCT location.`statecode` AS `statecode`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the code of Gwynedd State?",
    "evidence": "code refers to StateCode",
    "idx": 491
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t2.`locationid` = t1.`locationid`\nAND (t2.`state` = 'Texas' AND t1.`isreshare` = 'TRUE')\nRETURN COUNT(t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many reshared tweets are there in Texas?",
    "evidence": "reshared tweet refers to IsReshare = 'TRUE'; 'Texas' is the State",
    "idx": 493
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t2.`locationid` = t1.`locationid`\nAND (t1.`reach` = 547851)\nRETURN t2.`country` AS `country`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the tweet which got a reach number of 547851, which country did it come from?",
    "evidence": "reach number of 547851 refers to Reach = 547851",
    "idx": 494
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nMATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t3@`user`)\nWHERE t2.`locationid` = t1.`locationid`\nAND t3.`userid` = t1.`userid`\nAND (t2.`state` = 'Wisconsin' AND t3.`gender` = 'Female')\nRETURN COUNT(t1.`likes`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female Twitter users are there from Wisconsin?",
    "evidence": "female users refers to Gender = 'Female'; 'Wisconsin' is the State",
    "idx": 497
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`tweetid` = 'tw-715909161071091712')\nRETURN t2.`gender` AS `gender`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the gender of the user who tweeted `tw-715909161071091712`?",
    "evidence": "\"tw-715909161071091712\" is the TweetID",
    "idx": 498
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`retweetcount` = 535)\nRETURN t2.`gender` AS `gender`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the gender of the user whose tweet got 535 retweets?",
    "evidence": "tweet got 535 retweets refers to RetweetCount = 535",
    "idx": 500
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nMATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t3@`user`)\nWHERE t2.`locationid` = t1.`locationid`\nAND t3.`userid` = t1.`userid`\nAND (t2.`state` = 'Florida')\nRETURN sum(CASE  WHEN t3.`gender` = 'Male' THEN 1.0 ELSE 0 END) / COUNT(t1.`tweetid`) AS `percentage`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of male Twitter users from Florida?",
    "evidence": "\"Florida\" is the State; male user refers to Gender = 'Male'; percentage = Divide (Count(UserID where Gender = 'Male'), Count (UserID)) * 100",
    "idx": 505
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t2.`locationid` = t1.`locationid`\nAND (t2.`state` = 'California')\nRETURN sum(CASE  WHEN t1.`sentiment` > 0 THEN 1.0 ELSE 0 END) / COUNT(t1.`tweetid`) AS `percentage`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of the tweets from California are positive?",
    "evidence": "\"California\" is the State; positive tweet refers to Sentiment > 0; percentage = Divide (Count(TweetID where Sentiment > 0), Count (TweetID)) * 100",
    "idx": 506
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`tweetid` = 'tw-682712873332805633'\nRETURN twitter.`weekday` AS `weekday`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the day of the week that tweet with ID tw-682712873332805633 was posted?",
    "evidence": "\"tw-682712873332805633\" is the TweetID; day of the week refers to Weekday",
    "idx": 507
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`text` = 'Happy New Year to all those AWS instances of ours!'\nRETURN twitter.`reach` AS `reach`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many unique users have seen tweet with text `Happy New Year to all those AWS instances of ours!`?",
    "evidence": "\"Happy New Year to all those AWS instances of ours!\" is the text; seen unique users refers to Reach",
    "idx": 508
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`tweetid` = 'tw-682714048199311366'\nRETURN twitter.`locationid` AS `locationid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Is 3751 the location ID for tweet with ID tw-682714048199311366?",
    "evidence": "\"tw-682714048199311366\" is the TweetID",
    "idx": 510
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`weekday` = 'Wednesday'\nRETURN COUNT(twitter.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many tweets have been posted on Wednesday?",
    "evidence": "\"Wednesday\" is the Weekday",
    "idx": 511
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`tweetid` = 'tw-682714583044243456')\nRETURN t2.`gender` AS `gender`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the gender of the user who posted a tweet with ID tw-682714583044243456?",
    "evidence": "\"tw-682714583044243456\" is the TweetID",
    "idx": 513
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t1.`retweetcount` > 30)\nRETURN DISTINCT t2.`gender` AS `gender`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What gender of users retweet more than 30 times?",
    "evidence": "retweet more than 30 times refers to RetweetCount > 30",
    "idx": 516
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t2.`gender` = 'Female' AND t1.`isreshare` = 'TRUE')\nRETURN COUNT(t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female users reshared their tweets?",
    "evidence": "female users refers to Gender = 'Female'; reshare refers to IsReshare = 'TRUE'",
    "idx": 517
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`tweetid` = 'tw-682723090279841798')\nRETURN t2.`country` AS `country`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Tweet with ID tw-682723090279841798 was posted from which country?",
    "evidence": "\"tw-682723090279841798\" is the TweetID",
    "idx": 518
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t2.`country` = 'Brazil')\nRETURN DISTINCT t1.`lang` AS `lang`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Tweets that were posted from Brazil are in what languague?",
    "evidence": "\"Brazil\" is the Country; language refers to Lang",
    "idx": 521
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`klout` > 50\nRETURN COUNT(DISTINCT twitter.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many tweets have a klout of over 50?",
    "evidence": "klout of over 50 refers to Klout > 50",
    "idx": 524
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`weekday` = 'Monday' AND twitter.`isreshare` = 'TRUE'\nRETURN COUNT(DISTINCT twitter.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the tweets posted on Mondays, how many of them are reshared?",
    "evidence": "\"Monday\" is the Weekday; reshare refers to IsReshare = 'TRUE'",
    "idx": 526
  }
]