[
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`state` = 'Alabama' AND `t1`.`control` = 'Public' AND `t2`.`year` = 2011 AND `t2`.`grad_100` > '30')\nRETURN COUNT(`t1`.`chronname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the public institutes in the state of Alabama, how many of them have over 30 students who graduated within 100 percent of normal/expected time in 2011?",
    "evidence": "public refers to control = 'Public'; over 30 students who graduated within 100 percent of normal/expected time refers to grad_100 > 30; in 2011 refers to year = 2011;",
    "idx": 2859
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`state` = 'Alabama' AND `t2`.`year` = 2011 AND `t2`.`race` = 'X' AND `t2`.`grad_cohort` > '500')\nRETURN DISTINCT `t1`.`chronname` AS `chronname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the institutes in the state of Alabama whose all graduates in total exceeded 500 in 2011?",
    "evidence": "names of the institutes refers to chronname; graduates refers to grad_cohort; grad_cohort > 500; in 2011 refers to year = 2011; all students refer to race = 'X'.",
    "idx": 2860
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`chronname` = 'Central Alabama Community College' AND `t2`.`year` IN [2011, 2012, 2013] AND `t2`.`gender` = 'B' AND `t2`.`race` = 'X')\nRETURN avg(toFloat(`t2`.`grad_cohort`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the average number of graduates for Central Alabama Community College in the 3 consecutive years from 2011 to 2013?",
    "evidence": "graduates refers to grad_cohort; Central Alabama Community College refers to chronname = 'Central Alabama Community College'; average number of graduates for 3 consecutive years = DIVIDE(SUM(SUM(grad_cohort WHERE year = 2011), SUM(grad_cohort WHERE year = 2012), SUM(grad_cohort WHERE year = 2013)), 3);",
    "idx": 2861
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`chronname` = 'Central Alabama Community College')\nRETURN avg(toFloat(`t2`.`grad_100_rate`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average percentage of students graduating within 100 percent of normal/expected time for Central Alabama Community College?",
    "evidence": "average = DIVIDE(SUM(grad_100_rate), (SUM(grad_100), SUM(grad_150))); percentage of students graduating within 100 percent of normal/expected time refers to grade_100_rate; Central Alabama Community College refers to chronname = 'Central Alabama Community College';",
    "idx": 2862
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL (*) {\nMATCH (`institution_details_sub0`:`institution_details`)\nRETURN DISTINCT CASE  WHEN `institution_details_sub0`.`chronname` = 'Swarthmore College' THEN `institution_details_sub0`.`site` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the web site address for \"Swarthmore College\".",
    "evidence": "website address refers to site; Swarthmore College refers to chronname = 'Swarthmore College';",
    "idx": 2863
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL (*) {\nMATCH (`institution_details_sub0`:`institution_details`)\nRETURN DISTINCT CASE  WHEN `institution_details_sub0`.`chronname` = 'Mercer University' THEN `institution_details_sub0`.`state` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which state is \"Mercer University\" located in?",
    "evidence": "Mercer University refers to chronname = 'Mercer University';",
    "idx": 2864
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL (*) {\nMATCH (`institution_details_sub0`:`institution_details`)\nRETURN DISTINCT CASE  WHEN `institution_details_sub0`.`chronname` = 'Rensselaer Polytechnic Institute' THEN `institution_details_sub0`.`city` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which city is \"Rensselaer Polytechnic Institute\" located in?",
    "evidence": "Rensselaer Polytechnic Institute refers to chronname = 'Rensselaer Polytechnic Institute';",
    "idx": 2865
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL (*) {\nMATCH (`state_sector_grads_sub0`:`state_sector_grads`)\nRETURN DISTINCT CASE  WHEN `state_sector_grads_sub0`.`state` = 'Delaware' THEN `state_sector_grads_sub0`.`state_abbr` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the abbreviation for \"Delaware\" state.",
    "evidence": "abbreviation for state refers to state_abbr;",
    "idx": 2866
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`state_sector_details`:`state_sector_details`)\nWHERE `state_sector_details`.`state` = 'California' AND `state_sector_details`.`level` = '2-year' AND `state_sector_details`.`control` = 'Public'\nRETURN COUNT(`state_sector_details`.`stateid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many 2-year public schools are there in \"California\"?",
    "evidence": "2-year refers to level = '2-year'; public refers to control = 'public'; California refers to state = 'California';",
    "idx": 2867
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL (*) {\nMATCH (`state_sector_details_sub0`:`state_sector_details`)\nRETURN DISTINCT CASE  WHEN `state_sector_details_sub0`.`state` = 'Idaho' THEN `state_sector_details_sub0`.`state_post` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the post name of \"Idaho\" state.",
    "evidence": "post name refers to state_post;",
    "idx": 2868
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL(*) {\nMATCH (`t2_sub0`:`state_sector_grads`)-[aggregated_from_institutions_1:aggregated_from_institutions]->(`t1_sub0`:`institution_details`)\nWHERE `t2_sub0`.`state` = `t1_sub0`.`state`\nAND (`t2_sub0`.`state_abbr` = 'NJ' AND `t1_sub0`.`level` = '4-year')\nRETURN MAX(`t1_sub0`.`student_count`) AS `_col_0`  \n}\nMATCH (`t2`:`state_sector_grads`)-[aggregated_from_institutions_0:aggregated_from_institutions]->(`t1`:`institution_details`)\nWHERE `t2`.`state` = `t1`.`state`\nAND (`t2`.`state_abbr` = 'NJ' AND `t1`.`level` = '4-year' AND `t1`.`student_count` = `_col_0`)\nRETURN DISTINCT `t1`.`chronname` AS `chronname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the name of school in \"NJ\" that could get the bachelor's degree with highest students number.",
    "evidence": "name of school refers to chronname; NJ refers to state_abbr = 'NJ'; bachelor's degree refers to level = '4-year'; highest students number refers to MAX(student_count);",
    "idx": 2869
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL(*) {\nMATCH (`t2_sub0`:`state_sector_grads`)-[aggregated_from_institutions_1:aggregated_from_institutions]->(`t1_sub0`:`institution_details`)\nWHERE `t2_sub0`.`state` = `t1_sub0`.`state`\nAND (`t2_sub0`.`state_abbr` = 'PA')\nRETURN MAX(`t1_sub0`.`lat_y`) AS `_col_0`  \n}\nMATCH (`t2`:`state_sector_grads`)-[aggregated_from_institutions_0:aggregated_from_institutions]->(`t1`:`institution_details`)\nWHERE `t2`.`state` = `t1`.`state`\nAND (`t2`.`state_abbr` = 'PA' AND `t1`.`lat_y` = `_col_0`)\nRETURN DISTINCT `t1`.`site` AS `site`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the web site address for the school in \"PA\" state with the highest latitude.",
    "evidence": "web site address refers to site; PA refers to state_abbr = 'PA'; highest latitude refers to MAX(lat_y);",
    "idx": 2870
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[aggregated_from_institutions_0:aggregated_from_institutions]->(`t1`:`institution_details`)\nWHERE `t2`.`state` = `t1`.`state`\nAND (`t2`.`state_abbr` = 'UT' AND `t1`.`level` = '4-year' AND `t1`.`control` = 'Public' AND `t1`.`awards_per_value` > `t1`.`awards_per_state_value`)\nRETURN COUNT(DISTINCT `t1`.`chronname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of 4-year public schools in UT whose graduation rate exceeds the average for the state.",
    "evidence": "4-year refers to level = '4-year'; public refers to control = 'Public'; UT refers to state_abbr = 'UT'; graduation rate exceeds the average for the state refers to awards_per_value > awards_per_state_value;",
    "idx": 2871
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[aggregated_from_institutions_0:aggregated_from_institutions]->(`t1`:`institution_details`)\nWHERE `t2`.`state` = `t1`.`state`\nAND (`t2`.`state_abbr` = 'CT' AND `t2`.`level` = '2-year' AND `t1`.`control` = 'Private not-for-profit' AND `t1`.`awards_per_value` < `t1`.`awards_per_natl_value`)\nRETURN COUNT(DISTINCT `t1`.`chronname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many 2-year private nonprofit schools in \"CT\" whose graduation rate falls below the average for the state?",
    "evidence": "2-year refers to level = '2-year'; private nonprofit refers to control = 'Private not-for-profit'; CT refers to state_abbr = 'CT'; graduation rate falls below the average for the state refers to awards_per_value < awards_per_natl_value;",
    "idx": 2872
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`institution_details`)-[has_graduation_data_1:has_graduation_data]->(`t2_sub0`:`institution_grads`)\nWHERE `t2_sub0`.`unitid` = `t1_sub0`.`unitid`\nRETURN MAX(`t1_sub0`.`cohort_size`) AS `_col_0`  \n}\nMATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`cohort_size` = `_col_0`)\nRETURN DISTINCT `t1`.`chronname` AS `chronname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the cohort name for the school with biggest cohort size.",
    "evidence": "biggest cohort size refers to MAX(cohort_size); cohort = '4y bach' means bachelor's or equivalent-seeking cohort at 4-year institutions; cohort = '4y other' means students seeking another type of degree or certificate at a 4-year institution; cohort = '2y all' means degree-seeking students at 2-year institutions;",
    "idx": 2873
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_details`)-[contains_institutions_0:contains_institutions]->(`t1`:`institution_details`)\nWHERE `t2`.`state` = `t1`.`state`\nAND (`t2`.`level` = '4-year' AND `t2`.`control` = 'Private not-for-profit' AND `t1`.`chronname` = 'Brevard Community College')\nRETURN COUNT(`t1`.`chronname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of 4-year private not-for-profit schools in the home state of \"Brevard Community College\".",
    "evidence": "4-year refers to level = '4-year'; private not-for-profit refers to control = 'Private not-for-profit'; Brevard Community College refers to chronname = 'Brevard Community College';",
    "idx": 2874
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[has_state_details_0:has_state_details]->(`t1`:`state_sector_details`)\nWHERE `t2`.`stateid` = `t1`.`stateid`\nAND (`t2`.`level` = '2-year' AND `t2`.`control` = 'Public' AND `t2`.`gender` = 'B' AND `t2`.`race` = 'A' AND `t2`.`cohort` = '2y all' AND `t1`.`schools_count` = 113)\nRETURN COUNT(`t2`.`grad_cohort`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the state which has the 113 2-year public schools, tell the number of graduated Asian students who seeks another type of degree or certificate at a 2-year institution in 2013.",
    "evidence": "schools_count = 113; 2-year refers to level = '2-year'; public refers to control = 'public'; Asian refers to race = 'A'; seeks another type of degree or certificate at a 2-year institution refers to cohort = '2y all'; in 2013 refers to year = 2013;",
    "idx": 2875
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL(*) {\nMATCH (`t2_sub0`:`state_sector_details`)-[contains_institutions_1:contains_institutions]->(`t1_sub0`:`institution_details`)\nWHERE `t2_sub0`.`state` = `t1_sub0`.`state`\nAND (`t1_sub0`.`chronname` = 'Madison Area Technical College')\nRETURN `t1_sub0`.`state` AS `state`  \n}\nMATCH (`t2`:`state_sector_details`)-[contains_institutions_0:contains_institutions]->(`t1`:`institution_details`)\nWHERE `t2`.`state` = `t1`.`state`\nRETURN CASE WHEN COUNT(DISTINCT CASE  WHEN `t2`.`state` = 'Alabama' THEN `t1`.`chronname` ELSE NULL END)=0 THEN NULL ELSE toFloat(COUNT(DISTINCT CASE  WHEN `t1`.`state` = `state` AND `t1`.`level` = '4-year' AND `t1`.`control` = 'Public' THEN `t1`.`chronname` ELSE NULL END)) * 100 / COUNT(DISTINCT CASE  WHEN `t2`.`state` = 'Alabama' THEN `t1`.`chronname` ELSE NULL END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of the number of 4-year public schools from Madison Area Technical College's home state in the Alabama?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(chronname = 'Madison Area Technical College'), SUM(state = 'Alabama')), 100); 4-year refers to level = '4-year'; public refers to control = 'Public'; Madison Area Technical College refers to chronname = 'Madison Area Technical College'; home state in the United States refers to state;",
    "idx": 2876
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t2`.`race` = 'B' AND `t2`.`year` >= 2010 AND `t2`.`year` <= 2012)\nRETURN DISTINCT `t1`.`state` AS `state`, `t1`.`chronname` AS `chronname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the state and name of institutions in year of data release from 2010 to 2012 with black students.",
    "evidence": "name of institutions refers to chronname; year of data release refers to year; from '2010' to '2012' refers to year BETWEEN 2010 AND 2012; Black refers to race = 'B';",
    "idx": 2877
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[has_state_details_0:has_state_details]->(`t1`:`state_sector_details`)\nWHERE `t2`.`stateid` = `t1`.`stateid`\nAND (`t2`.`year` = 2011 AND `t1`.`awards_per_natl_value` <= 20)\nRETURN DISTINCT `t1`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the states in 2011 with a national sector average of 20 and below.",
    "evidence": "in 2011 refers to year = '2011'; national sector average of 20 and below refers to awards_per_natl_value < 20;",
    "idx": 2878
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`institution_details`)-[has_graduation_data_1:has_graduation_data]->(`t2_sub0`:`institution_grads`)\nWHERE `t2_sub0`.`unitid` = `t1_sub0`.`unitid`\nAND (`t2_sub0`.`race` = 'X')\nRETURN MAX(`t1_sub0`.`student_count`) AS `_col_0`  \n}\nMATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t2`.`race` = 'X' AND `t1`.`student_count` = `_col_0`)\nRETURN DISTINCT `t1`.`control` AS `control`, `t1`.`level` AS `level`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the race of all students, what is the control of institution and level of institution with highest number of students?",
    "evidence": "highest number of students refers to student_count; all students refer to race = 'X'.",
    "idx": 2879
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[has_state_details_0:has_state_details]->(`t1`:`state_sector_details`)\nWHERE `t2`.`stateid` = `t1`.`stateid`\nAND (`t1`.`schools_count` <= 20 AND `t1`.`control` = 'Public')\nRETURN DISTINCT `t2`.`race` AS `race`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the states with a public school count of 20 and below, list their race.",
    "evidence": "public refers to control = 'Public'; school_count < 20;",
    "idx": 2880
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t2`.`year` = 2012 AND `t2`.`gender` = 'M' AND `t2`.`race` = 'X')\nRETURN DISTINCT `t1`.`basic` AS `basic`, `t2`.`race` AS `race`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the basic of the institution in 2012 with race of all male students.",
    "evidence": "in 2012 refers to year = '2012'; male refers to gender = 'M'; all students refer to race = 'X'.",
    "idx": 2881
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[has_state_details_0:has_state_details]->(`t1`:`state_sector_details`)\nWHERE `t2`.`stateid` = `t1`.`stateid`\nAND (`t1`.`schools_count` = 1 AND `t2`.`year` >= 2011 AND `t2`.`year` <= 2013 AND `t2`.`race` = 'W' AND `t1`.`state` = 'Alaska')\nRETURN COUNT(`t2`.`race`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In Alaska with school count of 1 from year 2011 to 2013, how many of the students are white?",
    "evidence": "Alaska refers to state = 'Alaska'; from year 2011 to 2013 refers to year BETWEEN '2011' AND '2013'; white refers to race = 'W';",
    "idx": 2882
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t2`.`grad_cohort` >= '1' AND `t2`.`grad_cohort` <= '3' AND `t2`.`race` = 'Ai')\nRETURN DISTINCT `t1`.`chronname` AS `chronname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the institution's name of american students within the number of degree-seeking students in the cohort that ranges from 1 to 3?",
    "evidence": "institution's name refers to chronname; american refers to race = 'Ai'; number of degree-seeking students in the cohort refers to grad_cohort; grad_cohort < = 3;",
    "idx": 2883
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`institution_details`)-[has_graduation_data_1:has_graduation_data]->(`t2_sub0`:`institution_grads`)\nWHERE `t2_sub0`.`unitid` = `t1_sub0`.`unitid`\nRETURN MAX(`t2_sub0`.`year`) AS `_col_0`  \n}\nMATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`student_count` >= 500 AND `t1`.`student_count` <= 1000 AND `t2`.`year` = `_col_0`)\nRETURN DISTINCT `t1`.`site` AS `site`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the site of institution within the student count of 500 to 1000 that has the recent year of data release.",
    "evidence": "recent year of data release refers to newest year;",
    "idx": 2884
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[has_state_details_0:has_state_details]->(`t1`:`state_sector_details`)\nWHERE `t2`.`stateid` = `t1`.`stateid`\nAND (`t2`.`gender` = 'M' AND `t2`.`race` = 'B' AND `t1`.`control` = 'Private for-profit' AND `t2`.`year` = 2011)\nRETURN DISTINCT `t1`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the state name of male graduate in 2011 from a private for profit institution with black students?",
    "evidence": "male refers to gender = 'M'; in 2011 refers to year = '2011'; private for profit refers to control = 'Private for-profit'; black refers to race = 'B';",
    "idx": 2885
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t2`.`year` = 2011 AND `t2`.`race` = 'B' AND `t2`.`grad_cohort` >= '20' AND `t2`.`grad_cohort` <= '30')\nRETURN DISTINCT `t1`.`site` AS `site`, `t1`.`chronname` AS `chronname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the black students in 2011, list the institution site and name of those who has 20 t0 30 degree-seeking students in the cohort.",
    "evidence": "black refers to race = 'B'; in 2011 refers to year = '2011'; institution name refers to chronname; 20 to 30 degree-seeking students in the cohort refers to grad_cohort BWEEN 20 AND 30;",
    "idx": 2886
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[has_state_details_0:has_state_details]->(`t1`:`state_sector_details`)\nWHERE `t2`.`stateid` = `t1`.`stateid`\nAND (`t2`.`gender` = 'F' AND `t1`.`schools_count` >= 10 AND `t1`.`schools_count` <= 20 AND `t2`.`year` = 2012)\nRETURN COUNT(`t2`.`race`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In female students in year 2012, how many of them from a state with number of schools ranges from 10 to 20?",
    "evidence": "female refers to gender = 'F'; number of schools refers to schools_count; schools_count BETWEEN 10 AND 20;",
    "idx": 2887
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`institution_details`)-[has_graduation_data_1:has_graduation_data]->(`t2_sub0`:`institution_grads`)\nWHERE `t2_sub0`.`unitid` = `t1_sub0`.`unitid`\nAND (`t1_sub0`.`state` = 'Alabama')\nRETURN avg(`t1_sub0`.`student_count`) * 0.9 AS `_col_0`  \n}\nMATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`student_count` > `_col_0` AND `t1`.`state` = 'Alabama')\nRETURN DISTINCT `t2`.`race` AS `race`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the race of institutions in Alabama with number of students greater than the 90% of average number of students of all institutions?",
    "evidence": "Alabama refers to state = 'Alabama'; number of students greater than the 90% of average = MULTIPLY(AVG(student_count), 90%) < student_count;",
    "idx": 2888
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_grads`)-[has_state_details_0:has_state_details]->(`t1`:`state_sector_details`)\nWHERE `t2`.`stateid` = `t1`.`stateid`\nAND (`t2`.`state` = 'Hawaii' AND `t2`.`year` = 2010)\nRETURN CASE WHEN COUNT(`t2`.`level`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`level` = '2-year' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`level`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In year 2010 at schools located in Hawaii, what is the percentage of schools offers an associate's degree?",
    "evidence": "Hawaii refers to state = 'Hawaii'; associate's degree refers to level = '2-year'; percentage = MULTIPLY(DIVIDE(SUM(level = '2-year' ), count(level)), 1.0);",
    "idx": 2889
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "CALL(*) {\nMATCH (`institution_details_sub0`:`institution_details`)\nWHERE `institution_details_sub0`.`state` = 'Connecticut'\nRETURN MAX(`institution_details_sub0`.`retain_percentile`) AS `_col_0`  \n}\nMATCH (`institution_details`:`institution_details`)\nWHERE `institution_details`.`state` = 'Connecticut' AND `institution_details`.`retain_percentile` = `_col_0`\nRETURN `institution_details`.`chronname` AS `chronname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the state of Connecticut, what is the name of the instution with the highest percent rank for freshman retention percentage within the sector?",
    "evidence": "name of the institution refers to chronname;  highest percent rank for freshman retention percentage within the sector refers to MAX(retain_percentile);",
    "idx": 2890
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t2`.`race` = 'W' AND `t2`.`cohort` = '2y all' AND `t2`.`year` = 2008)\nORDER BY `t2`.`grad_cohort` IS NULL ASC, `t2`.`grad_cohort` DESC \nRETURN `t1`.`site` AS `site`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the website address of the institution with the highest number of White degree-seeking students at 2-year institutions in 2008?",
    "evidence": "website address refers to site; White refers to race = 'W'; degree-seeking students at 2-year institutions refers to cohort = '2y all'; in 2008 refers to year = '2008';",
    "idx": 2891
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`chronname` = 'Yale University' AND `t2`.`year` >= 2002 AND `t2`.`year` <= 2005 AND `t2`.`race` = 'B' AND `t2`.`cohort` = '4y bach')\nRETURN avg(toFloat(`t2`.`grad_cohort`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In Yale University, what is the average number of Black students per year who were bachelor's/equivalent-seeking cohort at 4-year institutions between 2002 to 2005?",
    "evidence": "Yale University refers to chronname = 'Yale University'; average = DIVIDE(COUNT(race = 'B' WHERE cohort = '4y bach AND year BETWEEN 2002 AND 2005), 3); Black refers to race = 'B'; bachelor's/equivalent-seeking cohort at 4-year institutions refers to cohort = '4y bach'; between 2002 to 2005 refers to year BETWEEN '2002' AND '2005';",
    "idx": 2892
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_details`)\nMATCH (`t1`:`institution_details`)\nWHERE `t2`.`level` = '4-year' AND `t2`.`control` = 'Public' AND `t2`.`state` = 'Florida'\nRETURN `t1`.`chronname` AS `chronname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many 4-year public institutions are there in the state of Florida? Give all of their names.",
    "evidence": "4-year refers to level = '4-year'; public refers to control = 'Public'; names refers to chronname;",
    "idx": 2893
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_details`)-[contains_institutions_0:contains_institutions]->(`t1`:`institution_details`)\nWHERE `t1`.`state` = `t2`.`state`\nAND (`t1`.`ft_pct` > 90)\nORDER BY `t2`.`schools_count` IS NULL ASC, `t2`.`schools_count` DESC \nRETURN COUNT(`t1`.`unitid`) AS `_col_0`, `t1`.`chronname` AS `chronname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the state with the highest number of schools, how many institutions have a percentage of no less than 90 of undergraduates who attend full-time? List all of the institutions' names.",
    "evidence": "highest number of schools refers to MAX(schools_count); percentage of no less than 90 of undergraduates who attend full-time refers to ft_pct > 90; institutions' names refers to chronname;",
    "idx": 2894
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_details`)-[contains_institutions_0:contains_institutions]->(`t1`:`institution_details`)\nWHERE `t1`.`state` = `t2`.`state`\nORDER BY `t2`.`state_appr_value` IS NULL DESC, `t2`.`state_appr_value`  \nRETURN avg(toFloat(`t1`.`med_sat_value`)) AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average SAT value for incoming students in all of the schools located in the state with the lowest state appropriations to higher education in fiscal year 2011 per resident?",
    "evidence": "average = DIVIDE(SUM(med_sat_value), SUM(chronname)); SAT value for incoming students refers to med_sat_value; lowest state appropriations to higher education in fiscal year 2011 per resident refers to MIN(state_appr_value);",
    "idx": 2895
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t2`.`gender` = 'F' AND `t2`.`cohort` = '4y other')\nORDER BY `t2`.`grad_cohort` IS NULL ASC, `t2`.`grad_cohort` DESC \nRETURN `t1`.`chronname` AS `chronname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the school with the highest number of first-time, full-time, degree-seeking female students in the cohort being tracked, minus any exclusions who were seeking another type of degree or certificate at a 4-year institution?",
    "evidence": "name of the school refers to chronname; highest number of first-time, full-time, degree-seeking female students in the cohort being tracked, minus any exclusions refers to MAX(grad_cohort WHERE gender = 'F'); seeking another type of degree or certificate at a 4-year institution refers to cohort = '4y other';",
    "idx": 2896
  }
]