[
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`shortname` = 'IWC')\nRETURN sum(CASE  WHEN `t2`.`year` = 2000 THEN 1 ELSE 0 END) - sum(CASE  WHEN `t2`.`year` = 2010 THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the differences of the paper number with the journal name of IWC in 2000 and 2010.",
    "evidence": "\"IWC\" is the ShortName of journal;  '2000' and '2010' are Year;  Difference = Subtract(Count(Paper.Id(Year = 2000)), Count(Paper.Id(Year = 2010)))",
    "idx": 2721
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t2`.`year` = 2013 AND `t2`.`journalid` <> 0 AND `t2`.`journalid` <> -1)\nRETURN DISTINCT `t2`.`journalid` AS `journalid`, `t1`.`shortname` AS `shortname`, `t1`.`fullname` AS `fullname`  LIMIT 4",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide any four valid Journal ID along with short name and full name of the papers which were made in 2013.",
    "evidence": "valid journal ID refers to JournalId! = 0 and JournalId! = -1; made in 2013 refers to Year = 2013",
    "idx": 2722
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[presented_at_0:presented_at]->(`t1`:`conference`)\nMATCH ()-[t3:authored_by]->()\nWHERE `t1`.`id` = `t2`.`conferenceid`\nAND `t1`.`id` = `t3`.`paperid`\nAND (`t1`.`shortname` = 'MICRO' AND `t2`.`year` >= '1971' AND `t2`.`year` <= '1980')\nRETURN `t2`.`title` AS `title`, `t3`.`name` AS `name`, `t1`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Under the conference name of MICRO, calculate how many more paper is needed to published in 1971 to 1980 in average by yearly to get equivalent to the number of paper from 1991 to 2000. Write down the title and author name of the paper that were actually published during 1971 to 1980 with the conference name with MICRO.",
    "evidence": "\"MICRO\" is the ShortName of conference; in 1971 to 1980 refers to Year BETWEEN '1971' AND '1980'; in 1991 to 2000 refers to Year BETWEEN '1991' AND '2000': Average needed paper = Subtract (Count(PaperId(Year BETWEEN '1991' AND '2000')), Count(PaperId(Year BETWEEN '1971' AND '1980')))/10",
    "idx": 2723
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`title` = 'The Dissimilarity Representation as a Tool for Three-Way Data Classification: A 2D Measure')\nRETURN `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the full name of conference for paper \"The Dissimilarity Representation as a Tool for Three-Way Data Classification: A 2D Measure\".",
    "evidence": "\"The Dissimilarity Representation as a Tool for Three-Way Data Classification: A 2D Measure\" is the Title of paper",
    "idx": 2725
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`title` = 'Energy-efficiency bounds for noise-tolerant dynamic circuits')\nRETURN `t2`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the homepage address for paper \"Energy-efficiency bounds for noise-tolerant dynamic circuits\"?",
    "evidence": "\"Energy-efficiency bounds for noise-tolerant dynamic circuits\" is the Title of paper",
    "idx": 2726
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`id` > 100 AND `t1`.`id` < 106)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the name of authors for paper with id from 101 to 105.",
    "evidence": "paper with ID from 101 to 105 refers to Id BETWEEN 100 AND 106",
    "idx": 2727
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`author`)-[t2:authored]->(`t3`:`paper`)-[presented_at_0:presented_at]->(`t4`:`conference`)\nWHERE `t1`.`id` = `t2`.`authorid`\nAND `t2`.`paperid` = `t3`.`id`\nAND `t3`.`conferenceid` = `t4`.`id`\nAND (`t3`.`year` = 2009)\nRETURN `t2`.`paperid` AS `paperid`, `t4`.`shortname` AS `shortname`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the papers published in 2009, pick 10 and list down the conference's short name of these papers.",
    "evidence": "published in 2009 refers to Year = 2009",
    "idx": 2728
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t1`.`title` = '364: Induction of Mixed Chimerism and Transplantation Tolerance in a Non-Human Primate Lung Allograft Model: Early Results')\nRETURN `t2`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down homepage URL of journal for paper \"364: Induction of Mixed Chimerism and Transplantation Tolerance in a Non-Human Primate Lung Allograft Model: Early Results\".",
    "evidence": "paper \"364: Induction of Mixed Chimerism and Transplantation Tolerance in a Non-Human Primate Lung Allograft Model: Early Results\" refers to Title = '364: Induction of Mixed Chimerism and Transplantation Tolerance in a Non-Human Primate Lung Allograft Model: Early Results'",
    "idx": 2729
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t2`.`fullname` = 'International Conference on Internet Computing' AND `t1`.`title` <> '')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all paper name that were published in conference \"International Conference on Internet Computing\".",
    "evidence": "conference \"International Conference on Internet Computing\" refers to FullName = 'International Conference on Internet Computing'; paper name refers to Title",
    "idx": 2730
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`year` = 2005 AND `t1`.`keyword` = 'KEY WORDS: LOAD IDE SNP haplotype asso- ciation studies')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among papers that were published in 2005, provide the author name of paper with key words of \"LOAD; IDE; SNP; haplotype; asso- ciation studies\".",
    "evidence": "in 2005 refers to Year = '2005'; key words of \"LOAD; IDE; SNP; haplotype; asso- ciation studies\" refers to Keyword = 'LOAD; IDE; SNP; haplotype; asso- ciation studies'",
    "idx": 2731
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`title` = '145 GROWTH HORMONE RECEPTORS AND THE ONSET OF HYPERINSULINEMIA IN THE OBESE ZUCKER RAT: ')\nRETURN COUNT(DISTINCT `t2`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many authors have written paper \"145 GROWTH HORMONE RECEPTORS AND THE ONSET OF HYPERINSULINEMIA IN THE OBESE ZUCKER RAT: \"?",
    "evidence": "paper \"145 GROWTH HORMONE RECEPTORS AND THE ONSET OF HYPERINSULINEMIA IN THE OBESE ZUCKER RAT: \" refers to Title like'%145 GROWTH HORMONE RECEPTORS AND THE ONSET OF HYPERINSULINEMIA IN THE OBESE ZUCKER RAT:%'",
    "idx": 2732
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`year` >= '1990' AND `paper`.`year` <= '2000' AND `paper`.`conferenceid` = 0 AND `paper`.`journalid` = 0\nRETURN COUNT(`paper`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many papers were preprinted between the years 1990 and 2000?",
    "evidence": "years 1990 and 2000 refers to Year BETWEEN '1990' AND '2000'; papers refers to COUNT(id)",
    "idx": 2734
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`author`:`author`)\nWHERE `author`.`affiliation` = 'Birkbeck University of London'\nRETURN `author`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of all authors affiliated with Birkbeck University of London.",
    "evidence": "affiliated with Birkbeck University of London refers to Affiliation = 'Birkbeck University of London'",
    "idx": 2735
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`conference`:`conference`)\nWHERE `conference`.`fullname` =~ '(?i)(?s)International Symposium.*'\nRETURN `conference`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the short name of all conferences whose full name begins with International Symposium.",
    "evidence": "full name refers to FullName LIKE 'International Symposium%'",
    "idx": 2736
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`year` = 0)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List author name for articles that are preprinted but not published.",
    "evidence": "articles that are preprinted but not published refers to Year = 0",
    "idx": 2738
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`keyword` = 'Quantum Physics')\nRETURN `t2`.`affiliation` AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List author affiliation for papers whose topic is Quantum Physics.",
    "evidence": "topic is Quantum Physics refers to Keyword = 'Quantum Physics'",
    "idx": 2739
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`conferenceid` <> 0 AND `t1`.`journalid` = 0 AND `t1`.`year` <> 0)\nRETURN `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify by conference full name all papers in which a journal was not published but a conference.",
    "evidence": "journal was not published but a conference refers to ConferenceId ! = 0 And JournalId = 0 Year ! = 0",
    "idx": 2740
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[presented_at_0:presented_at]->(`t1`:`conference`)\nWHERE `t1`.`id` = `t2`.`conferenceid`\nAND (`t1`.`homepage` = '' AND `t2`.`title` <> '')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify by papers title those in which conferences have been published that do not have a website..",
    "evidence": "do not have a website refers to HomePage IS NULL OR HomePage = ''",
    "idx": 2741
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t1`.`id` = `t2`.`journalid`\nAND (`t1`.`shortname` = '')\nRETURN DISTINCT `t2`.`year` AS `year`, `t1`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify by publication year in the paper database all journals that don't have short name.",
    "evidence": "don't have short name refers to ShortName is NULL OR ShortName = ''",
    "idx": 2742
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t1`.`year` = 2001 AND `t1`.`conferenceid` > 0 AND `t1`.`journalid` > 0)\nRETURN `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the name of all the journals published in the paper database in the year 2001.",
    "evidence": "name of all the journals refers to FullName",
    "idx": 2744
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`title` = 'Hypermethylation of the <I>TPEF/HPP1</I> Gene in Primary and Metastatic Colorectal Cancers')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the authors of the paper \"Hypermethylation of the <I>TPEF/HPP1</I> Gene in Primary and Metastatic Colorectal Cancers\".",
    "evidence": "paper \"Hypermethylation of the <I>TPEF/HPP1</I> Gene in Primary and Metastatic Colorectal Cancers\" refers to Title = 'Hypermethylation of the <I>TPEF/HPP1</I> Gene in Primary and Metastatic Colorectal Cancers'",
    "idx": 2754
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t1`.`title` = 'Multiple paternity in a natural population of a salamander with long-term sperm storage')\nRETURN `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the journal that published the paper \"Multiple paternity in a natural population of a salamander with long-term sperm storage\"?",
    "evidence": "paper \"Multiple paternity in a natural population of a salamander with long-term sperm storage\" refers to Title = 'Multiple paternity in a natural population of a salamander with long-term sperm storage'",
    "idx": 2755
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t2`.`fullname` = 'Iet Software/iee Proceedings - Software')\nRETURN COUNT(`t1`.`journalid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many papers were in the journal \"Iet Software/iee Proceedings - Software\"?",
    "evidence": "journal \"Iet Software/iee Proceedings - Software\" refers to FullName = 'Iet Software/iee Proceedings - Software'; papers refers to COUNT(JournalId)",
    "idx": 2756
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t2`.`name` =~ '(?i)(?s)Jun du.*')\nRETURN `t1`.`title` AS `title`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of any two papers that Jundu has written.",
    "evidence": "papers that Jundu has written refers to Name LIKE '%Jun du%'",
    "idx": 2758
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nMATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t3`:`conference`)\nWHERE `t1`.`id` = `t2`.`paperid`\nAND `t1`.`conferenceid` = `t3`.`id`\nAND (`t2`.`name` = 'Jean-luc Hainaut')\nRETURN DISTINCT `t3`.`fullname` AS `fullname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the full name of the conference where one of the papers of Jean-luc Hainaut were published.",
    "evidence": "papers of Jean-luc Hainaut refers to Name = 'Jean-luc Hainaut'",
    "idx": 2760
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t1`.`id` = `t2`.`paperid`\nAND `t1`.`journalid` = `t3`.`id`\nAND (`t2`.`name` = 'Andrew Cain')\nRETURN `t3`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the three journals that the papers written by Andrew Cain were published in? Please provide your answer with the full name of each journal.",
    "evidence": "written by Andrew Cain refers to Name = 'Andrew Cain'",
    "idx": 2761
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`title` = 'FIBER: A Generalized Framework for Auto-tuning Software')\nRETURN DISTINCT `t2`.`affiliation` AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all of the associations that the authors of the paper \"FIBER: A Generalized Framework for Auto-tuning Software\" are affiliated with.",
    "evidence": "paper \"FIBER: A Generalized Framework for Auto-tuning Software\" refers to Title = 'FIBER: A Generalized Framework for Auto-tuning Software'; are affiliated with refers to Affiliation",
    "idx": 2762
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t1`.`year` < 1)\nRETURN `t1`.`title` AS `title`, `t2`.`fullname` AS `fullname`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the titles of any two papers that are either preprinted or unpublished along with the full name of the journal to which those papers belong.",
    "evidence": "papers that are either preprinted or unpublished along refers to Year = 0",
    "idx": 2763
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t1`.`keyword` =~ '(?i)(?s).*Materials.*')\nRETURN `t2`.`shortname` AS `shortname`, `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the journal's short and full names that feature papers on the \"Materials\" topic?",
    "evidence": "papers on the \"Materials\" topic refers to Keyword = 'Materials'",
    "idx": 2764
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`author`:`author`)\nWHERE `author`.`affiliation` = 'University of Oxford'\nRETURN `author`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of authors affiliated with the University of Oxford in alphabetical order.",
    "evidence": "affiliated with the University of Oxford refers to Affiliation = 'University of Oxford'",
    "idx": 2765
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`conference`:`conference`)\nWHERE `conference`.`fullname` =~ '(?i)(?s)International Conference on Artificial Intelligence.*'\nRETURN `conference`.`shortname` AS `shortname`, `conference`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the short name and home page URL of all the international conferences on artificial intelligence.",
    "evidence": "all the international conferences on artificial intelligence refers to FullName LIKE 'International Conference on Artificial Intelligence%'",
    "idx": 2766
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`year` = 1996\nRETURN `paper`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the names of papers which are published in the year 1996.",
    "evidence": "",
    "idx": 2767
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t1`.`id` = `t2`.`paperid`\nAND `t1`.`journalid` = `t3`.`id`\nAND (`t3`.`fullname` = 'Neoplasia' AND `t1`.`year` = 2007)\nRETURN `t1`.`title` AS `title`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the title and author's name of papers published in the 2007 Neoplasia journal.",
    "evidence": "published in the 2007 refers to Year = 2007; Neoplasia journal refers to FullName = 'Neoplasia'",
    "idx": 2768
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`keyword` =~ '(?i)(?s).*optical properties.*' AND `t1`.`year` >= 2000 AND `t1`.`year` <= 2005 AND `t1`.`title` <> '')\nRETURN `t1`.`title` AS `title`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the title and author's name of the papers published between 2000 and 2005 that include the topic optical properties.",
    "evidence": "published between 2000 and 2005 refers to Year BETWEEN 2000 AND 2005; include the topic optical properties refers to Keyword LIKE '%optical properties%'",
    "idx": 2770
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nWITH `t1`.`year` AS _groupby_col_0, (CASE WHEN COUNT(`t1`.`id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`fullname` = 'International Congress Series' THEN 1 ELSE 0 END)) / COUNT(`t1`.`id`) END) AS _groupby_col_1, CASE WHEN COUNT(`t1`.`id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`fullname` = 'International Congress Series' THEN 1 ELSE 0 END)) / COUNT(`t1`.`id`) END AS _groupby_col_2\nWHERE _groupby_col_1 <> 0\nRETURN _groupby_col_2 AS `div1`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of papers published in the World Computer Congress each year?",
    "evidence": "published in the World Computer Congress refers to FullName = 'World Computer Congress'; average refers to DIVIDE(COUNT(FullName = 'World Computer Congress'), COUNT(Id))",
    "idx": 2771
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`conferenceid` = 0 AND `t1`.`journalid` = 0 AND `t1`.`year` = 1997 AND `t1`.`title` <> '')\nRETURN DISTINCT `t2`.`name` AS `name`, `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the Title and author's name of the books that were preprint in 1997.",
    "evidence": "in 1997 refers to Year = 1997; books that were preprint refers to ConferenceId = 0 AND JournalId = 0",
    "idx": 2772
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t1`.`id` = `t2`.`paperid`\nAND `t1`.`journalid` = `t3`.`id`\nAND (`t2`.`name` = 'Adam Jones' AND `t1`.`year` >= 2005 AND `t1`.`year` <= 2010)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the titles of papers published by Adam Jones and the journal name in which it was published from 2005 to 2010.",
    "evidence": "published from 2005 to 2010 refers to Year BETWEEN 2005 AND 2010; published by Adam Jones refers to Name = 'Adam Jones'",
    "idx": 2773
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`author`:`author`)\nWHERE `author`.`affiliation` = 'Otterbein University'\nRETURN COUNT(`author`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many authors is affiliated to the organization \"Otterbein University\"?",
    "evidence": "Otterbein University is an Affiliation",
    "idx": 2774
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`title` = 'Subcellular localization of nuclease in barley aleurone')\nRETURN COUNT(DISTINCT `t2`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many authors drafted the paper \"Subcellular localization of nuclease in barley aleurone\"?",
    "evidence": "'Subcellular localization of nuclease in barley aleurone' is the title of paper",
    "idx": 2775
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`title` = 'Extended Fuzzy Regression Models')\nRETURN `t2`.`fullname` AS `fullname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the conference in which the paper titled \"Extended Fuzzy Regression Models\" was published?",
    "evidence": "'Extended Fuzzy Regression Models' is the title of paper; full name of the conference refers to FullName",
    "idx": 2776
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t2`.`fullname` = 'Mathematics of Program Construction')\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many papers are published under the conference \"Mathematics of Program Construction\n\"?",
    "evidence": "'Mathematics of Program Construction' is the FullName of conference",
    "idx": 2777
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`title` = 'Open Sourcing Social Solutions (Building Communities of Change)')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the author of the paper titled \"Open Sourcing Social Solutions (Building Communities of Change)\"?",
    "evidence": "'Open Sourcing Social Solutions (Building Communities of Change)' is a title of the paper; author refers to PaperAuthor.Name",
    "idx": 2778
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t2`.`name` = 'Jianli Hua')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the title of the paper that Jianli Hua published.",
    "evidence": "Jianli Hua is the author of a paper",
    "idx": 2779
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t1`.`title` = 'Testing timed automata')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who authored the paper titled \"Testing timed automata\n\"?",
    "evidence": "'Testing timed automata' is a title of a paper; Who authored refers to PaperAuthor.Name",
    "idx": 2780
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`year` = 2000 AND `t2`.`shortname` = 'SSPR')\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many papers are published in year 2000 under the conference \"SSPR\"?",
    "evidence": "SSPR is a ShortName; papers refers to Paper.Id",
    "idx": 2781
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t2`.`fullname` = 'Theoretical Computer Science' AND `t1`.`year` = 2003 AND `t1`.`title` <> '')\nRETURN DISTINCT `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the paper that the journal \"Theoretical Computer Science\n\" published in 2003.",
    "evidence": "'Theoretical Computer Science' is the FullName; paper refers to Title; published in 2003 refers to Year = 2003",
    "idx": 2782
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[presented_at_0:presented_at]->(`t2`:`conference`)\nWHERE `t1`.`conferenceid` = `t2`.`id`\nAND (`t1`.`title` = 'Quality evaluation of long duration audiovisual content')\nRETURN `t2`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the conference homepage URL of the paper titled \"Quality evaluation of long duration audiovisual content\"?",
    "evidence": "homepage URL refers to HomePage; 'Quality evaluation of long duration audiovisual content' is the Title",
    "idx": 2783
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:authored_by]->()\nWHERE `t1`.`id` = `t2`.`paperid`\nAND (`t2`.`affiliation` = 'Asan Medical Center, University of Ulsan College of Medicine, Seoul, Korea' AND `t1`.`title` = 'A Randomized Comparison of Sirolimus- Versus Paclitaxel-Eluting Stent Implantation in Patients With Diabetes Mellitus')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the author who drafted the paper \"A Randomized Comparison of Sirolimus- Versus Paclitaxel-Eluting Stent Implantation in Patients With Diabetes Mellitus\", which of them is/are affiliated with the Asan Medical Center, University of Ulsan College of Medicine, Seoul, Korea\n?",
    "evidence": "author refers to PaperAuthor.Name; 'A Randomized Comparison of Sirolimus- Versus Paclitaxel-Eluting Stent Implantation in Patients With Diabetes Mellitus' is the title; 'Asan Medical Center, University of Ulsan College of Medicine, Seoul, Korea' is an Affiliation",
    "idx": 2784
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t1`.`journalid` = `t2`.`id`\nAND (`t2`.`fullname` = 'Software - Practice and Experience')\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many papers are published under the journal \"Software - Practice and Experience\"?",
    "evidence": "papers refers to Paper.Id; 'Software - Practice and Experience' is the FullName of a journal;",
    "idx": 2785
  }
]