[
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE `match`.`man_of_the_match` = 41\nRETURN COUNT(`match`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how many times has player no.41 won the \"man of the match\" award?",
    "evidence": "player no.41 won the \"man of the match\" refers to Man_of_the_Match = 41",
    "idx": 1219
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nRETURN COUNT(CASE  WHEN `t2`.`country_name` = 'Australia' THEN `t1`.`player_id` ELSE NULL END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players are from Australia?",
    "evidence": "Australia refers to Country_Name = 'Australia'",
    "idx": 1220
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[from_country_0:from_country]->(`t1`:`country`)\nWHERE `t2`.`country_name` = `t1`.`country_id`\nAND (NOT `t2`.`country_name` IS NULL)\nORDER BY `t2`.`dob` IS NULL DESC, `t2`.`dob`  \nRETURN `t1`.`country_name` AS `country_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country is the oldest player from?",
    "evidence": "country refers to Country_Name; the oldest refers to min(DOB)",
    "idx": 1221
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[has_bowling_style_0:has_bowling_style]->(`t1`:`bowling_style`)\nWHERE `t2`.`bowling_skill` = `t1`.`bowling_id`\nAND (`t2`.`player_name` = 'SC Ganguly')\nRETURN `t1`.`bowling_skill` AS `bowling_skill`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the bowling skill of SC Ganguly?",
    "evidence": "SC Ganguly refers to Player_Name = 'SC Ganguly'",
    "idx": 1222
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[from_country_0:from_country]->(`t1`:`country`)\nMATCH (`t2`:`player`)-[has_batting_style_0:has_batting_style]->(`t3`:`batting_style`)\nWHERE `t2`.`country_name` = `t1`.`country_id`\nAND `t2`.`batting_hand` = `t3`.`batting_id`\nAND (`t1`.`country_name` = 'Australia' AND `t3`.`batting_hand` = 'Right-hand bat')\nRETURN `t2`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the players who use the right hand as their batting hand and are from Australia.",
    "evidence": "name of player refers to Player_Name; right hand as batting hand refers to Batting_Hand = 'Right-hand bat'; Australia refers to Country_Name = 'Australia'",
    "idx": 1223
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_bowling_style_0:has_bowling_style]->(`t2`:`bowling_style`)\nMATCH (`t1`:`player`)-[from_country_0:from_country]->(`t3`:`country`)\nWHERE `t1`.`bowling_skill` = `t2`.`bowling_id`\nAND `t1`.`country_name` = `t3`.`country_id`\nAND (`t3`.`country_name` = 'Australia')\nWITH `t2`.`bowling_skill` AS _groupby_col_0\nRETURN _groupby_col_0 AS `bowling_skill`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the bowling skills of all the players from Australia.",
    "evidence": "Australia refers to Country_Name = 'Australia'",
    "idx": 1224
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_bowling_style_0:has_bowling_style]->(`t2`:`bowling_style`)\nWHERE `t1`.`bowling_skill` = `t2`.`bowling_id`\nAND (`t2`.`bowling_skill` = 'Legbreak')\nRETURN min(`t1`.`dob`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players whose bowling skill is \"Legbreak\", when was the oldest one of them born?",
    "evidence": "the oldest refers to min(DOB); date of birth refers to DOB",
    "idx": 1225
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t2`:`player`)\nWHERE `t2`.`player_id` = `t1`.`man_of_the_match`\nAND (`t1`.`match_date` = localdatetime('2008-04-18T00:00:00'))\nRETURN `t2`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the player who won the \"man of the match\" award in the match on 2008/4/18?",
    "evidence": "name of player refers to Player_Name; on 2008/4/18 refers to Match_Date = '2008-04-18'",
    "idx": 1226
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->()\nMATCH ()-[t2:played_as]->(`t3`:`rolee`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`role_id` = `t3`.`role_id`\nAND (`t1`.`player_name` = 'SC Ganguly')\nRETURN sum(CASE  WHEN `t3`.`role_desc` = 'Captain' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how many times has SC Ganguly played as team captain in a match?",
    "evidence": "SC Ganguly refers to Player_Name = 'SC Ganguly'; team captain refers to Role_Desc = 'Captain'",
    "idx": 1227
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->(`t4`:`match`)\nMATCH ()-[t2:played_as]->(`t3`:`rolee`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`role_id` = `t3`.`role_id`\nAND `t2`.`match_id` = `t4`.`match_id`\nAND (`t1`.`player_name` = 'SC Ganguly' AND `t4`.`match_date` = localdatetime('2008-04-18T00:00:00'))\nRETURN `t2`.`role_id` AS `role_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the role of SC Ganguly in the match on 2008/4/18?",
    "evidence": "role refers to of Role_Id; SC Ganguly refers to Player_Name = 'SC Ganguly'; on 2008/4/18 refers to Match_Date = '2008-04-18'",
    "idx": 1228
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->(`t3`:`match`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`match_id` = `t3`.`match_id`\nAND (`t1`.`player_name` = 'SC Ganguly')\nRETURN MAX(`t3`.`win_margin`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the matches SC Ganguly has played in, what is the highest winning margin?",
    "evidence": "SC Ganguly refers to Player_Name = 'SC Ganguly'; the highest winning margin refers to max(Win_Margin)",
    "idx": 1229
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->(`t3`:`match`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`match_id` = `t3`.`match_id`\nAND (`t1`.`player_name` = 'SC Ganguly')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(`t3`.`win_margin`)) / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average winning margin of all the matches SC Ganguly has played in?",
    "evidence": "SC Ganguly refers to Player_Name = 'SC Ganguly'; the average winning margin = divide(sum(Win_Margin), count(Match_Id)) where Player_Name = 'SC Ganguly'",
    "idx": 1230
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nORDER BY `player`.`dob` IS NULL ASC, `player`.`dob` DESC \nRETURN `player`.`player_name` AS `player_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the youngest player.",
    "evidence": "name of player refers to Player_Name; the youngest refers to max(DOB)",
    "idx": 1231
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "CALL(*) {\nMATCH (`team_sub0`:`team`)\nWHERE `team_sub0`.`team_name` = 'Sunrisers Hyderabad'\nRETURN `team_sub0`.`team_id` AS `team_id`  \n}\nMATCH (`match`:`match`)\nRETURN sum(CASE  WHEN `match`.`toss_winner` = `team_id` THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times has Sunrisers Hyderabad been the toss winner of a game?",
    "evidence": "Sunrisers Hyderabad refers to Team_Name = 'Sunrisers Hyderabad'; time of toss winner refers to count(Toss_Winner)",
    "idx": 1232
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)\nMATCH (`t1`:`ball_by_ball`)\nWHERE `t1`.`striker` = `t2`.`player_id`\nAND (`t1`.`match_id` = 419169 AND `t1`.`over_id` = 3 AND `t1`.`ball_id` = 2 AND `t1`.`innings_no` = 2)\nRETURN `t2`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the striker in the match no. 419169, over no.3, ball no.2, inning no.2.",
    "evidence": "name of the striker refers to Player_Name; match no. 419169 refers to Match_Id = 419169; over no.3 refers to Over_Id = 3; ball no.2 refers to Ball_Id = 2; inning no.2 refers to Innings_No = 2",
    "idx": 1233
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND (`t1`.`win_margin` = 138)\nRETURN `t2`.`venue_name` AS `venue_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of venue for the game with a win margin of 138 points.",
    "evidence": "name of venue refers to Venue_Name; a win margin of 138 points refers to Win_Margin = 138",
    "idx": 1234
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t1`:`player`)\nWHERE `t1`.`player_id` = `t2`.`man_of_the_match`\nAND (`t2`.`match_date` = localdatetime('2008-05-12T00:00:00'))\nRETURN `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the game on 2008/5/12, who was the man of the match?",
    "evidence": "on 2008/5/12 refers to Match_Date = '2008-05-12'; name refers to Player_Name;",
    "idx": 1235
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`season`)\nMATCH (`t2`:`player`)\nWHERE `t1`.`man_of_the_series` = `t2`.`player_id`\nAND (`t1`.`season_year` = 2013)\nRETURN `t2`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who was the man of the series in 2013? Give the full name.",
    "evidence": "full name refers to Player_Name; in 2013 refers to Season_Year = 2013",
    "idx": 1237
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`season`)\nMATCH (`t2`:`player`)\nWHERE `t1`.`man_of_the_series` = `t2`.`player_id`\nAND (`t1`.`season_year` = 2014 AND NOT `t1`.`orange_cap` IS NULL)\nRETURN `t2`.`dob` AS `dob`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the date of birth of the 2014 Orange Cap winner.",
    "evidence": "date of birth refers to DOB; 2014 refers to Season_Year = 2014; Orange Cap winner refers to Orange_Cap IS NOT NULL",
    "idx": 1238
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`season`)\nMATCH (`t2`:`player`)-[from_country_0:from_country]->(`t3`:`country`)\nWHERE `t1`.`man_of_the_series` = `t2`.`player_id`\nAND `t2`.`country_name` = `t3`.`country_id`\nAND (`t1`.`season_id` = 7 AND NOT `t1`.`purple_cap` IS NULL)\nRETURN `t3`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the nationality of the 7th season Purple Cap winner?",
    "evidence": "nationality refers to Country_Name; the 7th season refers to Season_Id = 7; Purple Cap winner refers to Purple_Cap IS NOT NULL",
    "idx": 1239
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND (`t1`.`city_name` = 'Ranchi')\nRETURN `t2`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country does Ranchi city belong to?",
    "evidence": "country refers to Country_Name; Ranchi city refers to City_Name = 'Ranchi'",
    "idx": 1240
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nRETURN sum(CASE  WHEN `t2`.`country_name` = 'India' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Indian cities are there in the database?",
    "evidence": "Indian refers to Country_Name = 'India'",
    "idx": 1241
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_batting_style_0:has_batting_style]->(`t2`:`batting_style`)\nWHERE `t1`.`batting_hand` = `t2`.`batting_id`\nAND (`t1`.`player_name` = 'MK Pandey')\nRETURN `t2`.`batting_hand` AS `batting_hand`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the batting hand of MK Pandey?",
    "evidence": "MK Pandey refers to Player_Name = 'MK Pandey'",
    "idx": 1242
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nRETURN CASE WHEN sum(CASE  WHEN `t2`.`country_name` = 'South Africa' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`country_name` = 'India' THEN 1 ELSE 0 END)) / sum(CASE  WHEN `t2`.`country_name` = 'South Africa' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the database, how many times is the number of Indian cities to the South African cities?",
    "evidence": "Indian refers to Country_Name = 'India'; South African refers to Country_Name = 'South Africa'; how many times = divide(count(City_Id where Country_Name = 'India'), count(City_Id where Country_Name = 'South Africa'))",
    "idx": 1243
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nRETURN sum(CASE  WHEN `t2`.`venue_name` = 'M Chinnaswamy Stadium' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t2`.`venue_name` = 'Maharashtra Cricket Association Stadium' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times does M Chinnaswamy Stadium host games than Maharashtra Cricket Association Stadium?",
    "evidence": "M Chinnaswamy Stadium refers to Venue_Name = 'M Chinnaswamy Stadium'; Maharashtra Cricket Association Stadium refers to Venue_Name = 'Maharashtra Cricket Association Stadium'; how many times = divide(count(Match_Id where Venue_Name = 'M Chinnaswamy Stadium'), count(Match_Id where Venue_Name = 'Maharashtra Cricket Association Stadium'))",
    "idx": 1244
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nORDER BY `player`.`dob` IS NULL DESC, `player`.`dob`  \nRETURN `player`.`player_name` AS `player_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the oldest player?",
    "evidence": "name of the player refers to Player_Name; the oldest refers to min(DOB)",
    "idx": 1245
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`dob` >= localdatetime('1990-01-01T00:00:00') AND `player`.`dob` <= localdatetime('1999-12-31T00:00:00')\nRETURN COUNT(`player`.`player_id`) AS `cnt`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players were born in the 90s?",
    "evidence": "born in the 90s refers to DOB > = '1990-01-01' AND DOB < = '1999-12-31'",
    "idx": 1246
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`season`:`season`)\nWITH `season`.`orange_cap` AS _groupby_col_0, COUNT(`season`.`season_year`) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `orange_cap`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the id of the player who won the Orange Cap for 2 consecutive seasons.",
    "evidence": "id of the player who won the Orange Cap refers to Orange_Cap; for 2 consecutive seasons refers to count(Season_Year) > 1",
    "idx": 1247
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE `match`.`season_id` = 7\nRETURN COUNT(`match`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches were played in Season 7?",
    "evidence": "Season 7 refers to Season_Id = 7",
    "idx": 1248
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`umpire`)-[from_country_0:from_country]->(`t1`:`country`)\nWHERE `t1`.`country_id` = `t2`.`umpire_country`\nRETURN sum(CASE  WHEN `t1`.`country_name` = 'South Africa' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many umpires are from South Africa?",
    "evidence": "South Africa refers to Country_Name = 'South Africa'",
    "idx": 1249
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)\nMATCH (`t2`:`season`)\nWHERE `t1`.`player_id` = `t2`.`orange_cap`\nRETURN sum(CASE  WHEN `t1`.`player_name` = 'CH Gayle' THEN 1 ELSE 0 END) AS `cnt`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Orange Cap awards were won by CH Gayle?",
    "evidence": "CH Gayle refers to Player_Name = 'CH Gayle'",
    "idx": 1250
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "CALL(*) {\nMATCH (`match_sub0`:`match`)\nWHERE `match_sub0`.`season_id` = 1\nWITH `match_sub0`.`match_winner` AS _groupby_col_0, COUNT(`match_sub0`.`match_winner`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `match_winner` ORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nLIMIT 1\n}\nMATCH (`team`:`team`)\nWHERE `team`.`team_id` = `match_winner`\nRETURN `team`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the team that won the most number of matches in season 1?",
    "evidence": "name of the team refers to Team_Name; the most number of matches refers to max(count(Match_Winner)); season 1 refers to season_Id = 1",
    "idx": 1251
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "CALL(*) {\nMATCH (`match_sub0`:`match`)\nORDER BY `match_sub0`.`match_date` IS NULL DESC, `match_sub0`.`match_date`  \nRETURN `match_sub0`.`man_of_the_match` AS `man_of_the_match`  LIMIT 1\n}\nMATCH (`player`:`player`)\nWHERE `player`.`player_id` = `man_of_the_match`\nRETURN `player`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the player who won the first ever \"man of the match\" award?",
    "evidence": "name of the player refers to Player_Name; the first ever refers to min(match_date); \"man of the match\" award refers to Player_Id in 'Man_of_the_Match'",
    "idx": 1252
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[has_batting_style_0:has_batting_style]->(`t1`:`batting_style`)\nMATCH (`t2`:`player`)-[from_country_0:from_country]->(`t3`:`country`)\nWHERE `t1`.`batting_id` = `t2`.`batting_hand`\nAND `t2`.`country_name` = `t3`.`country_id`\nAND (`t3`.`country_name` = 'India')\nRETURN sum(CASE  WHEN `t1`.`batting_hand` = 'Left-hand bat' THEN 1 ELSE 0 END) AS `cnt`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players with left-hand batting style are from India?",
    "evidence": "left-hand batting style refers to Batting_hand = 'Left-hand bat'; India refers to Country_Name = 'India'",
    "idx": 1253
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[has_batting_style_0:has_batting_style]->(`t1`:`batting_style`)\nWHERE `t2`.`batting_hand` = `t1`.`batting_id`\nRETURN CASE WHEN COUNT(`t2`.`player_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`batting_hand` = 'Right-hand bat' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`player_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of all right-handed batting players among all the other players?",
    "evidence": "right-handed batting refers to Batting_hand = 'Right-hand bat'; percentage = divide(count(Player_Id where Batting_hand = 'Right-hand bat'), count(Player_Id)) * 100%",
    "idx": 1254
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`dob` = localdatetime('1981-07-07T00:00:00')\nRETURN `player`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the player who is born on July 7, 1981.",
    "evidence": "name of the player refers to Player_Name; born on July 7 1981 refers to DOB = '1981-07-07'",
    "idx": 1255
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH ()-[player_match:played_in]->()\nRETURN sum(CASE  WHEN `player_match`.`player_id` = 2 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches were played by the player with player ID 2?",
    "evidence": "player ID 2 refers to Player_Id = 2",
    "idx": 1256
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[involves_team_0:involves_team]->(`t2`:`team`)\nWHERE `t2`.`team_id` = `t1`.`team_1`\nORDER BY `t1`.`win_margin` IS NULL ASC, `t1`.`win_margin` DESC \nRETURN `t2`.`team_name` AS `team_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the first team's name in the match with the highest winning margin.",
    "evidence": "team's name refers to Team_Name; first team refers to Team_Id = Team_1; the highest winning margin refers to max(Win_Margin)",
    "idx": 1257
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t3`:`country`)\nMATCH (`t1`:`venue`)-[located_in_0:located_in]->(`t2`:`city`)\nWHERE `t2`.`city_id` = `t1`.`city_id`\nAND `t3`.`country_id` = `t2`.`country_id`\nAND (`t1`.`venue_name` = 'St George\\'s Park')\nRETURN `t3`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the country where St. George's Park is located.",
    "evidence": "country refers to Country_Name; St. George's Park refers to Venue_Name = 'St George''s Park'",
    "idx": 1258
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH ()-[t2:has_player]->(`t1`:`player`)\nMATCH (`t3`:`team`)-[t2:had_player]->()\nWHERE `t2`.`player_id` = `t1`.`player_id`\nAND `t3`.`team_id` = `t2`.`team_id`\nAND (`t2`.`match_id` = 335990 AND `t3`.`team_name` = 'Mumbai Indians')\nWITH `t3`.`team_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the player's name of Mumbai Indians in the match ID 335990.",
    "evidence": "Mumbai Indians refers to Team_Name = 'Mumbai Indians'; match ID 335990 refers to Match_Id = 335990",
    "idx": 1259
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND (`t2`.`match_date` = localdatetime('2009-05-07T00:00:00') AND `t2`.`win_margin` = 7)\nRETURN `t1`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the winning team's name in the match with the point of winning margin of 7 on May 7, 2009.",
    "evidence": "the winning team refers to Team_Id = Match_Winner; the point of winning margin of 7 refers to Win_Margin = 7; on May 7 2009 refers to Match_Date = '2009-05-07'",
    "idx": 1260
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`outcome`)\nMATCH (`t1`:`match`)\nWHERE `t2`.`outcome_id` = `t1`.`outcome_type`\nRETURN sum(CASE  WHEN `t2`.`outcome_type` = 'Superover' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the matches are Superover?",
    "evidence": "Superover refers to Outcome_Type = 'Superover'",
    "idx": 1261
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`city`)\nWHERE `t2`.`country_id` = `t1`.`country_id`\nAND (`t2`.`country_name` = 'U.A.E')\nRETURN `t1`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the cities located in U.A.E.",
    "evidence": "city refers to City_Name; U.A.E refers to Country_Name = 'U.A.E'",
    "idx": 1262
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_by_0:won_by]->(`t2`:`team`)\nWHERE `t2`.`team_id` = `t1`.`match_winner`\nRETURN sum(CASE  WHEN `t2`.`team_name` = 'Pune Warriors' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of won matches of the team named \"Pune Warriors\"?",
    "evidence": "the team named \"Pune Warriors\" refers to Team_Name = 'Pune Warriors'; the total number of won matches = count(Team_Name where Team_Id = Match_Winner)",
    "idx": 1263
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_by_0:won_by]->(`t2`:`team`)\nWHERE `t2`.`team_id` = `t1`.`match_winner`\nAND (toString(`t1`.`match_date`) =~ '(?i)(?s)2015.*' AND `t1`.`match_id` = 829768)\nRETURN `t2`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the matches held in 2015, who is the winning team in the match ID 829768?",
    "evidence": "in 2015 refers to Match_Date LIKE '2015%'; the winning team refers to Team_Id = Match_Winner; match ID 829768 refers to Match_Id = 829768",
    "idx": 1264
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH ()-[t2:has_player]->(`t1`:`player`)\nMATCH (`t3`:`rolee`)-[t2:was_played_by]->()\nWHERE `t2`.`player_id` = `t1`.`player_id`\nAND `t3`.`role_id` = `t2`.`role_id`\nAND (`t2`.`match_id` = 335992 AND `t1`.`player_name` = 'K Goel')\nRETURN `t3`.`role_desc` AS `role_desc`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the role of K Goel in the match ID 335992?",
    "evidence": "role refers to Role_Desc; K Goel refers to Player_Name = 'K Goel'; match ID 335992 refers to Match_Id = 335992",
    "idx": 1265
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`city`)\nWHERE `t2`.`country_id` = `t1`.`country_id`\nRETURN sum(CASE  WHEN `t2`.`country_name` = 'South Africa' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cities are located in South Africa?",
    "evidence": "South Africa refers to Country_Name = 'South Africa'",
    "idx": 1266
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)\nWHERE `t2`.`venue_id` = `t1`.`venue_id`\nRETURN sum(CASE  WHEN `t2`.`venue_name` = 'Newlands' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches were held at the venue named \"Newlands\"?",
    "evidence": "the venue named \"Newlands\" refers to Venue_Name = 'Newlands'",
    "idx": 1267
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[involves_team_0:involves_team]->(`t2`:`team`)\nMATCH (`t1`:`match`)-[involves_team_1:involves_team]->(`t3`:`team`)\nWHERE `t2`.`team_id` = `t1`.`team_1`\nAND `t3`.`team_id` = `t1`.`team_2`\nAND ((`t2`.`team_name` = 'Mumbai Indians' AND `t3`.`team_name` = 'Royal Challengers Bangalore' AND `t1`.`match_date` = localdatetime('2008-05-28T00:00:00')) OR (`t2`.`team_name` = 'Royal Challengers Bangalore' AND `t3`.`team_name` = 'Mumbai Indians' AND `t1`.`match_date` = localdatetime('2008-05-28T00:00:00')))\nRETURN `t1`.`win_margin` AS `win_margin`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the point of the winning margin in a match between Mumbai Indians and Royal Challengers Bangalore on May 28, 2008.",
    "evidence": "point of the winning margin refers to Win_Margin; Mumbai Indians refers to Team_Name = 'Mumbai Indians'; Royal Challengers Bangalore refers to Team_Name = 'Royal Challengers Bangalore'; on May 28 2008 refers to Match_Date = '2008-05-28'",
    "idx": 1268
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH ()-[t2:played_as]->(`t1`:`rolee`)\nMATCH (`t3`:`player`)-[t2:played_in]->()\nWHERE `t2`.`role_id` = `t1`.`role_id`\nAND `t3`.`player_id` = `t2`.`player_id`\nAND (toString(`t3`.`dob`) =~ '(?i)(?s)1977.*')\nRETURN CASE WHEN COUNT(`t1`.`role_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`role_desc` = 'Captain' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`role_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players born in 1977, what is the percentage of the players with a role as a captain?",
    "evidence": "born in 1977 refers to DOB LIKE '1977%'; a role as a captain refers to Role_Desc = 'Captain'; percentage = divide(count(Role_Id where Role_Desc = 'Captain'), count(Role_Id)) * 100% where DOB LIKE '1977%'",
    "idx": 1269
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`ball_by_ball`:`ball_by_ball`)\nWHERE `ball_by_ball`.`match_id` = 335996 AND `ball_by_ball`.`innings_no` = 1\nRETURN COUNT(`ball_by_ball`.`over_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many overs were there in the first innings of match ID \"335996\"?",
    "evidence": "the first innings refers to Innings_No = 1; match ID \"335996\" refers to Match_Id = 335996",
    "idx": 1270
  }
]