[
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'Liwen Xiong' AND `t3`.`year` = 2015)\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What papers has Liwen Xiong written in 2015",
    "evidence": "",
    "idx": 679
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'TAIL' AND `t4`.`venuename` = 'NIPS')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What TAIL paper published in NIPS ?",
    "evidence": "",
    "idx": 695
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'TAIL' AND `t4`.`venuename` = 'NIPS')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the papers in NIPS about TAIL ?",
    "evidence": "",
    "idx": 697
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Mark Steedman')\nRETURN `t2`.`paperid` AS `paperid`   } AS in_collect_0\nMATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` <> 'Mark Steedman' AND `t2`.`paperid` IN in_collect_0)\nRETURN DISTINCT COUNT(DISTINCT `t1`.`authorid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many co-authors has Mark Steedman had ?",
    "evidence": "",
    "idx": 704
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t2:has_keyphrase]->()\nWHERE `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Christof Dallermassl' AND `t3`.`year` = 2000)\nRETURN DISTINCT `t2`.`keyphraseid` AS `keyphraseid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "keyphrases used by Christof Dallermassl in 2000",
    "evidence": "",
    "idx": 705
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nMATCH ()-[t3:cites]->()\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`citedpaperid`\nWITH `t1`.`authorname` AS _groupby_col_0, COUNT(`t3`.`citingpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `authorname`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what author is most cited ?",
    "evidence": "",
    "idx": 709
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'mohammad rastegari' AND `t3`.`journalid` >= 0)\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "journal articles by mohammad rastegari",
    "evidence": "",
    "idx": 710
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2014 AND `t2`.`venuename` = 'TACL')\nWITH `t1`.`paperid` AS _groupby_col_0, COUNT(DISTINCT `t3`.`citingpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `paperid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "best paper in TACL 2014 ?",
    "evidence": "",
    "idx": 712
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2014 AND `t2`.`venuename` = 'TACL')\nWITH `t1`.`paperid` AS _groupby_col_0, COUNT(DISTINCT `t3`.`citingpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `paperid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What was the best paper at TACL 2014 ?",
    "evidence": "",
    "idx": 713
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t2`.`year` = 2016 AND `t3`.`venuename` = 'acl')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who published at acl 2016 ?",
    "evidence": "",
    "idx": 714
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t2`.`year` = 2016 AND `t3`.`venuename` = 'acl')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who had papers at acl 2016 ?",
    "evidence": "",
    "idx": 719
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'Multiuser Receiver in the Decision Feedback' AND `t3`.`year` = 2016)\nWITH `t3`.`paperid` AS _groupby_col_0, COUNT(DISTINCT `t1`.`keyphrasename`) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN DISTINCT _groupby_col_0 AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were written on Multiuser Receiver in the Decision Feedback this year ?",
    "evidence": "",
    "idx": 721
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nMATCH ()-[t3:cites]->()\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`citingpaperid`\nAND (`t1`.`authorname` = 'Mirella Lapata')\nRETURN DISTINCT COUNT(`t3`.`citedpaperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers did Mirella Lapata cite ?",
    "evidence": "",
    "idx": 722
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nMATCH ()-[t3:cites]->()\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`citingpaperid`\nAND (`t1`.`authorname` = 'Mirella Lapata')\nRETURN DISTINCT COUNT(`t3`.`citedpaperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many papers has Mirella Lapata cited ?",
    "evidence": "",
    "idx": 724
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Michael Stonebraker' AND `t4`.`venuename` = 'VLDB')\nRETURN DISTINCT `t3`.`year` AS `year` ORDER BY `t3`.`year` IS NULL DESC, `t3`.`year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When does Michael Stonebraker publish the first VLDB paper ?",
    "evidence": "",
    "idx": 725
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Peter Mertens')\nRETURN DISTINCT `t3`.`journalid` AS `journalid`, `t4`.`venueid` AS `venueid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where does Peter Mertens publish ?",
    "evidence": "",
    "idx": 726
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Peter Mertens')\nRETURN DISTINCT `t3`.`journalid` AS `journalid`, `t4`.`venueid` AS `venueid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "in what venues does Peter Mertens publish ?",
    "evidence": "",
    "idx": 727
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'nature communications')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many papers appeared at nature communications last year",
    "evidence": "",
    "idx": 729
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'nature communications')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were at nature communications 2015 ?",
    "evidence": "",
    "idx": 730
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'nature communications')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were published in nature communications in 2015 ?",
    "evidence": "",
    "idx": 732
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'nature communications')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers on nature communications in 2015 ?",
    "evidence": "",
    "idx": 733
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'nature communications')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were accepted at nature communications 2015 ?",
    "evidence": "",
    "idx": 735
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'nature communications')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers are presented in nature communications 2015 ?",
    "evidence": "",
    "idx": 736
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'nature communications')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers published in nature communications in 2015 ?",
    "evidence": "",
    "idx": 737
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'nature communications')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many papers published in nature communications 2015 ?",
    "evidence": "",
    "idx": 738
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'nature communications')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were published in nature communications 2015 conference ?",
    "evidence": "",
    "idx": 739
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'convolutional neural networks' AND `t3`.`year` = 2016)\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were written on convolutional neural networks in the past year ?",
    "evidence": "",
    "idx": 741
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'convolutional neural networks' AND `t3`.`year` = 2016)\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were published on convolutional neural networks in 2016 ?",
    "evidence": "",
    "idx": 742
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'convolutional neural networks' AND `t3`.`year` = 2016)\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were written on convolutional neural networks in 2016 ?",
    "evidence": "",
    "idx": 743
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'convolutional neural networks' AND `t3`.`year` = 2016)\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were written on the convolutional neural networks this year ?",
    "evidence": "",
    "idx": 744
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'convolutional neural networks' AND `t3`.`year` = 2016)\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many papers on convolutional neural networks have been published in the past year ?",
    "evidence": "",
    "idx": 745
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'NIPS')\nWITH `t1`.`year` AS _groupby_col_0, COUNT(`t1`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which year had the most NIPS papers ?",
    "evidence": "",
    "idx": 747
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'NIPS')\nWITH `t1`.`year` AS _groupby_col_0, COUNT(`t1`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what year had the most NIPS papers ?",
    "evidence": "",
    "idx": 748
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'NIPS')\nWITH `t1`.`year` AS _groupby_col_0, COUNT(`t1`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what year had the most number of NIPS papers ?",
    "evidence": "",
    "idx": 749
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'NIPS')\nWITH `t1`.`year` AS _groupby_col_0, COUNT(`t1`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "when were most NIPS papers published ?",
    "evidence": "",
    "idx": 750
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paperdataset`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'jitendra malik')\nRETURN DISTINCT `t2`.`datasetid` AS `datasetid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what datasets did jitendra malik use ?",
    "evidence": "",
    "idx": 765
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paperdataset`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'jitendra malik')\nRETURN DISTINCT `t2`.`datasetid` AS `datasetid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what datasets did jitendra malik use in his papers ?",
    "evidence": "",
    "idx": 767
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paperdataset`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'jitendra malik')\nRETURN DISTINCT `t2`.`datasetid` AS `datasetid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what datasets were used by jitendra malik ?",
    "evidence": "",
    "idx": 768
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paperdataset`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'jitendra malik')\nRETURN DISTINCT `t2`.`datasetid` AS `datasetid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "datasets used in papers written by jitendra malik ?",
    "evidence": "",
    "idx": 769
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'deep learning')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`, `t3`.`year` AS `year` ORDER BY `t3`.`year` IS NULL ASC, `t3`.`year` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "recent deep learning papers",
    "evidence": "",
    "idx": 772
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'jamie callan')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`, `t3`.`year` AS `year` ORDER BY `t3`.`year` IS NULL DESC, `t3`.`year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "jamie callan 's publications by year",
    "evidence": "",
    "idx": 785
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'jamie callan')\nWITH `t3`.`year` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers does jamie callan publish each year ?",
    "evidence": "",
    "idx": 786
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'jamie callan')\nWITH `t3`.`year` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many papers jamie callan published each year ?",
    "evidence": "",
    "idx": 788
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:cites]->()\nMATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t3`.`paperid` = `t4`.`citingpaperid`\nAND `t2`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'oren etzioni')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who does oren etzioni cite",
    "evidence": "",
    "idx": 789
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:cites]->()\nMATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t3`.`paperid` = `t4`.`citingpaperid`\nAND `t2`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Daniel Jurafsky')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "papers citing Daniel Jurafsky",
    "evidence": "",
    "idx": 791
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:cites]->()\nMATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t3`.`paperid` = `t4`.`citingpaperid`\nAND `t2`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Daniel Jurafsky')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What papers cite Daniel Jurafsky ?",
    "evidence": "",
    "idx": 792
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:cites]->()\nMATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t3`.`paperid` = `t4`.`citingpaperid`\nAND `t2`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Daniel Jurafsky')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which papers cite Daniel Jurafsky ?",
    "evidence": "",
    "idx": 793
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'instance segmentation' AND `t3`.`journalid` >= 0)\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "journal papers for instance segmentation",
    "evidence": "",
    "idx": 795
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'semantic parsing' AND `t4`.`year` > 2005)\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who has the most papers in semantic parsing after 2005 ?",
    "evidence": "",
    "idx": 796
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'semantic parsing' AND `t4`.`year` > 2005)\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who has written the most papers on semantic parsing since 2005 ?",
    "evidence": "",
    "idx": 797
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'semantic parsing' AND `t4`.`year` > 2005)\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who published the most in semantic parsing after 2005 ?",
    "evidence": "",
    "idx": 798
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'character recognition' AND `t3`.`year` < 2010)\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "character recognition papers earlier than 2010",
    "evidence": "",
    "idx": 799
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t2:has_keyphrase]->()\nWHERE `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'oren etzioni')\nWITH `t2`.`keyphraseid` AS _groupby_col_0, COUNT(`t2`.`keyphraseid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `keyphraseid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what topics does oren etzioni write about most ?",
    "evidence": "",
    "idx": 804
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t3`.`paperid` = `t4`.`citedpaperid`\nAND (`t1`.`keyphrasename` = 'parsing')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "most cited papers on parsing",
    "evidence": "",
    "idx": 805
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t3`.`paperid` = `t4`.`citedpaperid`\nAND (`t1`.`keyphrasename` = 'parsing')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the paper about parsing of the most citation ?",
    "evidence": "",
    "idx": 809
  }
]