[
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`x` = 5 AND `t1`.`y` = 5)\nRETURN `t2`.`obj_class` AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the object classes of the images that have a (5,5) coordinate.",
    "evidence": "object classes refer to OBJ_CLASS; (5,5) coordinates refer to X and Y coordinates of the bounding box where X = 5 and Y = 5;",
    "idx": 5771
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t2:has_attribute]->(`t1`:`att_classes`)\nMATCH (`t3`:`img_obj`)-[has_object_class_0:has_object_class]->(`t4`:`obj_classes`)\nWHERE `t1`.`att_class_id` = `t2`.`att_class_id`\nAND `t2`.`img_id` = `t3`.`img_id`\nAND `t3`.`obj_class_id` = `t4`.`obj_class_id`\nAND (`t1`.`att_class` = 'horse' AND `t4`.`obj_class` = 'fur')\nRETURN `t3`.`x` AS `x`, `t3`.`y` AS `y`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the x-coordinate and y-coordinate of the image with an attribute class of ''horse\" and an object class of \"fur\".",
    "evidence": "attribute class of \"horse\" refers to ATT_CLASS = 'horse'; object class of \"fur\" refers to OBJ_CLASS = 'fur';",
    "idx": 5775
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`pred_classes`)\nMATCH ()-[t1:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t2`.`pred_class` = 'reading')\nRETURN COUNT(`t1`.`img_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For those objects that have multiple relations, how many images have a prediction class of \"reading\"?",
    "evidence": "prediction class of \"reading\" refers to PRED_CLASS = 'reading'; if two objects (OBJ1_SAMPLE_ID,\nOBJ2_SAMPLE_ID) has\nmultiple PRED_CLASS_ID, it\nmeans these two objects\nhave multiple relations;",
    "idx": 5777
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t3`:`img_obj`)\nMATCH ()-[t2:has_attribute]->(`t1`:`att_classes`)\nWHERE `t1`.`att_class_id` = `t2`.`att_class_id`\nAND `t2`.`img_id` = `t3`.`img_id`\nAND (`t3`.`x` = 5 AND `t3`.`y` = 5)\nRETURN `t1`.`att_class` AS `att_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the attribute classes of the images that have a (5,5) coordinate.",
    "evidence": "attribute classes refer to ATT_CLASS; (5,5) coordinate refers to X and Y coordinates of the bounding box where X = 5 and Y = 5;",
    "idx": 5780
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`obj_class` = 'keyboard')\nRETURN avg(`t1`.`img_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average number of images with an attribute class of \"keyboard\".",
    "evidence": "AVG(IMG_ID) where OBJ_CLASS = 'keyboard';",
    "idx": 5781
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nRETURN CASE WHEN COUNT(CASE  WHEN `t2`.`obj_class` = 'person' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t2`.`obj_class` = 'man' THEN 1 ELSE 0 END)) / COUNT(CASE  WHEN `t2`.`obj_class` = 'person' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the ratio of the total number of images with an object class of \"man\" and \"person\".",
    "evidence": "DIVIDE(COUNT(IMG_ID where OBJ_CLASS = 'man'), COUNT(IMG_ID where OBJ_CLASS = 'person'));",
    "idx": 5782
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`img_obj`:`img_obj`)\nWHERE `img_obj`.`img_id` = 17 AND `img_obj`.`x` = 0 AND `img_obj`.`y` = 0\nRETURN `img_obj`.`obj_sample_id` AS `obj_sample_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the object sample IDs of image ID 17 with coordinates (0,0).",
    "evidence": "object sample ID refers to OBJ_SAMPLE_ID; image ID 17 refers to IMG_ID = 17; coordinates (0,0) refer to X and Y coordinates of the bounding box where X = 0 and Y = 0;",
    "idx": 5783
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`img_obj`:`img_obj`)\nWHERE `img_obj`.`obj_sample_id` = 2\nRETURN `img_obj`.`w` AS `w`, `img_obj`.`h` AS `h`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all bounding box widths and heights of object sample ID 2.",
    "evidence": "The bounding box's W and H abbreviations stand for the object's width and height respectively; object sample ID 2 refers to OBJ_SAMPLE_ID = 2;",
    "idx": 5784
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 36 AND `t1`.`x` = 0 AND `t1`.`y` = 0)\nRETURN `t2`.`obj_class` AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the object classes of image ID 36 with coordinates (0,0).",
    "evidence": "object classes of image ID 36 refers to OBJ_CLASS where IMG_ID = 36; coordinates (0,0) refer to X and Y coordinates of the bounding box where X = 0 and Y = 0;",
    "idx": 5787
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`obj_class` = 'pizza')\nRETURN `t1`.`img_id` AS `img_id`, `t1`.`x` AS `x`, `t1`.`y` AS `y`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write 10 coordinates with the object class \"pizza.\"",
    "evidence": "coordinates for the object refer to X, Y, W and H coordinates of the bounding box; object class \"pizza\" refers to OBJ_CLASS = 'pizza';",
    "idx": 5788
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 22)\nRETURN `t1`.`w` AS `w`, `t1`.`h` AS `h`, `t2`.`obj_class` AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the object classes of image ID 22 alongside the object's width and height.",
    "evidence": "object classes of image ID 22 refers to OBJ_CLASS where IMG_ID = 22; the object's width and heigh refer to W and H coordinates of the bounding box respectively;",
    "idx": 5790
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`pred_classes`)\nMATCH ()-[t1:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t1`.`img_id` = 4434)\nRETURN `t2`.`pred_class` AS `pred_class` ORDER BY `t2`.`pred_class` IS NULL ASC, `t2`.`pred_class` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the most common predicate class of image ID 4434.",
    "evidence": "the most common predicate class of image ID 4434 MAX(PRED_CLASS) where IMG_ID = 4434;",
    "idx": 5793
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 1764 AND `t2`.`obj_class` = 'dress')\nRETURN `t1`.`x` AS `x`, `t1`.`y` AS `y`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the number of 'dress' object classes and include their X and Y coordinates in image ID 1764.",
    "evidence": "dress' object classes refer to OBJ_CLASS = 'dress'; image ID 1764 refers to IMG_ID = 1764; X and Y refer to coordinates of the bounding box;",
    "idx": 5794
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t3`:`img_obj`)\nMATCH ()-[t2:has_attribute]->(`t1`:`att_classes`)\nWHERE `t1`.`att_class_id` = `t2`.`att_class_id`\nAND `t2`.`img_id` = `t3`.`img_id`\nAND (`t3`.`img_id` = 23 AND `t1`.`att_class` = 'cast')\nRETURN `t3`.`obj_sample_id` AS `obj_sample_id`, `t3`.`x` AS `x`, `t3`.`y` AS `y`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the X and Y coordinates of the sample object of image ID 23 that has the 'cast' attribute class.",
    "evidence": "X and Y refer to coordinates of the bounding box; image ID 23 refers to IMG_ID = 23; 'cast' attribute class refers to ATT_CLASS = 'cast';",
    "idx": 5795
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 47)\nWITH `t2`.`obj_class` AS _groupby_col_0, avg(`t1`.`w`) AS _groupby_col_1, avg(`t1`.`h`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `obj_class`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average width and height of the objects in image ID 47? List their object classes as well.",
    "evidence": "The bounding box's W and H abbreviations stand for the object's width and height in which average width and height refer to AVG(W) and AVG(H) respectively; image ID 47 refers to IMG_ID = 47; object classes refer to OBJ_CLASS;",
    "idx": 5797
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`birthyear` = '1990' AND `master`.`birthcountry` <> 'USA'\nRETURN `master`.`firstname` AS `firstname`, `master`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the first Name and last name of all players not from USA and who are born in 1990 .",
    "evidence": "Not from USA refers to birthCountry! = 'USA'; born in 1990 refers to birthYear = 1990\n",
    "idx": 5798
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`shootcatch` IS NULL AND `master`.`pos` = 'F'\nRETURN `master`.`namegiven` AS `namegiven`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all players' given name who are good at both left and right hand and playing the forward position.",
    "evidence": "good at both left and right hand refers to shootCatch IS NULL;  playing the forward position refers to pos = 'F'",
    "idx": 5799
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`hofid` IS NULL\nRETURN `master`.`firstname` AS `firstname`, `master`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who are the players who were not in the Hall of Fame list.",
    "evidence": "not in the Hall of Fame refers to hofID IS NULL",
    "idx": 5800
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`deathyear` IS NULL\nRETURN `master`.`namegiven` AS `namegiven`, `master`.`namegiven` AS `namegiven_1`, `master`.`birthyear` AS `birthyear`, `master`.`birthmon` AS `birthmon`, `master`.`birthday` AS `birthday` ORDER BY `birthyear` IS NULL ASC, `birthyear` DESC, `birthmon` IS NULL ASC, `birthmon` DESC, `birthday` IS NULL ASC, `birthday` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the youngest player who is still living. State the given name and date of birth.",
    "evidence": "still living refers to deathYear IS NULL; youngest refers to MAX(birthYear,birthMon,birthDay)",
    "idx": 5801
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`shootcatch` IS NULL AND NOT `master`.`deathyear` IS NULL\nRETURN `master`.`firstname` AS `firstname`, `master`.`lastname` AS `lastname`, toFloat(`master`.`deathyear`) - toFloat(`master`.`birthyear`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all the deceased players who are good at both left and right hand, list the player's name and the age when he died.",
    "evidence": "age when he died refers to SUBTRACT(deathYear,birthYear); deceased refers to deathYear IS NOT NULL; good at both left and right hand refers to shootCatch IS NULL",
    "idx": 5802
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`height` > '72'\nRETURN avg(toFloat(`master`.`weight`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average weight of players who have height greater than 72 inches.",
    "evidence": "average weight refers to AVG(weight); height greater than 72 inches refers to height>72",
    "idx": 5803
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t2`.`playerid` = `t1`.`playerid`\nAND (NOT `t1`.`deathyear` IS NULL)\nRETURN `t1`.`playerid` AS `playerid`, `t2`.`year` AS `year`, `t2`.`min` AS `min` ORDER BY `t2`.`min` IS NULL ASC, `t2`.`min` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all deceased goalies by last name. List the season where he had the most time played.",
    "evidence": "deceased refers to deathYear; most time played refers to MAX(Min)",
    "idx": 5804
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`eng` >= '10')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all goalies with 10 or more empty net goals. Name the players and season where he played.",
    "evidence": "10 or more empty net goals refers to ENG> = 10; season refers to year",
    "idx": 5805
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (NOT CASE WHEN toFloat(toFloat(`t2`.`sa`))=0 THEN NULL ELSE toFloat(toFloat(`t2`.`ga`)) / toFloat(toFloat(`t2`.`sa`)) END IS NULL)\nORDER BY CASE WHEN toFloat(toFloat(`t2`.`sa`))=0 THEN NULL ELSE toFloat(toFloat(`t2`.`ga`)) / toFloat(toFloat(`t2`.`sa`)) END IS NULL DESC, CASE WHEN toFloat(toFloat(`t2`.`sa`))=0 THEN NULL ELSE toFloat(toFloat(`t2`.`ga`)) / toFloat(toFloat(`t2`.`sa`)) END  \nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t2`.`year` AS `year`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the goalie who has the lowest percentage of goals against among all the shots against recorded. Name the players and season where he played.",
    "evidence": "goals against refers to GA; shots against refers to SA; lowest percentage of goals against among all the shots against refers to MIN(DIVIDE(GA,SA)*100)",
    "idx": 5806
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t3`:`teams`)\nMATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND `t2`.`tmid` = `t3`.`tmid`\nAND (`t2`.`year` = 2005 AND `t1`.`height` < '72')\nRETURN DISTINCT `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all goalies who played in the year 2005 season and shorter than 72 inches. List all the team names he play for.",
    "evidence": "shorter than 72 inches refers to height<72",
    "idx": 5807
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t3`:`teams`)\nMATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND `t2`.`tmid` = `t3`.`tmid`\nAND (`t1`.`playerid` = 'aubinje01')\nRETURN DISTINCT `t1`.`namenick` AS `namenick`, `t3`.`year` AS `year`, `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the nick name of player ID 'aubinje01'. List all the teams and season he played for.",
    "evidence": "nick name refers to nameNick; team refers to tmID; season refers to year\n\n",
    "idx": 5808
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "CALL(*) {\nMATCH (`goalies_sub0`:`goalies`)\nWITH `goalies_sub0`.`playerid` AS _groupby_col_4, COUNT(`goalies_sub0`.`playerid`) AS _groupby_col_5\nRETURN _groupby_col_4 AS `playerid` ORDER BY _groupby_col_5 IS NULL ASC, _groupby_col_5 DESC \nLIMIT 1\n}\nMATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`playerid` = `playerid`)\nWITH `t1`.`firstname` AS _groupby_col_0, `t1`.`lastname` AS _groupby_col_1, `t2`.`year` AS _groupby_col_2, avg(toFloat(`t2`.`min`)) AS _groupby_col_3\nRETURN _groupby_col_0 AS `firstname`, _groupby_col_1 AS `lastname`, _groupby_col_2 AS `year`, _groupby_col_3 AS `_col_3`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the goalies with the most seasons played. State the average time he played for each season.",
    "evidence": "most seasons played refers to MAX(COUNT(playerID)); average time he played for each season refers to DIVIDE(SUM(T2.Min),COUNT(T2.playerID))",
    "idx": 5809
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "CALL (*) {\nMATCH (`goalies_sub0`:`goalies`)\nWHERE CASE WHEN toFloat(toFloat(`goalies_sub0`.`ga`))=0 THEN NULL ELSE toFloat(toFloat(`goalies_sub0`.`sho`)) / toFloat(toFloat(`goalies_sub0`.`ga`)) END > 0.05\nRETURN `goalies_sub0`.`playerid` AS `playerid`, `goalies_sub0`.`year` AS `year`  \n}\nMATCH (`t1`:`master`)\nWHERE `playerid` = `t1`.`playerid`\nRETURN DISTINCT `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the goalie and the season he played where he had 5% shutouts among the number of goals recorded while the goalie was on the ice.",
    "evidence": "shutouts refers to SHO; number of goals refers to GA; 5% shutouts among the number of goals refers to DIVIDE(SHO,GA)*100 = 5.00",
    "idx": 5810
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`birthcountry` <> `master`.`deathcountry`\nORDER BY `master`.`birthyear` IS NULL DESC, `master`.`birthyear`  \nRETURN `master`.`firstname` AS `firstname`, `master`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the deceased players whose death country is different from his birth country order by birth year.",
    "evidence": "death country is different from his birth country refers to birthCountry! = deathCountry",
    "idx": 5811
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE NOT `master`.`firstnhl` IS NULL AND NOT `master`.`firstwha` IS NULL\nRETURN `master`.`namegiven` AS `namegiven`, `master`.`firstnhl` AS `firstnhl`, `master`.`firstwha` AS `firstwha`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who are the players played both in NHL and WHA. List the given name and first year they were in NHL and first year in WHA.",
    "evidence": "first year they were in NHL refers to firstNHL; first year in WHA refers to firstWHA; play in both refers to firstNHL IS NOT NULL AND firstWHA IS NOT NULL\n",
    "idx": 5812
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`deathyear` IS NULL AND `master`.`pos` =~ '(?i)(?s).*/.*'\nRETURN `master`.`firstname` AS `firstname`, `master`.`lastname` AS `lastname`, `master`.`pos` AS `pos`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the living players who have two positions. State their given name the position they play.",
    "evidence": "living players refers to deathYear IS NULL; positions refers to pos",
    "idx": 5813
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nORDER BY `master`.`height` IS NULL ASC, `master`.`height` DESC \nRETURN `master`.`namenick` AS `namenick`, `master`.`lastnhl` AS `lastnhl`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the nick name of the tallest player? If the player had left NHL, mention the last season he was with NHL.",
    "evidence": "nick name refers to nameNick; tallest player refers to MAX(height); had left NHL refers to lastNHL",
    "idx": 5814
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t3`:`teams`)\nMATCH (`t1`:`goalies`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t2`.`playerid` = `t1`.`playerid`\nAND `t1`.`lgid` = `t3`.`lgid`\nAND (NOT `t1`.`playerid` IS NULL AND NOT `t2`.`coachid` IS NULL AND `t2`.`shootcatch` = 'L' AND `t2`.`pos` = 'G')\nRETURN DISTINCT `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`, `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the goalies who are good at left hand and also has become a coach after retirement. Name all teams he had played before.",
    "evidence": "good at left hand refers to shootCatch = 'L'; goalies refers to pos = 'G'",
    "idx": 5815
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t3`:`teams`)\nMATCH (`t1`:`goalies`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t2`.`playerid` = `t1`.`playerid`\nAND `t1`.`lgid` = `t3`.`lgid`\nAND (`t2`.`birthcountry` = 'Canada' AND NOT `t2`.`deathyear` IS NULL AND `t2`.`pos` = 'G')\nRETURN DISTINCT `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`, `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the deceased goalies and the teams he had played whose birth country was in Canada.",
    "evidence": "goalies refers to pos = 'G'; deceased goalies refers to deathYear IS NOT NULL\n",
    "idx": 5816
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nMATCH (`t2`:`goalies`)-[played_for_0:played_for]->(`t3`:`teams`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND `t2`.`year` = `t3`.`year` AND `t2`.`tmid` = `t3`.`tmid`\nAND (NOT `t1`.`deathyear` IS NULL AND `t3`.`name` = 'Boston Bruins' AND `t3`.`rank` = 1 AND `t1`.`pos` = 'G')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t3`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the goalies and season they played when Boston Bruins won number 1 in rank.",
    "evidence": "goalies refers to pos = 'G'; season refers to year\n",
    "idx": 5817
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t3`:`teams`)\nMATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND `t2`.`lgid` = `t3`.`lgid` AND `t2`.`year` = `t3`.`year`\nAND (NOT `t1`.`deathyear` IS NULL AND `t1`.`firstnhl` < '1950')\nRETURN DISTINCT `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all goalies who are still alive, whose first season in NHL in before 1950. List the team names they were in.",
    "evidence": "first season in NHL in before 1950 refers to firstNHL<1950; goalies who are still alive refers to deathYear IS NOT NULL",
    "idx": 5818
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t3`:`teams`)\nMATCH (`t2`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t2`.`coachid` = `t1`.`coachid`\nAND `t1`.`lgid` = `t3`.`lgid`\nAND (NOT `t2`.`playerid` IS NULL AND NOT `t2`.`coachid` IS NULL)\nRETURN DISTINCT `t2`.`namegiven` AS `namegiven`, `t3`.`name` AS `name`, `t3`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all players who becomes coach after retirement, state the given name of coach and which teams and years did they coach?",
    "evidence": "",
    "idx": 5819
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t3`:`teams`)\nMATCH (`t2`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t2`.`coachid` = `t1`.`coachid`\nAND `t1`.`lgid` = `t3`.`lgid`\nAND (NOT `t1`.`coachid` IS NULL)\nORDER BY CASE WHEN `t1`.`g`=0 THEN NULL ELSE toFloat(`t1`.`w`) / `t1`.`g` END IS NULL ASC, CASE WHEN `t1`.`g`=0 THEN NULL ELSE toFloat(`t1`.`w`) / `t1`.`g` END DESC \nRETURN `t2`.`namegiven` AS `namegiven`, `t3`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who was never a player, who has highest percentage of game winning? Provide the given name of the coach and team he coached.",
    "evidence": "highest percentage of game winning refers to MAX(DIVIDE(w,g)*100)",
    "idx": 5820
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "CALL (*) {\nMATCH (`coaches_sub0`:`coaches`)\nORDER BY CASE WHEN `coaches_sub0`.`g`=0 THEN NULL ELSE toFloat(`coaches_sub0`.`w`) / `coaches_sub0`.`g` END IS NULL ASC, CASE WHEN `coaches_sub0`.`g`=0 THEN NULL ELSE toFloat(`coaches_sub0`.`w`) / `coaches_sub0`.`g` END DESC \nRETURN `coaches_sub0`.`coachid` AS `coachid`  LIMIT 1\n}\nMATCH (`t1`:`master`)-[coach_profile_0:coach_profile]->(`t2`:`coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND `t2`.`coachid` = `coachid`\nRETURN CASE WHEN `t2`.`g`=0 THEN NULL ELSE toFloat(`t2`.`w`) / `t2`.`g` END AS `_col_0`, `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which coach has the best performance for team DET in history? What was the winning percentage? Name the coach and the year he coached.",
    "evidence": "winning percentage refers to DIVIDE(w,g)*100; team DET refers to tmID = 'DET'",
    "idx": 5821
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nMATCH (`t2`:`goalies`)-[played_for_0:played_for]->(`t3`:`teams`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND `t2`.`year` = `t3`.`year` AND `t2`.`tmid` = `t3`.`tmid`\nAND (`t1`.`pos` = 'G' AND `t2`.`l` > `t2`.`w`)\nWITH `t1`.`firstname` AS _groupby_col_0, `t1`.`lastname` AS _groupby_col_1, `t3`.`name` AS _groupby_col_2, COUNT(`t3`.`year`) AS _groupby_col_3\nWHERE _groupby_col_3 > 2\nRETURN DISTINCT _groupby_col_0 AS `firstname`, _groupby_col_1 AS `lastname`, _groupby_col_2 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all goalies with more lost than won games for two seasons or more. State the name of the player and team he played.",
    "evidence": "lost refers to L; won refers to W",
    "idx": 5822
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`goalies`)-[player_profile_0:player_profile]->(`t1`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`birthyear` = '1987' AND `t1`.`shootcatch` IS NULL)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t2`.`year` AS `year`, CASE WHEN toFloat(toFloat(`t2`.`gp`))=0 THEN NULL ELSE toFloat(toFloat(`t2`.`w`)) / toFloat(toFloat(`t2`.`gp`)) END AS `_col_3`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all the goalies born in year 1987, who are good in both right hand and left hand? Calculate his percentage of winning for every season he played.",
    "evidence": "good in both right hand and left hand refers shootCatch IS NULL; winning refers to W; every season he played refers to GP; percentage of winning for every season he played refers to DIVIDE(W,GP)*100",
    "idx": 5823
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`awardsmisc`:`awardsmisc`)\nWHERE NOT `awardsmisc`.`note` IS NULL\nRETURN COUNT(`awardsmisc`.`note`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players and coaches are awarded after death?",
    "evidence": "awarded after death refers to note = 'posthumous'",
    "idx": 5824
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`awardsplayers`:`awardsplayers`)\nWHERE `awardsplayers`.`pos` = 'G' AND `awardsplayers`.`year` = 1983\nRETURN COUNT(`awardsplayers`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players who won an award in the year 1983, how many of them play the position of goalie?",
    "evidence": "position of goalie refers to pos = 'G'",
    "idx": 5825
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`coaches`:`coaches`)\nWHERE `coaches`.`year` = 2007 AND `coaches`.`notes` = 'interim'\nRETURN COUNT(`coaches`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many coaches worked a temporary term in the year 2007?",
    "evidence": "worked a temporary term refers to notes = 'interim'",
    "idx": 5826
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`combinedshutouts`:`combinedshutouts`)\nWHERE `combinedshutouts`.`year` = 1977 AND `combinedshutouts`.`r/p` = 'R'\nRETURN COUNT(`combinedshutouts`.`year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many shoutouts are there in the regular season of 1977?",
    "evidence": "regular season refers to `R/P` = 'R'",
    "idx": 5827
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`goalies`:`goalies`)\nWHERE `goalies`.`year` = 2005 AND `goalies`.`eng` IS NULL\nRETURN COUNT(`goalies`.`tmid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many teams scored against their opponent who had pulled their goalie in the year 2005?",
    "evidence": "teams scored against their opponent who had pulled their goalie refers to ENG is not null",
    "idx": 5828
  }
]