[
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`city` = 'Folsom' AND t2.`creditcardtype` = 'Visa')\nRETURN COUNT(t1.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Folsom customers prefer to pay with Visa?",
    "evidence": "Folsom refers to City = 'Folsom'; Visa refers to CreditCardType = 'Visa';",
    "idx": 2706
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`starrating` = 5 AND t2.`reviewdate` >= date('2012-11-01') AND t2.`reviewdate` <= date('2012-11-30'))\nRETURN DISTINCT t1.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From which cities are the customers who gave 5 stars in their reviews in November 2012?",
    "evidence": "5 stars refers to StarRating = 5; in November 2012 refers to ReviewDate LIKE '2012-11%';",
    "idx": 2707
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->(t3@`rootbeerbrand`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`brandid` = t3.`brandid`\nAND (t1.`first` = 'Peg' AND t1.`last` = 'Winchester')\nRETURN t3.`brandname` AS `brandname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What brands of beer has Peg Winchester consumed?",
    "evidence": "brands of beer refers to BrandName;",
    "idx": 2708
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`starrating` = 5)\nRETURN t1.`first` AS `first`, t1.`last` AS `last`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of all the customers who have ever given a 5-star review?",
    "evidence": "name of the customer = First, Last; 5-star review refers to StarRating = 5;",
    "idx": 2709
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`location`)-[has_geolocation_0:`has_geolocation`]->(t2@`geolocation`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`zipcode` = 95819)\nRETURN t2.`latitude` AS `latitude`, t2.`longitude` AS `longitude`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the precise location of zip code 95819?",
    "evidence": "precise location = Latitude, Longitude;",
    "idx": 2710
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t2@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND (t1.`containertype` = 'Can')\nRETURN avg(t2.`currentretailprice` - t2.`wholesalecost`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average unit profit for wholesalers of canned beers?",
    "evidence": "average unit profit = DIVIDE(SUM(SUBTRACT(CurrentRetailPrice, WholesaleCost)), COUNT(ContainerType = 'Can')); canned beers refers to ContainerType = 'Can';",
    "idx": 2711
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t1:`reviewed`]->()\nMATCH ()-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`creditcardtype` = 'Discover')\nRETURN cast (COUNT(CASE  WHEN t1.`starrating` = 3 THEN 1 ELSE NULL END) as float) * 100 / COUNT(t1.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of customers who paid with a Discover Credit Card gave a 3-star rating?",
    "evidence": "percentage = MULTIPLY(DIVIDE(COUNT(CustomerID WHERE StarRating = 3), COUNT(CustomerID) WHERE CreditCardType = 'Discover'), 100); Discover Credit Card refers to CreditCardType = 'Discover'; 3-star rating refers to StarRating = 3;",
    "idx": 2712
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (rootbeer@`rootbeer`)\nWHERE rootbeer.`containertype` = 'Bottle' AND rootbeer.`purchasedate` >= date('2015-04-03') AND rootbeer.`purchasedate` <= date('2015-10-26')\nRETURN COUNT(rootbeer.`brandid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many brands of bottle root beer were purchased between 4/3/2015 and 10/26/2015?",
    "evidence": "bottle root beer refers to ContainerType = 'Bottle'; purchased between 4/3/2015 and 10/26/2015 refers to PurchaseDate BETWEEN '2015-04-23' AND '2015-10-26';",
    "idx": 2714
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`starrating` = 4 AND t1.`city` = 'Sacramento' AND t1.`gender` = 'F' AND t1.`subscribedtoemaillist` = 'TRUE' AND t2.`reviewdate` >= date('2013-01-03') AND t2.`reviewdate` <= date('2013-10-26'))\nRETURN COUNT(t1.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female mailing list subscribers from Sacramento gave a 4-star rating between 1/3/2016 and 10/26/2016?",
    "evidence": "female refers to Gender = 'F'; mailing list subscribers refers to SubscribedToEmailList = 'TRUE'; Elk Grove refers to City = 'Sacramento'; 4-star rating refers to StarRating = 4; between 1/3/2016 and 10/26/2016 refers to ReviewDate BETWEEN '2016-01-03' AND '2016-10-26';",
    "idx": 2717
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`first` = 'Anna' AND t1.`last` = 'Himes' AND t2.`creditcardtype` = 'MasterCard' AND t2.`transactiondate` >= date('2014-12-25') AND t2.`transactiondate` <= date('2016-05-20'))\nRETURN COUNT(t2.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times did Anna Himes use her Mastercard when paying between 12/25/2014 and 5/20/2016 ?",
    "evidence": "Mastercard refers to CreditCardType = 'MasterCard'; between 12/25/2014 and 5/20/2016 refers to TransactionDate BETWEEN '2014-12-25' AND '2016-05-20';",
    "idx": 2719
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`brandid` = 10018 AND t1.`gender` = 'F' AND t2.`reviewdate` >= date('2013-01-25') AND t2.`reviewdate` <= date('2015-03-10'))\nRETURN avg(t2.`starrating`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average star rating given by female customers to brand ID 10018 from 1/25/2015 to 3/10/2015?",
    "evidence": "average star rating = AVG(StarRating); female customers refers to Gender = 'F; from 1/25/2015 to 3/10/2015 refers to ReviewDate BETWEEN '2015-01-25' AND '2015-03-10';",
    "idx": 2720
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t1:`transacted_at`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t2.`locationname` = 'Sac State Union' AND t1.`creditcardtype` = 'American Express' AND t1.`transactiondate` >= date('2014-01-01') AND t1.`transactiondate` <= date('2014-12-31'))\nRETURN COUNT(t1.`transactionid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many transactions were made in Sac State Union using the American Express credit card in 2014?",
    "evidence": "Sac State Union refers to LocationName = 'Sac State Union'; American Express credit card refers to CreditCardType = 'American Express'; in 2014 refers to TransactionDate LIKE '2014%';",
    "idx": 2723
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`location`)-[has_geolocation_0:`has_geolocation`]->(t2@`geolocation`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`locationname` = 'Sac State Union')\nRETURN t2.`latitude` AS `latitude`, t2.`longitude` AS `longitude`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the precise coordinate of Sac State Union?",
    "evidence": "precise coordinate = Latitude, Longitude; Sac State Union refers to LocationName = 'Sac State Union';",
    "idx": 2724
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`reviewed`]->(t1@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND (t1.`brandname` = 'Bulldog' AND t2.`reviewdate` = date('2013-07-26'))\nRETURN t2.`review` AS `review`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What did the customer say in his or her review of Bulldog root beer on 7/26/2013?",
    "evidence": "Bulldog refers to BrandName = 'Bulldog'; on 7/26/2013 refers to ReviewDate = '2013-07-26';",
    "idx": 2725
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`first` = 'Kenneth' AND t1.`last` = 'Walton')\nRETURN DISTINCT t2.`creditcardtype` AS `creditcardtype`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the credit card type used by Kenneth Walton?",
    "evidence": "FALSE;",
    "idx": 2727
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t1:`reviewed`]->(t3@`rootbeerbrand`)\nMATCH ()-[t2:`purchased`]->(t4@`rootbeer`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t1.`brandid` = t3.`brandid`\nAND t2.`rootbeerid` = t4.`rootbeerid`\nAND (t2.`rootbeerid` = 100054)\nRETURN t4.`containertype` AS `containertype`, t3.`brandname` AS `brandname`, t1.`starrating` AS `starrating`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the container type, brand name and star rating for root beer ID 10054?",
    "evidence": "FALSE;",
    "idx": 2728
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->(t3@`rootbeer`)\nWHERE t2.`customerid` = t1.`customerid`\nAND t3.`rootbeerid` = t2.`rootbeerid`\nAND (t3.`containertype` = 'Bottle' AND t1.`first` = 'Jim' AND t1.`last` = 'Breech')\nRETURN COUNT(t3.`containertype`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many bottles of beer have been bought by Jim Breech?",
    "evidence": "bottles refers to ContainerType = 'Bottle';",
    "idx": 2731
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t3:`purchased`]->(t2@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t1@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND t2.`rootbeerid` = t3.`rootbeerid`\nAND (t1.`state` = 'CA')\nRETURN COUNT(t3.`rootbeerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many transactions have been made to purchase a root beer brand from California?",
    "evidence": "California refers to State = 'CA';",
    "idx": 2732
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`subscribedtoemaillist` = 'TRUE')\nRETURN avg(t2.`starrating`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average review given by a subscriber?",
    "evidence": "average review = AVG(StarRating); subscriber refers to SubscribedToEmailList = 'TRUE';",
    "idx": 2733
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "CALL {\nMATCH (t1_sub0@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t2_sub0@`rootbeerbrand`)\nWHERE t1_sub0.`brandid` = t2_sub0.`brandid`\nAND (t2_sub0.`state` = 'LA' AND t1_sub0.`containertype` = 'Bottle')\nRETURN COUNT(t1_sub0.`brandid`) AS `_col_0` \n}\nCALL {\nMATCH (t3_sub0@`rootbeer`)-[manufactured_by_1:`manufactured_by`]->(t4_sub0@`rootbeerbrand`)\nWHERE t3_sub0.`brandid` = t4_sub0.`brandid`\nAND (t4_sub0.`state` = 'MO' AND t3_sub0.`containertype` = 'Bottle')\nRETURN COUNT(t3_sub0.`brandid`) AS `_col_0_1` \n}\nRETURN _col_0 - _col_0_1 AS `difference`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the amount difference between the bottles of root beer sold from Louisiana and Missouri?",
    "evidence": "difference = SUBTRACT(COUNT(ContainerType = 'Bottle' WHERE State = 'LA'), COUNT(ContainerType = 'Bottle' State = 'MO')); bottles refers to ContainerType = 'Bottle'; Louisiana refers to State = 'LA'; Missouri refers to State = 'MO';",
    "idx": 2734
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t1:`transacted_at`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nRETURN cast (COUNT(CASE  WHEN t2.`locationname` = 'Sac State American River Courtyard' THEN t1.`transactionid` ELSE NULL END) as float) * 100 / COUNT(CASE  WHEN t2.`locationname` = 'Sac State Union' THEN t1.`transactionid` ELSE NULL END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the transaction ratio being made at Sac State American River Courtyard and Sac State Union?",
    "evidence": "transaction ratio = DIVIDE(SUM(TransactionID WHERE LocationName = 'Sac State American River Courtyard'), SUM(TransactionID WHERE LocationName = 'Sac State Union')); Sac State American River Courtyard refers to LocationName = 'Sac State American River Courtyard'; Sac State Union refers to LocationName = 'Sac State Union';",
    "idx": 2735
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t3:`purchased`]->(t2@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t1@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND t2.`rootbeerid` = t3.`rootbeerid`\nAND (t1.`canesugar` = 'FALSE' AND t1.`caffeinated` = 'FALSE')\nRETURN t1.`brandname` AS `brandname`, sum(t3.`purchaseprice`) AS `_col_1` \nGROUP BY brandname",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List out root beer brand that is not caffeinated and not containing cane sugar. What is the total amount sold for this products?",
    "evidence": "root beer brand refers to BrandName; not caffeinated refers to Caffeinated = 'FALSE'; not containing cane sugar refers to CaneSugar = 'FALSE'; total amount sold = SUM(PurchasePrice);",
    "idx": 2736
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`purchased`]->(t1@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t3@`rootbeerbrand`)\nWHERE t1.`rootbeerid` = t2.`rootbeerid`\nAND t1.`brandid` = t3.`brandid`\nRETURN cast ((sum(CASE  WHEN t3.`brandname` = 'River City' THEN t2.`purchaseprice` ELSE 0 END) - sum(CASE  WHEN t3.`brandname` = 'Frostie' THEN t2.`purchaseprice` ELSE 0 END)) as float) * 100 / sum(CASE  WHEN t3.`brandname` = 'Frostie' THEN t2.`purchaseprice` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage difference of River City sale compare to Frostie?",
    "evidence": "percentage difference = (DIVIDE(MULTIPLY(SUBTRACT(SUM(PurchasePrice WHERE BrandName = 'River City'), SUM(PurchasePrice WHERE BrandName = 'Frostie')), 100), SUM(PurchasePrice WHERE BrandName = 'Frostie'))); River City refers to BrandName = 'River City'; Frostie refers to BrandName = 'Frostie';",
    "idx": 2737
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`subscribedtoemaillist` = 'TRUE'\nRETURN cast (COUNT(CASE  WHEN customers.`gender` = 'F' THEN 1 ELSE NULL END) as float) * 100 / COUNT(customers.`subscribedtoemaillist`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of female customers who subscribed to the email list?",
    "evidence": "percentage = MULTIPLY(DIVIDE(COUNT(CustomerID WHERE Gender = 'F'), COUNT(CustomerID) WHERE SubscribedToEmailList = 'TRUE'), 1.0); female refers to Gender = 'F'; subscribed to the email list refers to SubscribedToEmailList = 'TRUE';",
    "idx": 2739
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`first` = 'Dick' AND t1.`last` = 'Ruthven')\nRETURN DISTINCT t2.`creditcardtype` AS `creditcardtype`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which type of card did Dick Ruthven use to pay for all of his transactions?",
    "evidence": "type of card refers to CreditCardType;",
    "idx": 2740
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t1:`transacted_at`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t2.`locationname` = 'Sac State Union')\nRETURN COUNT(t1.`transactionid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many transactions were made at Sac State Union?",
    "evidence": "Sac State Union refers to LocationName = 'Sac State Union';",
    "idx": 2741
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->(t3@`rootbeerbrand`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`brandid` = t3.`brandid`\nAND (t1.`first` = 'Urijah' AND t1.`last` = 'Faber' AND t3.`brandname` = 'Frostie')\nRETURN t2.`starrating` AS `starrating`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stars did Urijah Faber rate for Frostie?",
    "evidence": "stars refers to StarRating; Frostie refers to BrandName = 'Frostie';",
    "idx": 2742
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t1:`transacted_at`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t2.`locationname` = 'Sac State American River Courtyard' AND t1.`creditcardtype` = 'MasterCard')\nRETURN COUNT(t1.`transactionid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many purchases were made at Sac State American River Courtyard using Master Card?",
    "evidence": "Sac State American River Courtyard refers to LocationName = 'Sac State American River Courtyard'; Master Card refers to CreditCardType = 'MasterCard';",
    "idx": 2744
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`reviewed`]->(t1@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND (t1.`canesugar` = 'TRUE' AND t1.`honey` = 'TRUE' AND t2.`starrating` = 1 AND like(cast (t2.`reviewdate` as string),'2012%'))\nRETURN DISTINCT t1.`brandname` AS `brandname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which brand in 2012 has the lowest star rating and contains cane sugar as well as honey?",
    "evidence": "brand refers to BrandName; in 2012 refers to ReviewDate LIKE '2012%'; lowest star rating refers to MIN(StarRating); contains cane sugar as well as honey refers to CaneSugar = 'TRUE' AND Honey = 'TRUE';",
    "idx": 2745
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`geolocation`)\nMATCH (t3@`customers`)-[t2:`purchased`]->()\nWHERE t2.`locationid` = t1.`locationid`\nAND t3.`customerid` = t2.`customerid`\nAND (t3.`first` = 'Tommy' AND t3.`last` = 'Kono' AND like(cast (t2.`transactiondate` as string),'2014%'))\nRETURN DISTINCT t1.`latitude` AS `latitude`, t1.`longitude` AS `longitude`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the precise location of the place where Tommy Kono made a purchase in 2014?",
    "evidence": "precise location = Latitude, Longitude; in 2014 refers to TransactionDate LIKE '2014%';",
    "idx": 2746
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`purchased`]->(t1@`rootbeer`)\nWHERE t1.`rootbeerid` = t2.`rootbeerid`\nAND (t1.`containertype` = 'Bottle' AND t2.`creditcardtype` = 'American Express')\nRETURN COUNT(t1.`rootbeerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many transactions were made to purchase a bottle of beer using American Express?",
    "evidence": "bottle of beer refers to ContainerType = 'Bottle'; American Express refers to CreditCardType = 'American Express';",
    "idx": 2747
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`location`)-[has_geolocation_0:`has_geolocation`]->(t2@`geolocation`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`locationname` = 'Sac State American River Courtyard')\nRETURN t2.`latitude` AS `latitude`, t2.`longitude` AS `longitude`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the precise location of the Sac State American River Courtyard?",
    "evidence": "precise location = Latitude, Longitude; Sac State American River Courtyard refers to LocationName = 'Sac State American River Courtyard';",
    "idx": 2749
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (sales@`sales`)\nWHERE sales.`customerid` = 80\nRETURN COUNT(sales.`salesid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales ids are there for customer id 80?",
    "evidence": "",
    "idx": 2750
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "CALL {\nMATCH (products_sub0@`products`)\nRETURN MAX(products_sub0.`price`) AS `_col_0_1` \n}\nMATCH (products@`products`)\nWHERE products.`price` = _col_0_1\nRETURN COUNT(DISTINCT products.`productid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many product ids have the lowest price?",
    "evidence": "lowest price refers to MIN(Price);",
    "idx": 2754
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[includes_0:`includes`]->(t2@`products`)\nWHERE t1.`productid` = t2.`productid`\nORDER BY t1.`quantity`  NULLS FIRST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the product with the lowest quantity?",
    "evidence": "lowest quantity refers to MIN(Quantity);",
    "idx": 2757
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[includes_0:`includes`]->(t2@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t2.`name` = 'Hex Nut 9')\nRETURN COUNT(t1.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customer ids have purchased Hex Nut 9?",
    "evidence": "Hex Nut 9' is name of product;",
    "idx": 2758
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[sold_to_0:`sold_to`]->(t1@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`salesid` = 178)\nRETURN t1.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the last name of the customer who placed an order for sales id 178?",
    "evidence": "",
    "idx": 2762
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[made_by_0:`made_by`]->(t1@`employees`)\nWHERE t1.`employeeid` = t2.`salespersonid`\nAND (t2.`salesid` = 100)\nRETURN t1.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the last name of sales person for sales id 100?",
    "evidence": "",
    "idx": 2765
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[sold_to_0:`sold_to`]->(t1@`customers`)\nMATCH (t2@`sales`)-[made_by_0:`made_by`]->(t3@`employees`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`salespersonid` = t3.`employeeid`\nAND (t1.`firstname` = 'Abigail')\nRETURN DISTINCT t3.`firstname` AS `firstname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the first name of employee who handled sales for customer called Abigail?",
    "evidence": "",
    "idx": 2766
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t2.`customerid` = 11782 AND t1.`price` = 0)\nRETURN COUNT(t1.`productid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many free gifts have customer with id 11782 received?",
    "evidence": "free gifts refers to Price = 0;",
    "idx": 2767
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[sold_to_0:`sold_to`]->(t1@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`salespersonid` = 5)\nRETURN t1.`firstname` AS `firstname`, t1.`middleinitial` AS `middleinitial`, t1.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of customers who dealt with sales person with id 5?",
    "evidence": "full name = FirstName, MiddleInitial, LastName;",
    "idx": 2768
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t2.`customerid` >= 1 AND t2.`customerid` <= 100)\nORDER BY t1.`price` DESC NULLS LAST \nRETURN t1.`price` AS `price` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among customers with IDs from 1 to 100, what is the highest price of products they purchased?",
    "evidence": "IDs from 1 to 100 refers to CustomerID BETWEEN 1 AND 100 ; highest price refers to MAX(Price);",
    "idx": 2770
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[sold_to_0:`sold_to`]->(t1@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`lastname` = 'Valdez')\nORDER BY t2.`quantity` DESC NULLS LAST \nRETURN t1.`firstname` AS `firstname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among customers with the last name of Valdez, who purchased the highest quantity?",
    "evidence": "highest quantity refers to MAX(Quantity);",
    "idx": 2771
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[sold_to_0:`sold_to`]->(t2@`customers`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`firstname` = 'Alex')\nRETURN CASE WHEN t1.`productid` = 498 THEN 'YES' ELSE 'NO' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Has Alex purchased product with id 498?",
    "evidence": "WHEN ProductID = 498 AND FirstName = 'Alex' means that Alex purchased a product; WHEN ProductID = 498 AND FirstName NOT 'Alex' means Alex has not purchased a product;",
    "idx": 2773
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (products@`products`)\nWHERE products.`price` = 0\nRETURN COUNT(products.`productid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the products, how many of them are freebies?",
    "evidence": "freebies refers to Price = 0;",
    "idx": 2779
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[made_by_0:`made_by`]->(t2@`employees`)\nWHERE t1.`salespersonid` = t2.`employeeid`\nAND (t1.`quantity` = 1000)\nRETURN DISTINCT t2.`firstname` AS `firstname`, t2.`middleinitial` AS `middleinitial`, t2.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of employee who sold 1000 units?",
    "evidence": "full name of employee = FirstName, MiddleInitial, LastName; units refers to quantity; Quantity = 100",
    "idx": 2781
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nWHERE t1.`productid` = t2.`productid`\nAND (t1.`name` = 'Reflector')\nRETURN sum(t1.`price` * t2.`quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total sales amount for Reflector?",
    "evidence": "total sales amount = SUM(MULTIPLY(Price, Quantity)); 'Reflector' is name of product;",
    "idx": 2783
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[includes_0:`includes`]->(t1@`products`)\nWHERE t1.`productid` = t2.`productid`\nRETURN CASE WHEN sum(CASE WHEN t1.`name` = 'HL Mountain Frame - Silver, 42' THEN t2.`salesid` ELSE 0 END) - sum(CASE WHEN t1.`name` = 'HL Mountain Frame - Black, 42' THEN t2.`salesid` ELSE 0 END) > 0 THEN 'Silver' ELSE 'Black' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the best selling colour for HL Mountain Frame, 42?",
    "evidence": "best selling colour refers to name of product with higher total sales; SUM(SalesID WHERE Name = 'HL Mountain Frame - Silver, 42') > SUM(Name = 'HL Mountain Frame - Black, 42') means Silver is the best selling colour, otherwise Black is the best seling colour;",
    "idx": 2784
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "CALL {\nMATCH (products_sub0@`products`)\nWHERE products_sub0.`name` = 'HL Mountain Frame - Black, 42'\nRETURN products_sub0.`price` AS `price` \n}\nCALL {\nMATCH (products_sub0@`products`)\nWHERE products_sub0.`name` = 'LL Mountain Frame - Black, 42'\nRETURN products_sub0.`price` AS `price_1` \n}\nRETURN price - price_1 AS `num`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the difference in price between HL Mountain Frame - Black, 42 and LL Mountain Frame - Black, 42?",
    "evidence": "difference = SUBTRACT((Price WHERE Name = 'HL Mountain Frame - Black, 42'), (Price WHERE Name = 'HL Mountain Frame - Black, 42'));",
    "idx": 2785
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t1@`sales`)-[made_by_0:`made_by`]->(t2@`employees`)\nWHERE t1.`salespersonid` = t2.`employeeid`\nAND (t2.`firstname` = 'Michel' AND t2.`middleinitial` = 'e' AND t2.`lastname` = 'DeFrance')\nRETURN COUNT(t1.`salesid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Calculate the total number of sales closed by Michel E. DeFrance?",
    "evidence": "",
    "idx": 2786
  },
  {
    "filename": "train.json",
    "db_id": "sales",
    "gql_statement": "MATCH (t2@`sales`)-[sold_to_0:`sold_to`]->(t1@`customers`)\nMATCH (t2@`sales`)-[made_by_0:`made_by`]->(t3@`employees`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`salespersonid` = t3.`employeeid`\nRETURN cast (COUNT(t1.`customerid`) as float) / COUNT(t3.`employeeid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of customers per sales person?",
    "evidence": "average = DIVIDE(COUNT(CustomerID), COUNT(EmployeeID));",
    "idx": 2787
  }
]