[
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`t1`:`channel`)-[t2:broadcast]->()\nWHERE `t1`.`channel_id` = `t2`.`channel_id`\nAND (`t2`.`time_of_day` = 'Morning')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which channels are broadcast in the morning? Give me the channel names.",
    "evidence": "",
    "idx": 4344
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH ()-[broadcast:broadcast]->()\nWITH `broadcast`.`time_of_day` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `time_of_day`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many programs are broadcast in each time section of the day?",
    "evidence": "",
    "idx": 4345
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`program`:`program`)\nRETURN `program`.`origin` AS `origin` ORDER BY `origin` IS NULL DESC, `origin`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all program origins in the alphabetical order.",
    "evidence": "",
    "idx": 4349
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nRETURN COUNT(DISTINCT `channel`.`owner`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of distinct channel owners.",
    "evidence": "",
    "idx": 4352
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`program`:`program`)\nWHERE `program`.`origin` <> 'Beijing'\nRETURN `program`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the names of programs whose origin is not in Beijing.",
    "evidence": "",
    "idx": 4353
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`program`:`program`)\nWHERE `program`.`origin` <> 'Beijing'\nRETURN `program`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which programs' origins are not \"Beijing\"? Give me the program names.",
    "evidence": "",
    "idx": 4354
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nWHERE `channel`.`owner` = 'CCTV' OR `channel`.`owner` = 'HBS'\nRETURN `channel`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all the channels owned by either CCTV or HBS",
    "evidence": "",
    "idx": 4356
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nWITH `channel`.`owner` AS _groupby_col_0, sum(`channel`.`rating_in_percent`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `owner`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total rating ratio for each channel owner.",
    "evidence": "",
    "idx": 4357
  },
  {
    "filename": "train_spider.json",
    "db_id": "program_share",
    "gql_statement": "MATCH (`channel`:`channel`)\nWITH `channel`.`owner` AS _groupby_col_0, sum(`channel`.`rating_in_percent`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `owner`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total rating of channel for each channel owner?",
    "evidence": "",
    "idx": 4358
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`courses`:`courses`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of courses offered.",
    "evidence": "",
    "idx": 4360
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`courses`:`courses`)\nWHERE `courses`.`course_name` = 'database'\nRETURN `courses`.`course_description` AS `course_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the descriptions of the courses with name \"database\"?",
    "evidence": "",
    "idx": 4361
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`courses`:`courses`)\nWHERE `courses`.`course_name` = 'database'\nRETURN `courses`.`course_description` AS `course_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the description for the courses named \"database\".",
    "evidence": "",
    "idx": 4362
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`course_authors_and_tutors`:`course_authors_and_tutors`)\nWHERE `course_authors_and_tutors`.`personal_name` = 'Cathrine'\nRETURN `course_authors_and_tutors`.`address_line_1` AS `address_line_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the addresses of the course authors or tutors with personal name \"Cathrine\"",
    "evidence": "",
    "idx": 4363
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`course_authors_and_tutors`:`course_authors_and_tutors`)\nRETURN `course_authors_and_tutors`.`address_line_1` AS `address_line_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the addresses of all the course authors or tutors.",
    "evidence": "",
    "idx": 4365
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`course_authors_and_tutors`:`course_authors_and_tutors`)\nRETURN `course_authors_and_tutors`.`login_name` AS `login_name`, `course_authors_and_tutors`.`family_name` AS `family_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the login names and family names of course author and tutors.",
    "evidence": "",
    "idx": 4367
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`student_tests_taken`:`student_tests_taken`)\nWHERE `student_tests_taken`.`test_result` = 'Pass'\nRETURN `student_tests_taken`.`date_test_taken` AS `date_test_taken`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the dates of the tests taken with result \"Pass\".",
    "evidence": "",
    "idx": 4375
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`student_tests_taken`:`student_tests_taken`)\nWHERE `student_tests_taken`.`test_result` = 'Fail'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many tests have result \"Fail\"?",
    "evidence": "",
    "idx": 4377
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`student_tests_taken`:`student_tests_taken`)\nWHERE `student_tests_taken`.`test_result` = 'Fail'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of tests with \"Fail\" result.",
    "evidence": "",
    "idx": 4378
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`students`:`students`)\nWHERE `students`.`family_name` = 'Ward'\nRETURN `students`.`login_name` AS `login_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the login names of the students with family name \"Ward\"?",
    "evidence": "",
    "idx": 4379
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`students`:`students`)\nWHERE `students`.`family_name` = 'Ward'\nRETURN `students`.`login_name` AS `login_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the login names of the students whose family name is \"Ward\".",
    "evidence": "",
    "idx": 4380
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`students`:`students`)\nWHERE `students`.`family_name` = 'Jaskolski' OR `students`.`family_name` = 'Langosh'\nRETURN `students`.`date_of_latest_logon` AS `date_of_latest_logon`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the dates of the latest logon of the students with family name \"Jaskolski\" or \"Langosh\"?",
    "evidence": "",
    "idx": 4381
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`students`:`students`)\nWHERE `students`.`personal_name` =~ '(?i)(?s).*son.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students have personal names that contain the word \"son\"?",
    "evidence": "",
    "idx": 4383
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`students`:`students`)\nWHERE `students`.`personal_name` =~ '(?i)(?s).*son.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students who have the word \"son\" in their personal names.",
    "evidence": "",
    "idx": 4384
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`subjects`:`subjects`)\nRETURN `subjects`.`subject_name` AS `subject_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the subject names.",
    "evidence": "",
    "idx": 4385
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`subjects`:`subjects`)\nRETURN `subjects`.`subject_name` AS `subject_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the subjects.",
    "evidence": "",
    "idx": 4386
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`course_authors_and_tutors`:`course_authors_and_tutors`)\nRETURN `course_authors_and_tutors`.`author_id` AS `author_id`, `course_authors_and_tutors`.`author_tutor_atb` AS `author_tutor_atb`, `course_authors_and_tutors`.`login_name` AS `login_name`, `course_authors_and_tutors`.`password` AS `password`, `course_authors_and_tutors`.`personal_name` AS `personal_name`, `course_authors_and_tutors`.`middle_name` AS `middle_name`, `course_authors_and_tutors`.`family_name` AS `family_name`, `course_authors_and_tutors`.`gender_mf` AS `gender_mf`, `course_authors_and_tutors`.`address_line_1` AS `address_line_1` ORDER BY `course_authors_and_tutors`.`personal_name` IS NULL DESC, `course_authors_and_tutors`.`personal_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the information about course authors and tutors in alphabetical order of the personal name.",
    "evidence": "",
    "idx": 4387
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`students`:`students`)\nRETURN `students`.`personal_name` AS `personal_name`, `students`.`family_name` AS `family_name` ORDER BY `family_name` IS NULL DESC, `family_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the personal names and family names of all the students in alphabetical order of family name.",
    "evidence": "",
    "idx": 4389
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`student_tests_taken`:`student_tests_taken`)\nWITH `student_tests_taken`.`test_result` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `test_result`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List each test result and its count in descending order of count.",
    "evidence": "",
    "idx": 4391
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`t2`:`courses`)-[authored_by_0:authored_by]->(`t1`:`course_authors_and_tutors`)\nWHERE `t1`.`author_id` = `t2`.`author_id`\nAND (`t2`.`course_name` = 'advanced database')\nRETURN `t1`.`login_name` AS `login_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the login name of the course author that teaches the course with name \"advanced database\".",
    "evidence": "",
    "idx": 4393
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`t2`:`courses`)-[authored_by_0:authored_by]->(`t1`:`course_authors_and_tutors`)\nWHERE `t1`.`author_id` = `t2`.`author_id`\nAND (`t2`.`course_name` = 'operating system' OR `t2`.`course_name` = 'data structure')\nRETURN `t1`.`address_line_1` AS `address_line_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the addresses of the course authors who teach the course with name \"operating system\" or \"data structure\".",
    "evidence": "",
    "idx": 4395
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`t2`:`courses`)-[authored_by_0:authored_by]->(`t1`:`course_authors_and_tutors`)\nWHERE `t1`.`author_id` = `t2`.`author_id`\nAND (`t1`.`personal_name` = 'Julio')\nRETURN `t2`.`course_name` AS `course_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of courses taught by the tutor who has personal name \"Julio\".",
    "evidence": "",
    "idx": 4397
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`t1`:`courses`)-[belongs_to_0:belongs_to]->(`t2`:`subjects`)\nWHERE `t1`.`subject_id` = `t2`.`subject_id`\nAND (`t2`.`subject_name` = 'Computer Science')\nRETURN `t1`.`course_name` AS `course_name`, `t1`.`course_description` AS `course_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names and descriptions of courses that belong to the subject named \"Computer Science\".",
    "evidence": "",
    "idx": 4399
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`t2`:`student_tests_taken`)\nMATCH ()-[t1:enrolled_in]->()\nWHERE `t1`.`registration_id` = `t2`.`registration_id`\nAND (`t2`.`test_result` = 'Pass')\nRETURN `t1`.`date_of_enrolment` AS `date_of_enrolment`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the enrollment dates of all the tests that have result \"Pass\"?",
    "evidence": "",
    "idx": 4407
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`t2`:`student_tests_taken`)\nMATCH ()-[t1:enrolled_in]->()\nWHERE `t1`.`registration_id` = `t2`.`registration_id`\nAND (`t2`.`test_result` = 'Fail')\nRETURN `t1`.`date_of_completion` AS `date_of_completion`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the completion dates of all the tests that have result \"Fail\"?",
    "evidence": "",
    "idx": 4409
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`t2`:`students`)-[t1:enrolled_in]->()\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND (`t2`.`personal_name` = 'Karson')\nRETURN `t1`.`date_of_enrolment` AS `date_of_enrolment`, `t1`.`date_of_completion` AS `date_of_completion`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the dates of enrollment and completion of the student with personal name \"Karson\".",
    "evidence": "",
    "idx": 4411
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`t2`:`students`)-[t1:enrolled_in]->()\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND (`t2`.`personal_name` = 'Karson')\nRETURN `t1`.`date_of_enrolment` AS `date_of_enrolment`, `t1`.`date_of_completion` AS `date_of_completion`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "On what dates did the student whose personal name is \"Karson\" enroll in and complete the courses?",
    "evidence": "",
    "idx": 4412
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "MATCH (`t2`:`students`)-[t1:enrolled_in]->()\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND (`t2`.`family_name` = 'Zieme' AND `t2`.`personal_name` = 'Bernie')\nRETURN `t1`.`date_of_enrolment` AS `date_of_enrolment`, `t1`.`date_of_completion` AS `date_of_completion`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the dates of enrollment and completion of the student with family name \"Zieme\" and personal name \"Bernie\".",
    "evidence": "",
    "idx": 4413
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[student_course_enrolment_sub0:enrolled_in]->()\nRETURN `student_course_enrolment_sub0`.`student_id` AS `student_id`   } AS in_collect_0\nMATCH (`students`:`students`)\nWHERE NOT `students`.`student_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students did not have any course enrollment?",
    "evidence": "",
    "idx": 4415
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_learning",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[student_course_enrolment_sub0:enrolled_in]->()\nRETURN `student_course_enrolment_sub0`.`student_id` AS `student_id`   } AS in_collect_0\nMATCH (`students`:`students`)\nWHERE NOT `students`.`student_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of students who did not enroll in any course.",
    "evidence": "",
    "idx": 4416
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`payments`:`payments`)\nRETURN `payments`.`payment_method_code` AS `payment_method_code`, `payments`.`date_payment_made` AS `date_payment_made`, `payments`.`amount_payment` AS `amount_payment` ORDER BY `date_payment_made` IS NULL DESC, `date_payment_made`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the method, date and amount of all the payments, in ascending order of date.",
    "evidence": "",
    "idx": 4417
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`claims`:`claims`)\nRETURN `claims`.`amount_settled` AS `amount_settled`, `claims`.`amount_claimed` AS `amount_claimed` ORDER BY `amount_claimed` IS NULL ASC, `amount_claimed` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Among all the claims, what is the settlement amount of the claim with the largest claim amount? List both the settlement amount and claim amount.",
    "evidence": "",
    "idx": 4419
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`claims`:`claims`)\nRETURN `claims`.`amount_settled` AS `amount_settled`, `claims`.`amount_claimed` AS `amount_claimed` ORDER BY `amount_settled` IS NULL DESC, `amount_settled`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Among all the claims, what is the amount claimed in the claim with the least amount settled? List both the settlement amount and claim amount.",
    "evidence": "",
    "idx": 4421
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "CALL(*) {\nMATCH (`claims_sub0`:`claims`)\nRETURN avg(`claims_sub0`.`amount_claimed`) AS `_col_0`  \n}\nMATCH (`claims`:`claims`)\nWHERE `claims`.`amount_claimed` > `_col_0`\nRETURN `claims`.`date_claim_made` AS `date_claim_made`, `claims`.`date_claim_settled` AS `date_claim_settled`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Among all the claims, which claims have a claimed amount larger than the average? List the date the claim was made and the date it was settled.",
    "evidence": "",
    "idx": 4423
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "CALL(*) {\nMATCH (`claims_sub0`:`claims`)\nRETURN avg(`claims_sub0`.`amount_settled`) AS `_col_0`  \n}\nMATCH (`claims`:`claims`)\nWHERE `claims`.`amount_settled` <= `_col_0`\nRETURN `claims`.`date_claim_made` AS `date_claim_made`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Among all the claims, which settlements have a claimed amount that is no more than the average? List the claim start date.",
    "evidence": "",
    "idx": 4425
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "CALL(*) {\nMATCH (`claims_sub0`:`claims`)\nRETURN avg(`claims_sub0`.`amount_settled`) AS `_col_0`  \n}\nMATCH (`claims`:`claims`)\nWHERE `claims`.`amount_settled` <= `_col_0`\nRETURN `claims`.`date_claim_made` AS `date_claim_made`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the claim start date for the claims whose claimed amount is no more than the average",
    "evidence": "",
    "idx": 4426
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`t2`:`settlements`)-[for_claim_0:for_claim]->(`t1`:`claims`)\nWHERE `t1`.`claim_id` = `t2`.`claim_id`\nWITH `t1`.`claim_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `claim_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many settlements does each claim correspond to? List the claim id and the number of settlements.",
    "evidence": "",
    "idx": 4427
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`claims`:`claims`)\nRETURN `claims`.`date_claim_made` AS `date_claim_made` ORDER BY `date_claim_made` IS NULL DESC, `date_claim_made`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Tell me the the date when the first claim was made.",
    "evidence": "",
    "idx": 4430
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`settlements`:`settlements`)\nRETURN sum(`settlements`.`amount_settled`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of settlement made for all the settlements?",
    "evidence": "",
    "idx": 4431
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`settlements`:`settlements`)\nRETURN sum(`settlements`.`amount_settled`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the total amount of settlement across all the settlements.",
    "evidence": "",
    "idx": 4432
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`settlements`:`settlements`)\nRETURN `settlements`.`date_claim_made` AS `date_claim_made`, `settlements`.`date_claim_settled` AS `date_claim_settled`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Tell me the the claim date and settlement date for each settlement case.",
    "evidence": "",
    "idx": 4434
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`payments`:`payments`)\nRETURN sum(`payments`.`amount_payment`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of payment?",
    "evidence": "",
    "idx": 4435
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`payments`:`payments`)\nRETURN sum(`payments`.`amount_payment`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the total amount of payment processed.",
    "evidence": "",
    "idx": 4436
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN DISTINCT `customers`.`customer_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the distinct customer details.",
    "evidence": "",
    "idx": 4438
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`settlements`:`settlements`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the total number of settlements made.",
    "evidence": "",
    "idx": 4440
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`payments`:`payments`)\nWHERE `payments`.`payment_method_code` = 'Visa'\nRETURN `payments`.`payment_id` AS `payment_id`, `payments`.`date_payment_made` AS `date_payment_made`, `payments`.`amount_payment` AS `amount_payment`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which Payments were processed with Visa? List the payment Id, the date and the amount.",
    "evidence": "",
    "idx": 4441
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`claims`:`claims`)\nRETURN sum(`claims`.`amount_claimed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total claimed amount of all the claims.",
    "evidence": "",
    "idx": 4443
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_policies",
    "gql_statement": "MATCH (`claims`:`claims`)\nRETURN sum(`claims`.`amount_claimed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is total amount claimed summed across all the claims?",
    "evidence": "",
    "idx": 4444
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`appointment`)-[scheduled_for_0:scheduled_for]->(`t2`:`patient`)\nWHERE `t1`.`patient` = `t2`.`ssn`\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of patients who have made appointments.",
    "evidence": "",
    "idx": 4446
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`appointment`)-[conducted_by_0:conducted_by]->(`t2`:`physician`)\nWHERE `t1`.`physician` = `t2`.`employeeid`\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of physicians who took some appointment.",
    "evidence": "",
    "idx": 4449
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`appointment`)-[conducted_by_0:conducted_by]->(`t2`:`physician`)\nWHERE `t1`.`physician` = `t2`.`employeeid`\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the physicians who took appointments.",
    "evidence": "",
    "idx": 4450
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`physician`)-[t2:affiliated_with]->(`t3`:`department`)\nWHERE `t1`.`employeeid` = `t2`.`physician`\nAND `t2`.`department` = `t3`.`departmentid`\nAND (toInteger(`t2`.`primaryaffiliation`) = 1)\nRETURN `t1`.`name` AS `name`, `t3`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all physicians and their primary affiliated departments' names.",
    "evidence": "",
    "idx": 4451
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t2`:`appointment`)-[scheduled_for_0:scheduled_for]->(`t1`:`patient`)\nWHERE `t1`.`ssn` = `t2`.`patient`\nORDER BY `t2`.`start` IS NULL ASC, `t2`.`start` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the patient who made the appointment with the most recent start date.",
    "evidence": "",
    "idx": 4454
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`stay`:`stay`)\nWHERE `stay`.`room` = 112\nRETURN COUNT(`stay`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of patients who stayed in room 112.",
    "evidence": "",
    "idx": 4456
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t3`:`physician`)-[t2:prescribes]->(`t1`:`patient`)\nWHERE `t1`.`ssn` = `t2`.`patient`\nAND `t2`.`physician` = `t3`.`employeeid`\nAND (`t3`.`name` = 'John Dorian')\nRETURN COUNT(`t1`.`ssn`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of patients' prescriptions physician John Dorian made.",
    "evidence": "",
    "idx": 4458
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`stay`:`stay`)\nWHERE `stay`.`room` = 111\nORDER BY `stay`.`staystart` IS NULL ASC, `stay`.`staystart` DESC \nRETURN `stay`.`patient` AS `patient`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the patient who most recently stayed in room 111.",
    "evidence": "",
    "idx": 4459
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t2`:`room`)-[located_in_0:located_in]->(`t1`:`block`)\nWHERE `t1`.`blockfloor` = `t2`.`blockfloor` AND `t1`.`blockcode` = `t2`.`blockcode`\nWITH `t1`.`blockfloor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `blockfloor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of rooms located on each block floor.",
    "evidence": "",
    "idx": 4461
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`room`:`room`)\nWHERE toInteger(`room`.`unavailable`) = 0\nRETURN DISTINCT `room`.`blockcode` AS `blockcode`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Tell me the distinct block codes where some rooms are available.",
    "evidence": "",
    "idx": 4466
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`room`:`room`)\nRETURN COUNT(DISTINCT `room`.`roomtype`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of distinct room types available.",
    "evidence": "",
    "idx": 4468
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`physician`)-[t2:prescribes]->(`t3`:`medication`)\nWHERE `t1`.`employeeid` = `t2`.`physician`\nAND `t3`.`code` = `t2`.`medication`\nAND (`t3`.`name` = 'Thesisin')\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all the physicians who prescribe Thesisin as medication.",
    "evidence": "",
    "idx": 4470
  }
]