[
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`fbi_code`:`fbi_code`)\nWHERE `fbi_code`.`title` = 'Gambling'\nRETURN `fbi_code`.`fbi_code_no` AS `fbi_code_no`, `fbi_code`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the FBI code and definition of Gambling?",
    "evidence": "FBI code refers to fbi_code_no; definition refers to description; Gambling refers to title = 'Gambling'",
    "idx": 6628
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`iucr`:`iucr`)\nRETURN CASE WHEN COUNT(`iucr`.`iucr_no`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `iucr`.`index_code` = 'I' THEN `iucr`.`iucr_no` ELSE NULL END)) * 100 / COUNT(`iucr`.`iucr_no`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the crimes, what percentage are severe?",
    "evidence": "severe refers to index_code = 'I'; percentage = divide(count(iucr_no where index_code = 'I'), count(iucr_no)) * 100%",
    "idx": 6629
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t3`:`community_area`)\nWHERE `t2`.`ward_no` = `t1`.`ward_no`\nAND `t3`.`community_area_no` = `t2`.`community_area_no`\nRETURN CASE WHEN COUNT(DISTINCT `t3`.`side`)=0 THEN NULL ELSE toFloat(COUNT(`t1`.`ward_no`)) / COUNT(DISTINCT `t3`.`side`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On average, how many community areas are there in a side?",
    "evidence": "average = Divide(Count(ward_no), Count(side))",
    "idx": 6630
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nMATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t3`:`iucr`)\nWHERE `t2`.`district_no` = `t1`.`district_no`\nAND `t3`.`iucr_no` = `t2`.`iucr_no`\nAND (`t3`.`secondary_description` = 'RECKLESS HOMICIDE')\nRETURN CASE WHEN COUNT(DISTINCT `t1`.`district_name`)=0 THEN NULL ELSE toFloat(COUNT(`t2`.`report_no`)) / COUNT(DISTINCT `t1`.`district_name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of reckless homicides that happened in a district?",
    "evidence": "\"RECKLESS HOMICIDE\" is the secondary_description; average = Divide (Count(report_no), Count(district_name))",
    "idx": 6631
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[classified_as_0:classified_as]->(`t2`:`iucr`)\nWHERE `t2`.`iucr_no` = `t1`.`iucr_no`\nAND (`t2`.`secondary_description` = 'CHILD ABDUCTION')\nRETURN `t1`.`case_number` AS `case_number`, `t1`.`latitude` AS `latitude`, `t1`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the case number and coordinates of the places where child abduction is reported.",
    "evidence": "\"CHILD ABDUCTION\" is the secondary_description; coordinates refers to latitude, longitude",
    "idx": 6632
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nMATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t3`:`fbi_code`)\nWHERE `t2`.`iucr_no` = `t1`.`iucr_no`\nAND `t3`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t3`.`title` = 'Drug Abuse')\nRETURN CASE WHEN COUNT(`t1`.`secondary_description`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`secondary_description` =~ '(?i)(?s).*CANNABIS.*' THEN `t1`.`secondary_description`  END)) * 100 / COUNT(`t1`.`secondary_description`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In drug abuse crimes, what percentage is related to cannabis?",
    "evidence": "drug abuse crime refer to title = 'Drug Abuse'; percentage = Divide (Count (secondary_description LIKE '%CANNABIS%'), Count (secondary_description)) * 100",
    "idx": 6633
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nWHERE `t2`.`iucr_no` = `t1`.`iucr_no`\nAND (`t2`.`date` =~ '(?i)(?s)2/.*/2018.*' AND `t1`.`index_code` = 'N')\nRETURN CASE WHEN 28=0 THEN NULL ELSE toFloat(COUNT(`t2`.`case_number`)) / 28 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of less severe crimes reported a day in February of 2018?",
    "evidence": "day in February of 2018 refers to date LIKE '2/%/2018'; less severe crime refers to index_code = 'N'; average = Divide (Count(case_number), 28)",
    "idx": 6634
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nMATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t3`:`fbi_code`)\nWHERE `t2`.`district_no` = `t1`.`district_no`\nAND `t3`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t1`.`district_name` = 'Harrison')\nRETURN CASE WHEN COUNT(`t2`.`report_no`)=0 THEN NULL ELSE COUNT(CASE  WHEN `t3`.`title` = 'Disorderly Conduct' THEN `t2`.`report_no`  END) * 100.0 / COUNT(`t2`.`report_no`) END AS `per`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the incidents reported in Harrison, what percentage are disorderly conduct?",
    "evidence": "\"Harrison\" is the district_name;  'Disorderly Conduct' is the title; percentage = Divide (Count(title = 'Disorderly Conduct'), Count(report_no)) * 100; incident report refers to report_no",
    "idx": 6635
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nMATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t3`:`district`)\nWHERE `t2`.`iucr_no` = `t1`.`iucr_no`\nAND `t3`.`district_no` = `t2`.`district_no`\nRETURN round(CASE WHEN toFloat(COUNT(DISTINCT CASE  WHEN `t1`.`secondary_description` = 'VEHICULAR HIJACKING' THEN `t3`.`district_name`  END))=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`secondary_description` = 'VEHICULAR HIJACKING' THEN `t1`.`iucr_no`  END)) / toFloat(COUNT(DISTINCT CASE  WHEN `t1`.`secondary_description` = 'VEHICULAR HIJACKING' THEN `t3`.`district_name`  END)) END - CASE WHEN toFloat(COUNT(DISTINCT CASE  WHEN `t1`.`secondary_description` = 'AGGRAVATED VEHICULAR HIJACKING' THEN `t3`.`district_name`  END))=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`secondary_description` = 'AGGRAVATED VEHICULAR HIJACKING' THEN `t1`.`iucr_no`  END)) / toFloat(COUNT(DISTINCT CASE  WHEN `t1`.`secondary_description` = 'AGGRAVATED VEHICULAR HIJACKING' THEN `t3`.`district_name`  END)) END,4) AS `difference`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference in the average number of vehicular hijackings and aggravated vehicular hijackings in the districts.",
    "evidence": "\"VEHICULAR HIJACKING\" and \"AGGRAVATED VEHICULAR HIJACKING\" are both secondary_description; difference in average = Subtract (Divide(Count(secondary_description = 'VEHICULAR HIJACKING'), Count(district_name)), Divide(Count(secondary_description = \"AGGRAVATED VEHICULAR HIJACKING\"), Count(district_name)))",
    "idx": 6636
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`crime`:`crime`)\nWHERE `crime`.`longitude` = '-87.72658001'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crimes happened in longitude -8772658001?",
    "evidence": "",
    "idx": 6637
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`iucr`:`iucr`)\nWHERE `iucr`.`primary_description` = 'NARCOTICS'\nWITH `iucr`.`secondary_description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `secondary_description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the crimes of the narcotic type that exist.",
    "evidence": "narcotic type refers to primary_description = 'NARCOTICS'; crime refers to secondary_description",
    "idx": 6638
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`ward`:`ward`)\nWHERE `ward`.`population` > 50000\nRETURN `ward`.`alderman_first_name` AS `alderman_first_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the first name of the aldermen of wards with more than 50,000 inhabitants?",
    "evidence": "more than 50000 inhabitants refers to Population > 50000; first name of alderman refers to alderman_first_name",
    "idx": 6639
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t2`.`fbi_code_no` = `t1`.`fbi_code_no`\nAND (`t1`.`title` = 'Drug Abuse')\nRETURN `t2`.`report_no` AS `report_no`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List crimes that the FBI has classified as Drug Abuse by their report number.",
    "evidence": "\"Drug Abuse\" is the title of crime",
    "idx": 6640
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nMATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t3`:`district`)\nWHERE `t2`.`iucr_no` = `t1`.`iucr_no`\nAND `t3`.`district_no` = `t2`.`district_no`\nAND (`t1`.`primary_description` = 'WEAPONS VIOLATION')\nRETURN sum(CASE  WHEN `t3`.`district_name` = 'Calumet' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many weapons violation crimes have occurred in the Calumet district?",
    "evidence": "\"Calumet\" is the district_name; 'WEAPON VIOLATION' is the primary_description of crime",
    "idx": 6641
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t2`.`community_area_no` = `t1`.`community_area_no`\nAND (`t1`.`community_area_name` = 'Belmont Cragin')\nWITH `t2`.`latitude` AS _groupby_col_0, `t2`.`longitude` AS _groupby_col_1\nRETURN _groupby_col_0 AS `latitude`, _groupby_col_1 AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the exact location of the crimes that occurred in the Belmont Cragin community?",
    "evidence": "Belmont Cragin community refers to community_area_name = 'Belmont Cragin'; exact location refers to latitude, longitude",
    "idx": 6642
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t2`.`district_no` = `t1`.`district_no`\nAND (`t1`.`commander` = 'Ronald A. Pontecore Jr.')\nRETURN sum(CASE  WHEN `t2`.`domestic` = 'TRUE' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many domestic crime cases has Commander Ronald A. Pontecore Jr. been responsible for investigating?",
    "evidence": "domestic crime refers to domestic = 'TRUE'; person responsible for investigating refers to commander",
    "idx": 6643
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nMATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t3`:`district`)\nWHERE `t2`.`fbi_code_no` = `t1`.`fbi_code_no`\nAND `t3`.`district_no` = `t2`.`district_no`\nAND (`t3`.`district_name` = 'Wentworth')\nRETURN sum(CASE  WHEN `t1`.`crime_against` = 'Society' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crimes against society happened in the Wentworth district according to the FBI?",
    "evidence": "\"Wentworth\" is the district_name; crime against society refers to crime_against = 'Society\"",
    "idx": 6644
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nMATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t3`:`district`)\nWHERE `t2`.`ward_no` = `t1`.`ward_no`\nAND `t3`.`district_no` = `t2`.`district_no`\nAND (`t1`.`alderman_first_name` = 'Emma' AND `t1`.`alderman_last_name` = 'Mitts')\nRETURN `t3`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What phone number does alderman Emma Mitts have to call if she wants to speak to the commander in charge of the investigation of the crimes that have occurred in her ward?",
    "evidence": "",
    "idx": 6645
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t3`:`community_area`)\nWHERE `t2`.`fbi_code_no` = `t1`.`fbi_code_no`\nAND `t3`.`community_area_no` = `t2`.`community_area_no`\nAND (`t1`.`description` = 'The theft of a motor vehicle.')\nRETURN sum(CASE  WHEN `t3`.`community_area_name` = 'Lake View' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crimes described as 'The theft of a motor vehicle' by the FBI have taken place in the Lake View community?",
    "evidence": "lake view community refers to community_area_name = 'Lake View'; 'The theft of a motor vehicle' is the description",
    "idx": 6646
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t2`.`district_no` = `t1`.`district_no`\nAND (`t1`.`district_name` = 'Jefferson Park')\nRETURN CASE WHEN COUNT(`t2`.`case_number`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t2`.`domestic` = 'FALSE' THEN `t2`.`case_number`  END)) * 100 / COUNT(`t2`.`case_number`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of non-domestic crimes have occurred in the Jefferson Park district?",
    "evidence": "non domestic crime refers to domestic = 'FALSE'; 'Jefferson Park' is the district_name; percentage = Divide (Count (case_number where domestic = 'FALSE'), Count(case_number)) * 100",
    "idx": 6647
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t2`:`ward`)\nWHERE `t2`.`ward_no` = `t1`.`ward_no`\nAND (`t1`.`location_description` = 'APARTMENT' AND `t1`.`arrest` = 'FALSE')\nRETURN avg(`t2`.`population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average population of the wards where apartment crimes have been reported without arrests?",
    "evidence": "apartment crime refers to location_description = 'APARTMENT';  without arrest refers to arrest = 'FALSE'; average population = AVG(Population)",
    "idx": 6648
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`ward`:`ward`)\nORDER BY `ward`.`population` IS NULL ASC, `ward`.`population` DESC \nRETURN `ward`.`alderman_first_name` AS `alderman_first_name`, `ward`.`alderman_last_name` AS `alderman_last_name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the full names of the top 5 most crowded ward aldermen?",
    "evidence": "most crowded ward refers to Max(Population); full name of alderman refers to alderman_first_name, alderman_last_name",
    "idx": 6649
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`fbi_code`:`fbi_code`)\nWHERE `fbi_code`.`crime_against` = 'Property'\nRETURN COUNT(*) AS `cnt`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crime against property are there?",
    "evidence": "",
    "idx": 6650
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`zip_code` = 60608\nRETURN COUNT(*) AS `cnt`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many districts are there in the police district building with a zip code of 60608?",
    "evidence": "district refers to district_name",
    "idx": 6651
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`fbi_code`:`fbi_code`)\nWHERE `fbi_code`.`title` = 'Criminal Sexual Abuse'\nRETURN `fbi_code`.`crime_against` AS `crime_against`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the crime against criminal sexual abuse?",
    "evidence": "\"Criminal Sexual Abuse\" is the title of crime",
    "idx": 6652
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`neighborhood`)-[located_in_0:located_in]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nORDER BY `t2`.`community_area_no` IS NULL ASC, `t2`.`community_area_no` DESC \nRETURN `t1`.`community_area_name` AS `community_area_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which community has the highest number of neighborhoods?",
    "evidence": "community with highest number of neighborhoods refers to Max(Count(community_area_no)); community refers to community_area_name",
    "idx": 6653
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)\nMATCH (`t2`:`iucr`)\nWHERE `t1`.`report_no` = `t2`.`iucr_no`\nAND (`t2`.`index_code` = 'I' AND `t1`.`latitude` = '41.64820251')\nRETURN sum(CASE  WHEN `t1`.`longitude` = '-87.54430496' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many severe crime incidents were reported at coordinate 41.64820151, -87.54430496?",
    "evidence": "coordinates refers to latitude, longitude; severe crime refers to index_code = 'I'",
    "idx": 6654
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nWHERE `t1`.`iucr_no` = `t2`.`iucr_no`\nAND (`t2`.`location_description` = 'DAY CARE CENTER' AND `t1`.`secondary_description` = 'FORCIBLE ENTRY' AND `t1`.`primary_description` = 'BURGLARY')\nRETURN sum(CASE  WHEN `t2`.`arrest` = 'TRUE' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many arrests have been made due to forcible entry burglary that took place in a day care center?",
    "evidence": "\"BURGLARY\" is the primary_description; 'FORCIBLE ENTRY' is the secondary_description; 'DAY CARE CENTER' is the location_description; arrests have been made refers to arrest = 'TRUE'",
    "idx": 6655
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "CALL(*) {\nMATCH (`community_area_sub0`:`community_area`)\nRETURN min(`community_area_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND (`t1`.`population` = `_col_0` AND NOT `t2`.`location_description` IS NULL)\nWITH `t2`.`location_description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `location_description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the least populated community, what is the most common location of all the reported crime incidents?",
    "evidence": "least populated refers to Min(Population); community refers to community_area_no; most common location refers to Max(Count(location_description))",
    "idx": 6656
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t2`.`arrest` = 'FALSE')\nRETURN sum(CASE  WHEN `t1`.`description` =~ '(?i)(?s).*The violation of laws.*' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many violation of laws are there where no arrest has been made?",
    "evidence": "\"The violation of laws \" is the description of incidents; no arrest has been made refers to arrest = 'FALSE'",
    "idx": 6657
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t3`:`community_area`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND `t2`.`community_area_no` = `t3`.`community_area_no`\nAND (`t1`.`title` = 'Simple Assault' AND `t3`.`community_area_name` = 'Chatham' AND `t3`.`community_area_no` = 44)\nRETURN `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude` ORDER BY `t2`.`latitude` IS NULL ASC, `t2`.`latitude` DESC, `t2`.`longitude` IS NULL ASC, `t2`.`longitude` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the precise coordinate of the location where simple assault incidents happened the most in Chatham?",
    "evidence": "precise coordinates refers to latitude, longitude; 'Simple Assault' is the title of incident; 'Chatham' is the community_area_name; most incident happened refers to Max(Count(latitude, longitude))",
    "idx": 6658
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t3`:`community_area`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND `t2`.`community_area_no` = `t3`.`community_area_no`\nAND (`t1`.`crime_against` = 'Society')\nRETURN sum(CASE  WHEN `t3`.`community_area_name` = 'Englewood' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crime against society were reported in Englewood?",
    "evidence": "\"Englewood\" is the community_area_name; 'Society' is the crime_against",
    "idx": 6659
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (CASE  WHEN 1-1 < 0 AND 1 < 0  THEN substring(`t2`.`date`,(case when size(`t2`.`date`)+1+(1-1)+1 < 0 then 0 else size(`t2`.`date`)+1+(1-1)+1 end),-(1))  WHEN 1-1 < 0 AND 1 >= 0  THEN substring(`t2`.`date`,size(`t2`.`date`)+1+(1-1),1)  WHEN 1-1 >= 0 AND 1 < 0  THEN substring(`t2`.`date`,(case when 1-1+1+(1) < 0 then 0 else 1-1+1+(1) end),-(1))  ELSE substring(`t2`.`date`,1-1,1) END = '1' AND CASE  WHEN 5-1 < 0 AND 4 < 0  THEN substring(`t2`.`date`,(case when size(`t2`.`date`)+1+(5-1)+4 < 0 then 0 else size(`t2`.`date`)+1+(5-1)+4 end),-(4))  WHEN 5-1 < 0 AND 4 >= 0  THEN substring(`t2`.`date`,size(`t2`.`date`)+1+(5-1),4)  WHEN 5-1 >= 0 AND 4 < 0  THEN substring(`t2`.`date`,(case when 5-1+1+(4) < 0 then 0 else 5-1+1+(4) end),-(4))  ELSE substring(`t2`.`date`,5-1,4) END = '2018')\nRETURN CASE WHEN 4=0 THEN NULL ELSE toFloat(COUNT(`t1`.`fbi_code_no`)) / 4 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the weekly average number of fraud incidents that were reported in January 2018? Provide the description of the location where the majority of fraud incidents occurred in the said month.",
    "evidence": "fraud incident refers to title = 'Fraud'; reported in January 2018 refers to Substr(date, 1, 1) = '1' AND Substr(date, 5, 4) = '2018'; description of location refers to location_description; weekly average refers to Divide (Count(report_no), 4); majority of incidents occurred refers to Max(Count(location_description))",
    "idx": 6660
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nWHERE `community_area`.`population` > '50000'\nRETURN `community_area`.`community_area_name` AS `community_area_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any three community areas with a population of more than 50,000.",
    "evidence": "population of more than 50000 refers to Population > 50000; community area refers to community_area_name",
    "idx": 6661
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nWHERE `community_area`.`side` = 'Central'\nRETURN `community_area`.`community_area_name` AS `community_area_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the communities that are grouped together on the central side?",
    "evidence": "central side refers to side = 'Central'; community refers to community_area_name",
    "idx": 6662
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`community_area`:`community_area`)\nWHERE `community_area`.`population` > '300000'\nRETURN sum(CASE  WHEN `community_area`.`side` = 'South ' THEN 1 ELSE 0 END) - sum(CASE  WHEN `community_area`.`side` = 'North' THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference between the number of communities that are located on the north and south sides with a population of more than 30,000?",
    "evidence": "population of more than 30000 refers to Population > 30000; 'North' and 'South' both are the side; different number of community refers to Subtract(Count(Community_area_no where side = 'South'), Count(Community_area_no where side = 'North'))",
    "idx": 6663
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`district_name` = 'Near West'\nRETURN `district`.`phone` AS `phone`, `district`.`fax` AS `fax`, `district`.`tty` AS `tty`, `district`.`twitter` AS `twitter`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all of the contact information for the police district Near West.",
    "evidence": "\"Near West\" is the district_name; all contact information refers to phone, fax, tty, twitter",
    "idx": 6664
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`district_name` = 'Lincoln'\nRETURN `district`.`commander` AS `commander`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is responsible for crime cases in district Lincoln?",
    "evidence": "\"Lincoln\" is the district_name; responsible for crime case refers to commander",
    "idx": 6665
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`iucr`:`iucr`)\nWHERE `iucr`.`iucr_no` = '275'\nRETURN `iucr`.`primary_description` AS `primary_description`, `iucr`.`secondary_description` AS `secondary_description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the general and specific description of incident 275?",
    "evidence": "incident 275 refers to iucr_no = 275; general description refers to primary_description; specific description refers to secondary_description",
    "idx": 6666
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`iucr`:`iucr`)\nWHERE `iucr`.`index_code` = 'I'\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `iucr`.`primary_description` = 'CRIM SEXUAL ASSAULT' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of severe cases that are related to sexual assault?",
    "evidence": "related to sexual assault refers to primary_description = 'CRIME SEXUAL ASSAULT'; severe case refers to index_code = 'I'; percentage = Divide (Count (iucr_no where primary_description = 'CRIME SEXUAL ASSAULT'), Count (iucr_no)) * 100",
    "idx": 6667
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`neighborhood`)-[located_in_0:located_in]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND (`t1`.`community_area_name` = 'North Center')\nRETURN `t2`.`neighborhood_name` AS `neighborhood_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the neighborhoods that are located in the North Center community area?",
    "evidence": "\"North Center\" is the community_area_name; neighborhoods refers to neighborhood_name",
    "idx": 6668
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`neighborhood`)-[located_in_0:located_in]->(`t2`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nRETURN sum(CASE  WHEN `t2`.`community_area_name` = 'Forest Glen' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many neighborhoods can be found in the Forest Glen community area?",
    "evidence": "\"Forest Glen\" is the community_area_name; neighborhoods refers to neighborhood_name",
    "idx": 6669
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[categorized_as_0:categorized_as]->(`t2`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nRETURN sum(CASE  WHEN `t2`.`title` = 'Weapons Violation' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crime cases have been classified as \"Weapons Violation\" by the FBI?",
    "evidence": "\"Weapons Violation\" is the title of crime; crime cases refers to report_no;",
    "idx": 6670
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t1`.`title` = 'Criminal Sexual Assault' AND `t2`.`arrest` = 'TRUE' AND `t1`.`crime_against` = 'Persons')\nRETURN `t2`.`case_number` AS `case_number`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any three criminal sexual assault cases against persons where the criminals have been arrested.",
    "evidence": "\"Criminal Sexual Assault\" is the title of crime; against person refers to crime_against = 'Persons'; criminals have been arrested refers to arrest = 'TRUE'; cases refers to case_number",
    "idx": 6671
  }
]