[
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t2`:`ranking_criteria`)-[belongs_to_system_0:belongs_to_system]->(`t1`:`ranking_system`)\nWHERE `t1`.`id` = `t2`.`ranking_system_id`\nAND (`t2`.`criteria_name` = 'Quality of Education Rank')\nRETURN `t1`.`system_name` AS `system_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ranking system of the ranking criteria named Quality of Education Rank.",
    "evidence": "criteria named Quality of Education Rank refers to criteria_name = 'Quality of Education Rank'; ranking system refers to system_name;",
    "idx": 6133
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`country_id` = `t2`.`id`\nAND (`t1`.`id` = 112)\nRETURN `t2`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the location of the university ID 112.",
    "evidence": "location refers to country_name",
    "idx": 6135
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t2`:`university_year`)-[for_university_0:for_university]->(`t1`:`university`)-[located_in_0:located_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`university_id`\nAND `t3`.`id` = `t1`.`country_id`\nAND (`t3`.`country_name` = 'Sweden')\nRETURN sum(`t2`.`num_students`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total number of students in universities located in Sweden.",
    "evidence": "located in Sweden refers to country_name = 'Sweden'; number of students refers to num_students",
    "idx": 6136
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`country_id` = `t2`.`id`\nAND (`t2`.`country_name` = 'Spain')\nRETURN `t1`.`university_name` AS `university_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of universities located in Spain.",
    "evidence": "name of universities refers to university_name; located in Spain refers to country_name = 'Spain';",
    "idx": 6138
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university`)-[t2:has_ranking]->()\nMATCH (`t1`:`university`)-[located_in_0:located_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`university_id`\nAND `t3`.`id` = `t1`.`country_id`\nAND (`t3`.`country_name` = 'Brazil')\nRETURN avg(`t2`.`score`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compute the average score of the university located in Brazil.",
    "evidence": "average score refers to avg(score); located in Brazil refers to country_name = 'Brazil';",
    "idx": 6140
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)\nMATCH ()-[t2:has_ranking]->()\nWHERE `t1`.`university_id` = `t2`.`university_id`\nAND (`t2`.`year` = 2015 AND `t1`.`university_id` = 100)\nRETURN CASE WHEN 100=0 THEN NULL ELSE toFloat(`t1`.`num_students` * `t1`.`pct_international_students`) / 100 END AS `_col_0`, `t2`.`score` AS `score`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the score and number of international students in university ID 100 in 2015.",
    "evidence": "number of international students refers to DIVIDE(MULTIPLY(num_students, pct_international_students), 100); in 2015 refers to year = 2015",
    "idx": 6142
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t2`:`ranking_criteria`)-[belongs_to_system_0:belongs_to_system]->(`t1`:`ranking_system`)\nWHERE `t1`.`id` = `t2`.`ranking_system_id`\nAND (`t1`.`system_name` = 'Center for World University Rankings')\nRETURN `t2`.`criteria_name` AS `criteria_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the criteria names under the ranking system called Center for World University Ranking.",
    "evidence": "ranking system called Center for World University Ranking refers to system_name = 'Center for World University Rankings';",
    "idx": 6144
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "CALL(*) {\nMATCH (`university_year_sub0`:`university_year`)\nRETURN avg(`university_year_sub0`.`num_students`) AS `_col_0`  \n}\nMATCH (`t2`:`university_year`)-[for_university_0:for_university]->(`t1`:`university`)-[located_in_0:located_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`university_id`\nAND `t3`.`id` = `t1`.`country_id`\nAND (`t2`.`year` = 2013 AND `t2`.`num_students` * 100 > `_col_0` * 98)\nRETURN DISTINCT `t3`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the country name of universities with the number of students greater than 98% of the average student population of all universities in 2013.",
    "evidence": "number of students greater than 98% of the average student population of all universities refers to num_students >  MULTPLY(num_students, 0.98); in 2013 refers to year = 2013",
    "idx": 6145
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university_year`:`university_year`)\nWHERE `university_year`.`year` = 2012\nORDER BY `university_year`.`pct_female_students` IS NULL ASC, `university_year`.`pct_female_students` DESC \nRETURN `university_year`.`university_id` AS `university_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ID of the university with the highest percentage of female students in 2012.",
    "evidence": "in 2012 refers to year = 2012; highest percentage of female students  refers to MAX(pct_female_students); ID of the university refers to university_id",
    "idx": 6152
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t1`.`year` = 2011)\nORDER BY `t1`.`num_students` IS NULL ASC, `t1`.`num_students` DESC \nRETURN `t2`.`university_name` AS `university_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the university that had the most students in 2011.",
    "evidence": "in 2011 refers to year = 2011; had the most students refers to MAX(num_students); name of university refers to university_name;",
    "idx": 6154
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university`)-[t2:has_ranking]->()\nMATCH (`t3`:`ranking_criteria`)-[t2:has_ranking]->()\nWHERE `t1`.`id` = `t2`.`university_id`\nAND `t3`.`id` = `t2`.`ranking_criteria_id`\nAND (`t3`.`criteria_name` = 'Teaching')\nORDER BY `t2`.`score` IS NULL ASC, `t2`.`score` DESC \nRETURN `t1`.`university_name` AS `university_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the university's name with the highest ranking score in Teaching.",
    "evidence": "university's name refers to university_name; highest ranking score refers to MAX(score); in Teaching refers to criteria_name = 'Teaching'",
    "idx": 6155
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`ranking_system`:`ranking_system`)\nWHERE `ranking_system`.`system_name` = 'Center for World University Rankings'\nRETURN `ranking_system`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ranking system ID of the Center for World University Rankings.",
    "evidence": "the Center for World University Rankings refers to system_name = 'Center for World University Rankings';",
    "idx": 6167
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t2`.`university_name` = 'Yale University' AND `t1`.`year` = 2016)\nRETURN `t1`.`num_students` AS `num_students`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of students at Yale University in 2016.",
    "evidence": "number of students refers to num_students; Yale University refers to university_name = 'Yale University'; in 2016 refers to year = 2016",
    "idx": 6171
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`country_id` = `t2`.`id`\nAND (`t2`.`country_name` = 'Denmark')\nRETURN `t1`.`university_name` AS `university_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the universities in Denmark.",
    "evidence": "in Denmark refers to country_name = 'Denmark'; name of university refers to university_name;",
    "idx": 6172
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t2`.`university_name` = 'University of Auckland' AND `t1`.`year` = 2015)\nRETURN CASE WHEN sum(`t1`.`student_staff_ratio`)=0 THEN NULL ELSE toFloat(sum(`t1`.`num_students`)) / sum(`t1`.`student_staff_ratio`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of staff at the University of Auckland in 2015.",
    "evidence": "University of Auckland refers to university_name = 'University of Auckland'; in 2015 refers to year = 2015; number of staff refers to DIVIDE(num_students, student_staff_ratio)",
    "idx": 6173
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t2`:`university_year`)-[for_university_0:for_university]->(`t1`:`university`)\nWHERE `t1`.`id` = `t2`.`university_id`\nAND (`t1`.`university_name` = 'Arizona State University' AND `t2`.`year` = 2014)\nRETURN CASE WHEN 100=0 THEN NULL ELSE toFloat(`t2`.`num_students` * `t2`.`pct_female_students`) / 100 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the number of female students at Arizona State University in 2014.",
    "evidence": "female students refers to DIVIDE(MULTIPLY(pct_female_students, num_students), 100); at Arizona State University refers to university_name = 'Arizona State University'; in 2014 refers to year = 2014",
    "idx": 6176
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t2`:`ranking_criteria`)-[belongs_to_system_0:belongs_to_system]->(`t1`:`ranking_system`)\nWHERE `t1`.`id` = `t2`.`ranking_system_id`\nAND (`t1`.`system_name` = 'Shanghai Ranking')\nRETURN `t2`.`criteria_name` AS `criteria_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ranking criteria under the Shanghai Ranking system.",
    "evidence": "Shanghai Ranking system refers to system_name = 'Shanghai Ranking'; ranking criteria refers to criteria_name",
    "idx": 6177
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`ranking_criteria`)-[t2:has_ranking]->()\nMATCH (`t3`:`university`)-[t2:has_ranking]->()\nWHERE `t1`.`id` = `t2`.`ranking_criteria_id`\nAND `t3`.`id` = `t2`.`university_id`\nAND (`t3`.`university_name` = 'Harvard University' AND `t2`.`year` = 2005)\nRETURN `t1`.`criteria_name` AS `criteria_name`, `t2`.`score` AS `score`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ranking criteria and scores in 2005 that were received by Harvard University.",
    "evidence": "Harvard University refers to university_name = 'Harvard University'; in 2005 refers to year = 2005; ranking criteria refers to criteria_name;",
    "idx": 6180
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`ranking_criteria`)-[t2:has_ranking]->()\nWHERE `t1`.`id` = `t2`.`ranking_criteria_id`\nAND (`t1`.`criteria_name` = 'Alumni' AND `t2`.`year` = 2008)\nRETURN avg(`t2`.`score`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average score per university under Alumni criteria in 2008.",
    "evidence": "under Alumni criteria refers to criteria_name = 'Alumni'; in 2008 refers to year = 2008; average score refers to DIVIDE(SUM(score), COUNT(university_id))",
    "idx": 6181
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t2`:`university_year`)-[for_university_0:for_university]->(`t1`:`university`)-[located_in_0:located_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`university_id`\nAND `t3`.`id` = `t1`.`country_id`\nAND (`t2`.`year` = 2015)\nORDER BY `t2`.`num_students` IS NULL ASC, `t2`.`num_students` DESC \nRETURN `t1`.`university_name` AS `university_name`, `t3`.`country_name` AS `country_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the university and country which had the highest number of international students in 2015.",
    "evidence": "highest number of international students refers to MAX(DIVIDE(MULTIPLY(num_students, pct_international_students), 100)); in 2015 refers to year = 2015; name of university refers to university_name;",
    "idx": 6182
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university_year`:`university_year`)\nWHERE `university_year`.`year` = 2011 AND `university_year`.`student_staff_ratio` > 15\nRETURN `university_year`.`university_id` AS `university_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the universities with a student staff ratio of over 15 in 2011.",
    "evidence": "in 2011 refers to year 2011; student staff ratio of over 15 refers to student_staff_ratio > 15; ID of the university refers to university_id",
    "idx": 6185
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university_year`:`university_year`)\nWHERE `university_year`.`year` = 2011\nORDER BY `university_year`.`pct_female_students` IS NULL ASC, `university_year`.`pct_female_students` DESC \nRETURN `university_year`.`university_id` AS `university_id`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the universities with the top 3 female students percentage in 2011.",
    "evidence": "in 2011 refers to year 2011; top 3 female students percentage refers to MAX(pct_female_students) LIMIT 3; ID of the university refers to university_id",
    "idx": 6187
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`country_id` = `t2`.`id`\nAND (`t2`.`country_name` = 'Australia')\nRETURN `t1`.`university_name` AS `university_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the universities in Australia.",
    "evidence": "in Australia refers to country_name = 'Australia'; name of university refers to university_name",
    "idx": 6191
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`ranking_criteria`)-[t2:has_ranking]->()\nMATCH (`t3`:`university`)-[t2:has_ranking]->()\nWHERE `t1`.`id` = `t2`.`ranking_criteria_id`\nAND `t3`.`id` = `t2`.`university_id`\nAND (`t1`.`criteria_name` = 'Teaching' AND `t2`.`year` = 2011 AND `t2`.`score` > 90)\nRETURN `t3`.`university_name` AS `university_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the universities with a score in teaching of over 90 in 2011.",
    "evidence": "in 2011 refers to year 2011; in teaching refers to  criteria_name = 'Teaching'; score in teaching of over 90 refers to score > 90; name of university refers to university_name;",
    "idx": 6195
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`ranking_criteria`)-[t2:has_ranking]->()\nMATCH (`t3`:`university`)-[t2:has_ranking]->()\nWHERE `t1`.`id` = `t2`.`ranking_criteria_id`\nAND `t3`.`id` = `t2`.`university_id`\nAND (`t3`.`university_name` = 'Harvard University' AND `t2`.`year` = 2011)\nRETURN `t1`.`criteria_name` AS `criteria_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the ranking criteria of Harvard University in 2011.",
    "evidence": "in 2011 refers to year 2011; Harvard University refers to university_name = 'Harvard University'; names of all the ranking criteria refers to criteria_name",
    "idx": 6197
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`ranking_system`:`ranking_system`)\nWHERE `ranking_system`.`system_name` = 'Center for World University Rankings'\nRETURN `ranking_system`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the id of \"Center for World University Rankings\".",
    "evidence": "\"Center for World University Rankings\" refers to system_name = 'Center for World University Rankings';",
    "idx": 6201
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`university_name` = 'University of Veterinary Medicine Vienna'\nRETURN `university`.`country_id` AS `country_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country is University of Veterinary Medicine Vienna located in? Give its country id.",
    "evidence": "University of Veterinary Medicine Vienna refers to university_name = 'University of Veterinary Medicine Vienna';",
    "idx": 6202
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`ranking_criteria`:`ranking_criteria`)\nWHERE `ranking_criteria`.`criteria_name` = 'Citations Rank'\nRETURN `ranking_criteria`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the id of the criteria \"Citations Rank\"?",
    "evidence": "criteria \"Citations Rank\" refers to criteria_name = 'Citations Rank';",
    "idx": 6203
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`university_name` = 'University of Orléans'\nRETURN `university`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the id of University of Orléans.",
    "evidence": "University of Orléans refers to university_name = 'University of Orléans';",
    "idx": 6204
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university_year`:`university_year`)\nWHERE `university_year`.`university_id` = 268 AND `university_year`.`year` = 2013\nRETURN `university_year`.`num_students` AS `num_students`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the university id 268, show its number of students in 2013.",
    "evidence": "number of students refers to num_students; in 2013 refers to year = 2013",
    "idx": 6205
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`id` = 66\nRETURN `country`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the name of country id 66.",
    "evidence": "name of country refers to country_name",
    "idx": 6206
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`ranking_criteria`)-[t2:has_ranking]->()\nMATCH (`t3`:`university`)-[t2:has_ranking]->()\nWHERE `t1`.`id` = `t2`.`ranking_criteria_id`\nAND `t3`.`id` = `t2`.`university_id`\nAND (`t3`.`university_name` = 'Chosun University' AND `t1`.`criteria_name` = 'Influence Rank' AND `t2`.`year` = 2015)\nRETURN `t2`.`score` AS `score`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For Chosun University, what was its score on \"Influence Rank\" in 2015?",
    "evidence": "Chosun University refers to university_name = 'Chosun University'; in 2015 refers to year = 2015; on \"Influence Rank\" refers to criteria_name = 'Influence Rank';",
    "idx": 6211
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t2`:`ranking_criteria`)-[belongs_to_system_0:belongs_to_system]->(`t1`:`ranking_system`)\nWHERE `t1`.`id` = `t2`.`ranking_system_id`\nAND (`t2`.`criteria_name` = 'Total Shanghai')\nRETURN `t1`.`system_name` AS `system_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which ranking system is criteria \"Total Shanghai\" in?",
    "evidence": "criteria \"Total Shanghai\" refers to criteria_name = 'Total Shanghai'; which ranking system refers to system_name",
    "idx": 6214
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`ranking_criteria`)-[t2:has_ranking]->()\nMATCH (`t3`:`university`)-[t2:has_ranking]->()\nWHERE `t1`.`id` = `t2`.`ranking_criteria_id`\nAND `t3`.`id` = `t2`.`university_id`\nAND (`t3`.`university_name` = 'University of Florida' AND `t2`.`year` = 2014 AND `t1`.`criteria_name` = 'N and S')\nRETURN `t2`.`score` AS `score`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the score for University of Florida in \"N and S\" in 2014?",
    "evidence": "University of Florida refers to university_name = 'University of Florida'; in 2014 refers to year = 2014; in \"N and S\" refers to criteria_name = 'N and S'",
    "idx": 6216
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t1`.`year` = 2013 AND `t2`.`university_name` = 'University of Wisconsin-Madison')\nRETURN CASE WHEN 100=0 THEN NULL ELSE toFloat(`t1`.`num_students` * `t1`.`pct_international_students`) / 100 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the number of international students of University of Wisconsin-Madison in 2013.",
    "evidence": "international students refers to DIVIDE(MULTIPLY(num_students, pct_international_students), 100); University of Wisconsin-Madison refers to university_name = 'University of Wisconsin-Madison'; in 2013 refers to year = 2013",
    "idx": 6217
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t1`.`year` = 2015)\nORDER BY `t1`.`num_students` IS NULL DESC, `t1`.`num_students`  \nRETURN `t2`.`university_name` AS `university_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the name of the university with the lowest number of students in 2015.",
    "evidence": "lowest number of students refers to MIN(num_students); in 2015 refers to year = 2015; name of university refers to university_name;",
    "idx": 6218
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t2`:`ranking_criteria`)-[belongs_to_system_0:belongs_to_system]->(`t1`:`ranking_system`)\nWHERE `t1`.`id` = `t2`.`ranking_system_id`\nRETURN CASE WHEN 3=0 THEN NULL ELSE (sum(CASE  WHEN `t1`.`system_name` = 'Center for World University Rankings' THEN 1 ELSE 0 END) + sum(CASE  WHEN `t1`.`system_name` = 'Shanghai Ranking' THEN 1 ELSE 0 END) + sum(CASE  WHEN `t1`.`system_name` = 'Times Higher Education World University Ranking' THEN 1 ELSE 0 END)) / 3 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average number of criterias among \"Times Higher Education World University Ranking\",\"Shanghai Ranking\" and \"Center for World University Rankings\".",
    "evidence": "average number of criterias refers to DIVIDE(SUM(id), 3); \"Times Higher Education World University Ranking\", \"Shanghai Ranking\" and \"Center for World University Rankings\" refers to system_name IN ('Times Higher Education World University Ranking', 'Shanghai Ranking', 'Center for World University Rankings');",
    "idx": 6220
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university_year`:`university_year`)\nWHERE `university_year`.`year` = 2012\nRETURN avg(`university_year`.`num_students`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average number of students of all universities in 2012.",
    "evidence": "average number of students refers to avg(num_students); in 2012 refers to year = 2012",
    "idx": 6221
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`country_name` = 'Cyprus'\nRETURN `country`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the country ID of Cyprus.",
    "evidence": "Cyprus refers to country_name = 'Cyprus';",
    "idx": 6223
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`ranking_criteria`:`ranking_criteria`)\nWHERE `ranking_criteria`.`id` = 13\nRETURN `ranking_criteria`.`criteria_name` AS `criteria_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the criteria name of the ranking criteria ID 13.",
    "evidence": "",
    "idx": 6225
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university_year`:`university_year`)\nWHERE `university_year`.`university_id` = 35\nRETURN `university_year`.`student_staff_ratio` AS `student_staff_ratio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the student staff ratio of university ID 35.",
    "evidence": "",
    "idx": 6229
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)\nMATCH ()-[t2:has_ranking]->()\nWHERE `t1`.`university_id` = `t2`.`university_id`\nAND (`t1`.`year` = 2011)\nORDER BY `t1`.`num_students` IS NULL ASC, `t1`.`num_students` DESC \nRETURN `t2`.`score` AS `score`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the score of the most populated university in 2011.",
    "evidence": "most populated university refers to MAX(num_students); in 2011 refers to year = 2011;",
    "idx": 6230
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university`)-[t2:has_ranking]->()\nMATCH (`t3`:`ranking_criteria`)-[t2:has_ranking]->()\nWHERE `t1`.`id` = `t2`.`university_id`\nAND `t3`.`id` = `t2`.`ranking_criteria_id`\nAND (`t1`.`university_name` = 'Harvard University' AND `t2`.`score` = 100)\nRETURN DISTINCT `t3`.`criteria_name` AS `criteria_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the criteria name where Harvard University scored 100.",
    "evidence": "Harvard University refers to university_name = 'Harvard University'; scored 100 refers to score = 100",
    "idx": 6231
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`country_id` = `t2`.`id`\nAND (`t2`.`country_name` = 'Turkey')\nRETURN `t1`.`university_name` AS `university_name`, `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the university name and ID of the university found in Turkey.",
    "evidence": "found in Turkey refers to country_name = 'Turkey';",
    "idx": 6232
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nORDER BY CASE WHEN 100=0 THEN NULL ELSE `t1`.`num_students` * `t1`.`pct_female_students` / 100 END - `t1`.`num_students` IS NULL ASC, CASE WHEN 100=0 THEN NULL ELSE `t1`.`num_students` * `t1`.`pct_female_students` / 100 END - `t1`.`num_students` DESC \nRETURN `t2`.`university_name` AS `university_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of the university with the highest number of male students.",
    "evidence": "highest number of female students refers to MAX(SUBTRACT(num_students, DIVIDE(MULTIPLY(num_students, pct_female_students), 100))); name of university refers to university_name",
    "idx": 6238
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university`)-[t2:has_ranking]->()\nMATCH (`t1`:`university`)-[located_in_0:located_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`university_id`\nAND `t3`.`id` = `t1`.`country_id`\nAND (`t2`.`score` < 70 AND `t2`.`year` = 2016)\nRETURN DISTINCT `t3`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the countries of universities that scored 70 and below in 2016.",
    "evidence": "scored 70 and below refers to score < 70; in 2016 refers to year = 2016",
    "idx": 6239
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t2`.`university_name` = 'Emory University' AND `t1`.`year` = 2011)\nRETURN CASE WHEN 100=0 THEN NULL ELSE toFloat((`t1`.`num_students` - (`t1`.`num_students` * `t1`.`pct_female_students`))) / 100 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate number of male students in Emory University in 2011.",
    "evidence": "in 2011 refers to year 2011; number of male students refers to SUBTRACT(num_students, DIVIDE(MULTIPLY(num_students, pct_male_students), 100)); in Emory University refers to university_name = 'Emory University'",
    "idx": 6240
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t1`.`num_students` >= 400 AND `t1`.`num_students` <= 1000)\nRETURN DISTINCT `t2`.`university_name` AS `university_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the names of universities with number of students ranges from 400 to 1000.",
    "evidence": "number of students ranges from 400 to 1000 refers to num_students BETWEEN 400 AND 1000; name of university refers to university_name",
    "idx": 6242
  }
]