[
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t3`.`paperid` = `t4`.`citedpaperid`\nAND (`t1`.`keyphrasename` = 'parsing')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the parsing papers that have the most citations ?",
    "evidence": "",
    "idx": 813
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'ohad shamir')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the most cited paper by ohad shamir ?",
    "evidence": "",
    "idx": 818
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'ohad shamir')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the highest cited paper by ohad shamir ?",
    "evidence": "",
    "idx": 819
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'ohad shamir')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the most cited paper of ohad shamir ?",
    "evidence": "",
    "idx": 820
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'ohad shamir')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is ohad shamir 's highest cited paper ?",
    "evidence": "",
    "idx": 821
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'ohad shamir')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What paper by ohad shamir has the most citation ?",
    "evidence": "",
    "idx": 822
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'ohad shamir')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is ohad shamir 's most cited paper ?",
    "evidence": "",
    "idx": 824
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'michael i. jordan' AND `t3`.`year` = 2016)\nRETURN DISTINCT COUNT(`t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers did michael i. jordan publish in 2016 ?",
    "evidence": "",
    "idx": 825
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'michael i. jordan' AND `t3`.`year` = 2016)\nRETURN DISTINCT COUNT(`t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers does michael i. jordan have in 2016 ?",
    "evidence": "",
    "idx": 826
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'ACL')\nWITH `t1`.`authorid` AS _groupby_col_0, COUNT(`t2`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "count of ACL papers by author",
    "evidence": "",
    "idx": 828
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t2`.`year` = 2007 AND `t3`.`venuename` = 'CVPR')\nWITH `t1`.`authorid` AS _groupby_col_0, COUNT(`t2`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who wrote the most papers for CVPR 2007",
    "evidence": "",
    "idx": 831
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t2`.`year` = 2007 AND `t3`.`venuename` = 'CVPR')\nWITH `t1`.`authorid` AS _groupby_col_0, COUNT(`t2`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who published the most papers in 2007 at CVPR ?",
    "evidence": "",
    "idx": 836
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'ACL')\nRETURN DISTINCT COUNT(DISTINCT `t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers in ACL 2015 ?",
    "evidence": "",
    "idx": 837
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`year` = 2014\nRETURN DISTINCT `paper`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "papers from 2014",
    "evidence": "",
    "idx": 839
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`year` = 2014\nRETURN DISTINCT `paper`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "2014 papers",
    "evidence": "",
    "idx": 840
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Richard Ladner' AND `t4`.`venuename` = 'chi')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What papers does Richard Ladner have in chi ?",
    "evidence": "",
    "idx": 841
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Richard Ladner' AND `t4`.`venuename` = 'chi')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what paper has Richard Ladner published in chi journal ?",
    "evidence": "",
    "idx": 842
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Richard Ladner' AND `t4`.`venuename` = 'chi')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what paper has Richard Ladner published in chi ?",
    "evidence": "",
    "idx": 843
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Richard Ladner' AND `t4`.`venuename` = 'chi')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Does Richard Ladner publish in chi ?",
    "evidence": "",
    "idx": 845
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Richard Ladner' AND `t4`.`venuename` = 'chi')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What has Richard Ladner published at chi ?",
    "evidence": "",
    "idx": 846
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Richard Ladner' AND `t4`.`venuename` = 'chi')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What papers has Richard Ladner written at chi ?",
    "evidence": "",
    "idx": 847
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Richard Ladner' AND `t4`.`venuename` = 'chi')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which paper did Richard Ladner present at chi ?",
    "evidence": "",
    "idx": 848
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t3`.`paperid` = `t4`.`citedpaperid`\nAND (`t1`.`keyphrasename` = 'Artificial Intelligence')\nWITH `t4`.`citedpaperid` AS _groupby_col_0, COUNT(`t4`.`citingpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the paper with the most citation about Artificial Intelligence ?",
    "evidence": "",
    "idx": 849
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t3`.`year` = 2014 AND `t4`.`venuename` = 'ACL')\nWITH `t1`.`keyphraseid` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `keyphraseid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "topics at ACL 2014",
    "evidence": "",
    "idx": 851
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t3`.`year` = 2015 AND `t4`.`venuename` = 'NIPS')\nWITH `t1`.`keyphraseid` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `keyphraseid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "most common topics at NIPS 2015",
    "evidence": "",
    "idx": 852
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'deep reinforcement learning' AND `t4`.`venuename` = 'nips')\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers related to deep reinforcement learning in nips ?",
    "evidence": "",
    "idx": 858
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`year` = 2013\nRETURN DISTINCT `paper`.`venueid` AS `venueid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "conferences in 2013",
    "evidence": "",
    "idx": 859
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` <> 'chris dyer' AND `t5`.`keyphrasename` = 'syntactic parsing')\nRETURN DISTINCT `t1`.`authorname` AS `authorname`, `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are some syntactic parsing papers that chris dyer did not write ?",
    "evidence": "",
    "idx": 860
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` <> 'chris dyer' AND `t5`.`keyphrasename` = 'syntactic parsing')\nRETURN DISTINCT `t1`.`authorname` AS `authorname`, `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "are there any syntactic parsing papers not written by chris dyer ?",
    "evidence": "",
    "idx": 861
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "CALL(*) {\nMATCH (`paper_sub0`:`paper`)\nRETURN MAX(`paper_sub0`.`year`) AS `_col_0`  \n}\nMATCH (`paper`:`paper`)\nWHERE `paper`.`year` = `_col_0`\nRETURN DISTINCT `paper`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "papers published in the last year",
    "evidence": "",
    "idx": 864
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'benjamin mako hill')\nWITH `t3`.`year` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `year` IS NULL DESC, `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When was benjamin mako hill 's first publication ?",
    "evidence": "",
    "idx": 865
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'benjamin mako hill')\nWITH `t3`.`year` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `year` IS NULL DESC, `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When was benjamin mako hill 's first paper written ?",
    "evidence": "",
    "idx": 866
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'ameet soni')\nWITH `t3`.`year` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `year` IS NULL DESC, `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When did ameet soni publish ?",
    "evidence": "",
    "idx": 867
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'sigir')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many papers are in sigir ?",
    "evidence": "",
    "idx": 868
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'sigir')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many papers does sigir have ?",
    "evidence": "",
    "idx": 869
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'sigir')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many papers are published in sigir ?",
    "evidence": "",
    "idx": 870
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'sigir')\nRETURN DISTINCT COUNT(`t1`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "number of papers in sigir conference",
    "evidence": "",
    "idx": 871
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'ACL')\nWITH `t3`.`citingpaperid` AS _groupby_col_0, COUNT(DISTINCT `t3`.`citedpaperid`) AS _groupby_col_1\nWHERE _groupby_col_1 < 5\nRETURN DISTINCT _groupby_col_0 AS `citingpaperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what papers have fewer than 5 citations by ACL papers ?",
    "evidence": "",
    "idx": 872
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'ACL')\nWITH `t3`.`citingpaperid` AS _groupby_col_0, COUNT(DISTINCT `t3`.`citedpaperid`) AS _groupby_col_1\nWHERE _groupby_col_1 < 5\nRETURN DISTINCT _groupby_col_0 AS `citingpaperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what ACL papers have less than 5 citations ?",
    "evidence": "",
    "idx": 874
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'pldi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What were the papers published at pldi 2015 ?",
    "evidence": "",
    "idx": 877
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'pldi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the papers from pldi 2015 ?",
    "evidence": "",
    "idx": 880
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'pldi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Papers from pldi 2015 ?",
    "evidence": "",
    "idx": 881
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'pldi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which papers were accepted in pldi 2015 ?",
    "evidence": "",
    "idx": 882
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2015 AND `t2`.`venuename` = 'pldi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What papers were published during the conference pldi 2015 ?",
    "evidence": "",
    "idx": 883
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`year` = 2011\nWITH `paper`.`journalid` AS _groupby_col_0\nRETURN DISTINCT _groupby_col_0 AS `journalid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List today 's journals",
    "evidence": "",
    "idx": 893
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`year` = 2011\nWITH `paper`.`journalid` AS _groupby_col_0\nRETURN DISTINCT _groupby_col_0 AS `journalid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the journals published in March , 2011",
    "evidence": "",
    "idx": 894
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`title` =~ '(?i)(?s)neural attention' AND `t1`.`year` = 2016 AND `t2`.`venuename` = 'ACL')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "ACL papers in 2016 with neural attention in the title",
    "evidence": "",
    "idx": 895
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->(`t5`:`author`)\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND `t3`.`authorid` = `t5`.`authorid`\nAND (`t2`.`keyphrasename` = 'Bacterial Wilt' AND `t4`.`year` = 2016)\nRETURN DISTINCT `t3`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What authors wrote papers about Bacterial Wilt in 2016 ?",
    "evidence": "",
    "idx": 904
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->(`t5`:`author`)\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND `t3`.`authorid` = `t5`.`authorid`\nAND (`t2`.`keyphrasename` = 'Bacterial Wilt' AND `t4`.`year` = 2016)\nRETURN DISTINCT `t3`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who wrote on the topic of Bacterial Wilt in 2016 ?",
    "evidence": "",
    "idx": 905
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'question answering' AND `t3`.`year` = 2016)\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "question answering 2016 papers",
    "evidence": "",
    "idx": 907
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH ()-[t3:cites]->()\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t2`.`paperid` = `t3`.`citedpaperid`\nWITH `t1`.`keyphrasename` AS _groupby_col_0, COUNT(`t3`.`citingpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `keyphrasename` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what keyphrases get most citations ?",
    "evidence": "",
    "idx": 909
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'Temporal Data')\nWITH `t3`.`journalid` AS _groupby_col_0\nRETURN DISTINCT _groupby_col_0 AS `journalid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find journals about Temporal Data .",
    "evidence": "",
    "idx": 910
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t3`.`journalid` = `t2`.`journalid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'linda shapiro')\nRETURN DISTINCT `t2`.`journalid` AS `journalid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "in what journals does linda shapiro publish ?",
    "evidence": "",
    "idx": 912
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nWHERE `t3`.`journalid` = `t2`.`journalid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'linda shapiro')\nRETURN DISTINCT `t2`.`journalid` AS `journalid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which journals did linda shapiro submit papers to ?",
    "evidence": "",
    "idx": 913
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'NIPS')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "NIPS authors",
    "evidence": "",
    "idx": 914
  }
]