[
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY toFloat(CASE WHEN `t1`.`hiredate` is not NULL THEN apoc.temporal.format(`t1`.`hiredate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) IS NULL ASC, toFloat(CASE WHEN `t1`.`hiredate` is not NULL THEN apoc.temporal.format(`t1`.`hiredate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) DESC \nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname` SKIP 1\nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the second oldest person in the company at the time he was hired?",
    "evidence": "age at the time of being hired = SUBTRACT(HireDate, BirthDate); full name = FirstName+MiddleName+LastName;",
    "idx": 5511
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`purchaseorderheader`)-[t2:contains]->()\nWHERE `t1`.`purchaseorderid` = `t2`.`purchaseorderid`\nRETURN `t2`.`orderqty` - `t2`.`receivedqty` AS `_col_0`, `t1`.`vendorid` AS `vendorid` ORDER BY `t2`.`orderqty` - `t2`.`receivedqty` IS NULL ASC, `t2`.`orderqty` - `t2`.`receivedqty` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest amount of difference between the ordered quantity and actual quantity received in a single purchase order and to which vendor was the purchase order made?",
    "evidence": "highest amount of difference between the ordered quantity and actual quantity received in a single purchase order refers to MAX(SUBTRACT(OrderQty, ReceivedQty));",
    "idx": 5512
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesperson`:`salesperson`)\nWHERE `salesperson`.`bonus` = 0\nRETURN COUNT(`salesperson`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many salespersons haven't met quota?",
    "evidence": "salesperson that haven't met the quota refers to Bonus = 0;",
    "idx": 5514
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salestaxrate`:`salestaxrate`)\nWHERE `salestaxrate`.`name` =~ '(?i)(?s).*\\+.*'\nRETURN COUNT(`salestaxrate`.`salestaxrateid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the sales with a tax applied to retail transaction, how many of them are charged by multiple types of taxes?",
    "evidence": "tax applied to retail transaction refers to Taxtype = 1; sales that are charged with multiple types of tax refers to NAME LIKE '%+%';",
    "idx": 5515
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`transactionhistory`:`transactionhistory`)\nWHERE `transactionhistory`.`transactiontype` = 'P'\nRETURN `transactionhistory`.`actualcost` AS `actualcost` ORDER BY `actualcost` IS NULL ASC, `actualcost` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the highest product cost of a purchase order.",
    "evidence": "product cost refers to ActualCost; purchase order refers to TransactionType = 'P';",
    "idx": 5516
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesorderheader`:`salesorderheader`)\nORDER BY `salesorderheader`.`freight` IS NULL ASC, `salesorderheader`.`freight` DESC \nRETURN `salesorderheader`.`status` AS `status`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the current status of the order with the highest shipping cost?",
    "evidence": "shipping cost and Freight are synonyms; highest shipping cost refers to MAX(Freight);",
    "idx": 5517
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[productvendor:supplied_by]->()\nWHERE `productvendor`.`onorderqty` = 0\nRETURN COUNT(`productvendor`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products are out of stock?",
    "evidence": "out of stock product refers to OnOrderQty = 0;",
    "idx": 5518
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[productvendor:supplied_by]->()\nRETURN `productvendor`.`lastreceiptcost` - `productvendor`.`standardprice` AS `_col_0` ORDER BY `productvendor`.`lastreceiptcost` - `productvendor`.`standardprice` IS NULL ASC, `productvendor`.`lastreceiptcost` - `productvendor`.`standardprice` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest profit on net for a product?",
    "evidence": "profit on net = subtract(LastReceiptCost, StandardPrice)",
    "idx": 5519
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "CALL(*) {\nMATCH (`productreview_sub0`:`productreview`)\nRETURN `productreview_sub0`.`rating` AS `rating` ORDER BY `rating` IS NULL ASC, `rating` DESC \nLIMIT 1\n}\nMATCH (`productreview`:`productreview`)\nWHERE `productreview`.`rating` = `rating`\nRETURN `productreview`.`reviewername` AS `reviewername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which reviewer gives the biggest number of the highest rating?",
    "evidence": "highest rating refers to MAX(Rating)",
    "idx": 5520
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productreview`)-[review_for_0:review_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`makeflag` = 0 AND `t1`.`rating` <> 5)\nRETURN COUNT(`t1`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the products that are purchased, how many of them have never received the highest rating?",
    "evidence": "product that are purchased refers to MakeFlag = 0; never received highest rating refers to Rating! = 5\n\n",
    "idx": 5521
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productreview`)-[review_for_0:review_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`class` = 'M' AND `t2`.`style` = 'W' AND `t1`.`rating` = 5)\nRETURN `t1`.`reviewername` AS `reviewername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the reviewers who have given the highest rating for a medium class, women's product.",
    "evidence": "highest rating refers to Rating = 5; high class refers to Class = 'H'; men's product refers to Style = 'M'",
    "idx": 5522
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productreview`)-[review_for_0:review_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`class` = 'H')\nRETURN `t1`.`emailaddress` AS `emailaddress`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the e-mails of the reviewers who have reviewed high class.",
    "evidence": "high class refers to Class = 'H'; men's product refers to Style = 'M'",
    "idx": 5523
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productdescription`)\nMATCH (`t2`:`product`)\nWHERE `t2`.`name` = 'Headset Ball Bearings' AND `t1`.`productdescriptionid` = `t2`.`productid`\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the product description of Headset Ball Bearings?",
    "evidence": "Headset Ball Bearings is name of a product",
    "idx": 5524
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`name` = 'Hex Nut 5')\nRETURN `t1`.`standardprice` AS `standardprice` ORDER BY `t1`.`standardprice` IS NULL ASC, `t1`.`standardprice` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest vendor's selling price for Hex Nut 5?",
    "evidence": "vendor's selling price refers to StandardPrice",
    "idx": 5525
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->(`t3`:`vendor`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t1`.`businessentityid` = `t3`.`businessentityid`\nAND (`t2`.`name` = 'Hex Nut 5')\nRETURN `t3`.`purchasingwebserviceurl` AS `purchasingwebserviceurl`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the website purchasing links of the vendors from whom the product Hex Nut 5 can be purchased.",
    "evidence": "website purchasing link refers to PurchasingWebServiceURL",
    "idx": 5526
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->(`t3`:`vendor`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t1`.`businessentityid` = `t3`.`businessentityid`\nAND (`t2`.`name` = 'Hex Nut 5')\nORDER BY `t1`.`standardprice` IS NULL DESC, `t1`.`standardprice`  \nRETURN `t3`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which vendor's selling price for Hex Nut 5 is the lowest, please give the vendor's name.",
    "evidence": "vendor's selling price refers to StandardPrice; lowest selling price = MIN(StandardPrice)",
    "idx": 5527
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->(`t3`:`vendor`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t1`.`businessentityid` = `t3`.`businessentityid`\nAND (`t3`.`preferredvendorstatus` = 1 AND `t2`.`class` = 'M')\nRETURN COUNT(`t2`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many high-class products are sold by preferred vendors?",
    "evidence": "preferred vendor refers to PreferredVendorStatus = 1; high class refers to Class = 'H'",
    "idx": 5528
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productlistpricehistory`)-[price_history_for_0:price_history_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'LL Fork')\nRETURN `t2`.`listprice` AS `listprice`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give all the list prices of the product LL Fork.",
    "evidence": "Hex Nut 5 is name of a product",
    "idx": 5529
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)-[t2:supplied_by]->(`t3`:`vendor`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nWITH `t1`.`productid` AS _groupby_col_0, COUNT(`t1`.`name`) AS _groupby_col_1, sum(CASE  WHEN `t1`.`productline` = 'M' THEN 1 ELSE 0 END) AS _groupby_col_2\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_2 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the products from the mountain product line, how many of them are sold by over 2 vendors?",
    "evidence": "mountain product line refers to ProductLine = 'M'; sold by over 5 vendors refers to count(Name)>5",
    "idx": 5530
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productreview`)-[review_for_0:review_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nWITH `t1`.`productid` AS _groupby_col_0, COUNT(`t1`.`productreviewid`) AS _groupby_col_1, sum(CASE  WHEN `t2`.`productline` = 'M' THEN 1 ELSE 0 END) AS _groupby_col_2\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_2 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the products that get over at least 1 review, how many of them are from the mountain product line?",
    "evidence": "mountain product line refers to ProductLine = 'M'",
    "idx": 5531
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productreview`)-[review_for_0:review_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`name` = 'HL Mountain Pedal')\nORDER BY `t1`.`rating` IS NULL DESC, `t1`.`rating`  \nRETURN `t1`.`emailaddress` AS `emailaddress`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the email adresses of the reviewers who have given the lowest rating to the product HL Mountain Pedal.",
    "evidence": "lowest rating refers to Rating = 1",
    "idx": 5532
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`onorderqty` IS NULL OR `t1`.`onorderqty` = 0)\nRETURN COUNT(`t2`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products that take more than 2 days to make are out of stock?",
    "evidence": "take more than 2 days to make refers to DaysToManufacture>2; out of stock refers to OnOrderQty = 0 or OnOrderQty is null",
    "idx": 5533
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`makeflag` = 0 AND (`t1`.`onorderqty` IS NULL OR `t1`.`onorderqty` = 0))\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the products that are out of stock and purchased in house.",
    "evidence": "take more than 2 days to make refers to DaysToManufacture>2; out of stock refers to OnOrderQty = 0 or OnOrderQty is null; manufactured in house refers to MakeFlag = 1",
    "idx": 5534
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`name` = 'Hex Nut 5')\nRETURN CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE sum(`t1`.`standardprice`) / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average selling price of different vendors of the product Hex Nut 5?",
    "evidence": "average selling price = divide(sum(StandardPrice), count(BusinessEntityID))",
    "idx": 5535
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`persontype` = 'EM'\nORDER BY `person`.`businessentityid` IS NULL DESC, `person`.`businessentityid`  \nRETURN `person`.`firstname` AS `firstname`, `person`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the non-sales employees in ascending order of its business entitty ID.",
    "evidence": "non-sales employee refers to PersonType = 'EM'",
    "idx": 5536
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`lastname` = 'Anderson' AND `person`.`persontype` = 'IN'\nRETURN `person`.`firstname` AS `firstname`, `person`.`middlename` AS `middlename`, `person`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all person in the individual retail whose last name is 'Anderson'.",
    "evidence": "person in the individual retail refers to PersonType = 'IN'",
    "idx": 5537
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`employeedepartmenthistory`)\nMATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (NOT `t3`.`enddate` IS NULL)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t2`.`hiredate` AS `hiredate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of employees who had left the company? When were they hired?",
    "evidence": "employee that has left the company refers to EndDate is not null",
    "idx": 5538
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (CASE WHEN `t2`.`hiredate` is not NULL THEN apoc.temporal.format(`t2`.`hiredate`,'yyyy') ELSE NULL END >= '2007' AND `t2`.`salariedflag` = 1)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all salaried employee who are hired in 2007 and later.",
    "evidence": "salaried employee refers to SalariedFlag = 1; hired in 2007 and later refers to year(HireDate)> = 2007",
    "idx": 5539
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`maritalstatus` = 'M' AND `t2`.`vacationhours` < 20)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of married employees with less than 20 vacation hours.",
    "evidence": "married employee refers to MaritalStatus = 'M'; less than 20 vacation hours refers to VacationHours<20",
    "idx": 5540
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`employeedepartmenthistory`)\nMATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (`t3`.`shiftid` = 3)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, toFloat(CASE WHEN localdatetime.realtime() is not NULL THEN apoc.temporal.format(localdatetime.realtime(),'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) AS `_col_2` ORDER BY toFloat(CASE WHEN localdatetime.realtime() is not NULL THEN apoc.temporal.format(localdatetime.realtime(),'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) IS NULL ASC, toFloat(CASE WHEN localdatetime.realtime() is not NULL THEN apoc.temporal.format(localdatetime.realtime(),'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the oldest employee who is working on night shift. How old is the employee?",
    "evidence": "working on night shift refers to ShiftID = 3; oldest employee refers to min(BirthDate); age = 2022-year(BirthDate)+1",
    "idx": 5541
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employeepayhistory`)\nMATCH (`t3`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (NOT `t3`.`jobtitle` =~ '(?i)(?s)Chief Executive Officer')\nORDER BY `t1`.`rate` IS NULL ASC, `t1`.`rate` DESC \nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Other than the Chief Executive Officer, who is the employee who has the highest payrate? State the rate.",
    "evidence": "other than the Chief Executive Officer refers to JobTitle! = 'Chief Executive Officer'; highest payrate refers to max(Rate)",
    "idx": 5542
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`product`)-[t2:supplied_by]->(`t1`:`vendor`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`productid` = `t3`.`productid`\nAND (`t1`.`name` = 'Australia Bike Retailer')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all product name from Australia Bike Retailer order by product ID.",
    "evidence": "Australia Bike Retailer is name of vendor",
    "idx": 5544
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:supplied_by]->(`t1`:`vendor`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`productid` = 342)\nORDER BY `t2`.`lastreceiptcost` - `t2`.`standardprice` IS NULL ASC, `t2`.`lastreceiptcost` - `t2`.`standardprice` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which vendor gives the best profit on net for product ID 342?",
    "evidence": "profit on net = subtract(LastReceiptCost, StandardPrice); best profit on net refers to max(subtract(LastReceiptCost, StandardPrice))",
    "idx": 5545
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`person`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`firstname` = 'Rob' AND `t1`.`lastname` = 'Walters')\nRETURN `t2`.`rate` AS `rate`, CASE WHEN MAX(`t2`.`rate`)=0 THEN NULL ELSE (MAX(`t2`.`rate`) - min(`t2`.`rate`)) * 100 / MAX(`t2`.`rate`) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the current payrate of Rob Walters? Calculate the percentage increment from his previous payrate.",
    "evidence": "current payrate refers to max(Rate); percentage increment = divide(subtract(max(Rate), min(Rate)), min(Rate))*100%",
    "idx": 5546
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN avg(toFloat(CASE WHEN localdatetime.realtime() is not NULL THEN apoc.temporal.format(localdatetime.realtime(),'yyyy') ELSE NULL END) - toFloat(CASE WHEN `employee`.`birthdate` is not NULL THEN apoc.temporal.format(`employee`.`birthdate`,'yyyy') ELSE NULL END)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average age of employee in Adventure Works?",
    "evidence": "average age = AVG(subtract(year(now), year(HireDate)))",
    "idx": 5547
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN CASE WHEN COUNT(`employee`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `employee`.`jobtitle` = 'Sales Representative' THEN 1 ELSE 0 END)) * 100 / COUNT(`employee`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees in Adventure Works, calculate the percentage of them working as sales representatives.",
    "evidence": "percentage of sales representatives = divide(count(JobTitle = 'Sales Representative'), count(JobTitle))*100%",
    "idx": 5548
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`person`)-[t2:has_credit_card]->(`t1`:`creditcard`)\nWHERE `t1`.`creditcardid` = `t2`.`creditcardid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (`t1`.`cardtype` = 'Distinguish')\nRETURN `t3`.`firstname` AS `firstname`, `t3`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the person who owns a distinguish credt card.",
    "evidence": "distinguish credt card refers to cardType = 'Distinguish'",
    "idx": 5549
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`person`)\nMATCH (`t1`:`store`)-[has_salesperson_0:has_salesperson]->(`t2`:`salesperson`)-[assigned_to_0:assigned_to]->(`t4`:`salesterritory`)\nWHERE `t1`.`salespersonid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND `t2`.`territoryid` = `t4`.`territoryid`\nAND (`t1`.`name` = 'Area Bike Accessories')\nRETURN `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the sales person for store Area Bike Accessories. Which territory is he / she in?",
    "evidence": "",
    "idx": 5550
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)-[t2:supplied_by]->(`t3`:`vendor`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (CASE WHEN `t1`.`sellstartdate` is not NULL THEN apoc.temporal.format(`t1`.`sellstartdate`,'yyyy') ELSE NULL END = '2013')\nRETURN `t1`.`name` AS `name`, `t3`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all products that started selling in 2013. State its respective vendor's name.",
    "evidence": "Started selling in 2013 refers to year(SellStartDate) = 2013;",
    "idx": 5551
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`salesperson`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t1`.`salesytd` IS NULL ASC, `t1`.`salesytd` DESC \nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Names the Sales Representative with the highest year to date sales.",
    "evidence": "Highest year to date sales refers to Max(SalesYTD);",
    "idx": 5552
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->(`t3`:`vendor`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t1`.`businessentityid` = `t3`.`businessentityid`\nAND (`t1`.`maxorderqty` = 1000 AND `t2`.`standardcost` > 17)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all product only MOQ of 1,000 and with standard cost more than 17.",
    "evidence": "MOQ refers to minimum order quantity; MOQ of 1 refers to MinOrderQty = 1; standard cost more than 48 refers to StandardCost > 48;",
    "idx": 5553
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`gender` = 'M' AND `t1`.`maritalstatus` = 'M')\nORDER BY `t1`.`birthdate` IS NULL DESC, `t1`.`birthdate`  \nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`, `t1`.`jobtitle` AS `jobtitle`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the oldest married male? State his job title.",
    "evidence": "Male refers to Gender = 'M'; married refers to MaritalStatus = 'M'; oldest refers to Min(BirthDate);",
    "idx": 5554
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)-[t2:supplied_by]->(`t3`:`vendor`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (`t1`.`productnumber` = 'WB-H098')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the vendor for product number WB-H098.",
    "evidence": "",
    "idx": 5555
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END > '1970')\nORDER BY `t1`.`sickleavehours` IS NULL DESC, `t1`.`sickleavehours`  \nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the employee who are born in or after 1970 and with the least sick leave hour.",
    "evidence": "born in or after 1970 refers to year(BirthDate) > = 1970;",
    "idx": 5557
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`productsubcategory`:`productsubcategory`)\nRETURN DISTINCT `productsubcategory`.`productcategoryid` AS `productcategoryid`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the IDs of any three AdventureWorks product subcategories.",
    "evidence": "",
    "idx": 5558
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesperson`:`salesperson`)\nWHERE `salesperson`.`businessentityid` = 288\nRETURN `salesperson`.`salesytd` - `salesperson`.`salesquota` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the differences between the 288th salesperson's predicted annual sales and his or her actual sales thus far?",
    "evidence": "288th sales person refers to BusinessEntityID = 288; predited annual sales refers to SalesQuota; actual sales refers to SalesYTD; difference = Substract(SalesQuota(BusinessEntityID(288))), (SalesYTD(BusinessEntityID(288)));",
    "idx": 5559
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesperson`:`salesperson`)\nORDER BY `salesperson`.`saleslastyear` IS NULL DESC, `salesperson`.`saleslastyear`  \nRETURN `salesperson`.`businessentityid` AS `businessentityid`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list three businesses with the lowest total sales from last year.",
    "evidence": "lowest total sales in last year refers to Min(SalesLastYear);",
    "idx": 5560
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesterritory`:`salesterritory`)\nORDER BY `salesterritory`.`salesytd` IS NULL ASC, `salesterritory`.`salesytd` DESC \nRETURN `salesterritory`.`territoryid` AS `territoryid`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which three sales regions have generated the most revenue thus far?",
    "evidence": "revenue refers to SalesYTD; the most revenue refers to Max(SalesYTD);",
    "idx": 5561
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`specialoffer`:`specialoffer`)\nWHERE `specialoffer`.`category` = 'Reseller'\nRETURN `specialoffer`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What categories of offers qualify for group discounts for resellers?",
    "evidence": "resellers refers to Category = 'Reseller';",
    "idx": 5562
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`specialoffer`:`specialoffer`)\nWHERE `specialoffer`.`type` = 'Excess Inventory'\nRETURN `specialoffer`.`discountpct` AS `discountpct` ORDER BY `discountpct` IS NULL ASC, `discountpct` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest possible discount rate for 'Excess Inventory'?",
    "evidence": "excess inventory refers to Type = 'Excess Inventory'; highest possible discount refers to Max(DiscountPct);",
    "idx": 5563
  }
]