[
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`person`)-[t2:`participated_in`]->()\nMATCH ()-[t3:`awards_medal`]->(t4@`medal`)\nWHERE t1.`id` = t2.`person_id`\nAND t2.`id` = t3.`competitor_id`\nAND t3.`medal_id` = t4.`id`\nAND (t4.`medal_name` = 'Silver')\nRETURN avg(t1.`weight`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average weight of the competitors who won a silver medal?",
    "evidence": "AVG(weight) where medal_name = 'Silver';",
    "idx": 2640
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH ()-[t1:`held_in`]->(t2@`city`)\nMATCH ()-[t1:`hosted`]->(t3@`games`)\nWHERE t1.`city_id` = t2.`id`\nAND t1.`games_id` = t3.`id`\nAND (t3.`games_name` = '2004 Summer')\nRETURN t2.`city_name` AS `city_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which city the 2004 Summer was held?",
    "evidence": "in which city refers to city_name; the 2004 Summer refers to games_name = '2004 Summer';",
    "idx": 2641
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->(t3@`person`)\nWHERE t1.`id` = t2.`games_id`\nAND t2.`person_id` = t3.`id`\nAND (t3.`height` = 180 AND t3.`weight` = 73)\nRETURN DISTINCT t1.`season` AS `season`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the season of the game where a competitor who weighted 73 kg and 180 cm tall, participated?",
    "evidence": "competitor who weighted 73 kg and 180 cm tall refers to person_id where height = 180 and weight = 73;",
    "idx": 2642
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`noc_region`)-[t2:`has_person`]->(t3@`person`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`person_id` = t3.`id`\nAND (t1.`region_name` = 'Iran' AND t3.`gender` = 'F')\nRETURN COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female competitors were from Iran?",
    "evidence": "female competitors refer to person_id where gender = 'F'; from Iran refers to region_name = 'Iran';",
    "idx": 2645
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (t1@`games`)-[t2:`has_competitor`]->()\nWHERE t1.`id` = t2.`games_id`\nAND (t1.`games_name` = '2014 Winter')\nRETURN cast (COUNT(CASE  WHEN t2.`age` = 28 THEN 1  END) as float) * 100 / COUNT(t2.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the 2014 Winter game, what is the percentage of competitors who age 28 years old?",
    "evidence": "DIVIDE(COUNT(age = 28), COUNT(id)) as percentage where games_name = '2014 Winter';",
    "idx": 2648
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "CALL {\nMATCH (rootbeerbrand_sub0@`rootbeerbrand`)\nRETURN min(rootbeerbrand_sub0.`firstbrewedyear`) AS `_col_0` \n}\nMATCH (rootbeerbrand@`rootbeerbrand`)\nWHERE rootbeerbrand.`firstbrewedyear` = _col_0\nRETURN rootbeerbrand.`brandname` AS `brandname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the root beer brand that has the longest history?",
    "evidence": "name of the root beer brand refers to BrandName; longest history refers to MIN(FirstBrewedYear);",
    "idx": 2650
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (rootbeerbrand@`rootbeerbrand`)\nWHERE rootbeerbrand.`country` = 'United States'\nRETURN COUNT(rootbeerbrand.`brandid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many breweries are located in North America?",
    "evidence": "North America refers to country = 'United States'; North America is the name of continent where country = 'United States' is located;",
    "idx": 2651
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (rootbeerbrand@`rootbeerbrand`)\nORDER BY rootbeerbrand.`currentretailprice` - rootbeerbrand.`wholesalecost`  NULLS FIRST \nRETURN rootbeerbrand.`brandname` AS `brandname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the root beer brand with the lowest unit profit available to wholesalers?",
    "evidence": "name of the root beer brand refers to BrandName; lowest unit profit available to wholesalers refers to MIN(SUBTRACT(CurrentRetailPrice, WholesaleCost));",
    "idx": 2653
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (rootbeerbrand@`rootbeerbrand`)\nWHERE rootbeerbrand.`brandname` = 'A&W'\nRETURN rootbeerbrand.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the description of the root beer brand A&W?",
    "evidence": "A&W refers to BrandName = 'A&W';",
    "idx": 2654
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (rootbeerbrand@`rootbeerbrand`)\nWHERE rootbeerbrand.`breweryname` = 'AJ Stephans Beverages'\nRETURN rootbeerbrand.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which city is the brewery AJ Stephans Beverages located?",
    "evidence": "AJ Stephans refers to BreweryName = 'AJ Stephans Beverages';",
    "idx": 2655
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->(t3@`rootbeer`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`rootbeerid` = t3.`rootbeerid`\nAND (t1.`first` = 'Frank-Paul' AND t1.`last` = 'Santangelo' AND t2.`transactiondate` = date('2014-07-07') AND t3.`containertype` = 'Can')\nRETURN COUNT(t1.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the 4 root beers that Frank-Paul Santangelo purchased on 2014/7/7, how many of them were in cans?",
    "evidence": "on 2014/7/7 refers to transactiondate = '2014-07-07'; in cans refers to containertype = 'Can';",
    "idx": 2657
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`purchased`]->(t1@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t3@`rootbeerbrand`)\nWHERE t1.`rootbeerid` = t2.`rootbeerid`\nAND t1.`brandid` = t3.`brandid`\nAND (like(cast (t2.`transactiondate` as string),'2014-08%') AND t3.`brandname` = 'Bulldog')\nRETURN COUNT(t1.`brandid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many root beers of the Bulldog were purchased in August, 2014?",
    "evidence": "Bulldog refers to BrandName = 'Bulldog'; purchased in August, 2014 refers to SUBSTR(TransactionDate, 1, 4) = '2014' AND SUBSTR(TransactionDate, 6, 2) = '08';",
    "idx": 2658
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`purchased`]->(t1@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t3@`rootbeerbrand`)\nWHERE t1.`rootbeerid` = t2.`rootbeerid`\nAND t1.`brandid` = t3.`brandid`\nAND (like(cast (t2.`transactiondate` as string),'2014-08%') AND t3.`twitter` IS NULL)\nRETURN COUNT(t1.`brandid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the root beer brands that do not advertise on Twitter, how many of them have root beers sold in August, 2014?",
    "evidence": "do not advertise on Twitter refers to twitter IS NULL; in August, 2014 refers to SUBSTR(TransactionDate, 1, 4) = '2014' AND SUBSTR(TransactionDate, 6, 2) = '08';",
    "idx": 2660
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`first` = 'Frank-Paul' AND t1.`last` = 'Santangelo' AND t2.`transactiondate` = date('2014-07-07'))\nRETURN DISTINCT t2.`creditcardnumber` AS `creditcardnumber`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of the credit card that Frank-Paul Santangelo used to purchase root beers on 2014/7/7?",
    "evidence": "number of the credit card refers to CreditCardNumber; on 2014/7/7 refers to TransactionDate = '2014-07-07';",
    "idx": 2661
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->(t3@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t4@`rootbeerbrand`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`rootbeerid` = t3.`rootbeerid`\nAND t3.`brandid` = t4.`brandid`\nAND (t1.`first` = 'Frank-Paul' AND t1.`last` = 'Santangelo' AND t4.`artificialsweetener` = 'FALSE' AND t4.`honey` = 'FALSE')\nRETURN COUNT(t1.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the root beers purchased by Frank-Paul Santangelo, how many of them were non-sweetened?",
    "evidence": "non-sweetened refers to honey = 'FALSE' AND artificialsweetener = 'FALSE';",
    "idx": 2662
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`purchased`]->(t1@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t3@`rootbeerbrand`)\nWHERE t1.`rootbeerid` = t2.`rootbeerid`\nAND t1.`brandid` = t3.`brandid`\nAND (like(cast (t2.`transactiondate` as string),'2014-08%') AND t3.`brandname` = 'A&W')\nRETURN cast (COUNT(t1.`brandid`) as float) / 31 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of root beers of the brand A&W sold in a day in August, 2014?",
    "evidence": "average = DIVIDE(SUM(COUNT(RootBeerID WHERE BrandName = 'A&W' AND SUBSTR(TransactionDate, 1, 4) = '2014' AND SUBSTR(TransactionDate, 6, 2) = '08')), 31); A&W refers to BrandName = 'A&W'; in August, 2014 refers to SUBSTR(TransactionDate, 1, 4) = '2014' AND SUBSTR(TransactionDate, 6, 2) = '08';",
    "idx": 2663
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`purchased`]->(t1@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t3@`rootbeerbrand`)\nWHERE t1.`rootbeerid` = t2.`rootbeerid`\nAND t1.`brandid` = t3.`brandid`\nAND (like(cast (t2.`transactiondate` as string),'2014%'))\nRETURN cast (COUNT(CASE  WHEN t3.`breweryname` = 'AJ Stephans Beverages' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t1.`brandid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the root beers sold in 2014, what is the percentage of the root beers produced by the brewery AJ Stephans Beverages?",
    "evidence": "sold in 2014 refers to SUBSTR(TransactionDate, 1, 4) = '2014'; percentage = DIVIDE(MULTIPLY(SUM(BreweryName = 'AJ Stephans Beverages'), 1.0), COUNT(RootBeerID)) WHERE SUBSTR(TransactionDate, 1, 4) = '2014'; AJ Stephans Beverages refers to BreweryName = 'AJ Stephans Beverages';",
    "idx": 2664
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`transactionid` = 103545)\nRETURN t1.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city does the customer who finished transaction no.103545 live in?",
    "evidence": "transaction no. refers to TransactionID; TransactionID = 103545;",
    "idx": 2669
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`creditcardnumber` = 6011179359005382)\nRETURN DISTINCT t1.`phonenumber` AS `phonenumber`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the phone number of the customer who owns the credit card of number 6011179359005380?",
    "evidence": "FALSE;",
    "idx": 2670
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`review` = 'Tastes like Australia.')\nRETURN t1.`firstpurchasedate` AS `firstpurchasedate`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the customer who leaves the review content of \"Tastes like Australia.\", when was his/her first purchase date?",
    "evidence": "review content of \"Tastes like Australia.\" refers to Review = 'Tastes like Australia.';",
    "idx": 2671
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`first` = 'Natalie' AND t1.`last` = 'Dorris')\nORDER BY t2.`transactiondate`  NULLS FIRST \nRETURN t2.`transactiondate` AS `transactiondate` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did Natalie Dorris buy her first root beer?",
    "evidence": "when a customer bought their first root beer refers to FirstPurchaseDate;",
    "idx": 2672
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->(t3@`rootbeerbrand`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`brandid` = t3.`brandid`\nAND (t2.`starrating` = 3 AND t3.`brandname` = 'Frostie' AND t2.`reviewdate` = date('2014-04-24'))\nRETURN CASE  WHEN like(t1.`subscribedtoemaillist`,'TRUE') THEN 'YES' ELSE 'NO' END AS `result`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the customer who gave a 3 star rating to Frostie brand on 2014/4/24, did the user permit the company to send regular emails to him/her?",
    "evidence": "3 star rating refers to StarRating = 3; Frostie refers to  BrandName = 'Frostie'; if SubscribedToEmailList = 'TRUE', it means the user permit the company to send regular emails to him/her; if SubscribedToEmailList = FALSE', it means the user did not permit the company to send regular emails to him/her; rating on 2014/4/24 refers to ReviewDate = '2014-04-24';",
    "idx": 2673
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`reviewed`]->(t1@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND (t2.`review` = 'The quintessential dessert root beer. No ice cream required.')\nRETURN t1.`currentretailprice` - t1.`wholesalecost` AS `price`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the root beer brand which got the review with the content of \"The quintessential dessert root beer. No ice cream required.\", what is the current retail price of the root beer?",
    "evidence": "review with the content of \"The quintessential dessert root beer. No ice cream required.\" refers to Review = 'The quintessential dessert root beer. No ice cream required.';",
    "idx": 2674
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`reviewed`]->(t1@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND (t1.`brandname` = 'River City')\nRETURN cast (COUNT(CASE  WHEN t2.`starrating` = 5 THEN 1 ELSE NULL END) as float) * 100 / COUNT(t2.`starrating`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of 5 star ratings River City brand root beer get?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(BrandID WHERE StarRating = 5), COUNT(BrandID) WHERE BrandName = 'River City'), 1.0); 5 star ratings refers to StarRating = 5; River City refers to BrandName = 'River City';",
    "idx": 2675
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`gender` = 'F' AND customers.`subscribedtoemaillist` = 'TRUE'\nRETURN COUNT(customers.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female customers permit the company to send regular emails to them?",
    "evidence": "female refers to Gender = 'F'; customer permits the company to send regular emails to them refers to SubscribedToEmailList = 'TRUE';",
    "idx": 2677
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (rootbeerbrand@`rootbeerbrand`)\nORDER BY rootbeerbrand.`firstbrewedyear` DESC NULLS LAST \nRETURN rootbeerbrand.`brandname` AS `brandname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the brand of the beer with the shortest brewed history?",
    "evidence": "name of the brand of the beer refers to BrandName; shortest brewed history refers to MAX(FirstBrewedYear);",
    "idx": 2678
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (customers@`customers`)\nORDER BY customers.`firstpurchasedate`  NULLS FIRST \nRETURN customers.`first` AS `first`, customers.`last` AS `last` \nLIMIT 10",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the full names of the first top 10 customers?",
    "evidence": "full name = First Last; first top 10 customers refers to MIN(FirstPurchaseDate) LIMIT 10;",
    "idx": 2679
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (rootbeerbrand@`rootbeerbrand`)\nWHERE rootbeerbrand.`country` = 'Australia'\nRETURN COUNT(rootbeerbrand.`breweryname`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many breweries are there in Australia?",
    "evidence": "Australia refers to Country = 'Australia';",
    "idx": 2680
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`first` = 'Charles' AND customers.`city` = 'Sacramento'\nRETURN COUNT(customers.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are named Charles in Sacramento?",
    "evidence": "Sacramento refers to City = 'Sacramento';",
    "idx": 2681
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[transaction:`purchased`]->()\nWHERE transaction.`creditcardtype` = 'MasterCard' AND like(cast (transaction.`transactiondate` as string),'2014%')\nRETURN COUNT(transaction.`transactionid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many transactions were paid through MasterCard in 2014?",
    "evidence": "MasterCard refers to CreditCardType = 'MasterCard'; in 2014 refers to TransactionDate > = '2014-01-01' AND TransactionDate < = '2014-12-31';",
    "idx": 2682
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->(t3@`rootbeerbrand`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`brandid` = t3.`brandid`\nAND (t1.`first` = 'Jayne' AND t1.`last` = 'Collins' AND t2.`starrating` = 1)\nRETURN t3.`brandname` AS `brandname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which brand of root beer did Jayne Collins give the lowest rating?",
    "evidence": "brand of root beer refers to BrandName; lowest rating refers to MIN(StarRating);",
    "idx": 2683
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t2@`rootbeerbrand`)\nMATCH (t1@`rootbeer`)-[sold_at_0:`sold_at`]->(t3@`location`)\nWHERE t1.`brandid` = t2.`brandid`\nAND t1.`locationid` = t3.`locationid`\nAND (t3.`locationname` = 'Sac State American River Courtyard' AND like(cast (t1.`purchasedate` as string),'2015%') AND t2.`honey` = 'TRUE' AND t2.`canesugar` = 'FALSE' AND t1.`containertype` = 'Bottle')\nRETURN COUNT(t1.`brandid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sweet bottled root beers that do not contain cane sugar were purchased in 2015 through the selling company located in Sac State American River Courtyard?",
    "evidence": "sweet refers to Honey = 'TRUE'; bottled refers to ContainerType = 'Bottle'; do not contain cane sugar refers to CaneSugar = 'FALSE'; in 2015 refers to PurchaseDate < = '2015-12-31'; Sac State American River Courtyard refers to LocationName = 'Sac State American River Courtyard';",
    "idx": 2684
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->(t3@`rootbeerbrand`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`brandid` = t3.`brandid`\nAND (t3.`brandname` = 'River City' AND t2.`starrating` = 5)\nRETURN t1.`first` AS `first`, t1.`last` AS `last`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the full names of the customer who gave River City a 5-star?",
    "evidence": "full name = First, Last; River City refers to BrandName = 'River City'; 5-star refers to StarRating = 5;",
    "idx": 2685
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`first` = 'Tom' AND t1.`last` = 'Hanks' AND t2.`transactiondate` >= date('2015-01-01') AND t2.`transactiondate` <= date('2016-12-31'))\nRETURN COUNT(t2.`rootbeerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many root beers did Tom Hanks purchase between 2015 to 2016?",
    "evidence": "between 2015 to 2016 refers to TransactionDate > = '2015-01-01' AND TransactionDate < '2016-12-31';",
    "idx": 2686
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`reviewed`]->(t1@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND (t2.`starrating` = 5)\nRETURN t1.`brandname` AS `brandname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which brand of root beer was highly rated by customers?",
    "evidence": "brand of root beer refers to BrandName; highly rated refers to MAX(COUNT(StarRating = 5));",
    "idx": 2687
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->(t3@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t4@`rootbeerbrand`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`rootbeerid` = t3.`rootbeerid`\nAND t3.`brandid` = t4.`brandid`\nAND (t1.`first` = 'Nicholas' AND t1.`last` = 'Sparks' AND like(t4.`brandname`,'Henry Weinhard%s'))\nRETURN COUNT(t1.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Henry Weinhard's were bought by Nicholas Sparks?",
    "evidence": "Henry Weinhard's refers to BrandName = 'Henry Weinhard''s';",
    "idx": 2688
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t2@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND (t1.`containertype` = 'Can' AND t2.`brandname` = 'A&W' AND like(cast (t1.`purchasedate` as string),'2016%'))\nRETURN COUNT(t1.`brandid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many canned A&W were purchased in 2016?",
    "evidence": "canned refers to ContainerType = 'Can'; A&W refers to BrandName = 'A&W'; in 2016 refers to PurchaseDate > = '2016-01-01' AND PurchaseDate < = '2016-12-31';",
    "idx": 2689
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`location`)-[has_geolocation_0:`has_geolocation`]->(t2@`geolocation`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`locationname` = 'Sac State Union')\nRETURN t2.`latitude` AS `latitude`, t2.`longitude` AS `longitude`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the precise location of Sac State Union?",
    "evidence": "precise location = Latitude, Longitude; Sac State Union refers to LocationName = 'Sac State Union';",
    "idx": 2690
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (rootbeer@`rootbeer`)\nWHERE like(cast (rootbeer.`purchasedate` as string),'2014%')\nRETURN cast (COUNT(CASE  WHEN rootbeer.`containertype` = 'Can' THEN rootbeer.`rootbeerid` ELSE NULL END) as float) * 100 / COUNT(rootbeer.`rootbeerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the root beer purchased in 2014, what percentage were sold in cans?",
    "evidence": "in 2014 refers to PurchaseDate > = '2014-01-01' AND PurchaseDate < = '2014-12-31'; percentage = MULTIPLY(DIVIDE(SUM(ContainerType = 'Can'), COUNT(RootBeerID) WHERE PurchaseDate > = '2014-01-01' AND PurchaseDate < = '2014-12-31'), 1.0); in cans refers to ContainerType = 'Can';",
    "idx": 2692
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[transaction:`purchased`]->()\nRETURN cast (COUNT(CASE  WHEN transaction.`creditcardtype` = 'Visa' THEN transaction.`transactionid` ELSE NULL END) as float) * 100 / COUNT(transaction.`transactionid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the transactions, what percentage is done by using a visa card?",
    "evidence": "visa card refers to CreditCardType = 'Visa'; percentage = MULTIPLY(DIVIDE(SUM(CreditCardType = 'Visa'), COUNT(TransactionID)), 1.0);",
    "idx": 2693
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (rootbeerbrand@`rootbeerbrand`)\nWHERE rootbeerbrand.`cornsyrup` = 'TRUE' AND rootbeerbrand.`artificialsweetener` = 'TRUE' AND rootbeerbrand.`availableincans` = 'TRUE'\nRETURN COUNT(rootbeerbrand.`brandid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many brands of root beers are available in cans and contain corn syrup and artificial sweeteners?",
    "evidence": "available in cans refers to AvailableInCans = 'TRUE'; contain corn syrup refers to CornSyrup = 'TRUE'; contain artificial sweeteners refers to ArtificialSweetener = 'TRUE';",
    "idx": 2694
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t3:`purchased`]->(t2@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t1@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND t2.`rootbeerid` = t3.`rootbeerid`\nAND (t1.`caffeinated` = 'TRUE')\nRETURN cast (COUNT(t2.`rootbeerid`) as float) / COUNT(DISTINCT t2.`purchasedate`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On average how many caffeinated root beers are sold a day?",
    "evidence": "average = DIVIDE(COUNT(RootBeerID WHERE Caffeinated = 'TRUE'), COUNT(PurchaseDate)); caffeinated refers to Caffeinated = 'TRUE';",
    "idx": 2696
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`purchased`]->(t1@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t3@`rootbeerbrand`)\nWHERE t1.`rootbeerid` = t2.`rootbeerid`\nAND t1.`brandid` = t3.`brandid`\nAND (t1.`containertype` = 'Bottle' AND t2.`purchaseprice` > 2)\nRETURN avg(t2.`purchaseprice`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average cost of root beers purchased for more than 2 dollars and sold in bottles?",
    "evidence": "average cost = DIVIDE(SUM(PurchasePrice > 2), COUNT(RootBeerID) WHERE PurchasePrice > 2); more than 2 dollars refers to PurchasePrice > 2; in bottles refers to ContainerType = 'Bottle';",
    "idx": 2697
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`reviewed`]->()\nWHERE t1.`customerid` = t2.`customerid`\nAND (t1.`subscribedtoemaillist` = 'FALSE')\nRETURN cast (COUNT(CASE  WHEN t2.`starrating` > 3 THEN 1 ELSE NULL END) as float) * 100 / COUNT(t2.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers not subscribed to the mailing list, what percentage has given three or more stars in a review?",
    "evidence": "not subscribed to the mailing list refers to SubscribedToEmailList = 'FALSE'; percentage = MULTIPLY(DIVIDE(SUM(CustomerID WHERE StarRating > 3), COUNT(CustomerID) WHERE SubscribedToEmailList = 'FALSE'), 1.0);",
    "idx": 2698
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->(t3@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t4@`rootbeerbrand`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`rootbeerid` = t3.`rootbeerid`\nAND t3.`brandid` = t4.`brandid`\nAND (t1.`gender` = 'F' AND t4.`artificialsweetener` = 'TRUE')\nRETURN COUNT(t1.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the female customers, how many bought root beer that contains artificial sweetener?",
    "evidence": "female refers to Gender = 'F'; contains artificial sweetener refers to ArtificialSweetener = 'TRUE';",
    "idx": 2699
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t1@`customers`)-[t2:`purchased`]->(t3@`rootbeer`)-[manufactured_by_0:`manufactured_by`]->(t4@`rootbeerbrand`)\nWHERE t1.`customerid` = t2.`customerid`\nAND t2.`rootbeerid` = t3.`rootbeerid`\nAND t3.`brandid` = t4.`brandid`\nAND (t1.`city` = 'Sacramento' AND t1.`gender` = 'M' AND like(cast (t2.`transactiondate` as string),'2014%'))\nRETURN cast (COUNT(CASE  WHEN t4.`brandname` = 'Dominion' THEN t1.`customerid` ELSE NULL END) as float) * 100 / COUNT(t1.`customerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the male customers in Sacramento, what percentage bought Dominion root beer in 2013?",
    "evidence": "male customers refers to Gender = 'M'; Sacramento refers to City = 'Sacramento'; percentage = MULTIPLY(DIVIDE(SUM(BrandID WHERE BrandName = 'Dominion'), COUNT(BrandID) WHERE City = 'Sacramento'), 1.0); Dominion refers to BrandName = 'Dominion'; in 2013 refers to TransactionDate > = 2013-01-01 AND TransactionDate < 2014-01-01;",
    "idx": 2701
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH ()-[t2:`reviewed`]->(t1@`rootbeerbrand`)\nWHERE t1.`brandid` = t2.`brandid`\nAND (t2.`starrating` = 5 AND t2.`reviewdate` >= date('2014-09-01') AND t2.`reviewdate` <= date('2014-09-30'))\nRETURN DISTINCT t1.`brandname` AS `brandname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the reviews of September 2014. Which brand of beers obtained the highest star ratings?",
    "evidence": "September 2014 refers to ReviewDate LIKE '2014-09%'; brand of beers refers to BrandName; highest star ratings refers to MAX(StarRating);",
    "idx": 2704
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (t2@`geolocation`)\nMATCH ()-[t1:`purchased`]->()\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`creditcardtype` = 'American Express')\nRETURN DISTINCT t2.`latitude` AS `latitude`, t2.`longitude` AS `longitude`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the precise location of all paying customers with American Express?",
    "evidence": "precise location refers to Latitude, Longitude; American Express refers to CreditCardType = 'American Express';",
    "idx": 2705
  }
]