[
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`umpire`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`umpire_country` = `t2`.`country_id`\nAND (`t2`.`country_name` = 'New Zealand')\nRETURN `t1`.`umpire_name` AS `umpire_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of all New Zealand umpires.",
    "evidence": "New Zealand umpires refers to Country_Name = 'New Zealand'; name of umpires refers to Umpire_Name",
    "idx": 1324
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[has_bowling_style_0:has_bowling_style]->(`t1`:`bowling_style`)\nMATCH (`t2`:`player`)-[from_country_0:from_country]->(`t3`:`country`)\nWHERE `t1`.`bowling_id` = `t2`.`bowling_skill`\nAND `t2`.`country_name` = `t3`.`country_id`\nAND (`t1`.`bowling_skill` = 'Slow left-arm chinaman')\nRETURN `t3`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which country do most players have the 'slow left-arm chinaman' bowling style?",
    "evidence": "'slow left-arm chinaman' bowling style refers to Bowling_skill = 'Slow left-arm chinaman'; most players  refers to max(count(Country_Id))",
    "idx": 1325
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[held_at_0:held_at]->(`t1`:`venue`)\nMATCH (`t2`:`match`)-[involves_team_0:involves_team]->(`t3`:`team`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND `t2`.`team_1` = `t3`.`team_id`\nAND (`t3`.`team_name` = 'Kochi Tuskers Kerala')\nWITH `t1`.`venue_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `venue_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which venue did Kochi Tuskers Kerala play most of their matches?",
    "evidence": "Kochi Tuskers Kerala refers to Team_Name = 'Kochi Tuskers Kerala'; most of their matches refers to max(Venue_Id)",
    "idx": 1326
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`batsman_scored`)\nMATCH (`t2`:`ball_by_ball`)-[part_of_match_0:part_of_match]->(`t3`:`match`)-[involves_team_0:involves_team]->(`t4`:`team`)\nWHERE `t1`.`match_id` = `t2`.`match_id`\nAND `t2`.`match_id` = `t3`.`match_id`\nAND `t3`.`team_1` = `t4`.`team_id`\nAND (`t2`.`team_batting` = 1 OR `t2`.`team_batting` = 2 AND `t4`.`team_name` = 'Delhi Daredevils')\nRETURN COUNT(`t1`.`runs_scored`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In how many games in which the batting team was the Delhi Daredevils were no runs scored?",
    "evidence": "batting team was the Delhi Daredevils refers to Team_Name = 'Delhi Daredevils' and Team_1 = Team_Id where Team_Batting = 1 or Team_2 = Team_Id where Team_Batting = 2; no runs scored refers to Runs_Scored = 0",
    "idx": 1327
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`extra_runs`)-[has_type_0:has_type]->(`t2`:`extra_type`)\nWHERE `t1`.`extra_type_id` = `t2`.`extra_id`\nAND (`t2`.`extra_name` = 'noballs')\nRETURN avg(`t1`.`extra_runs`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of extra runs made as noballs?",
    "evidence": "noballs refers to Extra_Name = 'noballs' ; average number = divide(sum(Extra_Runs), count(Extra_Runs))",
    "idx": 1328
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nORDER BY `player`.`bowling_skill` IS NULL ASC, `player`.`bowling_skill` DESC \nRETURN `player`.`player_id` AS `player_id`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the player's ID of the top five players, by descending order, in terms of bowling skill.",
    "evidence": "player's ID refers to Player_Id",
    "idx": 1329
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`dob` < localdatetime('1975-10-16T00:00:00') AND `player`.`bowling_skill` < 3\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players were born before 10/16/1975, and have a bowling skill of less than 3?",
    "evidence": "born before 10/16/1975 refers to DOB < 1975-10-16; bowling skill of less than 3 refers to Bowling_skill < 3",
    "idx": 1330
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nORDER BY `player`.`dob` IS NULL ASC, `player`.`dob` DESC \nRETURN `player`.`player_name` AS `player_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the youngest player?",
    "evidence": "name refers to Player_Name; youngest player refers to max(DOB)",
    "idx": 1331
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`season`:`season`)\nWHERE 2011 < `season`.`season_year` < 2015\nRETURN `season`.`man_of_the_series` AS `man_of_the_series`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tally the player IDs of \"Man of the Series\" awardees for the seasons from 2011 to 2015.",
    "evidence": "seasons from 2011 to 2015 refers to 2011 < Season_Year < 2015",
    "idx": 1332
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`batsman_scored`:`batsman_scored`)\nWHERE `batsman_scored`.`match_id` = 335988 AND `batsman_scored`.`innings_no` = 2\nRETURN sum(`batsman_scored`.`runs_scored`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of runs scored by the batsmen during the 2nd inning of the match ID 335988?",
    "evidence": "number of runs refers to Runs_Scored; 2nd inning refers to Innings_No = 2",
    "idx": 1333
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`batsman_scored`:`batsman_scored`)\nWHERE 335989 < `batsman_scored`.`match_id` < 337000 AND `batsman_scored`.`innings_no` = 1 AND `batsman_scored`.`over_id` = 1 AND `batsman_scored`.`ball_id` = 1\nRETURN sum(CASE  WHEN `batsman_scored`.`runs_scored` > 3 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Between match nos. 335989 and 337000, how many times did a batsman score more than 3 runs during over no. 1, ball no. 1, and inning no. 1 of the matches?",
    "evidence": "Between match no. 335989 and 337000 refers to 335989 < Match_Id < 337000; batsman score more than 3 runs during over no. 1, ball no. 1, and inning no. 1 of the matches refers to Runs_Scored > 3 and  Over_Id = 1 and Ball_Id = 1 and Innings_No = 1",
    "idx": 1334
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND (`t2`.`venue_name` = 'Kingsmead')\nRETURN `t1`.`match_id` AS `match_id`, `t1`.`match_date` AS `match_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give me the match ID and date of the matches that were held in Kingsmead for three consecutive days.",
    "evidence": "date of the matches refers to Match_Date; held in Kingsmead refers to Venue_Name = 'Kingsmead'",
    "idx": 1335
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND (`t1`.`match_date` >= localdatetime('2009-05-09T00:00:00') AND `t1`.`match_date` <= localdatetime('2011-08-08T00:00:00'))\nRETURN sum(CASE  WHEN `t2`.`venue_name` = 'MA Chidambaram Stadium' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times did the matches were held in MA Chidambaram Stadium from 5/9/2009 to 8/8/2011?",
    "evidence": "MA Chidambaram Stadium refers to Venue_Name = 'MA Chidambaram Stadium' ; from 5/9/2009 to 8/8/2011 refers to Match_Date between '2009-05-09' and '2011-08-08'",
    "idx": 1336
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)-[located_in_0:located_in]->(`t3`:`city`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND `t2`.`city_id` = `t3`.`city_id`\nAND (`t1`.`match_id` = '336005')\nRETURN `t2`.`venue_name` AS `venue_name`, `t3`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where was the ID 336005 match held? Please give me the venue and the city.",
    "evidence": "ID 336005 match refers to Match_Id = '336005'; venue refers to Venue_Name; city refers to City_Name",
    "idx": 1337
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[has_toss_decision_0:has_toss_decision]->(`t2`:`toss_decision`)\nWHERE `t1`.`toss_decide` = `t2`.`toss_id`\nAND (`t1`.`match_id` = '336011')\nRETURN `t2`.`toss_name` AS `toss_name`, `t1`.`toss_decide` AS `toss_decide`, `t1`.`toss_winner` AS `toss_winner`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team wins the toss during the match ID 336011, and can you tell me whether they decided to bat or field?",
    "evidence": "wins the toss refers to Toss_Winner; whether they decided to bat or field refers to Toss_Name",
    "idx": 1338
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nAND (`t2`.`country_name` = 'South Africa')\nRETURN sum(CASE  WHEN `t1`.`dob` < localdatetime('1980-04-11T00:00:00') THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the South African players, how many were born before 4/11/1980?",
    "evidence": "South African players refers to Country_Name = 'South Africa'; born before 4/11/1980 refers to DOB < '1980-4-11'",
    "idx": 1339
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[has_bowling_style_0:has_bowling_style]->(`t1`:`bowling_style`)\nWHERE `t1`.`bowling_id` = `t2`.`bowling_skill`\nAND (`t1`.`bowling_skill` = 'Legbreak')\nRETURN `t2`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the name of players whose bowling skill is Legbreak.",
    "evidence": "name of players refers to Player_Name",
    "idx": 1340
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[t2:has_player]->(`t3`:`player`)\nMATCH ()-[t2:played_as]->(`t4`:`rolee`)\nWHERE `t1`.`match_id` = `t2`.`match_id`\nAND `t2`.`player_id` = `t3`.`player_id`\nAND `t2`.`role_id` = `t4`.`role_id`\nORDER BY `t3`.`dob` IS NULL ASC, `t3`.`dob` DESC \nRETURN `t1`.`match_date` AS `match_date`, `t4`.`role_desc` AS `role_desc`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When and for what role did the youngest player appear in his first match?",
    "evidence": "When refers to Match_Date; youngest player refers to max(DOB); first match refers to min(Match_Date)",
    "idx": 1341
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t2`:`player`)\nWHERE `t1`.`man_of_the_match` = `t2`.`player_id`\nAND (`t2`.`player_name` = 'V Kohli')\nRETURN `t1`.`match_id` AS `match_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tally the match IDs in which V Kohli is the \"Man of the Match\".",
    "evidence": "",
    "idx": 1342
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_by_0:won_by]->(`t2`:`team`)\nWHERE `t1`.`match_winner` = `t2`.`team_id`\nAND (`t2`.`team_name` = 'Sunrisers Hyderabad')\nRETURN `t1`.`match_date` AS `match_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did the Sunrisers Hyderabad win their first match?",
    "evidence": "Sunrisers Hyderabad refers to Team_Name = 'Sunrisers Hyderabad'; win their first match refers to Match_Winner and min(Match_Date)",
    "idx": 1343
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`umpire`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`umpire_country` = `t2`.`country_id`\nAND (`t2`.`country_name` = 'England')\nRETURN `t1`.`umpire_name` AS `umpire_name`, `t1`.`umpire_id` AS `umpire_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the player names and IDs of the English umpires.",
    "evidence": "English umpires refers to Country_Name = 'England'",
    "idx": 1344
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t3`:`batsman_scored`)-[part_of_match_0:part_of_match]->(`t2`:`match`)-[has_toss_decision_0:has_toss_decision]->(`t1`:`toss_decision`)\nWHERE `t1`.`toss_id` = `t2`.`toss_decide`\nAND `t2`.`match_id` = `t3`.`match_id`\nAND (`t2`.`match_id` = 335987 AND `t2`.`match_date` = localdatetime('2008-04-18T00:00:00'))\nWITH `t3`.`over_id` AS _groupby_col_0, COUNT(`t1`.`toss_name` = 'field') AS _groupby_col_1, CASE WHEN sum(CASE  WHEN `t1`.`toss_name` = 'field' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`toss_name` = 'bat' THEN `t3`.`runs_scored` ELSE NULL END)) / sum(CASE  WHEN `t1`.`toss_name` = 'field' THEN 1 ELSE 0 END) END AS _groupby_col_2\nWHERE _groupby_col_1 = 17\nRETURN _groupby_col_2 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the run rate at the end of 17 overs of the match ID 335987 on 4/18/2008.",
    "evidence": "4/18/2008 refers to Match_Date = 4/18/2008; end of 17 overs refers to count(Toss_Name = 'field' ) = 17; run rate = divide(sum(Runs_Scored) when Toss_Name = 'bat', sum(Over_Id) when Toss_Name = 'field')",
    "idx": 1345
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nORDER BY `match`.`match_winner` IS NULL ASC, `match`.`match_winner` DESC \nRETURN `match`.`match_id` AS `match_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the id of the team with the highest number of matches won?",
    "evidence": "id of the team refers to Team_Id; highest number of matches won refers to max(count(Match_Winner))",
    "idx": 1347
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nORDER BY `match`.`win_margin` IS NULL ASC, `match`.`win_margin` DESC \nRETURN `match`.`match_date` AS `match_date`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the date of the match that has the highest wager on the final result of a game?",
    "evidence": "date of the match refers to Match_Date; highest wager refers to max(Win_Margin)",
    "idx": 1348
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWITH `match`.`man_of_the_match` AS _groupby_col_0, COUNT(`match`.`match_id`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 5\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players have won at least 5 man of the match awards?",
    "evidence": "won at least 5 man of the match awards refers to COUNT(Match_Id) > = 5",
    "idx": 1349
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t1`:`player`)\nWHERE `t1`.`player_id` = `t2`.`man_of_the_match`\nAND (`t2`.`season_id` = 9)\nORDER BY `t2`.`match_date` IS NULL ASC, `t2`.`match_date` DESC \nRETURN `t1`.`player_name` AS `player_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the player who received the man of the match award during the last match of Season 9?",
    "evidence": "Who refers to Player_Name; last match of Season 9 refers to max(Match_Date) where Season_Id = 9",
    "idx": 1350
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND (`t2`.`season_id` = 1)\nORDER BY `t2`.`match_date` IS NULL DESC, `t2`.`match_date`  \nRETURN `t1`.`team_name` AS `team_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the team that won the first ever match?",
    "evidence": "name of the team refers to Team_Name; won the first ever match refers to Match_Winner where max(Match_Date)",
    "idx": 1351
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nRETURN sum(CASE  WHEN `t2`.`country_name` = 'U.A.E' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cities are in U.A.E?",
    "evidence": "U.A.E refers to Country_Name = 'U.A.E'",
    "idx": 1352
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`umpire`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t2`.`country_id` = `t1`.`umpire_country`\nAND (`t2`.`country_name` = 'England')\nRETURN `t1`.`umpire_name` AS `umpire_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of all the umpires from England.",
    "evidence": "from England refers to Country_Name = 'England'",
    "idx": 1353
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_bowling_style_0:has_bowling_style]->(`t2`:`bowling_style`)\nWHERE `t1`.`bowling_skill` = `t2`.`bowling_id`\nAND (`t2`.`bowling_skill` = 'Legbreak')\nRETURN `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players bowl in the legbreak style?",
    "evidence": "legbreak style refers to Bowling_skill = 'Legbreak'",
    "idx": 1354
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`umpire`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t2`.`country_id` = `t1`.`umpire_country`\nAND (`t1`.`umpire_name` = 'TH Wijewardene')\nRETURN `t2`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country is umpire TH Wijewardene from?",
    "evidence": "country refers to Country_Name",
    "idx": 1355
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`venue`)-[located_in_0:located_in]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t2`.`city_name` = 'Abu Dhabi')\nRETURN `t1`.`venue_name` AS `venue_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the venues in Abu Dhabi?",
    "evidence": "names of the venues refers to Venue_Name; Abu Dhabi refers to City_Name = 'Abu Dhabi'",
    "idx": 1356
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[from_country_0:from_country]->(`t1`:`country`)\nWHERE `t1`.`country_id` = `t2`.`country_name`\nORDER BY `t2`.`dob` IS NULL ASC, `t2`.`dob` DESC \nRETURN `t1`.`country_name` AS `country_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country is the youngest player from?",
    "evidence": "country refers to Country_Name; youngest player refers to max(DOB)",
    "idx": 1357
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)\nMATCH ()-[t2:has_player]->(`t3`:`player`)\nWHERE `t1`.`match_winner` = `t2`.`team_id`\nAND `t2`.`player_id` = `t3`.`player_id`\nAND (`t1`.`season_id` = 1)\nORDER BY `t1`.`match_date` IS NULL DESC, `t1`.`match_date`  \nRETURN `t3`.`player_name` AS `player_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the names of the winning team's players in the first match of season 1.",
    "evidence": "names refers to Player_Name; winning team's refers to Match_Winner; first match of season 1 refers to Season_Id = 1 and min(Match_Date)",
    "idx": 1358
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t3`:`country`)\nMATCH (`t4`:`match`)-[held_at_0:held_at]->(`t1`:`venue`)-[located_in_0:located_in]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND `t2`.`country_id` = `t3`.`country_id`\nAND `t1`.`venue_id` = `t4`.`venue_id`\nORDER BY `t4`.`match_date` IS NULL ASC, `t4`.`match_date` DESC \nRETURN `t1`.`venue_name` AS `venue_name`, `t2`.`city_name` AS `city_name`, `t3`.`country_name` AS `country_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the complete name of the venue, city and country where the last match was held.",
    "evidence": "name of the venue, city and country refers to Venue_Name and City_Name and Country_Name; last match refers to max(Match_Date)",
    "idx": 1359
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`ball_by_ball`:`ball_by_ball`)\nWHERE `ball_by_ball`.`match_id` = 336011\nRETURN sum(CASE  WHEN `ball_by_ball`.`innings_no` = 1 THEN 1 ELSE 0 END) AS `in1`, sum(CASE  WHEN `ball_by_ball`.`innings_no` = 2 THEN 1 ELSE 0 END) AS `in2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many overs were there in each innings of match ID \"336011\"?",
    "evidence": "",
    "idx": 1360
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`batsman_scored`:`batsman_scored`)\nWHERE `batsman_scored`.`match_id` = 335988 AND `batsman_scored`.`over_id` = 20\nRETURN `batsman_scored`.`ball_id` AS `ball_id`, `batsman_scored`.`runs_scored` AS `runs_scored`, `batsman_scored`.`innings_no` AS `innings_no`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ball IDs, scores, and innings numbers in the over ID 20 of match ID \"335988\".",
    "evidence": "innings numbers refers to Innings_No",
    "idx": 1361
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE toString(`match`.`match_date`) =~ '(?i)(?s)2011.*'\nRETURN COUNT(`match`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches were held in 2011?",
    "evidence": "held in 2011 refers to Match_Date like '2011%';",
    "idx": 1362
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nRETURN CASE WHEN sum(CASE  WHEN toString(`match`.`match_date`) =~ '(?i)(?s)2012.*' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `match`.`toss_winner` = `match`.`match_winner` THEN 1 ELSE 0 END)) / sum(CASE  WHEN toString(`match`.`match_date`) =~ '(?i)(?s)2012.*' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the win rate of the toss-winners in 2012.",
    "evidence": "in 2012 refers to Match_Date like '2012%'; win rate refers to DIVIDE(COUNT(Toss_Winner = Match_Winner), COUNT(Match_Date like '2012%'))",
    "idx": 1363
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE toString(`match`.`match_date`) =~ '(?i)(?s)2009.*' AND `match`.`win_margin` < 10\nRETURN COUNT(`match`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches in 2009 had win margins of less than 10?",
    "evidence": "in 2009 refers to Match_Date like '2009%'; win margins of less than 10 refers to Win_Margin < 10;",
    "idx": 1364
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH ()-[t1:has_player]->(`t2`:`player`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nRETURN sum(CASE  WHEN `t2`.`player_name` = 'Mohammad Hafeez' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches did Mohammad Hafeez play?",
    "evidence": "Mohammad Hafeez refers to Player_Name = 'Mohammad Hafeez';",
    "idx": 1365
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nAND (`t2`.`country_name` = 'South Africa' AND toString(`t1`.`dob`) =~ '(?i)(?s)1984.*')\nRETURN `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players from South Africa, provide the players' names who were born in 1984.",
    "evidence": "from South Africa refers to Country_Name = 'South Africa'; born in 1984 refers to DOB like '1984%';",
    "idx": 1366
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_batting_style_0:has_batting_style]->(`t2`:`batting_style`)\nWHERE `t1`.`batting_hand` = `t2`.`batting_id`\nRETURN CASE WHEN sum(CASE  WHEN `t2`.`batting_hand` = 'Right-hand bat' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`batting_hand` = 'Left-hand bat' THEN 1 ELSE 0 END)) / sum(CASE  WHEN `t2`.`batting_hand` = 'Right-hand bat' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ratio of players with batting hands of left and right?",
    "evidence": "batting hands of left refers to Batting_hand = 'Left-hand bat'; right refers to Batting_hand = 2; ratio refers to DIVIDE(COUNT(Batting_hand = 'Right-hand bat'), COUNT(Batting_hand = 2))",
    "idx": 1367
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nORDER BY `t1`.`dob` IS NULL DESC, `t1`.`dob`  \nRETURN `t1`.`player_name` AS `player_name`, `t2`.`country_name` AS `country_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the eldest player and where did he/she come from?",
    "evidence": "eldest player refers to MIN(DOB); where he/she come from refers to Country_Name",
    "idx": 1368
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[has_bowling_style_0:has_bowling_style]->(`t1`:`bowling_style`)\nMATCH (`t2`:`player`)-[from_country_0:from_country]->(`t3`:`country`)\nWHERE `t1`.`bowling_id` = `t2`.`bowling_skill`\nAND `t2`.`country_name` = `t3`.`country_id`\nAND (`t3`.`country_name` = 'Zimbabwea')\nRETURN `t1`.`bowling_skill` AS `bowling_skill`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which bowling skills did the players from Zimbabwea have?",
    "evidence": "Zimbabwea refers to Country_Name = 'Zimbabwea';",
    "idx": 1369
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`umpire`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`umpire_country` = `t2`.`country_id`\nAND (`t2`.`country_name` = 'New Zealand')\nRETURN `t1`.`umpire_id` AS `umpire_id`, `t1`.`umpire_name` AS `umpire_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the IDs and names of the umpires from New Zealand.",
    "evidence": "New Zealand refers to Country_Name = 'New Zealand'; ID of the umpire refers to Umpire_Id; name of the umpire refers to Umpire_Name",
    "idx": 1370
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_by_0:won_by]->(`t2`:`team`)\nWHERE `t1`.`match_winner` = `t2`.`team_id`\nAND (`t2`.`team_name` = 'Sunrisers Hyderabad')\nRETURN sum(CASE  WHEN toString(`t1`.`match_date`) =~ '(?i)(?s)2013.*' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches did the Sunrisers Hyderabad team win in 2013?",
    "evidence": "Sunrisers Hyderabad team refers to Team_Name = 'Sunrisers Hyderabad'; in 2013 refers to Match_Date like '2013%';",
    "idx": 1371
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`extra_runs`)-[has_type_0:has_type]->(`t2`:`extra_type`)\nWHERE `t1`.`extra_type_id` = `t2`.`extra_id`\nAND (`t2`.`extra_name` = 'penalty')\nRETURN `t1`.`match_id` AS `match_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide match ID which had the extra type of penalty.",
    "evidence": "extra type of penalty refers to Extra_Name = 'penalty';",
    "idx": 1372
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`wicket_taken`)-[has_out_type_0:has_out_type]->(`t2`:`out_type`)\nWHERE `t1`.`kind_out` = `t2`.`out_id`\nAND (`t1`.`innings_no` = 2)\nRETURN CASE WHEN COUNT(`t1`.`match_id`)=0 THEN NULL ELSE toFloat(COUNT(`t1`.`player_out`)) / COUNT(`t1`.`match_id`) END AS `_col_0`, sum(CASE  WHEN `t2`.`out_name` = 'lbw' THEN 1 ELSE 0 END) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average players out in the first innings per match. How many of them were out by the leg before wicket?",
    "evidence": "out by the leg refers to Out_Name = 'lbw'; out in the first innings refers to Innings_No = 2;",
    "idx": 1373
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE toString(`match`.`match_date`) =~ '(?i)(?s)2008.*'\nRETURN COUNT(`match`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches are there in 2008?",
    "evidence": "in 2008 refers to Match_Date like '2008%'",
    "idx": 1374
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`wicket_taken`:`wicket_taken`)\nWHERE `wicket_taken`.`innings_no` = 2\nRETURN COUNT(`wicket_taken`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the matches with a total of two innings.",
    "evidence": "total of two innings refers to innings_no = 2;",
    "idx": 1375
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND (`t2`.`city_name` = 'Rajkot')\nRETURN `t1`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which is the country of the city named \"Rajkot\"?",
    "evidence": "city named \"Rajkot\" refers to city_name = 'Rajkot';",
    "idx": 1376
  }
]