[
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nAND (`t2`.`server` = 'MORIAH' AND `t2`.`date received` = localdatetime('2013-09-11T00:00:00'))\nRETURN `t1`.`first` AS `first`, `t1`.`middle` AS `middle`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the owner of the final phone number for the complaints on server \"MORIAH\" on 9/11/2013?",
    "evidence": "owner refers to first, middle, last; on 9/11/2013 refers to Date received = '2013-09-11'",
    "idx": 155
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nRETURN CASE WHEN sum(CASE  WHEN `t1`.`age` > 13 AND `t1`.`age` <= 19 THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`age` > 13 AND `t1`.`age` <= 19 THEN 60 * toFloat(CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%H') ELSE NULL END) + toFloat(CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%M') ELSE NULL END) + toFloat(CASE WHEN 60=0 THEN NULL ELSE toFloat(CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%S') ELSE NULL END) / 60 END) ELSE 0 END)) / sum(CASE  WHEN `t1`.`age` > 13 AND `t1`.`age` <= 19 THEN 1 ELSE 0 END) END AS `teenageraveragemins`, CASE WHEN sum(CASE  WHEN `t1`.`age` > 19 AND `t1`.`age` <= 65 THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`age` > 19 AND `t1`.`age` <= 65 THEN 60 * toFloat(CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%H') ELSE NULL END) + toFloat(CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%M') ELSE NULL END) + toFloat(CASE WHEN 60=0 THEN NULL ELSE toFloat(CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%S') ELSE NULL END) / 60 END) ELSE 0 END)) / sum(CASE  WHEN `t1`.`age` > 19 AND `t1`.`age` <= 65 THEN 1 ELSE 0 END) END AS `adultaveragemins`, CASE WHEN sum(CASE  WHEN `t1`.`age` > 65 THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`age` > 65 THEN 60 * toFloat(CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%H') ELSE NULL END) + toFloat(CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%M') ELSE NULL END) + toFloat(CASE WHEN 60=0 THEN NULL ELSE toFloat(CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%S') ELSE NULL END) / 60 END) ELSE 0 END)) / sum(CASE  WHEN `t1`.`age` > 65 THEN 1 ELSE 0 END) END AS `elderaveragemins`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compute the average time in minute for each age group",
    "evidence": "teenager refers to 13 < age < = 19; adult refers to 19 < age < = 65; elder refers to age < = 65; highest average time per complaint = max(divide(sum(ser_time), count(ser_time)))",
    "idx": 156
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`client`:`client`)\nWHERE `client`.`city` = 'Indianapolis'\nRETURN CASE WHEN COUNT(`client`.`client_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `client`.`sex` = 'Male' THEN 1 ELSE 0 END)) * 100 / COUNT(`client`.`client_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of male clients from Indianapolis City.",
    "evidence": "male refers to sex = 'Male'; Indianapolis City refers to city = 'Indianapolis'; percentage = divide(count(client_id where sex = 'Male' and city = 'Indianapolis') , count(client_id where city = 'Indianapolis')) * 100%",
    "idx": 158
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nAND (`t2`.`type` = 'PS')\nRETURN `t1`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the email of client whose complaint is type \"PS\".",
    "evidence": "",
    "idx": 162
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nAND (`t1`.`city` = 'New York City' AND `t2`.`outcome` = 'AGENT')\nRETURN COUNT(`t2`.`rand client`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many clients who live in New York City have the complaint outcome as \"AGENT\"?",
    "evidence": "New York City refers to city = 'New York City'",
    "idx": 164
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`consumer disputed?` = 'Yes')\nRETURN `t1`.`first` AS `first`, `t1`.`middle` AS `middle`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the full name of clients who have disputed the response from company.",
    "evidence": "full name refers to first, middle, last; disputed the response refers to Consumer disputed? = 'Yes'",
    "idx": 165
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nAND (`t2`.`server` = 'ZOHARI')\nRETURN CASE WHEN COUNT(`t1`.`email`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`email` =~ '(?i)(?s).*@gmail.com' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`email`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of complaints made by Google account client in server ZOHARI.",
    "evidence": "Google account refers to email like '%@gmail.com'; percentage = divide(count(Complaint ID where email like '%@gmail.com') , count(Complaint ID)) * 100%",
    "idx": 167
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nAND (CASE WHEN `t2`.`ser_time` is not NULL THEN apoc.temporal.format(`t2`.`ser_time`,'%M') ELSE NULL END > '20')\nRETURN `t1`.`first` AS `first`, `t1`.`middle` AS `middle`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the full name of clients with server time of 20 minutes and above.",
    "evidence": "full name refers to first, middle, last; server time of 20 minutes and above refers to ser_time > '00:20:00'",
    "idx": 168
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nAND (`t2`.`priority` = 0)\nRETURN `t1`.`last` AS `last`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Pick 5 clients with 0 priority and write down their last name.",
    "evidence": "0 priority refers to priority = 0; last name refers to last",
    "idx": 169
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nAND (`t1`.`first` =~ '(?i)(?s)B.*')\nRETURN `t2`.`call_id` AS `call_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the call id of clients whose first name start with alphabet \"B\".",
    "evidence": "first name start with alphabet \"B\" refers to first like 'B%'",
    "idx": 170
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`timely response?` = 'No' AND `t1`.`sex` = 'Male')\nRETURN `t1`.`first` AS `first`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the first name of male clients who did not receive timely response from the call center.",
    "evidence": "first name refers to first; male refers to sex = 'Male'; did not receive timely response refers to Timely response? = 'No'",
    "idx": 172
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`company response to consumer` = 'Closed with relief')\nRETURN avg(`t1`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average age of clients whose response is \"Closed with relief\".",
    "evidence": "average age = avg(age where Company response to consumer = 'Closed with relief'); response \"Closed with relief\" refers to Company response to consumer = 'Closed with relief'",
    "idx": 179
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nAND (`t2`.`type` = 'TT')\nRETURN avg(`t1`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average age of clients whose complaint type is \"TT\"?",
    "evidence": "average age = avg(age where type = 'TT')",
    "idx": 180
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`callcenterlogs`:`callcenterlogs`)\nWHERE CASE WHEN `callcenterlogs`.`date received` is not NULL THEN apoc.temporal.format(`callcenterlogs`.`date received`,'yyyy') ELSE NULL END = '2014' AND `callcenterlogs`.`server` = 'AVIDAN'\nRETURN `callcenterlogs`.`complaint id` AS `complaint id`, `callcenterlogs`.`call_id` AS `call_id`, `callcenterlogs`.`phonefinal` AS `phonefinal`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the complaint ID, call ID, and final phone number of complaints through AVIDAN server from 1/1/2014 to 12/30/2014.",
    "evidence": "final phone number refers to phonefinal; from 1/1/2014 to 12/30/2014 refers to Date received between '2014-01-01' and '2014-12-30'",
    "idx": 181
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`callcenterlogs`:`callcenterlogs`)\nWHERE `callcenterlogs`.`date received` >= localdatetime('2017-01-01T00:00:00') AND `callcenterlogs`.`date received` <= localdatetime('2017-04-01T00:00:00')\nRETURN avg(toFloat(CASE  WHEN 4-1 < 0 AND 2 < 0  THEN substring(`callcenterlogs`.`ser_time`,(case when size(`callcenterlogs`.`ser_time`)+1+(4-1)+2 < 0 then 0 else size(`callcenterlogs`.`ser_time`)+1+(4-1)+2 end),-(2))  WHEN 4-1 < 0 AND 2 >= 0  THEN substring(`callcenterlogs`.`ser_time`,size(`callcenterlogs`.`ser_time`)+1+(4-1),2)  WHEN 4-1 >= 0 AND 2 < 0  THEN substring(`callcenterlogs`.`ser_time`,(case when 4-1+1+(2) < 0 then 0 else 4-1+1+(2) end),-(2))  ELSE substring(`callcenterlogs`.`ser_time`,4-1,2) END)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Between 1/1/2017 and 4/1/2017, what is the average server time of calls under the server DARMON?",
    "evidence": "between 1/1/2017 and 4/1/2017 refers to Date received between '2017-01-01' and '2017-04-01'; average server time refers to avg(ser_time)",
    "idx": 182
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[located_in_0:located_in]->(`t2`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t2`.`city` = 'Indianapolis')\nRETURN `t1`.`year` AS `year`, `t1`.`month` AS `month`, `t1`.`day` AS `day`, `t1`.`email` AS `email`, `t1`.`phone` AS `phone` ORDER BY `t1`.`year` IS NULL ASC, `t1`.`year` DESC, `t1`.`month` IS NULL ASC, `t1`.`month` DESC, `t1`.`day` IS NULL ASC, `t1`.`day` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give me the full birthdate, email and phone number of the youngest client in Indianapolis .",
    "evidence": "full birthdate = year, month, day; youngest refers to max(year, month, day); in Indianapolis refers to city = 'Indianapolis'",
    "idx": 184
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`reviews`)-[from_district_0:from_district]->(`t2`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t1`.`stars` = 5 AND toString(`t1`.`date`) =~ '(?i)(?s)2016.*')\nORDER BY `t1`.`date` IS NULL ASC, `t1`.`date` DESC \nRETURN `t2`.`city` AS `city`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the top five cities in terms of the number of 5-star ratings in 2016 reviews, in descending order.",
    "evidence": "5-star rating refers to Stars = 5; in 2016 refers to Date like '2016%'; most reviews refers to max(count(city))",
    "idx": 185
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH ()-[t2:filed_complaint]->(`t1`:`callcenterlogs`)\nWHERE `t1`.`complaint id` = `t2`.`complaint id`\nAND (`t2`.`issue` = 'Arbitration')\nRETURN MAX(`t1`.`ser_time`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the longest server time when the call is about the issue of arbitration?",
    "evidence": "longest server time refers to max(ser_time)",
    "idx": 186
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[located_in_0:located_in]->(`t2`:`district`)-[in_state_0:in_state]->(`t3`:`state`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND `t2`.`state_abbrev` = `t3`.`statecode`\nAND (`t1`.`phone` = '100-121-8371')\nRETURN `t1`.`social` AS `social`, `t1`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give me the social number and state of the client whose phone number is 100-121-8371.",
    "evidence": "social number refers to social",
    "idx": 187
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[located_in_0:located_in]->(`t2`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t2`.`division` = 'Pacific')\nRETURN `t1`.`first` AS `first`, `t1`.`middle` AS `middle`, `t1`.`last` AS `last`, `t1`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names and phone numbers of clients that were from the Pacific.",
    "evidence": "full name refers to first, middle, last; the Pacific refers to division = 'Pacific'",
    "idx": 188
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nRETURN `t1`.`social` AS `social`, 365 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END))) + 30 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'%M') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'%M') ELSE NULL END))) + toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'dd') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'dd') ELSE NULL END))) AS `_col_1`, `t2`.`company response to consumer` AS `company response to consumer` ORDER BY 365 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END))) + 30 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'%M') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'%M') ELSE NULL END))) + toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'dd') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'dd') ELSE NULL END))) IS NULL ASC, 365 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END))) + 30 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'%M') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'%M') ELSE NULL END))) + toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'dd') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'dd') ELSE NULL END))) DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the social number of the client who has the longest delay in his/her complaint? Calculate the days of delay and state the company's response to the consumer.",
    "evidence": "social number refers to social; longest delay = max(subtract(Date sent to company, Date received)); days of delay = subtract(Date sent to company, Date received); company's response refers to 'Company response to consumer'",
    "idx": 189
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`client`:`client`)\nWHERE `client`.`city` = 'New York City'\nRETURN `client`.`first` AS `first`, `client`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all first and last names of clients who live in New York city.",
    "evidence": "New York City refers to city = 'New York City'",
    "idx": 191
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[located_in_0:located_in]->(`t2`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nWITH `t2`.`division` AS _groupby_col_0, COUNT(`t2`.`division`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `division`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the number of clients by each division.",
    "evidence": "",
    "idx": 193
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH ()-[t2:filed_complaint]->(`t1`:`callcenterlogs`)\nWHERE `t1`.`complaint id` = `t2`.`complaint id`\nAND (CASE WHEN `t1`.`date received` is not NULL THEN apoc.temporal.format(`t1`.`date received`,'yyyy') ELSE NULL END = '2017')\nRETURN CASE WHEN COUNT(`t1`.`complaint id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`priority` = 2 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`complaint id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of complaints about the late fee issue whose priority is 2 in 2017?",
    "evidence": "percentage = divide(count(Complaint ID where priority = 2) , count(Complaint ID)) * 100%; in 2017 refers to year(Date received) = 2017",
    "idx": 197
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`complaint id` = 'CR0922485')\nRETURN `t1`.`first` AS `first`, `t1`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the first name and phone number of the client whose complaint id is CR0922485.",
    "evidence": "first name refers to first",
    "idx": 198
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`date received` = localdatetime('2014-07-03T00:00:00'))\nRETURN `t1`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the emails of the clients whose complaint date received is 7/3/2014.",
    "evidence": "7/3/2014 refers to Date received = '2014-07-03'",
    "idx": 199
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t1`.`city` = 'Omaha' AND CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END = '2012' AND `t2`.`product` = 'Credit card')\nRETURN COUNT(`t1`.`client_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2012, how many complaints about Credit card product came from clients in Omaha?",
    "evidence": "in 2012 refers to Date received LIKE'2012%'; in Omaha refers to city = 'Omaha'",
    "idx": 200
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END >= '2012' AND CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END <= '2015' AND `t2`.`submitted via` = 'Email' AND `t1`.`sex` = 'Male')\nRETURN COUNT(`t1`.`client_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 2012 to 2015, how many complaints were submitted via email from female clients?",
    "evidence": "from 2012 to 2015 refers to Date received BETWEEN 2012 AND 2015; submitted via email refers to Submitted via = 'Email'; female refers to sex = 'Female'",
    "idx": 201
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`company response to consumer` = 'In progress')\nRETURN `t1`.`phone` AS `phone`, `t2`.`complaint id` AS `complaint id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all clients' phone numbers and complaint IDs which are still in progress.",
    "evidence": "in progress refers to Company response to consumer = 'In progress'",
    "idx": 202
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH ()-[events:filed_complaint]->()\nWHERE CASE WHEN `events`.`date received` is not NULL THEN apoc.temporal.format(`events`.`date received`,'yyyy') ELSE NULL END = '2012' AND `events`.`submitted via` = 'Email'\nRETURN COUNT(`events`.`submitted via`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the complains received in 2012, how many of them are submitted through email?",
    "evidence": "received in 2012 refers to Date received LIKE '2012%'; submitted through email refers to Submitted via = 'Email'",
    "idx": 204
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`reviews`)-[from_district_0:from_district]->(`t1`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t2`.`product` = 'Eagle Capital' AND `t1`.`city` = 'Indianapolis' AND `t1`.`state_abbrev` = 'IN')\nRETURN `t2`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List date of the review of the Eagle Capital from Indianapolis, Indiana.",
    "evidence": "Eagle Capital refers to Product = 'Eagle Capital'; Indianapolis refers to city = 'Indianapolis'; Indiana refers to state_abbrev = 'IN'",
    "idx": 206
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH ()-[t2:filed_complaint]->(`t1`:`callcenterlogs`)\nWHERE `t1`.`complaint id` = `t2`.`complaint id`\nAND (CASE WHEN `t1`.`date received` is not NULL THEN apoc.temporal.format(`t1`.`date received`,'yyyy') ELSE NULL END = '2015' AND `t2`.`timely response?` = 'Yes' AND `t2`.`company response to consumer` = 'Closed with explanation')\nRETURN COUNT(`t1`.`complaint id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the complaints received in year 2015, what is total number of complaints timely response and closed with an explanation?",
    "evidence": "in year 2015 refers to Date received LIKE '2015%'; timely response refers to Timely response?\" = 'Yes'; closed with an explanation refers to Company response to consumer = 'Closed with explanation'",
    "idx": 207
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->(`t3`:`callcenterlogs`)\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND `t2`.`complaint id` = `t3`.`complaint id`\nAND (`t1`.`age` >= 20 AND `t1`.`age` <= 40 AND `t1`.`sex` = 'Female')\nRETURN DISTINCT `t3`.`date received` AS `date received`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the female clients that age between 20 to 40, list the date when their complaints were received.",
    "evidence": "female refers to sex = 'Female'",
    "idx": 208
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`reviews`)-[from_district_0:from_district]->(`t1`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t1`.`city` = 'Newton' AND `t1`.`state_abbrev` = 'MA' AND `t2`.`date` = localdatetime('2016-03-14T00:00:00') AND `t2`.`stars` = 1)\nRETURN `t2`.`product` AS `product`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the product reviewed with 1 star on March 14, 2016 from Newton, Massachusetts.",
    "evidence": "1 star refers to Stars = 1; on March 14, 2016 refers to Date = '2016-03-14'; Newton refers to city = 'Newton'; Massachusetts refers to state_abbrev = 'MA'",
    "idx": 209
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`product` = 'Credit card')\nORDER BY `t1`.`age` IS NULL ASC, `t1`.`age` DESC \nRETURN `t1`.`phone` AS `phone`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In complaints about the credit card product, list the phone number of the oldest client.",
    "evidence": "oldest refers to max(age)",
    "idx": 215
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH ()-[t2:filed_complaint]->(`t1`:`callcenterlogs`)\nWHERE `t1`.`complaint id` = `t2`.`complaint id`\nAND (`t2`.`submitted via` = 'Phone' AND CASE WHEN `t1`.`date received` is not NULL THEN apoc.temporal.format(`t1`.`date received`,'yyyy') ELSE NULL END = '2014')\nRETURN COUNT(`t2`.`complaint id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In complaints received in 2014, how many of them were submitted via call?",
    "evidence": "in 2014 refers to Date received LIKE '2014%'; submitted via call refers to Submitted via = 'Phone'",
    "idx": 216
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "CALL(*) {\nMATCH (`client_sub0`:`client`)\nRETURN avg(`client_sub0`.`age`) * 60 AS `_col_0`  \n}\nMATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t1`.`age` * 100 > `_col_0`)\nRETURN DISTINCT `t2`.`product` AS `product`, `t2`.`issue` AS `issue`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the product and its issues of the complains of clients with age greater than the 60% of average age of all clients.",
    "evidence": "age greater than the 60% of average age refers to age > multiply(avg(age) , 0.6)",
    "idx": 217
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t1`.`title` =~ '(?i)(?s)Pirates of the Caribbean: At World.*s End' AND `t2`.`job` = 'Director of Photography')\nRETURN `t3`.`person_name` AS `person_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the director of photography of the movie \"Pirates of the Caribbean: At World's End\"?",
    "evidence": "name of the director of photography refers to person_name where job = 'Director of Photography'; \"Pirates of the Caribbean: At World's End\" refers to title = 'Pirates of the Caribbean: At World''s End'",
    "idx": 219
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t1`.`title` =~ '(?i)(?s)Pirates of the Caribbean: At World.*s End' AND `t3`.`person_name` = 'Dariusz Wolski')\nRETURN `t2`.`job` AS `job`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the job of Dariusz Wolski in the movie \"Pirates of the Caribbean: At World's End\"?",
    "evidence": "movie \"Pirates of the Caribbean: At World's End\" refers to title = 'Pirates of the Caribbean: At World''s End'",
    "idx": 220
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t1`.`title` =~ '(?i)(?s)Pirates of the Caribbean: At World.*s End')\nRETURN `t3`.`person_name` AS `person_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the crew members of the movie \"Pirates of the Caribbean: At World's End\".",
    "evidence": "names refers to person_name; \"Pirates of the Caribbean: At World's End\" refers to title = 'Pirates of the Caribbean: At World''s End'",
    "idx": 221
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t1`.`title` =~ '(?i)(?s)Pirates of the Caribbean: At World.*s End' AND `t2`.`job` = 'Producer')\nRETURN COUNT(`t3`.`person_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crew members worked as producer in the movie \"Pirates of the Caribbean: At World's End\"?",
    "evidence": "worked as producer refers to job = 'Producer'; \"Pirates of the Caribbean: At World's End\" refers to title = 'Pirates of the Caribbean: At World''s End'",
    "idx": 222
  }
]