[
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`airport`:`airport`)\nWHERE `airport`.`airport_name` =~ '(?i)(?s).*London.*'\nRETURN sum(`airport`.`domestic_passengers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total number of domestic passengers at all London airports?",
    "evidence": "",
    "idx": 5183
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`airport`:`airport`)\nRETURN MAX(`airport`.`transit_passengers`) AS `_col_0`, min(`airport`.`transit_passengers`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum and minimum number of transit passengers of all aiports.",
    "evidence": "",
    "idx": 5184
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`pilot`:`pilot`)\nRETURN `pilot`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all pilot names in ascending alphabetical order.",
    "evidence": "",
    "idx": 5188
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`pilot`:`pilot`)\nWHERE `pilot`.`age` <= 30\nRETURN `pilot`.`name` AS `name` ORDER BY `name` IS NULL ASC, `name` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List names of all pilot aged 30 or younger in descending alphabetical order.",
    "evidence": "",
    "idx": 5190
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`t1`:`aircraft`)-[t2:based_at]->(`t3`:`airport`)\nWHERE `t1`.`aircraft_id` = `t2`.`aircraft_id`\nAND `t2`.`airport_id` = `t3`.`airport_id`\nAND (`t3`.`airport_name` = 'London Gatwick')\nRETURN `t1`.`aircraft` AS `aircraft`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the names of aircrafts associated with airport with name \"London Gatwick\".",
    "evidence": "",
    "idx": 5192
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`t1`:`aircraft`)-[t2:based_at]->(`t3`:`airport`)\nWHERE `t1`.`aircraft_id` = `t2`.`aircraft_id`\nAND `t2`.`airport_id` = `t3`.`airport_id`\nAND (`t3`.`total_passengers` > 10000000)\nRETURN `t1`.`aircraft` AS `aircraft`, `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the names and descriptions of aircrafts associated with airports that have a total number of passengers bigger than 10000000.",
    "evidence": "",
    "idx": 5194
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`t1`:`aircraft`)-[t2:based_at]->(`t3`:`airport`)\nWHERE `t1`.`aircraft_id` = `t2`.`aircraft_id`\nAND `t2`.`airport_id` = `t3`.`airport_id`\nAND (`t1`.`aircraft` = 'Robinson R-22')\nRETURN avg(`t3`.`total_passengers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average total number of passengers of airports that are associated with aircraft \"Robinson R-22\"?",
    "evidence": "",
    "idx": 5196
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`t2`:`match`)-[won_with_0:won_with]->(`t1`:`aircraft`)\nWHERE `t1`.`aircraft_id` = `t2`.`winning_aircraft`\nRETURN `t2`.`location` AS `location`, `t1`.`aircraft` AS `aircraft`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please list the location and the winning aircraft name.",
    "evidence": "",
    "idx": 5198
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`t2`:`match`)-[won_with_0:won_with]->(`t1`:`aircraft`)\nWHERE `t1`.`aircraft_id` = `t2`.`winning_aircraft`\nRETURN `t2`.`location` AS `location`, `t1`.`aircraft` AS `aircraft`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the location and name of the winning aircraft?",
    "evidence": "",
    "idx": 5199
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`pilot`:`pilot`)\nORDER BY `pilot`.`age` IS NULL ASC, `pilot`.`age` DESC \nRETURN `pilot`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List names of all pilot in descending order of age.",
    "evidence": "",
    "idx": 5200
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "WITH *, COLLECT { MATCH (`match_sub0`:`match`)\nRETURN `match_sub0`.`winning_aircraft` AS `winning_aircraft`   } AS in_collect_0\nMATCH (`aircraft`:`aircraft`)\nWHERE NOT `aircraft`.`aircraft_id` IN in_collect_0\nRETURN `aircraft`.`aircraft` AS `aircraft`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of aircrafts and that did not win any match.",
    "evidence": "",
    "idx": 5202
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "WITH *, COLLECT { MATCH (`match_sub0`:`match`)\nRETURN `match_sub0`.`winning_aircraft` AS `winning_aircraft`   } AS in_collect_0\nMATCH (`aircraft`:`aircraft`)\nWHERE NOT `aircraft`.`aircraft_id` IN in_collect_0\nRETURN `aircraft`.`aircraft` AS `aircraft`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all aicrafts that have never won any match?",
    "evidence": "",
    "idx": 5203
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`airport`:`airport`)\nRETURN `airport`.`airport_id` AS `airport_id`, `airport`.`airport_name` AS `airport_name`, `airport`.`total_passengers` AS `total_passengers`, `airport`.`%_change_2007` AS `%_change_2007`, `airport`.`international_passengers` AS `international_passengers`, `airport`.`domestic_passengers` AS `domestic_passengers`, `airport`.`transit_passengers` AS `transit_passengers`, `airport`.`aircraft_movements` AS `aircraft_movements`, `airport`.`freight_metric_tonnes` AS `freight_metric_tonnes` ORDER BY `airport`.`international_passengers` IS NULL ASC, `airport`.`international_passengers` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all information on the airport that has the largest number of international passengers.",
    "evidence": "",
    "idx": 5204
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`airport`:`airport`)\nRETURN `airport`.`airport_id` AS `airport_id`, `airport`.`airport_name` AS `airport_name`, `airport`.`total_passengers` AS `total_passengers`, `airport`.`%_change_2007` AS `%_change_2007`, `airport`.`international_passengers` AS `international_passengers`, `airport`.`domestic_passengers` AS `domestic_passengers`, `airport`.`transit_passengers` AS `transit_passengers`, `airport`.`aircraft_movements` AS `aircraft_movements`, `airport`.`freight_metric_tonnes` AS `freight_metric_tonnes` ORDER BY `airport`.`international_passengers` IS NULL ASC, `airport`.`international_passengers` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information on the airport with the largest number of international passengers?",
    "evidence": "",
    "idx": 5205
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`pilot`)\nWHERE `t1`.`pilot_id` = `t2`.`winning_pilot`\nRETURN `t1`.`name` AS `name`, `t1`.`age` AS `age` ORDER BY `t1`.`age` IS NULL DESC, `t1`.`age`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the name and age of the youngest winning pilot?",
    "evidence": "",
    "idx": 5206
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`pilot`)\nWHERE `t1`.`pilot_id` = `t2`.`winning_pilot`\nRETURN `t1`.`name` AS `name`, `t1`.`age` AS `age` ORDER BY `t1`.`age` IS NULL DESC, `t1`.`age`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How old is the youngest winning pilot and what is their name?",
    "evidence": "",
    "idx": 5207
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "WITH *, COLLECT { MATCH (`match_sub0`:`match`)\nWHERE `match_sub0`.`country` = 'Australia'\nRETURN `match_sub0`.`winning_pilot` AS `winning_pilot`   } AS in_collect_0\nMATCH (`pilot`:`pilot`)\nWHERE NOT `pilot`.`pilot_id` IN in_collect_0\nRETURN `pilot`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the name of pilots who did not win the matches held in the country of Australia.",
    "evidence": "",
    "idx": 5208
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "WITH *, COLLECT { MATCH (`match_sub0`:`match`)\nWHERE `match_sub0`.`country` = 'Australia'\nRETURN `match_sub0`.`winning_pilot` AS `winning_pilot`   } AS in_collect_0\nMATCH (`pilot`:`pilot`)\nWHERE NOT `pilot`.`pilot_id` IN in_collect_0\nRETURN `pilot`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the pilots that have not won any matches in Australia?",
    "evidence": "",
    "idx": 5209
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_and_lot",
    "gql_statement": "MATCH (`t2`:`residents`)-[lives_at_0:lives_at]->(`t1`:`properties`)\nWHERE `t1`.`property_id` = `t2`.`property_id`\nWITH `t1`.`property_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `property_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many residents does each property have? List property id and resident count.",
    "evidence": "",
    "idx": 5210
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_and_lot",
    "gql_statement": "MATCH (`t1`:`things`)-[managed_by_0:managed_by]->(`t2`:`organizations`)\nWHERE `t1`.`organization_id` = `t2`.`organization_id`\nRETURN `t1`.`thing_id` AS `thing_id`, `t1`.`type_of_thing_code` AS `type_of_thing_code`, `t2`.`organization_details` AS `organization_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the id and type of each thing, and the details of the organization that owns it.",
    "evidence": "",
    "idx": 5212
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_and_lot",
    "gql_statement": "MATCH (`t2`:`things`)-[has_status_0:has_status]->(`t1`:`timed_status_of_things`)\nWHERE `t1`.`thing_id` = `t2`.`thing_id`\nAND (`t1`.`status_of_thing_code` = 'Close' OR `t1`.`date_and_date` < localdatetime('2017-06-19T02:59:21'))\nRETURN DISTINCT `t2`.`thing_id` AS `thing_id`, `t2`.`type_of_thing_code` AS `type_of_thing_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct id and type of the thing that has the status 'Close' or has a status record before the date '2017-06-19 02:59:21'",
    "evidence": "",
    "idx": 5214
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of schools.",
    "evidence": "",
    "idx": 5223
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nORDER BY `school`.`enrollment` IS NULL DESC, `school`.`enrollment`  \nRETURN `school`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the locations of schools in ascending order of enrollment.",
    "evidence": "",
    "idx": 5224
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nORDER BY `school`.`founded` IS NULL ASC, `school`.`founded` DESC \nRETURN `school`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the locations of schools in descending order of founded year.",
    "evidence": "",
    "idx": 5226
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nWHERE `school`.`denomination` <> 'Catholic'\nRETURN `school`.`enrollment` AS `enrollment`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the enrollments of schools whose denomination is not \"Catholic\"?",
    "evidence": "",
    "idx": 5228
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nWHERE `school`.`denomination` <> 'Catholic'\nRETURN `school`.`enrollment` AS `enrollment`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the enrollment for each school that does not have \"Catholic\" as denomination.",
    "evidence": "",
    "idx": 5229
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nRETURN avg(`school`.`enrollment`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Take the average of the school enrollment.",
    "evidence": "",
    "idx": 5231
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`player`:`player`)\nRETURN `player`.`team` AS `team` ORDER BY `team` IS NULL DESC, `team`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the team of each player and sort them in ascending alphabetical order.",
    "evidence": "",
    "idx": 5233
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`player`:`player`)\nRETURN COUNT(DISTINCT `player`.`position`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of distinct player positions.",
    "evidence": "",
    "idx": 5235
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`player`:`player`)\nORDER BY `player`.`age` IS NULL ASC, `player`.`age` DESC \nRETURN `player`.`team` AS `team`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the team of the player of the highest age.",
    "evidence": "",
    "idx": 5236
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`player`:`player`)\nORDER BY `player`.`age` IS NULL ASC, `player`.`age` DESC \nRETURN `player`.`team` AS `team`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the teams of the players with the top 5 largest ages.",
    "evidence": "",
    "idx": 5238
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`t2`:`school`)-[has_player_0:has_player]->(`t1`:`player`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nRETURN `t1`.`team` AS `team`, `t2`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each player, show the team and the location of school they belong to.",
    "evidence": "",
    "idx": 5240
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`t1`:`school`)-[has_details_0:has_details]->(`t2`:`school_details`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nRETURN `t1`.`location` AS `location`, `t2`.`nickname` AS `nickname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show locations and nicknames of schools.",
    "evidence": "",
    "idx": 5242
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nWITH `school`.`denomination` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `denomination`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show different denominations and the corresponding number of schools.",
    "evidence": "",
    "idx": 5244
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nWITH `school`.`denomination` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `denomination`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each denomination, return the denomination and the count of schools with that denomination.",
    "evidence": "",
    "idx": 5245
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nWITH `school`.`denomination` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `denomination`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show different denominations and the corresponding number of schools in descending order.",
    "evidence": "",
    "idx": 5246
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nORDER BY `school`.`enrollment` IS NULL ASC, `school`.`enrollment` DESC \nRETURN `school`.`school_colors` AS `school_colors`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the school color of the school that has the largest enrollment.",
    "evidence": "",
    "idx": 5248
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "WITH *, COLLECT { MATCH (`player_sub0`:`player`)\nRETURN `player_sub0`.`school_id` AS `school_id`   } AS in_collect_0\nMATCH (`school`:`school`)\nWHERE NOT `school`.`school_id` IN in_collect_0\nRETURN `school`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the locations of schools that do not have any player.",
    "evidence": "",
    "idx": 5250
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "WITH *, COLLECT { MATCH (`player_sub0`:`player`)\nRETURN `player_sub0`.`school_id` AS `school_id`   } AS in_collect_0\nMATCH (`school`:`school`)\nWHERE NOT `school`.`school_id` IN in_collect_0\nRETURN `school`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which schools do not have any player? Give me the school locations.",
    "evidence": "",
    "idx": 5251
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school_details`:`school_details`)\nWHERE `school_details`.`division` <> 'Division 1'\nRETURN `school_details`.`nickname` AS `nickname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the nicknames of schools that are not in division 1.",
    "evidence": "",
    "idx": 5252
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_player",
    "gql_statement": "MATCH (`school`:`school`)\nWITH `school`.`denomination` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `denomination`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the denomination shared by more than one school.",
    "evidence": "",
    "idx": 5254
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`district`:`district`)\nORDER BY `district`.`city_area` IS NULL ASC, `district`.`city_area` DESC \nRETURN DISTINCT `district`.`district_name` AS `district_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the distinct district names ordered by city area in descending.",
    "evidence": "",
    "idx": 5256
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`product`:`product`)\nWITH `product`.`max_page_size` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `max_page_size`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the list of page size which have more than 3 product listed",
    "evidence": "",
    "idx": 5258
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`city_population` >= 200000 AND `district`.`city_population` <= 2000000\nRETURN `district`.`district_name` AS `district_name`, `district`.`city_population` AS `city_population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and population of district with population between 200000 and 2000000",
    "evidence": "",
    "idx": 5260
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`district`:`district`)\nWHERE `district`.`city_area` > 10 OR `district`.`city_population` > 100000\nRETURN `district`.`district_name` AS `district_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name all districts with city area greater than 10 or population larger than 100000",
    "evidence": "",
    "idx": 5262
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`district`:`district`)\nORDER BY `district`.`city_area` IS NULL ASC, `district`.`city_area` DESC \nRETURN sum(`district`.`city_population`) AS `_col_0`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total population of the top 3 districts with the largest area.",
    "evidence": "",
    "idx": 5268
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`district`:`district`)\nORDER BY `district`.`city_area` IS NULL ASC, `district`.`city_area` DESC \nRETURN sum(`district`.`city_population`) AS `_col_0`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of residents for the districts with the 3 largest areas?",
    "evidence": "",
    "idx": 5269
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`store`:`store`)\nWITH `store`.`type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all types of store and number of them.",
    "evidence": "",
    "idx": 5270
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`t1`:`store`)-[t2:located_in]->(`t3`:`district`)\nWHERE `t1`.`store_id` = `t2`.`store_id`\nAND `t2`.`district_id` = `t3`.`district_id`\nAND (`t3`.`district_name` = 'Khanewal District')\nRETURN `t1`.`store_name` AS `store_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all stores in Khanewal District.",
    "evidence": "",
    "idx": 5272
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "CALL(*) {\nMATCH (`district_sub0`:`district`)\nORDER BY `district_sub0`.`city_population` IS NULL ASC, `district_sub0`.`city_population` DESC \nRETURN `district_sub0`.`district_id` AS `district_id`  LIMIT 1\n}\nMATCH (`t1`:`store`)-[t2:located_in]->()\nWHERE `t1`.`store_id` = `t2`.`store_id`\nAND (`t2`.`district_id` = `district_id`)\nRETURN `t1`.`store_name` AS `store_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the stores in the district with the most population.",
    "evidence": "",
    "idx": 5274
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "CALL(*) {\nMATCH (`district_sub0`:`district`)\nORDER BY `district_sub0`.`city_population` IS NULL ASC, `district_sub0`.`city_population` DESC \nRETURN `district_sub0`.`district_id` AS `district_id`  LIMIT 1\n}\nMATCH (`t1`:`store`)-[t2:located_in]->()\nWHERE `t1`.`store_id` = `t2`.`store_id`\nAND (`t2`.`district_id` = `district_id`)\nRETURN `t1`.`store_name` AS `store_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the stores in the largest district by population?",
    "evidence": "",
    "idx": 5275
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`t1`:`store`)-[t2:located_in]->(`t3`:`district`)\nWHERE `t1`.`store_id` = `t2`.`store_id`\nAND `t2`.`district_id` = `t3`.`district_id`\nAND (`t1`.`store_name` = 'Blackville')\nRETURN `t3`.`headquartered_city` AS `headquartered_city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which city is the headquarter of the store named \"Blackville\" in?",
    "evidence": "",
    "idx": 5276
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`t1`:`store`)-[t2:located_in]->(`t3`:`district`)\nWHERE `t1`.`store_id` = `t2`.`store_id`\nAND `t2`.`district_id` = `t3`.`district_id`\nWITH `t3`.`headquartered_city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `headquartered_city`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of stores in each city.",
    "evidence": "",
    "idx": 5278
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`t3`:`store`)-[t2:has_product]->(`t1`:`product`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`store_id` = `t3`.`store_id`\nAND (`t3`.`store_name` = 'Miramichi')\nRETURN `t1`.`product` AS `product`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What products are available at store named \"Miramichi\"?",
    "evidence": "",
    "idx": 5282
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`max_page_size` = 'A4' AND `product`.`pages_per_minute_color` < 5\nRETURN `product`.`product` AS `product`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find products with max page size as \"A4\" and pages per minute color smaller than 5.",
    "evidence": "",
    "idx": 5284
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`max_page_size` = 'A4' OR `product`.`pages_per_minute_color` < 5\nRETURN `product`.`product` AS `product`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find products with max page size as \"A4\" or pages per minute color smaller than 5.",
    "evidence": "",
    "idx": 5286
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`product` =~ '(?i)(?s).*Scanner.*'\nRETURN `product`.`product` AS `product`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the product whose name contains the word \"Scanner\".",
    "evidence": "",
    "idx": 5288
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`product` =~ '(?i)(?s).*Scanner.*'\nRETURN `product`.`product` AS `product`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all of the products whose name includes the substring \"Scanner\"?",
    "evidence": "",
    "idx": 5289
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "CALL(*) {\nMATCH (`product_sub0`:`product`)\nWITH `product_sub0`.`max_page_size` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `max_page_size`  LIMIT 1\n}\nMATCH (`product`:`product`)\nWHERE `product`.`product` <> `max_page_size`\nRETURN `product`.`product` AS `product`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the products that are not using the most frequently-used max page size.",
    "evidence": "",
    "idx": 5290
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "CALL(*) {\nMATCH (`product_sub0`:`product`)\nWITH `product_sub0`.`max_page_size` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `max_page_size`  LIMIT 1\n}\nMATCH (`product`:`product`)\nWHERE `product`.`product` <> `max_page_size`\nRETURN `product`.`product` AS `product`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all products that are not the most frequently-used maximum page size?",
    "evidence": "",
    "idx": 5291
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "CALL(*) {\nMATCH (`district_sub0`:`district`)\nRETURN avg(`district_sub0`.`city_area`) AS `_col_0_1`  \n}\nMATCH (`district`:`district`)\nWHERE `district`.`city_area` > `_col_0_1`\nRETURN sum(`district`.`city_population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total population of the districts where the area is bigger than the average city area.",
    "evidence": "",
    "idx": 5292
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_product",
    "gql_statement": "CALL(*) {\nMATCH (`district_sub0`:`district`)\nRETURN avg(`district_sub0`.`city_area`) AS `_col_0_1`  \n}\nMATCH (`district`:`district`)\nWHERE `district`.`city_area` > `_col_0_1`\nRETURN sum(`district`.`city_population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total population for all the districts that have an area larger tahn the average city area?",
    "evidence": "",
    "idx": 5293
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`college`:`college`)\nRETURN sum(`college`.`enr`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total enrollment number of all colleges?",
    "evidence": "",
    "idx": 5294
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`college`:`college`)\nRETURN sum(`college`.`enr`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students are enrolled in college?",
    "evidence": "",
    "idx": 5295
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`hs` < 1500\nRETURN `player`.`pname` AS `pname`, `player`.`hs` AS `hs`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and training hours of players whose hours are below 1500.",
    "evidence": "",
    "idx": 5306
  }
]