[
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "WITH *, COLLECT { MATCH (`male_sub0`:`male`)\nRETURN `male_sub0`.`name` AS `name_1`   } AS in_collect_0\nMATCH (`t1`:`no_payment_due`)-[has_person_0:has_person]->(`t2`:`person`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (NOT `t2`.`name` IN in_collect_0 AND `t1`.`bool` = 'neg')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List 10 students that have no due payments and are not males.",
    "evidence": "no due payments refers to bool = 'neg'; not males refers to not in male table",
    "idx": 3344
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`no_payment_due`)\nMATCH (`t2`:`enlist`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`bool` = 'pos')\nRETURN `t2`.`organ` AS `organ`, `t1`.`name` AS `name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name 5 students with due payments that are enlisted alongside which organization they were enlisted.",
    "evidence": "with due payments refers to bool = 'pos'; organization refers to organ",
    "idx": 3345
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`disabled`)\nMATCH (`t1`:`enrolled`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`school` = 'smc')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all disabled students that are enrolled in SMC.",
    "evidence": "enrolled in SMC refers to school = 'smc';",
    "idx": 3346
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enrolled`)\nMATCH (`t1`:`enlist`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`school` = 'ucsd' AND `t1`.`organ` = 'peace_corps')\nRETURN COUNT(`t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the number of students from UCSD enlisted in the peace corps.",
    "evidence": "in the peace corps refers to organ = 'peace_corps'; from UCSD refers to school = 'ucsd';",
    "idx": 3352
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL(*) {\nMATCH (`longest_absense_from_school_sub0`:`longest_absense_from_school`)\nRETURN MAX(`longest_absense_from_school_sub0`.`month`) AS `_col_0`  \n}\nMATCH (`longest_absense_from_school`:`longest_absense_from_school`)\nWHERE `longest_absense_from_school`.`month` = `_col_0`\nRETURN `longest_absense_from_school`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out student IDs that have the longest absence duration from school.",
    "evidence": "longest absence duration refers to MAX(month)",
    "idx": 3356
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enlist`)\nMATCH (`t1`:`disabled`)\nWHERE `t1`.`name` = `t2`.`name`\nRETURN DISTINCT `t2`.`organ` AS `organ`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Does disable students join organization. If yes, please indicate the organization joined by the students.",
    "evidence": "organization refers to organ",
    "idx": 3361
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`male`)\nOPTIONAL MATCH (`t2`:`disabled`)\nWHERE `t1`.`name` = 'student124'\nAND `t1`.`name` = `t2`.`name`\nRETURN CASE WHEN `t2`.`name` IS NULL THEN 'female' ELSE 'male' END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please check if student 124 is disabled male.",
    "evidence": "if student name appear in disabled then student is disabled and vice versa; if student name appear in male then student is male and vice versa",
    "idx": 3362
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`no_payment_due`:`no_payment_due`)\nWHERE `no_payment_due`.`bool` = 'neg'\nRETURN COUNT(`no_payment_due`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of students do not have payment due.",
    "evidence": "do not have payment due refers to bool = 'neg';",
    "idx": 3374
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`no_payment_due`:`no_payment_due`)\nWHERE `no_payment_due`.`bool` = 'pos'\nRETURN COUNT(`no_payment_due`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of students who have payment due.",
    "evidence": "who have payment due refers to bool = 'pos';",
    "idx": 3375
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`longest_absense_from_school`)\nMATCH (`t1`:`disabled`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`month` = 0)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the name of disabled students who have never been absent from school.",
    "evidence": "never been absent from school refers to month = 0",
    "idx": 3376
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`male`)\nMATCH (`t2`:`enlist`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`organ` = 'foreign_legion')\nRETURN COUNT(`t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the number of male students who belong to foreign legion.",
    "evidence": "belong to foreign legion refers to organ = 'foreign_legion';",
    "idx": 3378
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "WITH *, COLLECT { MATCH (`male_sub0`:`male`)\nRETURN `male_sub0`.`name` AS `name`   } AS in_collect_0\nMATCH (`enlist`:`enlist`)\nWHERE `enlist`.`organ` = 'air_force' AND NOT `enlist`.`name` IN in_collect_0\nRETURN COUNT(`enlist`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the number of female students who enlisted in the air force.",
    "evidence": "enlisted in the air force refers to organ = 'air_force';",
    "idx": 3379
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`longest_absense_from_school`)\nMATCH (`t1`:`disabled`)\nWHERE `t1`.`name` = `t2`.`name`\nORDER BY `t2`.`month` IS NULL ASC, `t2`.`month` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State name of disabled students who have the longest duration of absense from school.",
    "evidence": "longest duration of absense refers to MAX(month)",
    "idx": 3380
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enlist`)\nMATCH (`t1`:`unemployed`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`organ` = 'marines')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the unemployed students who enlisted in marines.",
    "evidence": "enlisted in marines refers to organ = 'marines';",
    "idx": 3381
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`disabled`)\nMATCH (`t1`:`longest_absense_from_school`)\nWHERE `t1`.`name` = `t2`.`name`\nRETURN avg(`t1`.`month`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average duration of absense of disabled students.",
    "evidence": "average refers to DIVIDE(SUM(month), COUNT(name))",
    "idx": 3382
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`unemployed`)\nMATCH (`t1`:`longest_absense_from_school`)\nWHERE `t1`.`name` = `t2`.`name`\nORDER BY `t1`.`month` IS NULL ASC, `t1`.`month` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State name of unemployed students who have the longest duration of absense from school.",
    "evidence": "longest duration of absense refers to MAX(month)",
    "idx": 3384
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`unemployed`)\nMATCH (`t1`:`longest_absense_from_school`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`month` = 0)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the name of unemployed students who have never been absent from school.",
    "evidence": "have never been absent from school refers to month = 0",
    "idx": 3385
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`longest_absense_from_school`)\nMATCH (`t2`:`filed_for_bankrupcy`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`month` = 0)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the name of students who filed for bankruptcy and have never been absent from school.",
    "evidence": "have never been absent refers to month = 0;",
    "idx": 3387
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`longest_absense_from_school`)\nMATCH (`t2`:`filed_for_bankrupcy`)\nWHERE `t1`.`name` = `t2`.`name`\nORDER BY `t1`.`month` IS NULL ASC, `t1`.`month` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State name of students who filed for bankruptcy and have the longest duration of absense from school.",
    "evidence": "longest duration of absense refers to MAX(month)",
    "idx": 3388
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL (*) {\nMATCH (`male_sub0`:`male`)\nWHERE `male_sub0`.`name` = 'studenT1000'\nRETURN COUNT(`male_sub0`.`name`) AS `result`  \n}\nWITH *\nRETURN CASE WHEN `result` = 0 THEN 'female' ELSE 'male' END AS `re`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the gender of student1000?",
    "evidence": "student name appear in Male table means student is a male, student does not appear in Male table means student is a female",
    "idx": 3389
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`longest_absense_from_school`:`longest_absense_from_school`)\nRETURN avg(`longest_absense_from_school`.`month`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the average number of absences for each student.",
    "evidence": "average refers to DIVIDE(SUM(month), COUNT(name))",
    "idx": 3394
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`enlist`:`enlist`)\nWHERE `enlist`.`organ` IN ['army', 'peace_corps', 'foreign_legion']\nRETURN COUNT(`enlist`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Sum up the number of students enlisted in foreign legion, peace corps and army.",
    "evidence": "enlisted in foreign legion refers to organ = 'foreign_legion'; peace corps refers to organ = 'peace_corps'; army refers to organ = 'army'",
    "idx": 3395
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`enrolled`)\nMATCH (`t1_sub0`:`disabled`)\nWHERE `t1_sub0`.`name` = `t2_sub0`.`name`\nWITH `t2_sub0`.`school` AS _groupby_col_0, COUNT(`t2_sub0`.`name`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `school`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `school`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which school has the highest number of disabled students?",
    "evidence": "highest number of disabled students refers to MAX(COUNT(disabled.name))",
    "idx": 3399
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`filed_for_bankrupcy`)\nMATCH (`t2`:`enlist`)\nWHERE `t1`.`name` = `t2`.`name`\nRETURN `t2`.`organ` AS `organ`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the organisations of students who filed for bankcrupcy.",
    "evidence": "organization refers to organ; students who filed for bankrupcy refers to file_for_bankrupcy.name",
    "idx": 3400
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`male`)\nMATCH (`t2_sub0`:`enlist`)\nWHERE `t1_sub0`.`name` = `t2_sub0`.`name`\nWITH `t1_sub0`.`name` AS _groupby_col_0, COUNT(DISTINCT `t1_sub0`.`name`) AS _groupby_col_1, COUNT(`t2_sub0`.`organ`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `a`, _groupby_col_2 AS `num`  \n}\nWITH *\nWHERE `num` > 1\nRETURN COUNT(`a`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many male students join more than one organization?",
    "evidence": "more than one organization refers to COUNT(organ) > 1",
    "idx": 3401
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enlist`)\nMATCH (`t1`:`disabled`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`organ` = 'navy')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the navy students who are disabled.",
    "evidence": "navy students refers to organ = 'navy'; disabled student refers to disabled.name",
    "idx": 3402
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`male`)\nMATCH (`t1`:`disabled`)\nWHERE `t1`.`name` <> `t2`.`name`\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the disabled female students.",
    "evidence": "",
    "idx": 3404
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL(*) {\nMATCH (`unemployed_sub0`:`unemployed`)\nRETURN COUNT(`unemployed_sub0`.`name`) AS `_col_0_2`  \n}\nCALL(*) {\nMATCH (`disabled_sub0`:`disabled`)\nRETURN COUNT(`disabled_sub0`.`name`) AS `_col_0_1`  \n}\nWITH *\nRETURN CASE WHEN `_col_0_1`=0 THEN NULL ELSE toFloat(`_col_0_2`) / `_col_0_1` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the ratio between unemployed students and disabled students.",
    "evidence": "ratio refers to DIVIDE(COUNT(name from unemployed), COUNT(name from disabled))",
    "idx": 3405
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`enlist`)\nOPTIONAL MATCH (`t2`:`male`)\nWHERE `t1`.`organ` = 'fire_department'\nAND `t1`.`name` = `t2`.`name`\nRETURN CASE WHEN COUNT(`t1`.`name`)=0 THEN NULL ELSE toFloat(COUNT(`t2`.`name`)) * 100 / COUNT(`t1`.`name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the percentage of male students enlisted in the fire department.",
    "evidence": "percentage refers to DIVIDE(COUNT(organ = 'fire_department'), COUNT(name))",
    "idx": 3406
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`no_payment_due`)\nMATCH (`t2`:`enlist`)\nWHERE `t2`.`name` = `t1`.`name`\nAND (`t1`.`bool` = 'neg' AND `t2`.`organ` = 'fire_department')\nRETURN `t1`.`name` AS `name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List at least 10 students who have no payment due and are enlisted in Fire Department organization.",
    "evidence": "no payment due refers to bool = 'neg'; organization refers to organ; organ = 'fire_department';",
    "idx": 3418
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`enlist`)\nOPTIONAL MATCH (`t2`:`male`)\nWHERE `t1`.`organ` = 'fire_department'\nAND `t2`.`name` = `t1`.`name`\nRETURN CASE WHEN COUNT(`t1`.`name`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`name` IS NULL THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`name`) END AS `_col_0`, CASE WHEN COUNT(`t1`.`name`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN NOT `t2`.`name` IS NULL THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`name`) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the ratio in percentage between the average number of female and male students who joined Fire Department organization.",
    "evidence": "ratio = CONCAT(MULTIPLY(DIVIDE(COUNT(enlist.name WHERE organ = 'fire_department' which is NOT in male.name), COUNT(enlist.name WHERE organ = 'fire_department),'%'))) AS FEMALE; ratio = CONCAT(MULTIPLY(DIVIDE(COUNT(enlist.name WHERE organ = 'fire_department' which is IN male.name), COUNT(enlist.name WHERE organ = 'fire_department), 100))) AS MALE; female students refers to enlist.name who are NOT in male.name; male students refers to enlist.name who are IN male.name; organization refers to organ; organ = 'fire_department';",
    "idx": 3425
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`longest_absense_from_school`:`longest_absense_from_school`)\nRETURN CASE WHEN COUNT(`longest_absense_from_school`.`name`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `longest_absense_from_school`.`month` = 0 THEN 1 ELSE 0 END)) * 100 / COUNT(`longest_absense_from_school`.`name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of students who have never been absent.",
    "evidence": "percentage = CONCAT(DIVIDE(MULTIPLY(COUNT(name WHERE month = 0), 100), COUNT(name)),'%'); never been absent refers to month = 0;",
    "idx": 3427
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`enrolled`:`enrolled`)\nWHERE `enrolled`.`month` = 15\nRETURN `enrolled`.`name` AS `name`, `enrolled`.`school` AS `school`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the students' names and schools who enrolled for 15 months.",
    "evidence": "enrolled for 15 months refers to month = 15;",
    "idx": 3429
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`enlist`:`enlist`)\nRETURN CASE WHEN COUNT(DISTINCT `enlist`.`organ`)=0 THEN NULL ELSE toFloat(COUNT(`enlist`.`name`)) * 100 / COUNT(DISTINCT `enlist`.`organ`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average enlisted students per organization.",
    "evidence": "average = DIVIDE(FLOOR(COUNT(NAME), COUNT(DISTINCT organ)));",
    "idx": 3430
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`enrolled`:`enrolled`)\nWHERE `enrolled`.`name` = 'student214'\nRETURN `enrolled`.`school` AS `school`, `enrolled`.`month` AS `month`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the enrolled schools and duration of student214.",
    "evidence": "enrolled schools refers to school; duration refers to month; student214 is a name of student;",
    "idx": 3431
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`person`)\nOPTIONAL MATCH (`t2`:`disabled`)-[has_person_0:has_person]->(`t1`:`person`)\nWHERE `t2`.`name` = `t1`.`name`\nRETURN CASE WHEN COUNT(`t1`.`name`)=0 THEN NULL ELSE toFloat(COUNT(`t2`.`name`)) * 100 / COUNT(`t1`.`name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all students, calculate the percentage of disabled students.",
    "evidence": "percentage = CONCAT(DIVIDE(MULTIPLY(COUNT(disabled.name), 100), (COUNT(person.name that is not in disabled.name))),'%');",
    "idx": 3432
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "WITH *, COLLECT { MATCH (`filed_for_bankrupcy_sub0`:`filed_for_bankrupcy`)\nRETURN `filed_for_bankrupcy_sub0`.`name` AS `name_1`   } AS in_collect_0\nMATCH (`person`:`person`)\nWHERE NOT `person`.`name` IN in_collect_0\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the student names who did not file for bankruptcy.",
    "evidence": "students name who did not file a bankruptcy refers to person.name who are NOT in filed_for_bankrupcy.name;",
    "idx": 3434
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`enlist`)\nOPTIONAL MATCH (`t2`:`male`)\nWHERE `t2`.`name` IS NULL AND `t1`.`organ` = 'air_force'\nAND `t2`.`name` = `t1`.`name`\nRETURN `t1`.`name` AS `name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List any five female students' names who enlisted for the air force.",
    "evidence": "female students refers to enlist.name who are NOT in male.name; air force refers to organ = 'air_force';",
    "idx": 3435
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`person`)\nOPTIONAL MATCH (`t2`:`disabled`)-[has_person_0:has_person]->(`t1`:`person`)\nWHERE `t2`.`name` = `t1`.`name`\nRETURN COUNT(CASE  WHEN `t2`.`name` IS NULL THEN `t1`.`name`  END) AS `number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the number of students who are not disabled.",
    "evidence": "students who are not disabled refers to person.name who are NOT in disabled.name;",
    "idx": 3436
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`enrolled`)\nOPTIONAL MATCH (`t2`:`male`)\nWHERE `t1`.`name` = 'student995'\nAND `t2`.`name` = `t1`.`name`\nRETURN CASE WHEN `t2`.`name` IS NULL THEN 'female' ELSE 'male' END AS `gen`, `t1`.`school` AS `school`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Define the gender of \"student995\" and his/her enrolled schools.",
    "evidence": "male.name = 'student995' means student995's gender is male; if 'student995' can not be found in 'male.name', it means student995 is female;",
    "idx": 3437
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`unemployed`)\nMATCH (`t1`:`disabled`)\nWHERE `t2`.`name` = `t1`.`name`\nRETURN `t1`.`name` AS `name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the students with disabilities, list any five students' names who are unemployed.",
    "evidence": "students with disabilities who are unemployed refers to disabled.name who are IN unemployed.name;",
    "idx": 3438
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`longest_absense_from_school`)\nMATCH (`t2`:`enlist`)\nWHERE `t2`.`name` = `t1`.`name`\nAND (`t1`.`month` = 4)\nRETURN `t2`.`name` AS `name`, `t2`.`organ` AS `organ`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the students who have been absent for four months, provide any five students' names and enlisted organizations.",
    "evidence": "absent for four months refers to month = 4; enlisted organizations refers to organ;",
    "idx": 3440
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`no_payment_due`)\nMATCH (`t1`:`enlist`)\nWHERE `t2`.`name` = `t1`.`name`\nAND (`t1`.`name` = 'student160')\nRETURN `t1`.`organ` AS `organ`, `t2`.`bool` AS `bool`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the enlisted organizations of student160 and status of his/her payment due.",
    "evidence": "enlisted organizations refers to organ; student160 is a name of student; status of his or her payment due is mentioned in no_payment_due; bool = 'pos' means the student has payment due; bool = 'neg' means the student has no payment due;",
    "idx": 3442
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`enlist`)\nMATCH (`t2`:`male`)\nWHERE `t2`.`name` = `t1`.`name`\nAND (`t1`.`organ` = 'foreign_legion')\nRETURN `t1`.`name` AS `name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List any ten male students who enlisted for foreign legion.",
    "evidence": "male students are mentioned in male.name; foreign legion refers to organ = 'foreign_legion';",
    "idx": 3443
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`person`)\nOPTIONAL MATCH (`t2`:`male`)-[has_person_0:has_person]->(`t1`:`person`)\nWHERE `t2`.`name` = `t1`.`name`\nRETURN CASE WHEN COUNT(`t1`.`name`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`name` IS NULL THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of female students.",
    "evidence": "percentage = CONCAT(DIVIDE(MULTIPLY(COUNT(person.name which is not in male.name)), 100), COUNT(person.name that is IN male.name),'%'); female students refers to person.name who are NOT in male.name;",
    "idx": 3444
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`disabled`)\nMATCH (`t1`:`enrolled`)\nWHERE `t2`.`name` = `t1`.`name`\nWITH `t1`.`school` AS _groupby_col_0, COUNT(`t1`.`name`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide a disability breakdown for each school.",
    "evidence": "disability breakdown refers to the number of disabled students;",
    "idx": 3449
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`enrolled`)\nMATCH (`t1_sub0`:`enlist`)\nWHERE `t1_sub0`.`name` = `t2_sub0`.`name`\nWITH `t1_sub0`.`name` AS _groupby_col_0, COUNT(`t1_sub0`.`organ`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `num`  \n}\nWITH *\nWHERE `num` = 2\nRETURN `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out student names that enrolled in two schools and two organizations?",
    "evidence": "enrolled in two schools refers to COUNT(school) = 2; two organizations refers to COUNT(organ) = 2;",
    "idx": 3450
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`enrolled`)\nOPTIONAL MATCH (`t2_sub0`:`filed_for_bankrupcy`)\nWHERE `t2_sub0`.`name` = `t1_sub0`.`name`\nWITH `t1_sub0`.`school` AS _groupby_col_0, COUNT(`t2_sub0`.`name`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `school`, _groupby_col_1 AS `num`  \n}\nWITH *\nRETURN `school`, `num` ORDER BY `num` IS NULL ASC, `num` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which school have the highest student enrollment? How many of those students are filed for bankruptcy?",
    "evidence": "highest student enrollment refers to MAX(COUNT(school));",
    "idx": 3452
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enrolled`)\nMATCH (`t1`:`enlist`)\nWHERE `t2`.`name` = `t1`.`name`\nAND (`t2`.`school` = 'occ' AND `t1`.`organ` = 'fire_department')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out students that enrolled in occ school and enlisted in a fire department.",
    "evidence": "occ school refers to school = 'occ'; department refers to organ; organ = 'fire_department';",
    "idx": 3454
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`unemployed`)\nMATCH (`t2`:`longest_absense_from_school`)\nWHERE `t2`.`name` = `t1`.`name`\nRETURN CASE WHEN COUNT(`t1`.`name`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`month` = 0 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the ratio of unemployed students who have never been absent from school.",
    "evidence": "ratio = CONCAT(DIVIDE(MULTIPLY(COUNT(unemployed.name WHERE month = 0), 100), COUNT(month)),'%'); unemployed students who have never been absent from school refers to (unemployed.name WHERE month = 0);",
    "idx": 3459
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`no_payment_due`)\nMATCH (`t2`:`male`)\nWHERE `t2`.`name` = `t1`.`name`\nAND (`t1`.`bool` = 'pos')\nRETURN COUNT(`t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of male students who do not have payment due.",
    "evidence": "do not have payment due refers to bool = 'neg';",
    "idx": 3460
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`filed_for_bankrupcy`)\nMATCH (`t2`:`no_payment_due`)\nWHERE `t2`.`name` = `t1`.`name`\nAND (`t2`.`bool` = 'pos')\nRETURN COUNT(`t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of students who filed for bankruptcy and have payment due.",
    "evidence": "have payment due refers to bool = 'pos';",
    "idx": 3461
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t1`:`no_payment_due`)\nMATCH (`t2`:`disabled`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`bool` = 'neg')\nRETURN COUNT(`t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of disabled students who have payment due.",
    "evidence": "have payment due refers to bool = 'pos';",
    "idx": 3463
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`no_payment_due`)\nMATCH (`t1`:`longest_absense_from_school`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`bool` = 'neg')\nORDER BY `t1`.`month` IS NULL ASC, `t1`.`month` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State name of students who have the longest duration of absense from school and do not have payment due.",
    "evidence": "longest duration of absence from school refers to MAX(month); do not have payment due refers to bool = 'neg';",
    "idx": 3464
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`no_payment_due`)\nMATCH (`t1`:`longest_absense_from_school`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t1`.`month` = 5 AND `t2`.`bool` = 'neg')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State name of students who have been absent for 5 months from school and do not have payment due.",
    "evidence": "absent for 5 months refers to month = 5; do not have payment due refers to bool = 'neg';",
    "idx": 3465
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (`t2`:`enlist`)\nMATCH (`t1`:`disabled`)\nWHERE `t1`.`name` = `t2`.`name`\nAND (`t2`.`organ` = 'marines')\nRETURN COUNT(`t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the number of disabled students who enlisted in marines.",
    "evidence": "marines refers to organ = 'marines';",
    "idx": 3466
  }
]