[
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t1`.`year` = 2015)\nORDER BY `t1`.`num_students` IS NULL ASC, `t1`.`num_students` DESC \nRETURN `t2`.`university_name` AS `university_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the university with the most number of students in 2015.",
    "evidence": "most number of students refers to MAX(num_students); in 2015 refers to year = 2015; name of university refers to university_name;",
    "idx": 6245
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t1`.`year` >= 2011 AND `t1`.`year` <= 2014 AND `t2`.`university_name` = 'University of Tokyo')\nRETURN sum(`t1`.`num_students`) - sum(CASE WHEN 100=0 THEN NULL ELSE toFloat(`t1`.`num_students` * `t1`.`pct_international_students`) / 100 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference between the total number of students and the number of international international students in Univeristy of Tokyo from 2011 to 2014.",
    "evidence": "international students refers to DIVIDE(MULTIPLY(num_students, pct_international_students), 100); difference refers to SUBTRACT(SUM(num_students), SUM(DIVIDE(MULTIPLY(num_students, pct_international_students), 100))); in University of Tokyo refers to university_name = 'University of Tokyo'; from 2011 to 2014 refers to year BETWEEN 2011 AND 2014",
    "idx": 6249
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`weather`:`weather`)\nWHERE `weather`.`station_nbr` = 2 AND `weather`.`depart` > 0\nRETURN `weather`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the dates on which the temperature of station no.2 was above the 30-year normal.",
    "evidence": "temperature above the 30-year normal refers to depart > 0; station no.2 refers to station_nbr = 2",
    "idx": 6254
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[store_0:store]->(`t1`:`sales_in_weather`)\nMATCH (`t2`:`relation`)-[station_0:station]->(`t3`:`weather`)\nWHERE `t1`.`store_nbr` = `t2`.`store_nbr`\nAND `t2`.`station_nbr` = `t3`.`station_nbr`\nAND (`t2`.`store_nbr` = 3 AND `t1`.`item_nbr` = 5 AND `t1`.`units` > 100 AND `t3`.`avgspeed` > 10)\nRETURN `t1`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the dates on which the sale of item no.5 in store no.3 exceeded 100 and the average wind speed exceeded 10.",
    "evidence": "item no. 5 refers to item_nbr = 5; store no.3 refers to store_nbr = 3; exceed 100 refers to units > 100; average wind speed exceeded 10 refers to avgspeed > 10",
    "idx": 6259
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[store_0:store]->(`t1`:`sales_in_weather`)\nMATCH (`t2`:`relation`)-[station_0:station]->(`t3`:`weather`)\nWHERE `t1`.`store_nbr` = `t2`.`store_nbr`\nAND `t2`.`station_nbr` = `t3`.`station_nbr`\nAND (`t2`.`store_nbr` = 3 AND toString(`t1`.`date`) =~ '(?i)(?s).*2012.*')\nWITH `t3`.`tmax` AS _groupby_col_0, sum(`t1`.`units`) AS _groupby_col_1\nORDER BY _groupby_col_0 IS NULL ASC, _groupby_col_0 DESC \nRETURN _groupby_col_1 AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total units of products sold on the day with the highest max temperature in store no.3 in 2012?",
    "evidence": "highest max temperature refers to Max(tmax); store no.3 refers to store_nbr = 3; in 2012 refers to substring (date, 1, 4) = '2012'; total units refers to sum(units)",
    "idx": 6260
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`sales_in_weather`:`sales_in_weather`)\nWHERE `sales_in_weather`.`date` = localdatetime('2012-01-01T00:00:00') AND `sales_in_weather`.`store_nbr` = 1\nORDER BY `sales_in_weather`.`units` IS NULL ASC, `sales_in_weather`.`units` DESC \nRETURN `sales_in_weather`.`item_nbr` AS `item_nbr`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the id of the bestsellers of store no.1 on 2012/1/1.",
    "evidence": "store no. 1 refers to store_nbr = 1; on 2012/1/1 refers to date = '2012-01-01'; best seller refers to Max(units); ID refers to item_nbr",
    "idx": 6262
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`weather`:`weather`)\nWHERE `weather`.`date` = localdatetime('2014-10-17T00:00:00') AND `weather`.`station_nbr` = 20\nRETURN `weather`.`tavg` AS `tavg`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the average temperature of station no.20 on 2014/10/17.",
    "evidence": "station no.20 refers to station_nbr = 20; on 2014/10/17 refers to date = '2014-10-17'; average temperature refers to tavg",
    "idx": 6264
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`weather`:`weather`)\nWHERE `weather`.`date` = localdatetime('2014-01-15T00:00:00') AND `weather`.`station_nbr` = 9\nRETURN `weather`.`resultspeed` AS `resultspeed`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the resultant wind speed of station no.9 on 2014/1/15.",
    "evidence": "station no.9 refers to station_nbr = 9; on 2014/1/15 refers to date = '2014/01/15'; result wind speed refers to resultspeed",
    "idx": 6265
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nAND (`t2`.`store_nbr` = 7 AND `t1`.`date` = localdatetime('2014-04-28T00:00:00'))\nRETURN `t1`.`tmax` - `t1`.`tmin` AS `temprange`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the temperature range of the home weather station of store no.7 on 2014/4/28.",
    "evidence": "store no.7 refers to tore_nbr = 7; on 2014/4/28 refers to date = '2014-04-28'; temperature range refers to Subtract (tmax, tmin)",
    "idx": 6267
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nAND (`t2`.`store_nbr` = 14 AND `t1`.`date` = localdatetime('2012-02-15T00:00:00'))\nRETURN `t1`.`wetbulb` AS `wetbulb`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the wet-bulb temperature of the weather station which contained store no.6 on 2012/2/15.",
    "evidence": "store no.6 refers to store_nbr = 6; on 2012/2/15 refers to date = '2012-02-15'; wet-bulb temperature refers to wetbulb",
    "idx": 6270
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nAND (`t2`.`store_nbr` = 21 AND `t1`.`date` = localdatetime('2012-11-09T00:00:00'))\nRETURN `t1`.`tmax` AS `tmax`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the max temperature of the weather station which has the no.21 store on 2012/11/9.",
    "evidence": "no.21 store refers to store_nbr = 21; on 2012/11/9 refers to date = '2012-11-09'; max temperature refers to tmax",
    "idx": 6271
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nAND (`t1`.`date` = localdatetime('2014-02-21T00:00:00') AND `t2`.`store_nbr` = 30)\nRETURN `t1`.`sunrise` AS `sunrise`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the sunrise time recorded by the home weather station of store no.30 on 2014/2/21.",
    "evidence": "store no. 30 refers to store_nbr = 30; on 2014/2/21 refers to date = '2014-02-21'",
    "idx": 6272
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nORDER BY `t1`.`snowfall` IS NULL ASC, `t1`.`snowfall` DESC \nRETURN `t2`.`store_nbr` AS `store_nbr`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of stores that belongs to the weather station which recorded the deepest snowfall.",
    "evidence": "deepest snowfall refers to Max(snowfall); number of stores refers to store_nbr",
    "idx": 6273
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nAND (`t1`.`date` = localdatetime('2013-02-12T00:00:00') AND `t2`.`store_nbr` = 2)\nRETURN `t1`.`codesum` AS `codesum`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the code summarization for the weather recorded by the weather station which contained the no.2 store on 2013/2/12.",
    "evidence": "no.2 store refers to store_nbr = 2; on 2013/2/12 refers to date = '2013-02-12'; code summarization refers to codesum",
    "idx": 6274
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nAND (`t1`.`date` = localdatetime('2013-02-24T00:00:00') AND `t2`.`store_nbr` = 19)\nRETURN `t1`.`sealevel` AS `sealevel`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the sea level status recorded by the weather station of store no.19 on 2013/2/24.",
    "evidence": "store no.19 refers to store_nbr = 19; on 2013/2/24 refers to date = '2013-02-24'; sea level status refers to sealevel",
    "idx": 6275
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nAND (`t1`.`date` = localdatetime('2012-05-15T00:00:00') AND `t2`.`store_nbr` = 12)\nRETURN `t1`.`stnpressure` AS `stnpressure`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the station pressure status recorded by the weather station which contained no.12 store on 2012/5/15.",
    "evidence": "no.12 store refers to store_nbr = 12; on 2012/5/15 refers to date = '2012-05-15'; station pressure status refers to stnpressure",
    "idx": 6277
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "WITH *, COLLECT { MATCH (`relation_sub0`:`relation`)\nWITH `relation_sub0`.`station_nbr` AS _groupby_col_0, COUNT(`relation_sub0`.`store_nbr`) AS _groupby_col_1\nWHERE _groupby_col_1 = 1\nRETURN _groupby_col_0 AS `station_nbr_1`   } AS in_collect_0\nMATCH (`t1`:`relation`)-[station_0:station]->(`t2`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nAND (NOT `t2`.`sunrise` IS NULL AND toString(`t2`.`date`) =~ '(?i)(?s).*2012-02.*' AND `t1`.`station_nbr` IN in_collect_0)\nORDER BY `t2`.`sunrise` IS NULL DESC, `t2`.`sunrise`  \nRETURN `t1`.`station_nbr` AS `station_nbr`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the earliest sunrise recorded in the stations with no more than 1 store in February 2012?",
    "evidence": "in February 2012 refers to SUBSTR(date, 1, 7) = '2012-02'; earliest sunrise Min(sunrise);  station with no more than 1 store refers to station_nbr where Count(store_nbr) = 1",
    "idx": 6286
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "CALL (*) {\nMATCH (`weather_sub0`:`weather`)\nORDER BY `weather_sub0`.`heat` IS NULL ASC, `weather_sub0`.`heat` DESC \nRETURN `weather_sub0`.`station_nbr` AS `station_nbr`  LIMIT 1\n}\nMATCH (`t2`:`relation`)\nWHERE `station_nbr` = `t2`.`station_nbr`\nRETURN COUNT(`t2`.`store_nbr`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many stores belong to the station with the highest recorded heat of all time?",
    "evidence": "highest recorded heat refers to Max(heat); station refers to station_nbr",
    "idx": 6289
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "WITH *, COLLECT { MATCH (`relation_sub0`:`relation`)\nWITH `relation_sub0`.`station_nbr` AS _groupby_col_0, COUNT(`relation_sub0`.`store_nbr`) AS _groupby_col_1\nWHERE _groupby_col_1 = 3\nRETURN _groupby_col_0 AS `station_nbr`   } AS in_collect_0\nMATCH (`weather`:`weather`)\nWHERE `weather`.`date` = localdatetime('2014-02-18T00:00:00') AND `weather`.`stnpressure` < 30 AND `weather`.`station_nbr` IN in_collect_0\nRETURN COUNT(`weather`.`station_nbr`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the stations with 3 stores, how many stations have a station pressure of no more than 30 on February 18, 2014?",
    "evidence": "station with 3 stores refers to station_nbr where Count(store_nbr) = 3; station pressure of no more than 30 refers to stnpressure < 30; On February 18, 2014 refers to date = '2014-02-18'",
    "idx": 6291
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t1`:`relation`)-[store_0:store]->(`t2`:`sales_in_weather`)\nWHERE `t1`.`store_nbr` = `t2`.`store_nbr`\nAND (`t1`.`store_nbr` = 17)\nWITH `t1`.`station_nbr` AS _groupby_col_0, `t2`.`item_nbr` AS _groupby_col_1\nRETURN _groupby_col_0 AS `station_nbr`, _groupby_col_1 AS `item_nbr`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out stations number and items sold by store 17.",
    "evidence": "station number refers to station_nbr; store 17 refers to store_nbr = 17",
    "idx": 6300
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t2`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`station_nbr` = `t2`.`station_nbr`\nAND (`t2`.`store_nbr` = 35 AND `t1`.`codesum` =~ '(?i)(?s).*' OR False OR False)\nRETURN `t1`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out dates when haze is recorded in store 35.",
    "evidence": "store 35 refers to store_nbr = 35; haze is recorded refers to codesum like '%'||'HZ'||'%'",
    "idx": 6301
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (`t3`:`relation`)-[store_0:store]->(`t2`:`sales_in_weather`)\nMATCH (`t3`:`relation`)-[station_0:station]->(`t1`:`weather`)\nWHERE `t1`.`date` = `t2`.`date`\nAND `t2`.`store_nbr` = `t3`.`store_nbr` AND `t1`.`station_nbr` = `t3`.`station_nbr`\nAND (`t2`.`store_nbr` = 1 AND `t1`.`codesum` =~ '(?i)(?s).*' OR False OR False)\nWITH `t2`.`item_nbr` AS _groupby_col_0\nORDER BY `t2`.`units` IS NULL ASC, `t2`.`units` DESC \nRETURN _groupby_col_0 AS `item_nbr`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which items from store 1 have the highest units sold during rainy day?",
    "evidence": "store 1 refers to store_nbr = 1; highest unit sold refers to Max(units); during rainy day refers to codesum like '%'||'RA'||'%'; item refers to item_nbr",
    "idx": 6303
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`ethnicgroup`)\nWHERE `t1`.`country` = `t2`.`code`\nAND (`t1`.`name` = 'Polish')\nWITH `t2`.`name` AS _groupby_col_0, `t1`.`percentage` AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL DESC, _groupby_col_1  \nRETURN _groupby_col_0 AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which country does Polish found least in?",
    "evidence": "",
    "idx": 6309
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`ethnicgroup`)\nWHERE `t1`.`country` = `t2`.`code`\nAND (`t1`.`name` = 'African' AND `t1`.`percentage` > 90)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which countries have more than 90% of African? List the name of the country in full.",
    "evidence": "Percentage = 90 means 90% of the population",
    "idx": 6310
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`ethnicgroup`)\nWHERE `t1`.`country` = `t2`.`code`\nAND (`t2`.`name` = 'Singapore')\nWITH `t1`.`name` AS _groupby_col_0, `t1`.`percentage` AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `percentage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the different ethnic group and percentage of the language in Singapore.",
    "evidence": "",
    "idx": 6311
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`politics`:`politics`)\nWHERE CASE WHEN `politics`.`independence` is not NULL THEN apoc.temporal.format(`politics`.`independence`,'yyyy') ELSE NULL END > '1970'\nRETURN CASE WHEN COUNT(`politics`.`country`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `politics`.`government` = 'republic' THEN 1 ELSE 0 END)) * 100 / COUNT(`politics`.`country`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of country which gained independence as republic after 1970.",
    "evidence": "",
    "idx": 6312
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`population`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`population_growth` > 2 AND `t2`.`infant_mortality` < 5)\nRETURN `t1`.`name` AS `name`, `t1`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the country and its population with population growth greater than 2% but infant mortality rate less than 5%.",
    "evidence": "",
    "idx": 6313
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`ethnicgroup`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t1`.`population` > 10000000)\nWITH `t2`.`name` AS _groupby_col_0, `t2`.`percentage` AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `name`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which is the majority of the ethnic group in country with great than 10,000,000 population",
    "evidence": "",
    "idx": 6314
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`population`)\nMATCH (`t2`:`ethnicgroup`)\nWHERE `t1`.`country` = `t2`.`country`\nAND (`t2`.`name` = 'Amerindian')\nORDER BY `t2`.`percentage` IS NULL DESC, `t2`.`percentage`  \nRETURN `t1`.`infant_mortality` AS `infant_mortality`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the infant mortality of country with the least Amerindian.",
    "evidence": "",
    "idx": 6316
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`economy`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`gdp` > 400000)\nRETURN `t1`.`capital` AS `capital`, `t1`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among countries with more than 400,000 GDP, state its capital and population.",
    "evidence": "",
    "idx": 6323
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`economy`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t1`.`name` = 'Brazil')\nRETURN `t2`.`service` * `t2`.`gdp` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the service of GDP for Brazil.",
    "evidence": "The service of GDP can be computed by service * GDP",
    "idx": 6324
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`population`)\nWHERE `t1`.`code` = `t2`.`country`\nORDER BY `t2`.`infant_mortality` IS NULL ASC, `t2`.`infant_mortality` DESC \nRETURN `t1`.`name` AS `name`, `t2`.`population_growth` AS `population_growth`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country has the highest infant mortality? Also state its population growth.",
    "evidence": "",
    "idx": 6325
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`population`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`population_growth` < 0)\nRETURN `t1`.`name` AS `name`, `t1`.`population` AS `population`, `t2`.`population_growth` AS `population_growth`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all countries with negative growth in population. State the country, population and growth.",
    "evidence": "Negative growth in population means population_growth < 0",
    "idx": 6326
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`population`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t1`.`area` >= 500000 AND `t1`.`area` <= 1000000)\nRETURN `t1`.`name` AS `name`, `t2`.`infant_mortality` AS `infant_mortality`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For countries with area between 500000 to 1000000, state the country and infant mortality rate.",
    "evidence": "",
    "idx": 6327
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`ethnicgroup`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(`t1`.`name`) AS _groupby_col_1\nWHERE _groupby_col_1 > 5\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the name of the countries with over 5 ethnic groups.",
    "evidence": "",
    "idx": 6333
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`economy`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`inflation` < 2)\nRETURN `t1`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the capital cities of the countries with an inflation rate under 2.",
    "evidence": "",
    "idx": 6336
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`located`)\nMATCH (`t2`:`lake`)\nWHERE `t1`.`lake` = `t2`.`name`\nAND (`t1`.`province` = 'Albania')\nRETURN `t2`.`depth` AS `depth`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the depth of the lakes that are located in the Province of Albania.",
    "evidence": "",
    "idx": 6340
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t1`.`population` < 1000000)\nWITH `t2`.`country` AS _groupby_col_0, COUNT(`t1`.`name`) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the countries with a population of under 1000000, how many of them have over 2 languages?",
    "evidence": "",
    "idx": 6344
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`economy`)\nMATCH (`t2`:`organization`)\nWHERE `t1`.`country` = `t2`.`country`\nAND (`t1`.`gdp` < 500000 AND CASE WHEN `t2`.`established` is not NULL THEN apoc.temporal.format(`t2`.`established`,'yyyy') ELSE NULL END < '1999')\nWITH `t1`.`country` AS _groupby_col_0, COUNT(`t1`.`country`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many organizations are established after 1999/1/1 in a country whose GDP is under 500000?",
    "evidence": "",
    "idx": 6346
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`language`)\nMATCH (`t2`:`organization`)\nWHERE `t1`.`country` = `t2`.`country`\nAND (`t1`.`name` = 'Dutch')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the organization names established in the countries where Dutch is spoken.",
    "evidence": "Dutch is one of language",
    "idx": 6347
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`economy`)\nWHERE `t1`.`code` = `t2`.`country`\nWITH `t1`.`name` AS _groupby_col_0, `t2`.`inflation` AS _groupby_col_1, `t2`.`inflation` AS _groupby_col_2, avg(`t2`.`inflation`) * 1.3 AS _groupby_col_3\nWHERE _groupby_col_2 > _groupby_col_3\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the countries with an inflation rate that's 30% above the average.",
    "evidence": "Average inflation rate = [sum(inflation) / count(countries)]; 30% above average implies inflation > 1.3 average inflation rate",
    "idx": 6352
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`religion`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`name` = 'Christian' AND `t2`.`percentage` = 41)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country is 41% Christian? Give the full name of the country.",
    "evidence": "",
    "idx": 6355
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`borders`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country1`\nORDER BY `t2`.`length` IS NULL ASC, `t2`.`length` DESC \nRETURN `t2`.`country1` AS `country1`, `t2`.`country2` AS `country2`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which two countries have the longest border in the world? Give the full name of the country.",
    "evidence": "",
    "idx": 6356
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`geo_mountain`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`mountain` = 'Cerro Chirripo')\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country is Mountain Cerro Chirripo located in? Give the full name of the country.",
    "evidence": "",
    "idx": 6357
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`city`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t2`.`population` = 114339)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country has the city of 114339 in population? Give the full name of the country.",
    "evidence": "",
    "idx": 6366
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`geo_mountain`)\nWHERE `t1`.`code` = `t2`.`country`\nWITH `t1`.`name` AS _groupby_col_0, `t1`.`capital` AS _groupby_col_1, COUNT(`t1`.`name`) AS _groupby_col_2\nWHERE _groupby_col_2 > 4\nRETURN _groupby_col_1 AS `capital`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the capital cities of the countries that have more than 4 mountains.",
    "evidence": "",
    "idx": 6371
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`economy`)\nMATCH (`t2_sub0`:`geo_mountain`)\nWHERE `t1_sub0`.`country` = `t2_sub0`.`country`\nAND (`t1_sub0`.`industry` < 40)\nWITH `t1_sub0`.`country` AS _groupby_col_0, COUNT(`t1_sub0`.`country`) AS _groupby_col_1\nWHERE _groupby_col_1 < 2\nRETURN _groupby_col_0 AS `country`  \n}\nWITH *\nRETURN COUNT(`country`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the countries whose agriculture takes up more than 40% of its GDP, how many of them have less than 2 mountains?",
    "evidence": "",
    "idx": 6372
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "CALL(*) {\nMATCH (`economy_sub0`:`economy`)\nORDER BY `economy_sub0`.`inflation` IS NULL DESC, `economy_sub0`.`inflation`  \nRETURN `economy_sub0`.`country` AS `country`  LIMIT 1\n}\nMATCH (`geo_mountain`:`geo_mountain`)\nWHERE `geo_mountain`.`country` = `country`\nRETURN `geo_mountain`.`mountain` AS `mountain`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the mountains in the country with the lowest inflation rate.",
    "evidence": "",
    "idx": 6373
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`geo_desert`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country`\nAND (`t1`.`area` > 100000 AND `t1`.`population` < 500000)\nRETURN `t2`.`desert` AS `desert`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the deserts in the countries whose population is over 100000 and covers an area of under 500000.",
    "evidence": "",
    "idx": 6374
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`borders`)\nMATCH (`t1`:`country`)\nWHERE `t1`.`code` = `t2`.`country1`\nORDER BY `t2`.`length` IS NULL DESC, `t2`.`length`  \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the countries that share the shortest border.",
    "evidence": "",
    "idx": 6375
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (`t2`:`province`)\nMATCH (`t1`:`city`)\nWHERE `t2`.`name` = `t1`.`province`\nAND (`t2`.`population` > 1000000)\nRETURN `t1`.`name` AS `name`, `t1`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the all the cities and its city population for provinces with population more than 1000000.",
    "evidence": "",
    "idx": 6377
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`island_sub0`:`island`)\nWHERE `island_sub0`.`type` = 'coral'\nRETURN `island_sub0`.`name` AS `name`   } AS in_collect_0\nMATCH (`locatedon`:`locatedon`)\nWHERE `locatedon`.`island` IN in_collect_0\nRETURN `locatedon`.`city` AS `city`, `locatedon`.`province` AS `province`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the coral islands along with its city and province.",
    "evidence": "Baltic Sea is a sea located in Northern Europe",
    "idx": 6378
  }
]