[
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[categorized_as_0:categorized_as]->(`t2`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t2`.`title` = 'Criminal Sexual Assault' AND `t2`.`crime_against` = 'Persons' AND `t1`.`arrest` = 'TRUE')\nRETURN `t1`.`case_number` AS `case_number`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please state the district name where incident number JB106545 took place.",
    "evidence": "incident number JB106545 refers to case_number = 'JB106545'",
    "idx": 6672
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nWHERE `t1`.`iucr_no` = `t2`.`iucr_no`\nAND (`t2`.`case_number` = 'JB106010')\nRETURN `t1`.`primary_description` AS `primary_description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the general description for case number JB106010?",
    "evidence": "general description refers to primary_description",
    "idx": 6673
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t3`:`community_area`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND `t2`.`community_area_no` = `t3`.`community_area_no`\nAND (`t1`.`title` = 'Criminal Sexual Assault')\nRETURN `t3`.`community_area_name` AS `community_area_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please name three communities that experience the fraud incident.",
    "evidence": "communities refers to community_area_name; 'Fraud Incident' is the title of crime",
    "idx": 6674
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t3`:`community_area`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND `t2`.`community_area_no` = `t3`.`community_area_no`\nAND (`t3`.`community_area_name` = 'Rogers Park')\nWITH `t1`.`fbi_code_no` AS _groupby_col_0, `t1`.`title` AS _groupby_col_1\nRETURN _groupby_col_0 AS `fbi_code_no`, _groupby_col_1 AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the major type of crime that happened in the Rogers Park community area?",
    "evidence": "\"Rogers Park\" is the community_area_name; major type of crime refers to title",
    "idx": 6675
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t2`.`case_number` = 'JB120039')\nWITH `t1`.`district_no` AS _groupby_col_0, `t1`.`district_name` AS _groupby_col_1\nRETURN _groupby_col_0 AS `district_no`, _groupby_col_1 AS `district_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "At which district did the multiple homicide case number JB120039 occurred?",
    "evidence": "multiple homicide refers to Count(case_number) > 1; district refers to district_name",
    "idx": 6676
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[categorized_as_0:categorized_as]->(`t2`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nRETURN CASE WHEN COUNT(`t1`.`fbi_code_no`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`title` = 'Drug Abuse' AND `t1`.`location_description` = 'STREET' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`fbi_code_no`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of crime cases that have been classified as \"drug abuse\" by the FBI and happened on the street?",
    "evidence": "\"Drug Abuse\" is the title of crime; happened on the street refers to location_description = 'STREET';  percentage = Divide (Count(fbi_code_no where location_description = 'STREET'), Count(fbi_code_no)) * 100",
    "idx": 6677
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`ward`:`ward`)\nORDER BY `ward`.`population` IS NULL ASC, `ward`.`population` DESC \nRETURN `ward`.`ward_no` AS `ward_no`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ward number with the highest population.",
    "evidence": "highest population refers to Max(Population); ward number refers to ward_no",
    "idx": 6678
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`crime`:`crime`)\nWHERE `crime`.`case_number` = 'JB112212'\nRETURN `crime`.`beat` AS `beat`, `crime`.`location_description` AS `location_description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the beat and location description of the case JB112212?",
    "evidence": "case JB112212 refers to case_number = 'JB112212'",
    "idx": 6679
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`fbi_code`:`fbi_code`)\nWHERE `fbi_code`.`description` = 'The killing of one human being by another.'\nRETURN `fbi_code`.`fbi_code_no` AS `fbi_code_no`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the FBI code for the crime described by \"The killing of one human being by another.\"",
    "evidence": "\"The killing of one human being by another\" is the description; FBI code refers to fbi_code_no",
    "idx": 6680
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nMATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t3`:`ward`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND `t2`.`ward_no` = `t3`.`ward_no`\nAND (`t1`.`community_area_name` = 'Montclare')\nWITH `t3`.`ward_office_address` AS _groupby_col_0\nRETURN _groupby_col_0 AS `ward_office_address`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide at least 5 ward office addresses associated with the crimes that happened in the community of Montclare.",
    "evidence": "\"Montclare\" is the community_area_name",
    "idx": 6681
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t1`:`crime`)-[handled_by_district_0:handled_by_district]->(`t2`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t1`.`location_description` = 'YARD' AND `t1`.`beat` = 532)\nRETURN `t2`.`address` AS `address`, `t2`.`commander` AS `commander`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the district's commander associated with the crime that happened at the yard and has a beat of 532.",
    "evidence": "beat of 532 refers to beat = 532; happened in the Yard refers to location_description = 'YARD'; district commander refers to commander",
    "idx": 6682
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`neighborhood`)-[located_in_0:located_in]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND (`t1`.`community_area_name` = 'Lake View')\nRETURN `t2`.`neighborhood_name` AS `neighborhood_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the neighborhood name in the community area of Lake View?",
    "evidence": "\"Lake View\" is the community_area_name",
    "idx": 6683
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t3`:`neighborhood`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND `t2`.`community_area_no` = `t3`.`community_area_no`\nAND (`t2`.`report_no` = 23778)\nRETURN `t3`.`neighborhood_name` AS `neighborhood_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the neighborhood of the community area in crime with report number 23843?",
    "evidence": "neighborhood refers to neighborhood_name; '23778' is the report_no",
    "idx": 6684
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t2`.`report_no` = 23843)\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the FBI description of the crime for report number 23778?",
    "evidence": "\"23778\" is the report_no; FBI description refers to description",
    "idx": 6685
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nRETURN sum(CASE  WHEN `t1`.`commander` = 'Jill M. Stevens' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the report number of crimes associated with the district commander named Jill M. Stevens.",
    "evidence": "report number refers report_no; 'Jill M. Stevens\" is the commander",
    "idx": 6686
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t3`:`neighborhood`)\nMATCH (`t2`:`crime`)-[occurred_in_community_area_0:occurred_in_community_area]->(`t1`:`community_area`)\nWHERE `t1`.`community_area_no` = `t2`.`community_area_no`\nAND `t2`.`community_area_no` = `t3`.`community_area_no`\nAND (`t3`.`neighborhood_name` = 'Avalon Park')\nRETURN CASE WHEN COUNT(`t2`.`location_description`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`location_description` = 'HOUSE' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`location_description`) END AS `persent`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the crimes happened in the neighborhood called \"Avalon Park\", what is the percentage of crimes that happened inside the house?",
    "evidence": "\"Avalon Park\" is the neghborhood_name; happened inside the house refers to location_description = 'HOUSE'; percentage = Divide (Count(location_description = 'HOUSE'), Count(location_description)) * 100",
    "idx": 6687
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`ward`:`ward`)\nWHERE `ward`.`ward_no` = 21\nRETURN `ward`.`alderman_first_name` AS `alderman_first_name`, `ward`.`alderman_last_name` AS `alderman_last_name`, `ward`.`alderman_name_suffix` AS `alderman_name_suffix`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the alderman of ward no.21?",
    "evidence": "full name of alderman refers to alderman_first_name, alderman_last_name, alderman_name_suffix",
    "idx": 6688
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`ward`:`ward`)\nORDER BY `ward`.`population` IS NULL ASC, `ward`.`population` DESC \nRETURN `ward`.`ward_no` AS `ward_no`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ward ID of the most crowded ward?",
    "evidence": "most crowded ward refers to Max(Population)",
    "idx": 6689
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`iucr`:`iucr`)\nWHERE `iucr`.`primary_description` = 'ASSAULT'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many incidents have the general description of \"ASSAULT\" in the IUCR classification?",
    "evidence": "general description refers to primary_description; 'ASSAULT' is the primary_description; incidents refers to iucr_no",
    "idx": 6690
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t2`.`arrest` = 'FALSE' AND `t1`.`alderman_first_name` = 'Pat')\nRETURN sum(CASE  WHEN `t1`.`alderman_last_name` = 'Dowell' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the crimes with no arrest made, how many of them happened in the ward represented by alderman Pat Dowell?",
    "evidence": "no arrest has been made refers to arrest = 'FALSE'",
    "idx": 6692
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "CALL(*) {\nMATCH (`ward_sub0`:`ward`)\nRETURN `ward_sub0`.`population` AS `population` ORDER BY `population` IS NULL ASC, `population` DESC \nLIMIT 1\n}\nMATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t2`.`domestic` = 'TRUE')\nORDER BY `t1`.`population` = `population` IS NULL DESC, `t1`.`population` = `population`  \nRETURN COUNT(`t1`.`ward_no`) AS `num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the crimes in the ward with the most population, how many of them are cases of domestic violence?",
    "evidence": "most population refers to Max(Population); domestic violence refers to domestic = 'TRUE'",
    "idx": 6693
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t1`.`alderman_first_name` = 'Pat' AND `t1`.`alderman_last_name` = 'Dowell' AND NOT `t2`.`latitude` IS NULL AND NOT `t2`.`longitude` IS NULL)\nRETURN `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the location coordinates of all the incidents that had happened in the ward represented by alderman Pat Dowell.",
    "evidence": "location coordinates refers to latitude, longitude",
    "idx": 6694
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nWHERE `t1`.`iucr_no` = `t2`.`iucr_no`\nAND (`t1`.`primary_description` = 'BATTERY')\nRETURN `t2`.`case_number` AS `case_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the case numbers of all the incidents with the generic description of \"BATTERY\" in the IUCR classification.",
    "evidence": "general description refers to primary_description; 'BATTERY' is the primary_description",
    "idx": 6695
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[classified_as_0:classified_as]->(`t1`:`iucr`)\nWHERE `t1`.`iucr_no` = `t2`.`iucr_no`\nAND (`t1`.`primary_description` = 'BATTERY')\nRETURN sum(CASE  WHEN `t2`.`arrest` = 'FALSE' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the incidents with the generic description of \"BATTERY\" in the IUCR classification, how many of them do not have arrests made?",
    "evidence": "general description refers to primary_description; 'BATTERY' is the primary_description; do not have arrest made refers to arrest = 'FALSE'",
    "idx": 6696
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t1`.`title` = 'Homicide 1st & 2nd Degree')\nRETURN `t2`.`case_number` AS `case_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the case numbers of all the crimes whose short description of the kind of crime is \"Homicide 1st & 2nd Degree\" in the FBI classification.",
    "evidence": "\"Homicide 1st & 2nd Degree\" is the title",
    "idx": 6697
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[categorized_as_0:categorized_as]->(`t1`:`fbi_code`)\nWHERE `t1`.`fbi_code_no` = `t2`.`fbi_code_no`\nAND (`t1`.`crime_against` = 'Property' AND CASE  WHEN 1-1 < 0 AND 1 < 0  THEN substring(`t2`.`date`,(case when size(`t2`.`date`)+1+(1-1)+1 < 0 then 0 else size(`t2`.`date`)+1+(1-1)+1 end),-(1))  WHEN 1-1 < 0 AND 1 >= 0  THEN substring(`t2`.`date`,size(`t2`.`date`)+1+(1-1),1)  WHEN 1-1 >= 0 AND 1 < 0  THEN substring(`t2`.`date`,(case when 1-1+1+(1) < 0 then 0 else 1-1+1+(1) end),-(1))  ELSE substring(`t2`.`date`,1-1,1) END = '1')\nRETURN sum(CASE  WHEN CASE  WHEN 5-1 < 0 AND 4 < 0  THEN substring(`t2`.`date`,(case when size(`t2`.`date`)+1+(5-1)+4 < 0 then 0 else size(`t2`.`date`)+1+(5-1)+4 end),-(4))  WHEN 5-1 < 0 AND 4 >= 0  THEN substring(`t2`.`date`,size(`t2`.`date`)+1+(5-1),4)  WHEN 5-1 >= 0 AND 4 < 0  THEN substring(`t2`.`date`,(case when 5-1+1+(4) < 0 then 0 else 5-1+1+(4) end),-(4))  ELSE substring(`t2`.`date`,5-1,4) END = '2018' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the incidents in January, 2018, how many of them were stated \"against Property\" in the FBI classification?",
    "evidence": "in January 2018 refers to Substr(date, 1, 1) = '1' AND Substr(date, 5, 4) = '2018'; against property refers to crime_against = 'Property'",
    "idx": 6698
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t1`.`commander` = 'Robert A. Rubio' AND CASE  WHEN 1-1 < 0 AND 1 < 0  THEN substring(`t2`.`date`,(case when size(`t2`.`date`)+1+(1-1)+1 < 0 then 0 else size(`t2`.`date`)+1+(1-1)+1 end),-(1))  WHEN 1-1 < 0 AND 1 >= 0  THEN substring(`t2`.`date`,size(`t2`.`date`)+1+(1-1),1)  WHEN 1-1 >= 0 AND 1 < 0  THEN substring(`t2`.`date`,(case when 1-1+1+(1) < 0 then 0 else 1-1+1+(1) end),-(1))  ELSE substring(`t2`.`date`,1-1,1) END = '1')\nRETURN sum(CASE  WHEN CASE  WHEN 5-1 < 0 AND 4 < 0  THEN substring(`t2`.`date`,(case when size(`t2`.`date`)+1+(5-1)+4 < 0 then 0 else size(`t2`.`date`)+1+(5-1)+4 end),-(4))  WHEN 5-1 < 0 AND 4 >= 0  THEN substring(`t2`.`date`,size(`t2`.`date`)+1+(5-1),4)  WHEN 5-1 >= 0 AND 4 < 0  THEN substring(`t2`.`date`,(case when 5-1+1+(4) < 0 then 0 else 5-1+1+(4) end),-(4))  ELSE substring(`t2`.`date`,5-1,4) END = '2018' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "District commander Robert A. Rubio was responsible for how many incidents in January, 2018?",
    "evidence": "in January 2018 refers to Substr(date, 1, 1) = '1' AND Substr(date, 5, 4) = '2018'",
    "idx": 6699
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t1`.`commander` IN ['Robert A. Rubio', 'Glenn White'] AND CASE  WHEN 1-1 < 0 AND 1 < 0  THEN substring(`t2`.`date`,(case when size(`t2`.`date`)+1+(1-1)+1 < 0 then 0 else size(`t2`.`date`)+1+(1-1)+1 end),-(1))  WHEN 1-1 < 0 AND 1 >= 0  THEN substring(`t2`.`date`,size(`t2`.`date`)+1+(1-1),1)  WHEN 1-1 >= 0 AND 1 < 0  THEN substring(`t2`.`date`,(case when 1-1+1+(1) < 0 then 0 else 1-1+1+(1) end),-(1))  ELSE substring(`t2`.`date`,1-1,1) END = '1' AND CASE  WHEN 5-1 < 0 AND 4 < 0  THEN substring(`t2`.`date`,(case when size(`t2`.`date`)+1+(5-1)+4 < 0 then 0 else size(`t2`.`date`)+1+(5-1)+4 end),-(4))  WHEN 5-1 < 0 AND 4 >= 0  THEN substring(`t2`.`date`,size(`t2`.`date`)+1+(5-1),4)  WHEN 5-1 >= 0 AND 4 < 0  THEN substring(`t2`.`date`,(case when 5-1+1+(4) < 0 then 0 else 5-1+1+(4) end),-(4))  ELSE substring(`t2`.`date`,5-1,4) END = '2018')\nWITH `t1`.`commander` AS _groupby_col_0\nRETURN _groupby_col_0 AS `commander`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which district commander was responsible for more incidents in January, 2018, Robert A. Rubio or Glenn White?",
    "evidence": "in January 2018 refers to Substr(date, 1, 1) = '1' AND Substr(date, 5, 4) = '2018'; 'Robert A. Rubio' and 'Glenn White' are both commander; responsible for more incident refers to Max(count(ward_no))",
    "idx": 6700
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "MATCH (`t2`:`crime`)-[handled_by_district_0:handled_by_district]->(`t1`:`district`)\nWHERE `t1`.`district_no` = `t2`.`district_no`\nAND (`t1`.`commander` = 'Robert A. Rubio')\nRETURN `t2`.`block` AS `block`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the blocks where all the incidents in the district commanded by Robert A. Rubio took place.",
    "evidence": "\"Robert A. Rubio\" is the commander",
    "idx": 6701
  },
  {
    "filename": "train.json",
    "db_id": "chicago_crime",
    "gql_statement": "CALL(*) {\nMATCH (`t2_sub0`:`crime`)-[occurred_in_ward_1:occurred_in_ward]->(`t1_sub0`:`ward`)\nWHERE `t1_sub0`.`ward_no` = `t2_sub0`.`ward_no`\nAND (`t2_sub0`.`date` =~ '(?i)(?s).*2018.*')\nRETURN MAX(`t1_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`t2`:`crime`)-[occurred_in_ward_0:occurred_in_ward]->(`t1`:`ward`)\nWHERE `t1`.`ward_no` = `t2`.`ward_no`\nAND (`t2`.`date` =~ '(?i)(?s).*2018.*' AND `t1`.`population` = `_col_0`)\nRETURN CASE WHEN 12=0 THEN NULL ELSE COUNT(`t1`.`ward_no`) / 12 END AS `average`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of incidents per month in 2018 in the ward with the most population?",
    "evidence": "in 2018 refers to date like '%2018%'; ward with most population refers to Max(Population); average number of incident per month refers to Divide(Count(ward_no), 12)",
    "idx": 6702
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`inspections`:`inspections`)\nWHERE CASE WHEN `inspections`.`date` is not NULL THEN apoc.temporal.format(`inspections`.`date`,'yyyy') ELSE NULL END = '2016' AND `inspections`.`type` = 'Routine - Unscheduled'\nRETURN COUNT(`inspections`.`date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the inspections carried out in 2016, how many of them are routine?",
    "evidence": "inspections carried out in 2016 refer to YEAR(date) = 2016; routine inspections refer to type = 'Routine - Unscheduled';",
    "idx": 6706
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`score` = 100)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the restaurants that have met all requirements in one inspection.",
    "evidence": "met all requirements refers to inspections where score = 100;",
    "idx": 6707
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END = '2016' AND `t2`.`city` IN ['San Francisco', 'SAN FRANCISCO', 'SF', 'S.F.'])\nRETURN COUNT(DISTINCT `t2`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the restaurants being inspected in 2016, how many of them are in San Francisco?",
    "evidence": "inspected in 2016 refers to YEAR(date) = 2016; San Francisco refers to city in ('San Francisco', 'SF' ,'S.F.', 'SAN FRANCISCO');",
    "idx": 6708
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END = '2014' AND `t1`.`risk_category` = 'Low Risk')\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the restaurants that had a low risk violation in inspections in 2014.",
    "evidence": "inspection in 2014 refers to year(date) = 2014; low risk violations refer to risk_category = 'Low Risk';",
    "idx": 6711
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`risk_category` = 'High Risk' AND `t2`.`name` = 'Tiramisu Kitchen')\nRETURN DISTINCT `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the descriptions of all the high risk violations of Tiramisu Kitchen.",
    "evidence": "Tiramisu Kitchen is the name of the business; high risk violations refer to risk_category = 'High Risk';",
    "idx": 6713
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`score` = 100 AND `t1`.`date` = localdatetime('2016-09-28T00:00:00') AND `t1`.`type` = 'Routine - Unscheduled')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the business which met all the required standards during the unscheduled routine inspection on 2016/9/28.",
    "evidence": "met all the required standards refers to score = 100; unscheduled routine inspection on 2016/9/28 refers to type = 'Routine - Unscheduled' where date = '2016-09-28';",
    "idx": 6719
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`name` = 'Stacks Restaurant' AND `t1`.`date` = localdatetime('2016-10-04T00:00:00'))\nRETURN COUNT(DISTINCT `t1`.`violation_type_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many kinds of violations did \"Stacks Restaurant\" have on 2016/10/4?",
    "evidence": "\"Stacks Restaurant\" is the name of the business; date = '2016-10-04';",
    "idx": 6720
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`name` = 'Chez Fayala, Inc.' AND `t1`.`date` = localdatetime('2016-07-01T00:00:00') AND `t1`.`risk_category` = 'Moderate Risk')\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the description of the moderate risk violation which \"Chez Fayala, Inc.\" had on 2016/7/1.",
    "evidence": "\"Chez Fayala, Inc.\" is the name of the business; moderate risk violation refers to risk_category = 'Moderate Risk'; date = '2016-07-01';",
    "idx": 6721
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "CALL(*) {\nMATCH (`inspections_sub0`:`inspections`)\nWHERE `inspections_sub0`.`date` = localdatetime('2016-09-26T00:00:00') AND `inspections_sub0`.`type` = 'Routine - Unscheduled'\nRETURN min(`inspections_sub0`.`score`) AS `_col_0`  \n}\nMATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`score` = `_col_0` AND `t1`.`date` = localdatetime('2016-09-26T00:00:00') AND `t1`.`type` = 'Routine - Unscheduled')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which business had the lowest score for the unscheduled routine inspection on 2016/9/26? Give the name of the business.",
    "evidence": "the lowest score for unscheduled routine inspection refers to type = 'Routine - Unscheduled' where MIN(score); date = '2016-09-26';",
    "idx": 6722
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`name` = 'Soma Restaurant And Bar' AND `t1`.`type` = 'Routine - Unscheduled')\nRETURN COUNT(`t1`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many unscheduled routine inspections did \"Soma Restaurant And Bar\" have?",
    "evidence": "\"Soma Restaurant And Bar\" is the name of the business; unscheduled routine inspections refer to type = 'Routine - Unscheduled';",
    "idx": 6723
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "CALL(*) {\nMATCH (`violations_sub0`:`violations`)\nWHERE `violations_sub0`.`risk_category` = 'Low Risk' AND `violations_sub0`.`description` = 'Permit license or inspection report not posted'\nRETURN min(`violations_sub0`.`date`) AS `_col_0`  \n}\nMATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`date` = `_col_0` AND `t1`.`risk_category` = 'Low Risk' AND `t1`.`description` = 'Permit license or inspection report not posted')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which business was the first one to get a low risk violation because of \"Permit license or inspection report not posted\"? Give the name of the business.",
    "evidence": "low risk violation because of \"Permit license or inspection report not posted\" refers to risk_category = 'Low Risk' where description = 'Permit license or inspection report not posted'; business was the first one refers to name where MIN(date);",
    "idx": 6724
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`business_certificate` = '304977' AND `t1`.`date` = localdatetime('2013-10-07T00:00:00'))\nRETURN COUNT(`t1`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the business whose business certificate number is 304977, how many violations did it have on 2013/10/7?",
    "evidence": "date = '2013-10-07';",
    "idx": 6725
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`businesses`:`businesses`)\nWHERE CASE WHEN `businesses`.`application_date` is not NULL THEN apoc.temporal.format(`businesses`.`application_date`,'yyyy') ELSE NULL END = '2012'\nRETURN COUNT(`businesses`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many eateries applied in 2012?",
    "evidence": "eateries applied in 2012 refer to business_id where application_date between '2012-01-01' and '2012-12-31';",
    "idx": 6730
  }
]