[
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_quantity` > 10 AND lineitem.`l_returnflag` = 'R'\nRETURN COUNT(lineitem.`l_linenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders of more than 10 items have been returned?",
    "evidence": "more than 10 items have been returned refer to l_returnflag = 'R' where l_quantity > 10; orders refer to l_orderkey;",
    "idx": 3394
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_shipmode` = 'AIR' AND lineitem.`l_shipinstruct` = 'NONE'\nRETURN lineitem.`l_extendedprice` * (1 - lineitem.`l_discount`) * (1 + lineitem.`l_tax`) AS `totalprice`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total price charged for orders shipped by air without shipping instructions?",
    "evidence": "SUM(MULTIPLY(MULTIPLY(l_extendedprice, SUBTRACT(1, l_discount)), SUM(1, l_tax))) where l_shipmode = 'AIR' and l_shipinstruct = 'NONE';",
    "idx": 3395
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)\nWHERE t1.`s_nationkey` = t2.`n_nationkey`\nAND (t1.`s_acctbal` < 0 AND t2.`n_name` = 'EGYPT')\nRETURN COUNT(t1.`s_suppkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many suppliers from Egypt have a debit balance?",
    "evidence": "suppliers refer to s_suppkey; Egypt is the name of the nation which refers to n_name = 'EGYPT'; the balance is in debt if s_acctbal < 0;",
    "idx": 3396
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND (t2.`l_shipmode` = 'REG AIR' AND t1.`o_orderdate` = date('1995-03-22'))\nRETURN COUNT(t1.`o_orderkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many items shipped by REG AIR were ordered on March 22, 1995?",
    "evidence": "items shipped by REG AIR refer to l_linenumber where l_shipmode = 'REG AIR'; ordered on March 22, 1995 refers to o_orderdate = '1995-03-22';",
    "idx": 3397
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`supplier`)-[located_in_2_0:`located_in_2`]->(t1@`nation`)-[in_region_0:`in_region`]->(t2@`region`)\nWHERE t1.`n_regionkey` = t2.`r_regionkey`\nAND t1.`n_nationkey` = t3.`s_nationkey`\nAND (t2.`r_name` = 'EUROPE')\nRETURN COUNT(t1.`n_nationkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many European suppliers are there?",
    "evidence": "European suppliers refer to s_suppkey where r_name = 'EUROPE';",
    "idx": 3398
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`part`)-[t2:`supplied_by`]->()\nWHERE t1.`p_partkey` = t2.`ps_partkey`\nAND (t1.`p_type` = 'LARGE BURNISHED COPPER')\nRETURN t2.`ps_supplycost` AS `ps_supplycost`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the cost prices of large burnished copper?",
    "evidence": "cost price refers to ps_supplycost; large burnished copper refers to p_type = 'LARGE BURNISHED COPPER'",
    "idx": 3400
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`orders`)-[placed_by_0:`placed_by`]->(t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND t1.`c_custkey` = t3.`o_custkey`\nAND (t2.`n_name` = 'MOZAMBIQUE' AND t3.`o_orderpriority` = '5-LOW')\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many clients from Mozambique required orders with a low priority order?",
    "evidence": "Mozambique refers to n_name = 'MOZAMBIQUE'; low priority order refers to o_orderpriority = '5-LOW'",
    "idx": 3401
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)\nWHERE t1.`o_custkey` = t2.`c_custkey`\nAND (t2.`c_address` = 'uFTe2u518et8Q8UC')\nRETURN COUNT(t1.`o_clerk`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many different clerks have served the customer with the address uFTe2u518et8Q8UC?",
    "evidence": "clerk who have served the customer refers to o_clerk\n",
    "idx": 3403
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)\nWHERE t1.`s_nationkey` = t2.`n_nationkey`\nAND (t2.`n_name` = 'GERMANY' AND like(t1.`s_comment`,'%carefully regular packages%'))\nRETURN COUNT(t1.`s_suppkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many suppliers from Germany have left a comment with 'carefully regular packages'?",
    "evidence": "Germany is nation name which refers to n_name = 'GERMANY'; comment with 'carefully regular packages' refers to s_comment LIKE 'carefully regular packages%'",
    "idx": 3405
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND (t1.`o_orderdate` = date('1994-09-21') AND t2.`l_shipdate` = date('1994-11-19'))\nRETURN COUNT(t2.`l_partkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many products shipped on 19/11/1994 were ordered on 21/09/1994?",
    "evidence": "shipped on 19/11/1994 refers to l_shipdate = '1994-11-19'; ordered on 21/09/1994 refers to o_orderdate = '1994-09-21'",
    "idx": 3406
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t1.`c_mktsegment` = 'HOUSEHOLD')\nRETURN cast (sum(CASE WHEN t2.`n_name` = 'IRAN' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`n_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of customers engaged in the household segment are from Iran?",
    "evidence": "the household segment refers to c_mktsegment = 'HOUSEHOLD'; Iran is nation name which refers to n_name = 'IRAN'; percentage = divide(count(c_custkey where n_name = 'IRAN'), count(c_custkey)) where c_mktsegment = 'HOUSEHOLD' * 100%",
    "idx": 3408
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_quantity` > 40 AND lineitem.`l_shipmode` = 'AIR'\nRETURN COUNT(lineitem.`l_linenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the line items that have a quantity greater than 40 have been shipped by air?",
    "evidence": "quantity greater than 40 refers to l_quantity > 40; shipped by air refers to l_shipmode = 'AIR'",
    "idx": 3411
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (orders@`orders`)\nWHERE orders.`o_orderkey` = 33\nRETURN orders.`o_totalprice` AS `o_totalprice`, orders.`o_orderpriority` AS `o_orderpriority`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total price and the order priority of order number 33?",
    "evidence": "total price refers to o_totalprice; order priority refers to o_orderpriority; order number 33 refers to o_orderkey = 33",
    "idx": 3412
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_linenumber` = 1\nRETURN lineitem.`l_extendedprice` * (1 - lineitem.`l_discount`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the discounted price of line item number 1?",
    "evidence": "discounted price refers to multiply(l_extendedprice, subtract(1, l_discount)); line item number 1 refers to l_linenumber = 1",
    "idx": 3414
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_extendedprice` < 16947.7\nRETURN sum(CASE WHEN lineitem.`l_returnflag` = 'A' THEN 1 ELSE 0 END) - sum(CASE WHEN lineitem.`l_returnflag` = 'N' THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the difference between the number of returned items and not returned items with the full price of under 16947.7?",
    "evidence": "full price of under 16947.7 refers to l_extendedprice < 16947.7; returned item refers to l_returnflag = 'R'; not returned item refers to l_returnflag = 'A' OR l_returnflag = 'N'; difference = subtract(count(l_linenumber where l_returnflag = 'A' OR l_returnflag = 'N'), count(l_linenumber where l_returnflag = 'R')) where l_extendedprice < 16947.7",
    "idx": 3415
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`part`)-[t2:`supplied_by`]->()\nWHERE t1.`p_partkey` = t2.`ps_partkey`\nAND (t1.`p_type` = 'large plated tin')\nRETURN t2.`ps_supplycost` AS `ps_supplycost`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the supply cost of large plated tin?",
    "evidence": "supply cost refers to ps_supplycost; large plated tin refers to p_type = 'large plated tin'",
    "idx": 3416
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)\nWHERE t1.`s_nationkey` = t2.`n_nationkey`\nAND (t1.`s_suppkey` = 1)\nRETURN t2.`n_name` AS `n_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the nationality of supplier number 1?",
    "evidence": "nationality refers to n_name; supplier number 1 refers to s_suppkey = 1",
    "idx": 3419
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`nation`)-[in_region_0:`in_region`]->(t1@`region`)\nWHERE t1.`r_regionkey` = t2.`n_regionkey`\nAND (t1.`r_name` = 'Africa')\nRETURN t2.`n_name` AS `n_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the countries that belong to Africa?",
    "evidence": "country is nation name which refers to n_name; Africa is region name refers to r_name = 'Africa'",
    "idx": 3420
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t1.`c_mktsegment` = 'FURNITURE' AND t2.`n_name` = 'IRAQ')\nRETURN COUNT(t1.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers from the furniture segments come from Iraq?",
    "evidence": "furniture segment refers to c_mktsegment = 'FURNITURE'; Iraq refers to n_name = 'Iraq'",
    "idx": 3421
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)\nWHERE t1.`o_custkey` = t2.`c_custkey`\nAND (t1.`o_totalprice` = 191918.92 AND t1.`o_custkey` = 93697)\nRETURN t2.`c_name` AS `c_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the customer number 93697 with the total order price of 191918.92?",
    "evidence": "customer name refers to c_name; number 93697 refers to o_custkey = 93697; total order price of 191918.92 refers to o_totalprice = 191918.92",
    "idx": 3422
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`customer`)-[located_in_1_0:`located_in_1`]->(t1@`nation`)-[in_region_0:`in_region`]->(t3@`region`)\nWHERE t1.`n_nationkey` = t2.`c_nationkey`\nAND t1.`n_regionkey` = t3.`r_regionkey`\nAND (t2.`c_name` = 'Customer#000000008')\nRETURN t1.`n_name` AS `n_name`, t3.`r_name` AS `r_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which nation and region does the Customer#000000008 come from?",
    "evidence": "nation refers to n_name; region refers to r_name; Customer#000000008 refers to c_name = 'Customer#000000008'",
    "idx": 3423
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)\nWHERE t1.`s_nationkey` = t2.`n_nationkey`\nAND (t1.`s_acctbal` < 0 AND t2.`n_name` = 'JAPAN')\nRETURN COUNT(t1.`s_suppkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Japanese suppliers have their accounts in debt?",
    "evidence": "Japanese refers to n_name = 'Japan'; have accounts in debt refers to s_acctbal < 0",
    "idx": 3424
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL {\nMATCH (customer_sub0@`customer`)\nRETURN min(customer_sub0.`c_acctbal`) AS `_col_0` \n}\nMATCH (customer@`customer`)\nWHERE customer.`c_acctbal` = _col_0\nRETURN customer.`c_name` AS `c_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which customer is the most in debt?",
    "evidence": "customer refers to c_name; the most in debt refers to max(c_acctbal)",
    "idx": 3425
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_shipinstruct` = 'DELIVER IN PERSON'\nRETURN COUNT(lineitem.`l_linenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the items are instructed to be delivered in person?",
    "evidence": "instructed to be delivered in person refers to l_shipinstruct = 'DELIVER IN PERSON'",
    "idx": 3427
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (supplier@`supplier`)\nRETURN MAX(supplier.`s_acctbal`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the largest supplier's account balance?",
    "evidence": "the largest supplier's account balance refers to max(s_acctbal)",
    "idx": 3428
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH ()-[partsupp:`supplied_by`]->()\nWHERE partsupp.`ps_availqty` < 10\nRETURN COUNT(partsupp.`ps_suppkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many part supplies are close to being out of stock?",
    "evidence": "close to being out of stock refers to ps_availqty < 10",
    "idx": 3429
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND (t1.`o_orderdate` = date('1994-12-31'))\nRETURN DISTINCT t2.`l_shipmode` AS `l_shipmode`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the shipping methods for the orders on 12/31/1994?",
    "evidence": "shipping method refers to l_shipmode; order on 12/31/1994 refers to o_orderdate = '1994-12-31'",
    "idx": 3434
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND (t2.`l_shipmode` = 'MAIL')\nRETURN t1.`o_clerk` AS `o_clerk`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the clerks of orders with line items shipped by mail?",
    "evidence": "clerk refers to o_clerk; shipped by mail refers to l_shipmode = 'MAIL'",
    "idx": 3437
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)\nWHERE t1.`s_nationkey` = t2.`n_nationkey`\nORDER BY t1.`s_acctbal`  NULLS FIRST \nRETURN t2.`n_name` AS `n_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the top 5 nations of suppliers with the lowest account balance?",
    "evidence": "nation refers to n_name; the lowest account balance refers to min(s_acctbal)",
    "idx": 3438
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)-[in_region_0:`in_region`]->(t1@`region`)\nWHERE t1.`r_regionkey` = t2.`n_regionkey`\nAND t2.`n_nationkey` = t3.`s_nationkey`\nRETURN cast (sum(CASE WHEN t1.`r_name` = 'ASIA' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`r_regionkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What proportion of suppliers are from Asia?",
    "evidence": "Asia refers to r_name = 'ASIA'; proportion = divide(count(s_name where r_name = 'ASIA'), count(s_name)) * 100%",
    "idx": 3440
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_discount` = 0\nRETURN COUNT(lineitem.`l_orderkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many order keys are not applied for the discount?",
    "evidence": "order key refers to l_orderkey; not applied for the discount refers to l_discount = 0",
    "idx": 3442
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (lineitem@`lineitem`)\nWHERE lineitem.`l_shipmode` = 'AIR'\nORDER BY lineitem.`l_quantity` DESC NULLS LAST \nRETURN lineitem.`l_linenumber` AS `l_linenumber` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which line item with the highest quantity is shipped by air?",
    "evidence": "line item refers to l_linenumber; the highest quantity refers to max(l_quantity); shipped by air refers to l_shipmode = 'AIR'",
    "idx": 3443
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND (t1.`c_mktsegment` = 'HOUSEHOLD' AND t2.`n_name` = 'GERMANY')\nRETURN COUNT(t1.`c_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers belong to the household segment in Germany?",
    "evidence": "household segment refers to c_mktsegment = 'household'; Germany refers to n_name = 'Germany'",
    "idx": 3445
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)\nWHERE t1.`s_nationkey` = t2.`n_nationkey`\nAND (t1.`s_acctbal` < 0 AND t2.`n_name` = 'ARGENTINA')\nRETURN t1.`s_name` AS `s_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the providers in Argentina, which supplier has an account that is in debt?",
    "evidence": "Argentina refers to n_name = 'ARGENTINA'; supplier refers to s_name; an account in debt refers to s_acctbal < 0",
    "idx": 3453
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`nation`)-[in_region_0:`in_region`]->(t1@`region`)\nWHERE t1.`r_regionkey` = t2.`n_regionkey`\nAND (t2.`n_name` = 'ALGERIA')\nRETURN COUNT(t1.`r_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many countries belong to the Algeria region?",
    "evidence": "the algeria region refers to r_name = 'ALGERIA'",
    "idx": 3454
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (part@`part`)\nWHERE part.`p_retailprice` > 1900\nRETURN COUNT(part.`p_partkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many parts have a retail price of over 1900?",
    "evidence": "a retail price of over 1900 refers to p_retailprice > 1900",
    "idx": 3459
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (part@`part`)\nWHERE part.`p_type` = 'PROMO BRUSHED STEEL' AND part.`p_mfgr` = 'Manufacturer#5'\nRETURN COUNT(part.`p_partkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the products under the type \"promo brushed steel\", how many of them are manufactured by Manufacturer#5?",
    "evidence": "type \"promo brushed steel\" refers to p_type = 'PROMO BRUSHED STEEL'; Manufacturer#5 refers to p_mfgr = 'Manufacturer#5'",
    "idx": 3460
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL {\nMATCH (part_sub0@`part`)\nRETURN MAX(part_sub0.`p_retailprice`) AS `_col_0` \n}\nMATCH (part@`part`)\nWHERE part.`p_retailprice` = _col_0\nRETURN part.`p_name` AS `p_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the product with the highest retail price?",
    "evidence": "name of the product refers to p_name; the highest retail price refers to p_retailprice",
    "idx": 3462
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (part@`part`)\nWHERE part.`p_container` = 'JUMBO CASE'\nRETURN COUNT(part.`p_partkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many parts have a jumbo case container?",
    "evidence": "jumbo case container refers to p_container = 'JUMBO CASE'",
    "idx": 3463
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (part@`part`)\nWHERE part.`p_container` = 'JUMBO CASE'\nRETURN min(part.`p_size`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the size of the smallest part in a jumbo case container?",
    "evidence": "size refers to p_size; the smallest part refers to min(p_size); jumbo case container refers to p_container = 'JUMBO CASE'",
    "idx": 3464
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (supplier@`supplier`)\nWHERE supplier.`s_acctbal` < 0\nRETURN COUNT(supplier.`s_suppkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many suppliers have their accounts in debt?",
    "evidence": "account in debt refers to s_acctbal < 0",
    "idx": 3465
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH ()-[t1:`supplied_by`]->(t2@`supplier`)\nMATCH ()-[t1:`supplies`]->(t3@`part`)\nWHERE t1.`ps_suppkey` = t2.`s_suppkey`\nAND t1.`ps_partkey` = t3.`p_partkey`\nAND (t3.`p_name` = 'hot spring dodger dim light')\nORDER BY t1.`ps_supplycost`  NULLS FIRST \nRETURN t2.`s_name` AS `s_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the supplier that provides the part \"hot spring dodger dim light\" with the lowest supply cost?",
    "evidence": "supplier name refers to s_name; part \"hot spring dodger dim light\" refers to p_name = 'hot spring dodger dim light'; the lowest supply cost refers to min(ps_supplycost)",
    "idx": 3470
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`part`)-[t2:`supplied_by`]->(t3@`supplier`)\nWHERE t1.`p_partkey` = t2.`ps_partkey`\nAND t2.`ps_suppkey` = t3.`s_suppkey`\nAND (t3.`s_acctbal` < 0 AND t1.`p_type` = 'PROMO BRUSHED STEEL')\nRETURN COUNT(t3.`s_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the suppliers providing parts under the type \"promo brushed steel\", how many of them are in debt?",
    "evidence": "type \"promo brushed steel\" refers to p_type = 'PROMO BRUSHED STEEL'; in debt refers to s_acctbal < 0",
    "idx": 3475
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)\nMATCH (t1@`part`)\nWHERE t1.`p_partkey` = t2.`l_partkey`\nAND (t1.`p_name` = 'hot spring dodger dim light')\nRETURN COUNT(t1.`p_partkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "The part \"hot spring dodger dim light\" is ordered in how many orders?",
    "evidence": "part \"hot spring dodger dim light\" refers to p_name = 'hot spring dodger dim light'",
    "idx": 3477
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)\nMATCH (t1@`part`)\nWHERE t1.`p_partkey` = t2.`l_partkey`\nAND (t1.`p_name` = 'hot spring dodger dim light')\nRETURN sum(t1.`p_partkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total quantity of the part \"hot spring dodger dim light\" ordered in all orders?",
    "evidence": "total quantity refers to sum(l_quantity); part \"hot spring dodger dim light\" refers to p_name = 'hot spring dodger dim light'",
    "idx": 3478
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`supplier`)-[located_in_2_0:`located_in_2`]->(t1@`nation`)-[in_region_0:`in_region`]->(t2@`region`)\nWHERE t1.`n_regionkey` = t2.`r_regionkey`\nAND t1.`n_nationkey` = t3.`s_nationkey`\nAND (t2.`r_name` = 'EUROPE' AND t3.`s_acctbal` < 0)\nRETURN COUNT(t1.`n_nationkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the suppliers in debt, how many of them are in Europe?",
    "evidence": "in debt refers to s_acctbal < 0; Europe refers to r_name = 'EUROPE'",
    "idx": 3479
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)-[in_region_0:`in_region`]->(t1@`region`)\nWHERE t1.`r_regionkey` = t2.`n_regionkey`\nAND t2.`n_nationkey` = t3.`s_nationkey`\nAND (t1.`r_name` = 'EUROPE')\nRETURN COUNT(t1.`r_regionkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the suppliers providing the part \"hot spring dodger dim light\", how many of them are in Europe?",
    "evidence": "part \"hot spring dodger dim light\" refers to p_name = hot spring dodger dim light; Europe refers to r_name = 'EUROPE'",
    "idx": 3480
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`supplier`)\nMATCH (t1@`lineitem`)\nWHERE t1.`l_suppkey` = t2.`s_suppkey`\nAND (t1.`l_orderkey` = 4 AND t2.`s_acctbal` < 0)\nRETURN COUNT(t1.`l_linenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the suppliers for the parts ordered in order no.4, how many of them are in debt?",
    "evidence": "order no.4 refers to l_orderkey = 4; in debt refers to s_acctbal < 0",
    "idx": 3482
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`supplier`)\nMATCH (t1@`lineitem`)\nWHERE t1.`l_suppkey` = t2.`s_suppkey`\nAND (t1.`l_returnflag` = 'R' AND t2.`s_acctbal` < 0)\nRETURN COUNT(t1.`l_partkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the parts that are returned, how many of them are provided by a supplier in debt?",
    "evidence": "returned refers to l_returnflag = 'R'; in debt refers to s_acctbal < 0",
    "idx": 3483
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`part`)\nMATCH (t1@`lineitem`)\nWHERE t1.`l_partkey` = t2.`p_partkey`\nAND (t1.`l_orderkey` = 1 AND t2.`p_name` = 'burnished seashell gainsboro navajo chocolate')\nRETURN t1.`l_shipdate` AS `l_shipdate`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On which date was the part \"burnished seashell gainsboro navajo chocolate\" in order no.1 shipped?",
    "evidence": "date refers to l_shipdate; part \"burnished seashell gainsboro navajo chocolate\" refers to p_name = 'burnished seashell gainsboro navajo chocolate'; order no.1 refers to l_orderkey = 1",
    "idx": 3484
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`part`)\nMATCH (t1@`lineitem`)\nWHERE t1.`l_partkey` = t2.`p_partkey`\nAND (t1.`l_orderkey` = 1 AND t2.`p_name` = 'burnished seashell gainsboro navajo chocolate')\nRETURN t1.`l_quantity` AS `l_quantity`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the quantity of the part \"burnished seashell gainsboro navajo chocolate\" ordered in order no.1?",
    "evidence": "quantity refers to l_quantity; part \"burnished seashell gainsboro navajo chocolate\" refers to p_name = 'burnished seashell gainsboro navajo chocolate'; order no.1 refers to l_orderkey = 1",
    "idx": 3485
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH ()-[t1:`supplied_by`]->(t2@`supplier`)\nMATCH ()-[t1:`supplies`]->(t3@`part`)\nWHERE t1.`ps_suppkey` = t2.`s_suppkey`\nAND t1.`ps_partkey` = t3.`p_partkey`\nAND (t3.`p_name` = 'hot spring dodger dim light')\nRETURN cast ((MAX(t1.`ps_supplycost`) - min(t1.`ps_supplycost`)) as float) * 100 / min(t1.`ps_supplycost`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much higher in percentage is the highest supply cost of the part \"hot spring dodger dim light\" than the lowest supply cost?",
    "evidence": "part \"hot spring dodger dim light\" refers to p_name = 'hot spring dodger dim light'; percentage = divide(subtract(max(ps_supplycost), min(ps_supplycost)), min(ps_supplycost)) * 100%",
    "idx": 3489
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`lineitem`)\nMATCH ()-[t2:`supplied_by`]->()\nWHERE t1.`l_suppkey` = t2.`ps_suppkey`\nAND (t1.`l_orderkey` = 1 AND t1.`l_partkey` = 98768)\nRETURN t1.`l_extendedprice` * (1 - t1.`l_discount`) - t2.`ps_supplycost` * t1.`l_quantity` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the profit for part no.98768 in order no.1?",
    "evidence": "part no.98768 refers to l_partkey = 98768; order no.1 refers to l_orderkey = 1; profit = subtract(multiply(l_extendedprice, subtract(1, l_discount)), multiply(ps_supplycost, l_quantity))",
    "idx": 3490
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL {\nMATCH (customer_sub0@`customer`)\nRETURN min(customer_sub0.`c_acctbal`) AS `_col_0` \n}\nMATCH (customer@`customer`)\nWHERE customer.`c_acctbal` = _col_0\nRETURN customer.`c_mktsegment` AS `c_mktsegment`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which market segment does the customer with the highest amount of debt belongs to?",
    "evidence": "market segment refers to c_mktsegment; the highest amount of debt refers to max(c_acctbal)",
    "idx": 3492
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`c_mktsegment` = 'FURNITURE'\nRETURN COUNT(customer.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are in the furniture segment?",
    "evidence": "furniture segment refers to c_mktsegment = 'FURNITURE'",
    "idx": 3493
  }
]