[
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`inspections`)-[conducted_at_0:`conducted_at`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`type` = 'Routine - Unscheduled' AND t2.`name` = 'Tiramisu Kitchen')\nRETURN COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many routine inspections did Tiramisu Kitchen have?",
    "evidence": "Tiramisu Kitchen is the name of the business; routine inspections refer to type = 'Routine - Unscheduled';",
    "idx": 4261
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`inspections`)-[conducted_at_0:`conducted_at`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`name` = 'Tiramisu Kitchen' AND t1.`type` = 'Routine - Unscheduled' AND t1.`score` > 70)\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the routine inspections of Tiramisu Kitchen, how many of them have a score of over 70?",
    "evidence": "Tiramisu Kitchen is the name of the business; routine inspections refer to type = 'Routine - Unscheduled'; score of over 70 refers to score > 70;",
    "idx": 4262
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)-[committed_by_0:`committed_by`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`risk_category` = 'Low Risk')\nRETURN CASE  WHEN sum(CASE  WHEN t2.`name` = 'OMNI S.F. Hotel - 2nd Floor Pantry' THEN 1 ELSE 0 END) > sum(CASE  WHEN t2.`name` = 'Tiramisu Kitchen' THEN 1 ELSE 0 END) THEN 'OMNI S.F. Hotel - 2nd Floor Pantry' ELSE 'Tiramisu Kitchen' END AS `result`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which restaurant had more low risk violation in inspections, Tiramisu Kitchen or OMNI S.F. Hotel - 2nd Floor Pantry?",
    "evidence": "Tiramisu Kitchen and OMNI S.F. Hotel - 2nd Floor Pantry are names of the business; more low risk violations refer to MAX(COUNT(risk_category = 'Low Risk'));",
    "idx": 4263
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)-[committed_by_0:`committed_by`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`city` IN ['San Francisco', 'SF', 'S.F.', 'SAN FRANCISCO'] AND t1.`risk_category` = 'High Risk')\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many high risk violations do the restaurants in San Francisco have in total?",
    "evidence": "restaurants in San Francisco refer to business_id where city in ('San Francisco', 'SF', 'S.F.', 'SAN FRANCISCO'); high risk violations refer to risk_category = 'High Risk';",
    "idx": 4264
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`inspections`)-[conducted_at_0:`conducted_at`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`name` = 'Tiramisu Kitchen')\nRETURN avg(t1.`score`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average scores of Tiramisu Kitchen in all inspections?",
    "evidence": "avg(score);",
    "idx": 4265
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`inspections`)-[conducted_at_0:`conducted_at`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nRETURN cast (sum(CASE  WHEN t2.`name` = 'Chairman Bao' THEN t1.`score` ELSE 0 END) as float) / COUNT(CASE  WHEN t1.`type` = 'Routine - Unscheduled' THEN t1.`score` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average score for \"Chairman Bao\" in all its unscheduled routine inspections?",
    "evidence": "DIVIDE(SUM(score where type = 'Routine - Unscheduled' and name = 'Chairman Bao'), COUNT(type = 'Routine - Unscheduled' where name = 'Chairman Bao'));",
    "idx": 4271
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t2@`violations`)-[committed_by_0:`committed_by`]->(t1@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`name` = 'Melody Lounge')\nRETURN cast (sum(CASE  WHEN t2.`risk_category` = 'Moderate Risk' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of the violations for \"Melody Lounge\" are moderate risks?",
    "evidence": "DIVIDE(COUNT(risk_category = 'Moderate Risk' where name = 'Melody Lounge'), COUNT(business_id where name = 'Melody Lounge')) as percentage;",
    "idx": 4272
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (businesses@`businesses`)\nWHERE businesses.`city` = 'HAYWARD'\nRETURN COUNT(businesses.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many eateries are located in Hayward?",
    "evidence": "eateries in Hayward refer city = 'HAYWARD';",
    "idx": 4273
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (inspections@`inspections`)\nWHERE inspections.`score` < 50\nRETURN COUNT(DISTINCT inspections.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many establishments have an inspection score of no more than 50?",
    "evidence": "establishments have the same meaning as businesses; inspection score of no more than 50 refers to score < 50;",
    "idx": 4274
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "CALL {\nMATCH (inspections_sub0@`inspections`)\nRETURN min(inspections_sub0.`score`) AS `_col_0` \n}\nMATCH (t1@`inspections`)-[conducted_at_0:`conducted_at`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`score` = _col_0)\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the establishment with the lowest inspection score of all time?",
    "evidence": "the lowest inspection score refers to MIN(score);",
    "idx": 4275
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)-[committed_by_0:`committed_by`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`name` = 'Tiramisu Kitchen' AND t1.`risk_category` = 'High Risk')\nRETURN COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many high risks violations did the Tiramisu Kitchen violate?",
    "evidence": "Tiramisu Kitchen is the name of the business; high risks violations refer to risk_category = 'High Risk';",
    "idx": 4276
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (violations@`violations`)\nWHERE violations.`risk_category` = 'Low Risk' AND violations.`description` = 'Unpermitted food facility'\nRETURN COUNT(DISTINCT violations.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many eateries had low risk for violation with unpermitted food facility description?",
    "evidence": "eateries represent business; low risk for violation refers to risk_category = 'Low Risk';",
    "idx": 4278
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`inspections`)-[conducted_at_0:`conducted_at`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`city` = 'SAN BRUNO')\nORDER BY t1.`score` DESC NULLS LAST \nRETURN t1.`date` AS `date` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did eateries from San Bruno city get highest score in inspection?",
    "evidence": "eateries represent business; highest score in inspection refers to score = 100;",
    "idx": 4280
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`inspections`)-[conducted_at_0:`conducted_at`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`name` = 'El Aji Peruvian Restaurant')\nORDER BY t1.`score` DESC NULLS LAST \nRETURN t1.`type` AS `type_` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the inspection type when El Aji Peruvian Restaurant got highest inspection score?",
    "evidence": "El Aji Peruvian Restaurant is the name of the business; highest inspection score refers to MAX(score);",
    "idx": 4288
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)-[committed_by_0:`committed_by`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`risk_category` = 'High Risk' AND t1.`description` = 'Improper cooking time or temperatures')\nRETURN t2.`owner_name` AS `owner_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who were the owners of eateries which had highest health hazard by improper cooking time or temperatures?",
    "evidence": "owners of eateries refer to owner_name; highest health hazard by improper cooking time or temperatures refers to risk_category = 'High Risk' and description = 'Improper cooking time or temperatures';",
    "idx": 4289
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (businesses@`businesses`)\nWHERE businesses.`address` = '1825 POST St #223' AND businesses.`city` = 'SAN FRANCISCO'\nRETURN COUNT(businesses.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the businesses are located at 1825 POST St #223, San Francisco?",
    "evidence": "1825 POST St #223 refers to address = '1825 POST St #223', San Francisco is the name of the city;",
    "idx": 4292
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (businesses@`businesses`)\nWHERE businesses.`tax_code` = 'H25'\nRETURN COUNT(businesses.`tax_code`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of businesses with a tax code H25?",
    "evidence": "",
    "idx": 4294
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)-[committed_by_0:`committed_by`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`postal_code` = '94117' AND t1.`risk_category` = 'High Risk')\nRETURN COUNT(DISTINCT t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the businesses within the postal code 94117, what is total number of businesses with a high risk category?",
    "evidence": "businesses with a high risk category refer to business_id where risk_category = 'High Risk';",
    "idx": 4297
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)\nMATCH (t2@`inspections`)-[conducted_at_0:`conducted_at`]->(t3@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND t2.`business_id` = t3.`business_id`\nAND (t1.`date` = date('2016-05-27') AND t1.`violation_type_id` = '103157' AND t2.`type` = 'Routine - Unscheduled')\nRETURN DISTINCT t3.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In businesses that violates 103157 on May 27, 2016 , what is the name of the business that has an unscheduled inspection?",
    "evidence": "businesses that violates 103157 refer to business_id where violation_type_id = 103157; date = '2016-05-27'; unscheduled inspection refers to type = 'Routine - Unscheduled';",
    "idx": 4300
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)-[committed_by_0:`committed_by`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`risk_category` = 'High Risk' AND t1.`violation_type_id` = '103109' AND t1.`description` = 'Unclean or unsanitary food contact surfaces')\nRETURN DISTINCT t2.`owner_name` AS `owner_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the owner of the business that has a high risk violation of 103109 and described as unclean or unsanitary food contact surfaces?",
    "evidence": "owner refers to owner_name; high risk violation of 103109 and described as unclean or unsanitary food contact surfaces refers to risk_category = 'High Risk' where violation_type_id = 103109 and description = 'Unclean or unsanitary food contact surfaces';",
    "idx": 4301
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`inspections`)-[conducted_at_0:`conducted_at`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`owner_city` = 'Cameron Park' AND t1.`score` = 100)\nRETURN DISTINCT t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the owners from Cameron Park, what is the business name of the business with a score of 100?",
    "evidence": "Cameron Park is a name of city;",
    "idx": 4302
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)-[committed_by_0:`committed_by`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`violation_type_id` = '103156' AND t1.`date` = date('2014-06-12'))\nRETURN DISTINCT t2.`owner_name` AS `owner_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the owner's name of the of the business that violates 103156 on June 12, 2014?",
    "evidence": "business that violates 103156 on June 12, 2014 refers to business_id where violation_type_id = 103156 and date = '2014-06-12';",
    "idx": 4304
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)\nMATCH (t2@`inspections`)-[conducted_at_0:`conducted_at`]->(t3@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND t2.`business_id` = t3.`business_id`\nAND (t2.`score` < 95 AND t3.`postal_code` = '94110')\nRETURN cast (sum(CASE  WHEN t1.`risk_category` = 'Low Risk' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`risk_category`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In businesses with a score lower than 95 and located around the postal code of 94110, what is the percentage of businesses with a risk category of low risk?",
    "evidence": "DIVIDE(COUNT(business_id where risk_category = 'Low Risk', score < 95 and postal_code = 94110), COUNT(business_id where score < 95 and postal_code = 94110)) as percentage;",
    "idx": 4306
  },
  {
    "filename": "train.json",
    "db_id": "craftbeer",
    "gql_statement": "MATCH (t2@`breweries`)\nMATCH (t1@`beers`)\nWHERE t1.`brewery_id` = t2.`id`\nAND (t2.`name` = 'Boston Beer Company' AND t1.`ounces` = 12)\nRETURN avg(t1.`abv`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average alcohol content per 12-ounce beer bottle produced by Boston Beer Company?",
    "evidence": "",
    "idx": 4308
  },
  {
    "filename": "train.json",
    "db_id": "craftbeer",
    "gql_statement": "MATCH (t2@`breweries`)\nMATCH (t1@`beers`)\nWHERE t1.`brewery_id` = t2.`id`\nAND (t2.`name` = 'Stevens Point Brewery')\nRETURN cast (sum(CASE WHEN t1.`style` = 'American Adjunct Lager' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`brewery_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of all the beer styles produced by Stevens Point Brewery, how many percent do they allot for American Adjunct Lager?",
    "evidence": "Percent allotted = count(American Adjunct Lager beer styles) / count(styles) * 100%",
    "idx": 4309
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nORDER BY t2.`total_fat` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the recipe that is most likely to gain weight?",
    "evidence": "most likely to gain weight refers to MAX(total_fat)",
    "idx": 4311
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t1.`prep_min` > 10)\nORDER BY t2.`calories` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the recipes that take more than 10 minutes to prepare, what is the title of the one with the most calories?",
    "evidence": "more than 10 minutes to prepare refers to prep_min > 10; the most calories refers to MAX(calories)",
    "idx": 4316
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t1.`title` = 'Turkey Tenderloin Bundles')\nRETURN t2.`calories` AS `calories`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many calories does the turkey tenderloin bundles recipe have?",
    "evidence": "turkey tenderloin refers to title",
    "idx": 4325
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`ingredient_id` = t2.`ingredient_id`\nAND (t1.`name` = '1% lowfat milk' AND t2.`unit` = 'cup(s)' AND t2.`recipe_id` = 1436)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cups of 1% lowfat milk should be added to no.1436 recipe?",
    "evidence": "1% lowfat milk is a name of an ingredient; no.1436 recipe refers to recipe_id = 1436; max_qty = min_qty",
    "idx": 4326
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`ingredient_id` = t2.`ingredient_id`\nAND (t1.`name` = 'seedless red grapes')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times do seedless red grapes appear in the recipes?",
    "evidence": "seedless red grapes is a name of an ingredient",
    "idx": 4328
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nMATCH (t3@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND t3.`ingredient_id` = t2.`ingredient_id`\nAND (t1.`title` = 'Raspberry-Pear Couscous Cake' AND t3.`name` = 'apple juice')\nRETURN t2.`preparation` AS `preparation`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What kind of preparation is needed for apple juice to make a raspberry-pear couscous cake?",
    "evidence": "apple juice is a name of an ingredient; raspberry-pear couscous cake refers to title",
    "idx": 4331
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nMATCH (t3@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND t3.`ingredient_id` = t2.`ingredient_id`\nAND (t1.`title` = 'Chicken Pocket Sandwich' AND t3.`name` = 'almonds' AND t2.`unit` = 'cup(s)')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cups of almonds do you need for a chicken pocket sandwich?",
    "evidence": "cups is a unit; almonds is a name of an ingredient; chicken pocket sandwich refers to title",
    "idx": 4332
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t1.`title` = 'Sherried Beef')\nRETURN t2.`vitamin_a` AS `vitamin_a`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much Vitamin A is in Sherry beef?",
    "evidence": "Sherry beef refers to title = 'Sherried Beef'",
    "idx": 4334
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nRETURN cast (sum(CASE  WHEN t1.`title` = 'Lasagne-Spinach Spirals' THEN t2.`sodium` ELSE 0 END) as float) * 100 / sum(CASE  WHEN t1.`title` = 'Beef and Spinach Pita Pockets' THEN t2.`sodium` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times is the sodium content in Lasagne-Spinach Spirals to Beef and Spinach Pita Pockets?",
    "evidence": "sodium is a name of an ingredient; calculation = DIVIDE(SUM(title = 'Lasagne-Spinach Spirals' THEN sodium), SUM(title = 'Beef and Spinach Pita Pockets' THEN sodium))",
    "idx": 4335
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t3@`nutrition`)\nMATCH ()-[t2:`uses`]->(t1@`ingredient`)\nWHERE t2.`ingredient_id` = t1.`ingredient_id`\nAND t3.`recipe_id` = t2.`recipe_id`\nAND (t1.`name` = 'coarsely ground black pepper')\nRETURN avg(t3.`calories`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average calorie count for all recipes using coarsely ground black pepper?",
    "evidence": "coarsely ground black pepper is a name of an ingredient; calculation = AVG(calories)",
    "idx": 4336
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t2.`iron` > 20)\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the recipes that will cause stomach pain?",
    "evidence": "cause stomach pain refers to iron > 20",
    "idx": 4337
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t1.`title` = 'Apricot Yogurt Parfaits')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many ingredients are there in Apricot Yogurt Parfaits?",
    "evidence": "Apricot Yogurt Parfaits refers to title",
    "idx": 4338
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`ingredient_id` = t2.`ingredient_id`\nAND (t2.`preparation` = 'cooked in beef broth')\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the ingredients that need to be cook in beef broth?",
    "evidence": "'cook in beef broth' refers to a preparation",
    "idx": 4339
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`nutrition`)\nMATCH ()-[t2:`uses`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t1.`vitamin_a` > 0)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many ingredients are there in the recipe that is best in helping your body's natural defence against illness and infection?",
    "evidence": "best in helping your body's natural defence against illness and infection refers to MAX(vitamin_a);",
    "idx": 4340
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nORDER BY t2.`vitamin_c` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 5",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the top 5 recipes that are best for wound healing?",
    "evidence": "names of the recipes refers to title; best for wound healing refers to MAX(vitamin_c)",
    "idx": 4341
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nMATCH (t3@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND t3.`ingredient_id` = t2.`ingredient_id`\nAND (t3.`category` = 'baking products' AND t1.`title` = 'No-Bake Chocolate Cheesecake')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many baking product ingredients are there in the No-Bake Chocolate Cheesecake?",
    "evidence": "baking product is a category; No-Bake Chocolate Cheesecake refers to title;",
    "idx": 4342
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nMATCH (t3@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND t3.`ingredient_id` = t2.`ingredient_id`\nAND (t1.`title` = 'Warm Chinese Chicken Salad' AND t2.`optional` = 'TRUE')\nRETURN t3.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the optional ingredients for Warm Chinese Chicken Salad?",
    "evidence": "optional refers to optional = 'TRUE'; Warm Chinese Chicken Salad refers to title",
    "idx": 4344
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t2.`alcohol` > 10)\nORDER BY t1.`prep_min` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the recipes with alcohol content over 10, which recipe takes the longest to prepare?",
    "evidence": "with alcohol content over 10 refers to alcohol > 10; takes the longest to prepare refers to MAX(prep_min)",
    "idx": 4345
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nORDER BY t2.`total_fat` - t2.`sat_fat` DESC NULLS LAST \nRETURN COUNT(t1.`title`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many servings does the recipe with the highest unsaturated fat have?",
    "evidence": "with the highest unsaturated fat refers MAX(SUBTRACT(total_fat, sat_fat))",
    "idx": 4346
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t1.`source` = 'National Potato Board')\nORDER BY t2.`calories` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the recipes whose source is the National Potato Board, which recipe has the highest calories?",
    "evidence": "the National Potato Board is a source; the highest calories refers to MAX(calories)",
    "idx": 4347
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nMATCH (t3@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND t3.`ingredient_id` = t2.`ingredient_id`\nAND (t3.`name` = 'almond extract')\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which recipes contain almond extract?",
    "evidence": "almond extract is a name of an ingredient",
    "idx": 4349
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t1.`title` = 'Idaho Potato Supreme')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many ingredients are needed to prepare Idaho Potato Supreme?",
    "evidence": "Idaho Potato Supreme refers to title",
    "idx": 4351
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`ingredient_id` = t2.`ingredient_id`\nAND (t1.`category` = 'canned dairy')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many recipes can be made with canned dairy?",
    "evidence": "canned dairy is a category",
    "idx": 4358
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nMATCH (t3@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND t3.`ingredient_id` = t2.`ingredient_id`\nAND (t3.`name` = 'sea bass steak')\nRETURN cast (sum(CASE  WHEN t1.`servings` >= 10 THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the recipes with sea bass, how many percent of recipes can serve 10 people and above?",
    "evidence": "sea bass is a name of an ingredient; can serve 10 people and above refers to servings > = 10; calculation = MULTIPLY(DIVIDE(COUNT(servings > = 10 THEN recipe_id)), COUNT(recipe_id), 100)",
    "idx": 4360
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t1.`title` = 'Raspberry Chiffon Pie')\nRETURN t2.`total_fat` AS `total_fat`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much fat does the Raspberry Chiffon Pie have?",
    "evidence": "Raspberry Chiffon Pie refers to title",
    "idx": 4361
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND (t1.`title` = 'Raspberry Chiffon Pie')\nRETURN t2.`pcnt_cal_prot` AS `pcnt_cal_prot`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage calories protein of Raspberry Chiffon Pie?",
    "evidence": "Raspberry Chiffon Pie refers title; percentage calories protein refers to pcnt_cal_prot",
    "idx": 4362
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nMATCH (t3@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND t3.`ingredient_id` = t2.`ingredient_id`\nAND (t1.`title` = 'Raspberry Chiffon Pie')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many ingredients are required to make the Raspberry Chiffon Pie?",
    "evidence": "Raspberry Chiffon Pie refer to title",
    "idx": 4363
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t2@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t1@`nutrition`)\nWHERE t2.`recipe_id` = t1.`recipe_id`\nAND (like(t2.`title`,'%cake%'))\nRETURN avg(t1.`vitamin_c`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average vitamin C amount of all cakes?",
    "evidence": "average vitamin C refers to AVG(vitamin_c); all cakes refers to title LIKE '%cake%'",
    "idx": 4365
  }
]