[
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`sex` = 'F' AND `student`.`city_code` = 'BAL'\nRETURN `student`.`lname` AS `lname`   \nUNION DISTINCT\nMATCH (`student`:`student`)\nWHERE `student`.`sex` = 'M' AND `student`.`age` < 20\nRETURN `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last name of students who is either female (sex is F) and living in the city of code BAL or male (sex is M) and in age of below 20.",
    "evidence": "",
    "idx": 5906
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nORDER BY `dorm`.`student_capacity` IS NULL ASC, `dorm`.`student_capacity` DESC \nRETURN `dorm`.`dorm_name` AS `dorm_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the dorm with the largest capacity.",
    "evidence": "",
    "idx": 5908
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm_amenity`:`dorm_amenity`)\nRETURN `dorm_amenity`.`amenity_name` AS `amenity_name` ORDER BY `amenity_name` IS NULL DESC, `amenity_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List in alphabetic order all different amenities.",
    "evidence": "",
    "idx": 5910
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "CALL(*) {\nMATCH (`student_sub0`:`student`)\nRETURN avg(`student_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`student`:`student`)\nWHERE `student`.`age` < `_col_0`\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first and last name of students whose age is younger than the average age.",
    "evidence": "",
    "idx": 5912
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`city_code` <> 'HKG'\nORDER BY `student`.`age` IS NULL DESC, `student`.`age`  \nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the first and last name of students who are not living in the city with code HKG, and sorted the results by their ages.",
    "evidence": "",
    "idx": 5914
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t3`:`dorm`)-[t2:has_amenity]->(`t1`:`dorm_amenity`)\nWHERE `t2`.`amenid` = `t1`.`amenid`\nAND `t2`.`dormid` = `t3`.`dormid`\nAND (`t3`.`dorm_name` = 'Anonymous Donor Hall')\nRETURN `t1`.`amenity_name` AS `amenity_name` ORDER BY `t1`.`amenity_name` IS NULL DESC, `t1`.`amenity_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List name of all amenities which Anonymous Donor Hall has, and sort the results in alphabetic order.",
    "evidence": "",
    "idx": 5916
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nWITH `dorm`.`gender` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, sum(`dorm`.`student_capacity`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of dorms and total capacity for each gender.",
    "evidence": "",
    "idx": 5918
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nWITH `dorm`.`gender` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, sum(`dorm`.`student_capacity`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many dorms are there and what is the total capacity for each gender?",
    "evidence": "",
    "idx": 5919
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`sex` AS _groupby_col_0, avg(`student`.`age`) AS _groupby_col_1, MAX(`student`.`age`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `sex`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average and oldest age for students with different sex.",
    "evidence": "",
    "idx": 5920
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`sex` AS _groupby_col_0, avg(`student`.`age`) AS _groupby_col_1, MAX(`student`.`age`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `sex`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average and oldest age for each gender of student?",
    "evidence": "",
    "idx": 5921
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`major` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `major`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students in each major.",
    "evidence": "",
    "idx": 5922
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`city_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, avg(`student`.`age`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `city_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number and average age of students living in each city.",
    "evidence": "",
    "idx": 5924
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`sex` = 'M'\nWITH `student`.`city_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, avg(`student`.`age`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `city_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age and number of male students (with sex M) from each city.",
    "evidence": "",
    "idx": 5926
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`city_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `city_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students for the cities where have more than one student.",
    "evidence": "",
    "idx": 5928
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "CALL(*) {\nMATCH (`student_sub0`:`student`)\nWITH `student_sub0`.`major` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `major`  LIMIT 1\n}\nMATCH (`student`:`student`)\nWHERE `student`.`major` <> `major`\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first and last name of students who are not in the largest major.",
    "evidence": "",
    "idx": 5930
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "CALL(*) {\nMATCH (`student_sub0`:`student`)\nWITH `student_sub0`.`major` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `major`  LIMIT 1\n}\nMATCH (`student`:`student`)\nWHERE `student`.`major` <> `major`\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first and last name of the students who are not in the largest major?",
    "evidence": "",
    "idx": 5931
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "CALL(*) {\nMATCH (`student_sub0`:`student`)\nRETURN avg(`student_sub0`.`age`) AS `_col_0_1`  \n}\nMATCH (`student`:`student`)\nWHERE `student`.`age` > `_col_0_1`\nWITH `student`.`sex` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `sex`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students whose age is older than the average age for each gender.",
    "evidence": "",
    "idx": 5932
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:lives_in]->(`t3`:`dorm`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND `t3`.`dormid` = `t2`.`dormid`\nWITH `t3`.`dorm_name` AS _groupby_col_0, avg(`t1`.`age`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dorm_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age of students living in each dorm and the name of dorm.",
    "evidence": "",
    "idx": 5934
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:lives_in]->(`t3`:`dorm`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND `t3`.`dormid` = `t2`.`dormid`\nWITH `t3`.`dorm_name` AS _groupby_col_0, avg(`t1`.`age`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dorm_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average age for each dorm and what are the names of each dorm?",
    "evidence": "",
    "idx": 5935
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t1`:`dorm`)-[t2:has_amenity]->()\nWHERE `t1`.`dormid` = `t2`.`dormid`\nAND (`t1`.`student_capacity` > 100)\nWITH `t1`.`dormid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dormid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of amenities for each of the dorms that can accommodate more than 100 students.",
    "evidence": "",
    "idx": 5936
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:lives_in]->(`t3`:`dorm`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND `t3`.`dormid` = `t2`.`dormid`\nAND (`t1`.`age` > 20)\nWITH `t3`.`dorm_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dorm_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students who is older than 20 in each dorm.",
    "evidence": "",
    "idx": 5938
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:lives_in]->(`t3`:`dorm`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND `t3`.`dormid` = `t2`.`dormid`\nAND (`t3`.`dorm_name` = 'Smith Hall')\nRETURN `t1`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name of students who are living in the Smith Hall.",
    "evidence": "",
    "idx": 5940
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "CALL(*) {\nMATCH (`dorm_sub0`:`dorm`)\nRETURN MAX(`dorm_sub0`.`student_capacity`) AS `_col_0_1`  \n}\nMATCH (`t1`:`student`)-[t2:lives_in]->(`t3`:`dorm`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND `t3`.`dormid` = `t2`.`dormid`\nAND (`t3`.`student_capacity` = `_col_0_1`)\nRETURN avg(`t1`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age of students who are living in the dorm with the largest capacity.",
    "evidence": "",
    "idx": 5942
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "CALL(*) {\nMATCH (`dorm_sub0`:`dorm`)\nRETURN MAX(`dorm_sub0`.`student_capacity`) AS `_col_0_1`  \n}\nMATCH (`t1`:`student`)-[t2:lives_in]->(`t3`:`dorm`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND `t3`.`dormid` = `t2`.`dormid`\nAND (`t3`.`student_capacity` = `_col_0_1`)\nRETURN avg(`t1`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average age of students who are living in the dorm with the largest capacity?",
    "evidence": "",
    "idx": 5943
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:lives_in]->(`t3`:`dorm`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND `t3`.`dormid` = `t2`.`dormid`\nAND (`t3`.`gender` = 'M')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of students living in the male dorm (with gender M).",
    "evidence": "",
    "idx": 5944
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:lives_in]->(`t3`:`dorm`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND `t3`.`dormid` = `t2`.`dormid`\nAND (`t3`.`dorm_name` = 'Smith Hall' AND `t1`.`sex` = 'F')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of female students (with F sex) living in Smith Hall",
    "evidence": "",
    "idx": 5946
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t1`:`dorm`)-[t2:has_amenity]->(`t3`:`dorm_amenity`)\nWHERE `t1`.`dormid` = `t2`.`dormid`\nAND `t2`.`amenid` = `t3`.`amenid`\nAND (`t1`.`dorm_name` = 'Smith Hall')\nRETURN `t3`.`amenity_name` AS `amenity_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of amenities Smith Hall dorm have.",
    "evidence": "",
    "idx": 5948
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t1`:`dorm`)-[t2:has_amenity]->(`t3`:`dorm_amenity`)\nWHERE `t1`.`dormid` = `t2`.`dormid`\nAND `t2`.`amenid` = `t3`.`amenid`\nAND (`t1`.`dorm_name` = 'Smith Hall')\nRETURN `t3`.`amenity_name` AS `amenity_name` ORDER BY `t3`.`amenity_name` IS NULL DESC, `t3`.`amenity_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of amenities Smith Hall dorm have. ordered the results by amenity names.",
    "evidence": "",
    "idx": 5950
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t3_sub0:has_amenity]->(`t4_sub0`:`dorm_amenity`)\nWHERE `t3_sub0`.`amenid` = `t4_sub0`.`amenid`\nAND (`t4_sub0`.`amenity_name` = 'TV Lounge')\nRETURN `t3_sub0`.`dormid` AS `dormid`   } AS in_collect_0\nMATCH (`t1`:`student`)-[t2:lives_in]->()\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t2`.`dormid` IN in_collect_0)\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first and last name of students who are living in the dorms that have amenity TV Lounge.",
    "evidence": "",
    "idx": 5952
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t3_sub0:has_amenity]->(`t4_sub0`:`dorm_amenity`)\nWHERE `t3_sub0`.`amenid` = `t4_sub0`.`amenid`\nAND (`t4_sub0`.`amenity_name` = 'TV Lounge')\nRETURN `t3_sub0`.`dormid` AS `dormid`   } AS in_collect_0\nMATCH (`t1`:`student`)-[t2:lives_in]->()\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t2`.`dormid` IN in_collect_0)\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first and last names of all students who are living in a dorm with a TV Lounge?",
    "evidence": "",
    "idx": 5953
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t3_sub0:has_amenity]->(`t4_sub0`:`dorm_amenity`)\nWHERE `t3_sub0`.`amenid` = `t4_sub0`.`amenid`\nAND (`t4_sub0`.`amenity_name` = 'TV Lounge')\nRETURN `t3_sub0`.`dormid` AS `dormid`   } AS in_collect_0\nMATCH (`t1`:`student`)-[t2:lives_in]->()\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (NOT `t2`.`dormid` IN in_collect_0)\nRETURN `t1`.`fname` AS `fname`, `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name and age of students who are living in the dorms that do not have amenity TV Lounge.",
    "evidence": "",
    "idx": 5954
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t3_sub0:has_amenity]->(`t4_sub0`:`dorm_amenity`)\nWHERE `t3_sub0`.`amenid` = `t4_sub0`.`amenid`\nAND (`t4_sub0`.`amenity_name` = 'TV Lounge')\nRETURN `t3_sub0`.`dormid` AS `dormid`   } AS in_collect_0\nMATCH (`t1`:`student`)-[t2:lives_in]->()\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (NOT `t2`.`dormid` IN in_collect_0)\nRETURN `t1`.`fname` AS `fname`, `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name and age of every student who lives in a dorm with a TV Lounge?",
    "evidence": "",
    "idx": 5955
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t5`:`student`)-[t4:lives_in]->(`t1`:`dorm`)-[t2:has_amenity]->(`t3`:`dorm_amenity`)\nWHERE `t1`.`dormid` = `t2`.`dormid`\nAND `t2`.`amenid` = `t3`.`amenid`\nAND `t4`.`dormid` = `t1`.`dormid`\nAND `t5`.`stuid` = `t4`.`stuid`\nAND (`t5`.`lname` = 'Smith')\nRETURN `t3`.`amenity_name` AS `amenity_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of amenities of the dorm where the student with last name Smith is living in.",
    "evidence": "",
    "idx": 5956
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`t5`:`student`)-[t4:lives_in]->(`t1`:`dorm`)-[t2:has_amenity]->(`t3`:`dorm_amenity`)\nWHERE `t1`.`dormid` = `t2`.`dormid`\nAND `t2`.`amenid` = `t3`.`amenid`\nAND `t4`.`dormid` = `t1`.`dormid`\nAND `t5`.`stuid` = `t4`.`stuid`\nAND (`t5`.`lname` = 'Smith')\nRETURN `t3`.`amenity_name` AS `amenity_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the amenities in the dorm that a student who has the last name of Smith lives in?",
    "evidence": "",
    "idx": 5957
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customers.",
    "evidence": "",
    "idx": 5959
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`email_address` AS `email_address`, `customers`.`phone_number` AS `phone_number` ORDER BY `email_address` IS NULL DESC, `email_address` , `phone_number` IS NULL DESC, `phone_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the emails and phone numbers of all the customers, ordered by email address and phone number.",
    "evidence": "",
    "idx": 5960
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`t2`:`complaints`)-[about_0:about]->(`t1`:`products`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nWITH `t1`.`product_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `product_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of all products along with the number of complaints that they have received.",
    "evidence": "",
    "idx": 5962
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`t2`:`complaints`)-[made_by_0:made_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nORDER BY `t2`.`date_complaint_raised` IS NULL ASC, `t2`.`date_complaint_raised` DESC \nRETURN `t1`.`phone_number` AS `phone_number`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the phone number of the customer who filed the complaint that was raised most recently.",
    "evidence": "",
    "idx": 5965
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "WITH *, COLLECT { MATCH (`complaints_sub0`:`complaints`)\nRETURN `complaints_sub0`.`customer_id` AS `customer_id`   } AS in_collect_0\nMATCH (`customers`:`customers`)\nWHERE NOT `customers`.`customer_id` IN in_collect_0\nRETURN `customers`.`email_address` AS `email_address`, `customers`.`phone_number` AS `phone_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the email and phone number of the customers who have never filed a complaint before.",
    "evidence": "",
    "idx": 5966
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`phone_number` AS `phone_number`   \nUNION DISTINCT\nMATCH (`staff`:`staff`)\nRETURN `staff`.`phone_number` AS `phone_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the phone number of all the customers and staff.",
    "evidence": "",
    "idx": 5968
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_name` = 'Chocolate'\nRETURN `products`.`product_description` AS `product_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the description of the product named \"Chocolate\"?",
    "evidence": "",
    "idx": 5970
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_name` = 'Chocolate'\nRETURN `products`.`product_description` AS `product_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the description of the product called \"Chocolate\".",
    "evidence": "",
    "idx": 5971
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`products`:`products`)\nORDER BY `products`.`product_price` IS NULL ASC, `products`.`product_price` DESC \nRETURN `products`.`product_name` AS `product_name`, `products`.`product_category_code` AS `product_category_code`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and category of the most expensive product.",
    "evidence": "",
    "idx": 5972
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "WITH *, COLLECT { MATCH (`complaints_sub0`:`complaints`)\nRETURN `complaints_sub0`.`product_id` AS `product_id`   } AS in_collect_0\nMATCH (`products`:`products`)\nWHERE NOT `products`.`product_id` IN in_collect_0\nRETURN `products`.`product_price` AS `product_price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the prices of products which has never received a single complaint.",
    "evidence": "",
    "idx": 5974
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "WITH *, COLLECT { MATCH (`complaints_sub0`:`complaints`)\nRETURN `complaints_sub0`.`product_id` AS `product_id`   } AS in_collect_0\nMATCH (`products`:`products`)\nWHERE NOT `products`.`product_id` IN in_collect_0\nRETURN `products`.`product_price` AS `product_price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the prices of products that have never gotten a complaint?",
    "evidence": "",
    "idx": 5975
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`products`:`products`)\nWITH `products`.`product_category_code` AS _groupby_col_0, avg(`products`.`product_price`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `product_category_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the average price of products that have each category code.",
    "evidence": "",
    "idx": 5977
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`t2`:`complaints`)-[handled_by_0:handled_by]->(`t1`:`staff`)\nMATCH (`t2`:`complaints`)-[about_0:about]->(`t3`:`products`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND `t2`.`product_id` = `t3`.`product_id`\nORDER BY `t3`.`product_price` IS NULL DESC, `t3`.`product_price`  \nRETURN `t1`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last name of the staff member who processed the complaint of the cheapest product.",
    "evidence": "",
    "idx": 5978
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`t2`:`complaints`)-[handled_by_0:handled_by]->(`t1`:`staff`)\nMATCH (`t2`:`complaints`)-[about_0:about]->(`t3`:`products`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND `t2`.`product_id` = `t3`.`product_id`\nORDER BY `t3`.`product_price` IS NULL DESC, `t3`.`product_price`  \nRETURN `t1`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the last name of the staff member in charge of the complaint on the product with the lowest price?",
    "evidence": "",
    "idx": 5979
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`staff`:`staff`)\nWHERE `staff`.`email_address` =~ '(?i)(?s).*wrau.*'\nRETURN `staff`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last name of the staff whose email address contains \"wrau\".",
    "evidence": "",
    "idx": 5982
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`staff`:`staff`)\nWHERE `staff`.`email_address` =~ '(?i)(?s).*wrau.*'\nRETURN `staff`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the last names of staff with email addressed containing the substring \"wrau\"?",
    "evidence": "",
    "idx": 5983
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`customers`:`customers`)\nWITH `customers`.`customer_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers are there in the customer type with the most customers?",
    "evidence": "",
    "idx": 5984
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`t2`:`complaints`)-[handled_by_0:handled_by]->(`t1`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nORDER BY `t2`.`date_complaint_raised` IS NULL DESC, `t2`.`date_complaint_raised`  \nRETURN `t1`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the last name of the staff member who handled the complaint with the earliest date raised.",
    "evidence": "",
    "idx": 5987
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`complaints`:`complaints`)\nRETURN COUNT(DISTINCT `complaints`.`complaint_type_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different complaint type codes.",
    "evidence": "",
    "idx": 5989
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`email_address` = 'vbogisich@example.org'\nRETURN `customers`.`address_line_1` AS `address_line_1`, `customers`.`address_line_2` AS `address_line_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the address line 1 and 2 of the customer with email \"vbogisich@example.org\".",
    "evidence": "",
    "idx": 5990
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_complaints",
    "gql_statement": "MATCH (`complaints`:`complaints`)\nWHERE `complaints`.`complaint_type_code` = 'Product Failure'\nWITH `complaints`.`complaint_status_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `complaint_status_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of complaints with Product Failure type for each complaint status.",
    "evidence": "",
    "idx": 5992
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of submissions.",
    "evidence": "",
    "idx": 5995
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nORDER BY `submission`.`scores` IS NULL DESC, `submission`.`scores`  \nRETURN `submission`.`author` AS `author`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the authors of submissions in ascending order of scores.",
    "evidence": "",
    "idx": 5996
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nORDER BY `submission`.`scores` IS NULL DESC, `submission`.`scores`  \nRETURN `submission`.`author` AS `author`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the author for each submission and list them in ascending order of submission score.",
    "evidence": "",
    "idx": 5997
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nRETURN `submission`.`author` AS `author`, `submission`.`college` AS `college`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each submission, show the author and their affiliated college.",
    "evidence": "",
    "idx": 5999
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nWHERE `submission`.`college` = 'Florida' OR `submission`.`college` = 'Temple'\nRETURN `submission`.`author` AS `author`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of authors from college \"Florida\" or \"Temple\"",
    "evidence": "",
    "idx": 6000
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nWHERE `submission`.`college` = 'Florida' OR `submission`.`college` = 'Temple'\nRETURN `submission`.`author` AS `author`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which authors with submissions are from college \"Florida\" or \"Temple\"?",
    "evidence": "",
    "idx": 6001
  }
]