[
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business_attributes`)\nMATCH (t2@`business`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`attribute_value` = 'beer_and_wine')\nRETURN DISTINCT t2.`state` AS `state`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the states of businesses with attribute of beer and wine located?",
    "evidence": "with attribute of beer and wine refers to attribute_value = 'beer_and_wine';",
    "idx": 2186
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`compliments`)\nMATCH (t2@`users_compliments`)\nWHERE t1.`compliment_id` = t2.`compliment_id`\nAND (t1.`compliment_type` = 'photos' AND t2.`number_of_compliments` = 'Medium')\nRETURN COUNT(t2.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many user's compliment in photo has medium in number?",
    "evidence": "user's compliment in photo refers to compliment_type = 'photo'; photo has medium in number refers to number_of_compliments = 'Medium'",
    "idx": 2187
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`attributes`)\nMATCH (t2@`business_attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (t2.`attribute_value` = 'true')\nRETURN cast (sum(CASE  WHEN t1.`attribute_name` = 'Good for Kids' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of businesses with \"Good for Kids\" attribute over the other attributes?",
    "evidence": "\"Good for Kids\" attribute refers to attribute_name = 'Good for Kids' AND attribute_value = 'true'; Calculation = DIVIDE(SUM(attribute_name = 'Good for Kids' AND attribute_value = 'true')), SUM(business_id) * 100",
    "idx": 2189
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE business.`city` = 'Mesa' AND business.`active` = 'true'\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses are not closed in the city of Mesa?",
    "evidence": "businesses are not closed refers to active = 'true'",
    "idx": 2190
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE business.`stars` IN [1, 2]\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In how many businesses have customers had a bad or terrible experience?",
    "evidence": "stars = 2 means bad experience; stars = 1 means terrible experience; customers had a bad or terrible experience refers to stars = 2 OR stars = 1",
    "idx": 2191
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business_attributes@`business_attributes`)\nWHERE business_attributes.`attribute_value` > '1'\nRETURN COUNT(business_attributes.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses have more than 1 attribute?",
    "evidence": "businesses have more than 1 attribute refers to COUNT(attribute_value) > 1",
    "idx": 2193
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business_hours@`business_hours`)\nWHERE business_hours.`opening_time` = '8AM' AND business_hours.`closing_time` = '6PM'\nRETURN COUNT(business_hours.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses are opened the same number of hours every day of the week?",
    "evidence": "how much time does this business open refers to SUBTRACT(closing_time, opening_time); every day of the week refers to day_id BETWEEN 1 AND 7",
    "idx": 2194
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`reviews`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`review_votes_funny` = 'Uber' AND t1.`active` = 'true')\nRETURN COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many reviews of businesses that are still open received an uber rating on the funny vote?",
    "evidence": "businesses that still open refers to active = 'true'; business received an uber rating on the funny vote refers to review_votes_funny = 'Uber'",
    "idx": 2195
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`users`)\nMATCH (t1@`users_compliments`)\nWHERE t1.`user_id` = t2.`user_id`\nAND (t1.`number_of_compliments` = 'High' AND t2.`user_fans` = 'None')\nRETURN COUNT(t2.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the users who use a high number of compliments do not have any fans?",
    "evidence": "do not have fans refers to user_fans = 'None'; high number of compliment refers to number_of_compliments = 'High'",
    "idx": 2196
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`business`)\nMATCH (t1@`reviews`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`review_length` = 'Long' AND t2.`active` = 'true' AND t2.`city` = 'Phoenix')\nRETURN COUNT(DISTINCT t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many open businesses in the City of Phoenix have users left a long review?",
    "evidence": "open businesses refers to active = 'true'; long review refers to review_length = 'Long'",
    "idx": 2198
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`reviews`)\nWHERE t1.`user_id` = t2.`user_id`\nAND (t1.`user_votes_cool` = 'Low' AND t2.`review_votes_cool` = 'Low')\nRETURN COUNT(DISTINCT t1.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users who have received a low cool vote have also received at least 1 low cool vote for some of their reviews?",
    "evidence": "low cool vote for user refers to user_votes_cool = 'Low';  low cool vote for review refers to review_votes_cool = 'Low'",
    "idx": 2199
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`tips`)\nWHERE t1.`user_id` = t2.`user_id`\nAND (t2.`tip_length` = 'Long' AND t2.`likes` = 2 AND t1.`user_fans` = 'High')\nRETURN COUNT(DISTINCT t1.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users with a long tip and 2 likes for their tip have a high number of fans?",
    "evidence": "long tip refers to tip_length = 'Long'; 2 likes refers to likes = 2; high number of fans refers to user_fans = 'High'",
    "idx": 2200
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`attributes`)\nMATCH (t2@`business_attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (t1.`attribute_name` = 'ambience_trendy' AND t2.`attribute_value` IN ['none', 'no', 'false'])\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In how many businesses with the ambience_trendy attribute?",
    "evidence": "ambience_trendy attribute refers to attribute_name = 'ambience_trendy' AND attribute_value = 'false'",
    "idx": 2201
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE business.`city` = 'Surprise'\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the businesses are in Surprise?",
    "evidence": "Surprise is a city",
    "idx": 2202
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE business.`review_count` = 'Medium' AND business.`state` = 'AZ' AND business.`active` = 'true'\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of active businesses in AZ with a medium review count?",
    "evidence": "active businesses refers to active = 'true'; AZ is a state; medium review count refers to review_count = 'Medium'",
    "idx": 2204
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (users@`users`)\nWHERE users.`user_yelping_since_year` >= 2009 AND users.`user_yelping_since_year` < 2012 AND users.`user_fans` = 'Low'\nRETURN COUNT(users.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In users yelping since 2009 to 2011, how many of them have low count of fans?",
    "evidence": "users in yelping since 2009 to 2011 refers to user_yelping_since_year BETWEEN 2009 AND 2011; low count of fans refers to user_fans = 'Low'",
    "idx": 2206
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`user_id` = 11021 AND reviews.`business_id` = 3\nRETURN reviews.`review_length` AS `review_length`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the review length of user 11021 to business with business ID 3?",
    "evidence": "review length refers to review_length; user 11021 refers to user_id = 11021; business ID 3 refers to business_id = 3",
    "idx": 2207
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`business_hours`)\nMATCH (t1@`business`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`city` = 'Glendale')\nORDER BY t1.`stars` DESC NULLS LAST \nRETURN t2.`opening_time` AS `opening_time`, t2.`closing_time` AS `closing_time` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the closing and opening time of businesses located at Glendale with highest star rating?",
    "evidence": "Glendale is a city; the highest star rating refers to MAX(stars)",
    "idx": 2208
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (paper@`paper`)\nRETURN cast (COUNT(CASE  WHEN paper.`class_label` = 'Agents' THEN paper.`paper_id` ELSE NULL END) as float) * 100 / COUNT(paper.`paper_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the citation, what is the percentage of paper ID under the Agents classification?",
    "evidence": "classification refers to class_label; class_label = 'Agents'; percentage = (divide(count(paper_id where class_label = 'Agents')), (count(paper_id)))*100;",
    "idx": 2209
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (t1@`paper`)-[has_content_0:`has_content`]->(t2@`content`)\nWHERE t1.`paper_id` = t2.`paper_id`\nAND (t1.`class_label` = 'AI')\nRETURN COUNT(DISTINCT t2.`word_cited_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of word cited under that class labelled 'AI'?",
    "evidence": "",
    "idx": 2210
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (t1@`paper`)-[has_content_0:`has_content`]->(t2@`content`)\nWHERE t1.`paper_id` = t2.`paper_id`\nAND (t1.`paper_id` = 'chakrabarti01integrating')\nRETURN DISTINCT t1.`class_label` AS `class_label`, COUNT(t2.`word_cited_id`) AS `_col_1` \nGROUP BY class_label",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the class label of paper ID 'chakrabarti01integrating'. How many words were cited by this paper ID?",
    "evidence": "",
    "idx": 2215
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (paper@`paper`)\nRETURN cast (COUNT(CASE  WHEN paper.`class_label` = 'ML' THEN paper.`paper_id` ELSE NULL END) as float) / COUNT(paper.`paper_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On average, how many papers are under the ML class?",
    "evidence": "class refers to class_label; average = divide(count(paper_id where class_label = 'M')), (count(paper_id)));",
    "idx": 2217
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (t1@`cites`)\nMATCH (t2@`content`)\nWHERE t1.`cited_paper_id` = t2.`paper_id`\nAND (t1.`citing_paper_id` = 'sima01computational')\nRETURN DISTINCT t2.`word_cited_id` AS `word_cited_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Find the words cited in papers that are cited by sima01computational?",
    "evidence": "paper cited by refers to citing_paper_id; citing_paper_id = 'sima01computational';",
    "idx": 2218
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (t1@`cites`)\nMATCH (t2@`content`)\nWHERE t1.`cited_paper_id` = t2.`paper_id`\nAND (t1.`citing_paper_id` = 'schmidt99advanced' AND t2.`word_cited_id` = 'word3555')\nRETURN COUNT(t2.`paper_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many papers were cited by schmidt99advanced cited word3555?",
    "evidence": "paper cited by refers to citing_paper_id; citing_paper_id = 'schmidt99advanced';",
    "idx": 2219
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (t1@`paper`)-[has_content_0:`has_content`]->(t2@`content`)\nWHERE t1.`paper_id` = t2.`paper_id`\nAND (t2.`word_cited_id` = 'word1163')\nRETURN DISTINCT t1.`class_label` AS `class_label`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Under what classification do the papers that cited word1163 belong?",
    "evidence": "",
    "idx": 2220
  },
  {
    "filename": "train.json",
    "db_id": "citeseer",
    "gql_statement": "MATCH (t1@`paper`)\nMATCH (t2@`cites`)\nWHERE t1.`paper_id` = t2.`citing_paper_id`\nAND (t1.`class_label` = 'ML' AND t2.`cited_paper_id` = 'butz01algorithmic')\nRETURN COUNT(t1.`paper_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the papers classified as ML, how many cited butz01algorithmic?",
    "evidence": "classification refers to class_label; paper cited by refers to citing_paper_id; citing_paper_id = 'butz01algorithmic';",
    "idx": 2221
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` = 0\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students have never been absent from school?",
    "evidence": "have never been absent refers to `month` = 0;",
    "idx": 2222
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nRETURN MAX(longest_absense_from_school.`month`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the students who have been absent from school for the longest time, how many months have they been absent?",
    "evidence": "absent from school for the longest time refers to MAX(month)",
    "idx": 2223
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'navy'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students belong to the navy department?",
    "evidence": "belong to the navy department refers to organ = 'navy';",
    "idx": 2224
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`male`)\nMATCH (t1@`longest_absense_from_school`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`month` >= 5)\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students that have been absent from school for more than 5 months, how many of them are male?",
    "evidence": "absent from school for more than 5 months refers to `month`  > = 5;",
    "idx": 2225
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`filed_for_bankrupcy`)\nMATCH (t2@`longest_absense_from_school`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`month` > 5)\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students that have filed for bankruptcy, how many of them have been absent from school for over 5 months?",
    "evidence": "absent from school for over 5 months refers to `month` > 5;",
    "idx": 2227
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enlist`)\nMATCH (t2@`no_payment_due`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`organ` = 'navy' AND t2.`bool` = 'pos')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students from the navy department, how many of them have payment due?",
    "evidence": "from the navy department refers to organ = 'navy'; have payment due refers to bool = 'pos';",
    "idx": 2228
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (male_sub0@`male`)\nRETURN collect(male_sub0.`name`) AS `name` \n} \nMATCH (disabled@`disabled`)\nWHERE NOT disabled.`name` IN in_collect_0\nRETURN COUNT(disabled.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female students are disabled?",
    "evidence": "females students are disabled refers to name that appeared in both disabled and male tables",
    "idx": 2229
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`no_payment_due`)\nMATCH (t1@`unemployed`)\nWHERE t1.`name` = t2.`name`\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are unemployed and have payment due?",
    "evidence": "are unemployed and have payment due refers to",
    "idx": 2230
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`longest_absense_from_school`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`organ` = 'navy')\nORDER BY t1.`month` DESC NULLS LAST \nRETURN t1.`month` AS `month` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the longest time for a student from the navy department to be absent from school?",
    "evidence": "navy department refers to organ = 'navy'; longest time to be absent from school refers to MAX(month)",
    "idx": 2231
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`longest_absense_from_school`)\nMATCH (t2@`disabled`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`month` = 0)\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many disabled students have never been absent from school?",
    "evidence": "never been absent from school refers to month = 0",
    "idx": 2232
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`disabled`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nRETURN t2.`organ` AS `organ`, COUNT(t1.`name`) AS `_col_1` \nGROUP BY organ\nORDER BY _col_1 DESC NULLS LAST \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which department has the most disabled students?",
    "evidence": "department refers to organ; most disabled students refers to MAX(disabled.name)",
    "idx": 2234
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enlist`)\nOPTIONAL MATCH (t2@`male`)\nWHERE t1.`organ` = 'navy'\nAND t1.`name` = t2.`name`\nRETURN cast (COUNT(t2.`name`) as float) * 100 / COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of male students in the navy department?",
    "evidence": "in the navy department refers to organ = 'navy'; percentage refers to DIVIDE(COUNT(name where organ = 'navy'), COUNT(name))",
    "idx": 2236
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`longest_absense_from_school`)\nMATCH (t2@`disabled`)\nWHERE t1.`name` = t2.`name`\nRETURN avg(t1.`month`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average time for a disabled student to be absent from school?",
    "evidence": "average time refers to DIVIDE(SUM(`month`), COUNT(name))",
    "idx": 2237
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (no_payment_due@`no_payment_due`)\nWHERE no_payment_due.`name` = 'student348'\nRETURN no_payment_due.`bool` AS `bool`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Does student348 have a due payment?",
    "evidence": "payment due refers to bool = 'pos' means the student has payment due , bool = 'neg' means the student does not have payment due;",
    "idx": 2239
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enrolled@`enrolled`)\nWHERE enrolled.`name` = 'student829'\nRETURN enrolled.`school` AS `school`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which school is student829 enrolled in?",
    "evidence": "",
    "idx": 2240
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`name` = 'student217'\nRETURN longest_absense_from_school.`month` AS `month`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many months has student217 been absent?",
    "evidence": "",
    "idx": 2241
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`name` = 'student285'\nRETURN enlist.`organ` AS `organ`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which organization did student285 enlist?",
    "evidence": "",
    "idx": 2243
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enrolled`)\nMATCH (t2@`disabled`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`name` = 'student281')\nRETURN t2.`name` AS `name`, t1.`school` AS `school`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Is student281 disabled and which school is the student enrolled in?",
    "evidence": "",
    "idx": 2244
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enlist`)\nMATCH (t2@`filed_for_bankrupcy`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`organ` = 'foreign_legion')\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which students that filed for bankruptcy are also in the foreign legion?",
    "evidence": "in the foreign legion refers to organ = 'foreign_legion';",
    "idx": 2249
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`male`)\nMATCH (t1@`no_payment_due`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`bool` = 'neg')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many male students have no due payments?",
    "evidence": "have no due payments refers to bool = 'neg';",
    "idx": 2250
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`longest_absense_from_school`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`organ` = 'marines' AND t1.`month` = 6)\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which students that are in the marines have been absent for 6 months?",
    "evidence": "in the marines refers to organ = 'marines'; absent for 6 months refers to month = 6",
    "idx": 2251
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`unemployed`)\nMATCH (t1@`enrolled`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`school` = 'smc')\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students from SMC are unemployed?",
    "evidence": "from SMC refers to school = 'smc';",
    "idx": 2252
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`unemployed`)\nMATCH (t1@`longest_absense_from_school`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`month` = 6)\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many unemployed students are there that have been absent for 6 months?",
    "evidence": "absent for 6 months refers to month = 6;",
    "idx": 2253
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enlist`)\nMATCH (t2@`longest_absense_from_school`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`name` = 'student21')\nRETURN t2.`month` AS `month`, t1.`organ` AS `organ`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Student21 is enlisted in which organization and has the student been absent?",
    "evidence": "organization refers to organ",
    "idx": 2255
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`no_payment_due`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`organ` = 'foreign_legion')\nRETURN cast (sum(CASE WHEN t1.`bool` = 'pos' THEN 1 ELSE 0 END) as float) * 100 / sum(CASE WHEN t1.`bool` = 'neg' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage ratio of students who are enlisted in foreign legions that have a due payment?",
    "evidence": "have a due payment refers to bool = 'pos'; in foreign legions refers to organ = 'foreign_legion'; ratio refers to DIVIDE(COUNT(bool = 'pos'), COUNT(bool = 'neg'))",
    "idx": 2256
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enrolled`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`organ` = 'navy')\nRETURN cast (sum(CASE WHEN t1.`school` = 'occ' THEN 1.0 ELSE 0 END) as float) * 100 / COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of students who enlisted in the navy make up the number of students enrolled in OCC?",
    "evidence": "in the navy refers to organ = 'navy'; enrolled in OCC refers to school = 'occ'",
    "idx": 2257
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (person@`person`)\nRETURN COUNT(person.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of students in the school?",
    "evidence": "",
    "idx": 2259
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL {\nMATCH (longest_absense_from_school_sub0@`longest_absense_from_school`)\nRETURN MAX(longest_absense_from_school_sub0.`month`) AS `_col_0` \n}\nMATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` = _col_0\nRETURN longest_absense_from_school.`name` AS `name`, longest_absense_from_school.`month` AS `month`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the longest students absence duration from school?",
    "evidence": "longest students absence duration MAX(month)",
    "idx": 2260
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` = 4\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students were absence for 4 month?",
    "evidence": "absence for 4 month refers to month = 4;",
    "idx": 2261
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`filed_for_bankrupcy`)\nMATCH (t1@`unemployed`)\nWHERE t1.`name` = t2.`name`\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of unemployed and bankrupt students?",
    "evidence": "",
    "idx": 2262
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (male_sub0@`male`)\nRETURN collect(male_sub0.`name`) AS `name` \n} \nMATCH (enlist@`enlist`)\nWHERE enlist.`organ` IN ['marines', 'air_force'] AND NOT enlist.`name` IN in_collect_0\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female students joined a marines and air force organization?",
    "evidence": "joined a marines refers to organ = 'marines'; air force organization refers to organ = 'air_force';",
    "idx": 2265
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enrolled`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`name` IN ['student27,student17,studetn101'])\nRETURN t1.`school` AS `school`, t2.`organ` AS `organ`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List out the organization joined and school enrolled by student27, student17 and student101?",
    "evidence": "organization joined refers to organ",
    "idx": 2266
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`disabled`)\nOPTIONAL MATCH (t2@`male`)\nWHERE t1.`name` = t2.`name`\nRETURN cast (sum(CASE WHEN t2.`name` IS NULL THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio of disable female to male students?",
    "evidence": "ratio refers to DIVIDE(COUNT(name not from male), COUNT(name from male))",
    "idx": 2267
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`filed_for_bankrupcy`)\nMATCH (t2@`no_payment_due`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`bool` = 'neg')\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List out all bankrupt students that are able to make payment before due?",
    "evidence": "make payment before due refers to bool = 'neg';",
    "idx": 2268
  }
]