[
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`track`:`track`)\nORDER BY `track`.`year_opened` IS NULL ASC, `track`.`year_opened` DESC \nRETURN `track`.`name` AS `name`, `track`.`location` AS `location`, `track`.`seating` AS `seating`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name, location, and seating of the track that was opened in the most recent year.",
    "evidence": "",
    "idx": 1978
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN min(`track`.`seating`) AS `_col_0`, MAX(`track`.`seating`) AS `_col_1`, avg(`track`.`seating`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the minimum, maximum, and average seating for all tracks.",
    "evidence": "",
    "idx": 1979
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN min(`track`.`seating`) AS `_col_0`, MAX(`track`.`seating`) AS `_col_1`, avg(`track`.`seating`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the minimum, maximum, and average seating across all tracks.",
    "evidence": "",
    "idx": 1980
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "CALL(*) {\nMATCH (`track_sub0`:`track`)\nRETURN avg(`track_sub0`.`seating`) AS `_col_0`  \n}\nMATCH (`track`:`track`)\nWHERE `track`.`seating` > `_col_0`\nRETURN `track`.`name` AS `name`, `track`.`location` AS `location`, `track`.`year_opened` AS `year_opened`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name, location, open year for all tracks with a seating higher than the average.",
    "evidence": "",
    "idx": 1981
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN DISTINCT `track`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the different locations of tracks.",
    "evidence": "",
    "idx": 1984
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`race`:`race`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of races.",
    "evidence": "",
    "idx": 1986
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`race`:`race`)\nRETURN DISTINCT `race`.`class` AS `class`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the different classes of races.",
    "evidence": "",
    "idx": 1988
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`race`:`race`)\nRETURN `race`.`name` AS `name`, `race`.`class` AS `class`, `race`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show name, class, and date for all races.",
    "evidence": "",
    "idx": 1989
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`race`:`race`)\nWITH `race`.`class` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `class`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the race class and number of races in each class.",
    "evidence": "",
    "idx": 1991
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`race`:`race`)\nWITH `race`.`class` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `class`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the race class with at least two races.",
    "evidence": "",
    "idx": 1993
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "WITH *, COLLECT { MATCH (`race_sub0`:`race`)\nRETURN `race_sub0`.`track_id` AS `track_id`   } AS in_collect_0\nMATCH (`track`:`track`)\nWHERE NOT `track`.`track_id` IN in_collect_0\nRETURN `track`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all track names that have had no races.",
    "evidence": "",
    "idx": 1995
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "WITH *, COLLECT { MATCH (`race_sub0`:`race`)\nRETURN `race_sub0`.`track_id` AS `track_id`   } AS in_collect_0\nMATCH (`track`:`track`)\nWHERE NOT `track`.`track_id` IN in_collect_0\nRETURN `track`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of tracks that have no had any races.",
    "evidence": "",
    "idx": 1996
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`track`:`track`)\nWHERE `track`.`seating` >= 4000 AND `track`.`seating` <= 5000\nRETURN `track`.`year_opened` AS `year_opened`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show year where a track with a seating at least 5000 opened and a track with seating no more than 4000 opened.",
    "evidence": "",
    "idx": 1997
  },
  {
    "filename": "train_spider.json",
    "db_id": "race_track",
    "gql_statement": "MATCH (`t1`:`race`)-[held_at_0:held_at]->(`t2`:`track`)\nWHERE `t1`.`track_id` = `t2`.`track_id`\nRETURN `t1`.`name` AS `name`, `t1`.`date` AS `date`, `t2`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and date for each race and its track name.",
    "evidence": "",
    "idx": 1999
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "MATCH (`member`:`member`)\nWITH `member`.`address` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of members living in each address.",
    "evidence": "",
    "idx": 2002
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "MATCH (`member`:`member`)\nWHERE `member`.`address` = 'Harford' OR `member`.`address` = 'Waterbury'\nRETURN `member`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the names of members whose address is in Harford or Waterbury.",
    "evidence": "",
    "idx": 2003
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "MATCH (`member`:`member`)\nWHERE `member`.`membership_card` = 'Black' OR `member`.`age` < 30\nRETURN `member`.`name` AS `name`, `member`.`member_id` AS `member_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the ids and names of members who are under age 30 or with black membership card.",
    "evidence": "",
    "idx": 2004
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "MATCH (`member`:`member`)\nRETURN `member`.`time_of_purchase` AS `time_of_purchase`, `member`.`age` AS `age`, `member`.`address` AS `address` ORDER BY `time_of_purchase` IS NULL DESC, `time_of_purchase`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the purchase time, age and address of each member, and show the results in the order of purchase time.",
    "evidence": "",
    "idx": 2005
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "MATCH (`shop`:`shop`)\nORDER BY `shop`.`open_year` IS NULL DESC, `shop`.`open_year`  \nRETURN `shop`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the shop addresses ordered by their opening year.",
    "evidence": "",
    "idx": 2008
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "MATCH (`shop`:`shop`)\nRETURN avg(toFloat(`shop`.`num_of_staff`)) AS `_col_0`, avg(`shop`.`score`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average score and average staff number of all shops?",
    "evidence": "",
    "idx": 2009
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "CALL(*) {\nMATCH (`shop_sub0`:`shop`)\nRETURN avg(`shop_sub0`.`score`) AS `_col_0`  \n}\nMATCH (`shop`:`shop`)\nWHERE `shop`.`score` < `_col_0`\nRETURN `shop`.`shop_id` AS `shop_id`, `shop`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id and address of the shops whose score is below the average score.",
    "evidence": "",
    "idx": 2010
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "WITH *, COLLECT { MATCH (`happy_hour_sub0`:`happy_hour`)\nRETURN `happy_hour_sub0`.`shop_id` AS `shop_id`   } AS in_collect_0\nMATCH (`shop`:`shop`)\nWHERE NOT `shop`.`shop_id` IN in_collect_0\nRETURN `shop`.`address` AS `address`, `shop`.`num_of_staff` AS `num_of_staff`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the address and staff number of the shops that do not have any happy hour.",
    "evidence": "",
    "idx": 2011
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "MATCH (`happy_hour`:`happy_hour`)\nWITH `happy_hour`.`shop_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `shop_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which shop has happy hour most frequently? List its id and number of happy hours.",
    "evidence": "",
    "idx": 2013
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`album`:`album`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many albums are there?",
    "evidence": "",
    "idx": 2015
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`album`:`album`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of albums.",
    "evidence": "",
    "idx": 2016
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`genre`:`genre`)\nRETURN `genre`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all music genres.",
    "evidence": "",
    "idx": 2017
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`genre`:`genre`)\nRETURN `genre`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of different music genres?",
    "evidence": "",
    "idx": 2018
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`state` = 'NY'\nRETURN `customer`.`customerid` AS `customerid`, `customer`.`firstname` AS `firstname`, `customer`.`lastname` AS `lastname`, `customer`.`company` AS `company`, `customer`.`address` AS `address`, `customer`.`city` AS `city`, `customer`.`state` AS `state`, `customer`.`country` AS `country`, `customer`.`postalcode` AS `postalcode`, `customer`.`phone` AS `phone`, `customer`.`fax` AS `fax`, `customer`.`email` AS `email`, `customer`.`supportrepid` AS `supportrepid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the customer information in state NY.",
    "evidence": "",
    "idx": 2019
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`state` = 'NY'\nRETURN `customer`.`customerid` AS `customerid`, `customer`.`firstname` AS `firstname`, `customer`.`lastname` AS `lastname`, `customer`.`company` AS `company`, `customer`.`address` AS `address`, `customer`.`city` AS `city`, `customer`.`state` AS `state`, `customer`.`country` AS `country`, `customer`.`postalcode` AS `postalcode`, `customer`.`phone` AS `phone`, `customer`.`fax` AS `fax`, `customer`.`email` AS `email`, `customer`.`supportrepid` AS `supportrepid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the customer information for customers in NY state?",
    "evidence": "",
    "idx": 2020
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`city` = 'Calgary'\nRETURN `employee`.`firstname` AS `firstname`, `employee`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names and last names of the employees who live in Calgary city.",
    "evidence": "",
    "idx": 2021
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`city` = 'Calgary'\nRETURN `employee`.`firstname` AS `firstname`, `employee`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the full names of employees living in the city of Calgary.",
    "evidence": "",
    "idx": 2022
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`invoice`:`invoice`)\nRETURN DISTINCT (`invoice`.`billingcountry`) AS `billingcountry`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct billing countries of the invoices?",
    "evidence": "",
    "idx": 2023
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`invoice`:`invoice`)\nRETURN DISTINCT (`invoice`.`billingcountry`) AS `billingcountry`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the different billing countries for all invoices.",
    "evidence": "",
    "idx": 2024
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`artist`:`artist`)\nWHERE `artist`.`name` =~ '(?i)(?s).*a.*'\nRETURN `artist`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all artists that have \"a\" in their names.",
    "evidence": "",
    "idx": 2025
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`artist`:`artist`)\nWHERE `artist`.`name` =~ '(?i)(?s).*a.*'\nRETURN `artist`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of artist who have the letter 'a' in their names?",
    "evidence": "",
    "idx": 2026
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t1`:`album`)-[by_artist_0:by_artist]->(`t2`:`artist`)\nWHERE `t1`.`artistid` = `t2`.`artistid`\nAND (`t2`.`name` = 'AC/DC')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the title of all the albums of the artist \"AC/DC\".",
    "evidence": "",
    "idx": 2027
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t1`:`album`)-[by_artist_0:by_artist]->(`t2`:`artist`)\nWHERE `t1`.`artistid` = `t2`.`artistid`\nAND (`t2`.`name` = 'AC/DC')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of albums by the artist \"AC/DC\"?",
    "evidence": "",
    "idx": 2028
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t1`:`album`)-[by_artist_0:by_artist]->(`t2`:`artist`)\nWHERE `t1`.`artistid` = `t2`.`artistid`\nAND (`t2`.`name` = 'Metallica')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Hom many albums does the artist \"Metallica\" have?",
    "evidence": "",
    "idx": 2029
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t1`:`album`)-[by_artist_0:by_artist]->(`t2`:`artist`)\nWHERE `t1`.`artistid` = `t2`.`artistid`\nAND (`t2`.`name` = 'Metallica')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of albums by the artist \"Metallica\".",
    "evidence": "",
    "idx": 2030
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t1`:`album`)-[by_artist_0:by_artist]->(`t2`:`artist`)\nWHERE `t1`.`artistid` = `t2`.`artistid`\nAND (`t1`.`title` = 'Balls to the Wall')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which artist does the album \"Balls to the Wall\" belong to?",
    "evidence": "",
    "idx": 2031
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t1`:`album`)-[by_artist_0:by_artist]->(`t2`:`artist`)\nWHERE `t1`.`artistid` = `t2`.`artistid`\nAND (`t1`.`title` = 'Balls to the Wall')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the artist who made the album \"Balls to the Wall\".",
    "evidence": "",
    "idx": 2032
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`track`:`track`)\nWHERE `track`.`name` =~ '(?i)(?s).*you.*'\nRETURN `track`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all the tracks that contain the word \"you\".",
    "evidence": "",
    "idx": 2033
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`track`:`track`)\nWHERE `track`.`name` =~ '(?i)(?s).*you.*'\nRETURN `track`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of tracks that contain the the word you in them?",
    "evidence": "",
    "idx": 2034
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN avg(`track`.`unitprice`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average unit price of all the tracks?",
    "evidence": "",
    "idx": 2035
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN avg(`track`.`unitprice`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average unit price for a track.",
    "evidence": "",
    "idx": 2036
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN MAX(`track`.`milliseconds`) AS `_col_0`, min(`track`.`milliseconds`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the durations of the longest and the shortest tracks in milliseconds?",
    "evidence": "",
    "idx": 2037
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN MAX(`track`.`milliseconds`) AS `_col_0`, min(`track`.`milliseconds`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the maximum and minimum durations of tracks in milliseconds.",
    "evidence": "",
    "idx": 2038
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_genre_0:has_genre]->(`t1`:`genre`)\nWHERE `t1`.`genreid` = `t2`.`genreid`\nAND (`t1`.`name` = 'Rock')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many tracks belong to rock genre?",
    "evidence": "",
    "idx": 2039
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_genre_0:has_genre]->(`t1`:`genre`)\nWHERE `t1`.`genreid` = `t2`.`genreid`\nAND (`t1`.`name` = 'Rock')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of tracks that are part of the rock genre.",
    "evidence": "",
    "idx": 2040
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_genre_0:has_genre]->(`t1`:`genre`)\nWHERE `t1`.`genreid` = `t2`.`genreid`\nAND (`t1`.`name` = 'Jazz')\nRETURN avg(`t2`.`unitprice`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average unit price of tracks that belong to Jazz genre?",
    "evidence": "",
    "idx": 2041
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_genre_0:has_genre]->(`t1`:`genre`)\nWHERE `t1`.`genreid` = `t2`.`genreid`\nAND (`t1`.`name` = 'Jazz')\nRETURN avg(`t2`.`unitprice`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average unit price of jazz tracks.",
    "evidence": "",
    "idx": 2042
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`email` = 'luisg@embraer.com.br'\nRETURN `customer`.`firstname` AS `firstname`, `customer`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name and last name of the customer that has email \"luisg@embraer.com.br\"?",
    "evidence": "",
    "idx": 2043
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`email` = 'luisg@embraer.com.br'\nRETURN `customer`.`firstname` AS `firstname`, `customer`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the full name of the customer with the email \"luisg@embraer.com.br\".",
    "evidence": "",
    "idx": 2044
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`email` =~ '(?i)(?s).*gmail.com.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers have email that contains \"gmail.com\"?",
    "evidence": "",
    "idx": 2045
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`email` =~ '(?i)(?s).*gmail.com.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customers that have an email containing \"gmail.com\".",
    "evidence": "",
    "idx": 2046
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t1`:`customer`)-[supported_by_0:supported_by]->(`t2`:`employee`)\nWHERE `t1`.`supportrepid` = `t2`.`employeeid`\nAND (`t1`.`firstname` = 'Leonie')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name and last name employee helps the customer with first name Leonie?",
    "evidence": "",
    "idx": 2047
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t1`:`customer`)-[supported_by_0:supported_by]->(`t2`:`employee`)\nWHERE `t1`.`supportrepid` = `t2`.`employeeid`\nAND (`t1`.`postalcode` = '70174')\nRETURN `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What city does the employee who helps the customer with postal code 70174 live in?",
    "evidence": "",
    "idx": 2049
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t1`:`customer`)-[supported_by_0:supported_by]->(`t2`:`employee`)\nWHERE `t1`.`supportrepid` = `t2`.`employeeid`\nAND (`t1`.`postalcode` = '70174')\nRETURN `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the cities corresponding to employees who help customers with the postal code 70174.",
    "evidence": "",
    "idx": 2050
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN COUNT(DISTINCT `employee`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many distinct cities does the employees live in?",
    "evidence": "",
    "idx": 2051
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN COUNT(DISTINCT `employee`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of different cities that employees live in.",
    "evidence": "",
    "idx": 2052
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`invoice`)-[placed_by_0:placed_by]->(`t1`:`customer`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`firstname` = 'Astrid' AND `t1`.`lastname` = 'Gruber')\nRETURN `t2`.`invoicedate` AS `invoicedate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all invoice dates corresponding to customers with first name Astrid and last name Gruber.",
    "evidence": "",
    "idx": 2053
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`invoice`)-[placed_by_0:placed_by]->(`t1`:`customer`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`firstname` = 'Astrid' AND `t1`.`lastname` = 'Gruber')\nRETURN `t2`.`invoicedate` AS `invoicedate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the invoice dates for customers with the first name Astrid and the last name Gruber?",
    "evidence": "",
    "idx": 2054
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`invoice`)-[placed_by_0:placed_by]->(`t1`:`customer`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`country` = 'Brazil')\nRETURN DISTINCT `t1`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of all customers that live in Brazil and have an invoice.",
    "evidence": "",
    "idx": 2055
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`invoice`)-[placed_by_0:placed_by]->(`t1`:`customer`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`country` = 'Brazil')\nRETURN DISTINCT `t1`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different first names for customers from Brazil who have also had an invoice?",
    "evidence": "",
    "idx": 2056
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`invoice`)-[placed_by_0:placed_by]->(`t1`:`customer`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`country` = 'Germany')\nRETURN DISTINCT `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the address of all customers that live in Germany and have invoice.",
    "evidence": "",
    "idx": 2057
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`invoice`)-[placed_by_0:placed_by]->(`t1`:`customer`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`country` = 'Germany')\nRETURN DISTINCT `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the addresses of customers living in Germany who have had an invoice?",
    "evidence": "",
    "idx": 2058
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN `employee`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the phone numbers of all employees.",
    "evidence": "",
    "idx": 2059
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN `employee`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the phone numbers for each employee?",
    "evidence": "",
    "idx": 2060
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_media_type_0:has_media_type]->(`t1`:`mediatype`)\nWHERE `t1`.`mediatypeid` = `t2`.`mediatypeid`\nAND (`t1`.`name` = 'AAC audio file')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many tracks are in the AAC audio file media type?",
    "evidence": "",
    "idx": 2061
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_media_type_0:has_media_type]->(`t1`:`mediatype`)\nWHERE `t1`.`mediatypeid` = `t2`.`mediatypeid`\nAND (`t1`.`name` = 'AAC audio file')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of tracks that are of the media type \"AAC audio file\".",
    "evidence": "",
    "idx": 2062
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_genre_0:has_genre]->(`t1`:`genre`)\nWHERE `t1`.`genreid` = `t2`.`genreid`\nAND (`t1`.`name` = 'Latin' OR `t1`.`name` = 'Pop')\nRETURN avg(`t2`.`milliseconds`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average duration in milliseconds of tracks that belong to Latin or Pop genre?",
    "evidence": "",
    "idx": 2063
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_genre_0:has_genre]->(`t1`:`genre`)\nWHERE `t1`.`genreid` = `t2`.`genreid`\nAND (`t1`.`name` = 'Latin' OR `t1`.`name` = 'Pop')\nRETURN avg(`t2`.`milliseconds`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average millisecond length of Latin and Pop tracks.",
    "evidence": "",
    "idx": 2064
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`album`:`album`)\nRETURN `album`.`title` AS `title` ORDER BY `title` IS NULL DESC, `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please list all album titles in alphabetical order.",
    "evidence": "",
    "idx": 2065
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`album`:`album`)\nRETURN `album`.`title` AS `title` ORDER BY `title` IS NULL DESC, `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the album titles, in alphabetical order?",
    "evidence": "",
    "idx": 2066
  }
]