[
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`title` = 'Dawn of the Planet of the Apes')\nRETURN CASE WHEN COUNT(`t3`.`date of birth`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t3`.`date of birth` > localdatetime('1970-01-01T00:00:00') THEN 1 ELSE 0 END)) * 100 / COUNT(`t3`.`date of birth`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of the actors that showed up in the credit list of movie \"Dawn of the Planet of the Apes\" that were born after \"1970/1/1\"?",
    "evidence": "movie \"Dawn of the Planet of the Apes\" refers to Title = 'Dawn of the Planet of the Apes'; born after \"1970/1/1\" refers to Date of Birth > '1970/1/1'; percentage = divide(count(ActorID where Date of Birth > '1970/1/1'), count(ActorID))*100%",
    "idx": 513
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`rating` >= 7 AND `movie`.`rating` <= 8 AND `movie`.`budget` = 15000000\nRETURN `movie`.`movieid` AS `movieid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the movie ID of movie with a budget of 15000000 and a rating between 7 to 8.",
    "evidence": "a budget of 15000000 refers to Budget = 15000000; rating between 7 to 8 refers to Rating BETWEEN 7 and 8",
    "idx": 514
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t3`.`birth city` = 'New York City' AND `t1`.`rating` > 5)\nRETURN `t1`.`genre` AS `genre`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the actors born in New York City, list the genre of their movie with a rating greater than 5.",
    "evidence": "born in New York City refers to Birth City = 'New York City'; rating greater than 5 refers to Rating > 5",
    "idx": 517
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`title` = 'Three Men and a Little Lady')\nRETURN `t3`.`height (inches)` AS `height (inches)`, `t3`.`networth` AS `networth`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the height and net worth of actors starred in Three Men and a Little Lady.",
    "evidence": "Three Men and a Little Lady refers to Title = 'Three Men and a Little Lady'",
    "idx": 519
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`mpaa rating` = 'PG')\nORDER BY toFloat(replace(replace(`t3`.`networth`,',',''),'$','')) IS NULL ASC, toFloat(replace(replace(`t3`.`networth`,',',''),'$','')) DESC \nRETURN `t1`.`genre` AS `genre`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the genre of PG rated movie starred by the actor with highest net worth?",
    "evidence": "PG rated refers to MPAA Rating = 'PG';  highest net worth refers to max(NetWorth)",
    "idx": 520
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`title` = 'Ghost' AND `t3`.`gender` = 'Male' AND `t3`.`birth country` = 'USA')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the male actors born in USA that starred in Ghost.",
    "evidence": "male refers to Gender = 'Male'; born in USA refers to Birth Country = 'USA'; Ghost refers to Title = 'Ghost'",
    "idx": 522
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`title` = 'Die Hard 2' AND `t3`.`height (inches)` >= 60 AND `t3`.`height (inches)` <= 65)\nRETURN `t3`.`networth` AS `networth`, `t3`.`date of birth` AS `date of birth`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the actors starred in Die Hard 2, list their net worth and birth date of actors with a height between 60 to 65.",
    "evidence": "Die Hard 2 refers to Title = 'Die Hard 2'; height between 60 to 65 refers to Height (Inches) BETWEEN 60 AND 65",
    "idx": 524
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t3`.`ethnicity` = 'African American' AND `t3`.`date of birth` = localdatetime('1954-12-28T00:00:00'))\nRETURN `t1`.`runtime` AS `runtime`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the runtime of movies starred by an African-American actor born on December 28, 1954.",
    "evidence": "African-American refers to Ethnicity = 'African American'; born on December 28 1954 refers to Date of Birth = '1954-12-28'",
    "idx": 525
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`gross` = 136766062 AND `t2`.`character name` = 'Don Altobello' AND `t1`.`genre` = 'Drama')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the actor's name that played as Don Altobello in a drama movie that has a gross of 136766062.",
    "evidence": "actor's name refers to Name; as Don Altobello refers to Character Name = 'Don Altobello'; drama movie refers to Genre = 'Drama'",
    "idx": 526
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (toFloat(replace(replace(`t3`.`networth`,',',''),'$','')) > 375000000 AND `t1`.`rating` < 7 AND `t1`.`genre` = 'Comedy')\nRETURN sum(`t1`.`gross`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the gross of a comedy movie with a rating lower than 7 and starred by an actor with a net worth greater than $375,000,000.00?",
    "evidence": "comedy movie refers to Genre = 'Comedy'; rating lower than 7 refers to Rating < 7; net worth greater than $375,000,000.00 refers to NetWorth > '$375,000,000.00'",
    "idx": 527
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`genre` = 'Drama')\nRETURN sum(CASE  WHEN toFloat(replace(replace(`t3`.`networth`,',',''),'$','')) > 400000000 THEN 1 ELSE 0 END) - sum(CASE  WHEN toFloat(replace(replace(`t3`.`networth`,',',''),'$','')) < 400000000 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the movies with drama genre, what is the percentage of the actors with net worth greater than $400,000,000.00?",
    "evidence": "drama genre refers to Genre = 'Drama'; net worth greater than $400,000,000.00 refers to NetWorth > '$400,000,000.00'; percentage = divide(count(ActorID where NetWorth > '$400,000,000.00'), COUNT(ActorID))*100%",
    "idx": 529
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`twitter`:`twitter`)\nWHERE `twitter`.`isreshare` = 'TRUE'\nRETURN `twitter`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the texts of all the tweets that are reshared.",
    "evidence": "reshared refers to Isreshare = 'TRUE'",
    "idx": 531
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE NOT `location`.`city` IS NULL AND `location`.`country` = 'Argentina'\nRETURN `location`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the cities in Argentina.",
    "evidence": "\"Argentina\" is the Country",
    "idx": 535
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_from_0:posted_from]->(`t2`:`location`)\nWHERE `t2`.`locationid` = `t1`.`locationid`\nAND (`t1`.`sentiment` > 0 AND `t2`.`city` = 'Buenos Aires')\nRETURN `t1`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the texts of all the tweets posted from Buenos Aires with a positive sentiment.",
    "evidence": "\"Buenos Aires\" is the City; positive sentiment refers to Sentiment > 0",
    "idx": 538
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`user`:`user`)\nWHERE `user`.`gender` = 'Unknown'\nRETURN COUNT(`user`.`userid`) AS `user_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of users who do not show their genders.",
    "evidence": "do not show their gender refers to Gender = 'Unknown'",
    "idx": 547
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE `location`.`country` = 'United Kingdom'\nRETURN COUNT(`location`.`state`) AS `state_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of states in the United Kingdom.",
    "evidence": "\"United Kingdom\" is the Country",
    "idx": 548
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE `location`.`state` = 'West Sussex'\nRETURN DISTINCT `location`.`locationid` AS `locationid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the location id of West Sussex State.",
    "evidence": "",
    "idx": 550
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_from_0:posted_from]->(`t2`:`location`)\nWHERE `t2`.`locationid` = `t1`.`locationid`\nAND (`t1`.`sentiment` > 0 AND `t2`.`state` = 'Ha Noi')\nRETURN COUNT(`t1`.`tweetid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of positive tweets from Ha Noi.",
    "evidence": "positive tweet refers to Sentiment > 0; 'Ha Noi' is the State",
    "idx": 553
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_from_0:posted_from]->(`t2`:`location`)\nWHERE `t2`.`locationid` = `t1`.`locationid`\nAND (`t2`.`state` = 'Connecticut')\nORDER BY `t1`.`klout` IS NULL ASC, `t1`.`klout` DESC \nRETURN `t1`.`text` AS `text`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the text of the tweet with the highest klout from Connecticut.",
    "evidence": "highest klout refers to Max(Klout); 'Connecticut' is the State",
    "idx": 554
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_from_0:posted_from]->(`t2`:`location`)\nWHERE `t2`.`locationid` = `t1`.`locationid`\nAND (`t1`.`text` = 'One of our favorite stories is @FINRA_News\\'s move to the cloud with AWS Enterprise Support! https://amp.twimg.com/v/991837f1-4815-4edc-a88f-e68ded09a02a')\nRETURN `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the city of the user who tweeted `One of our favorite stories is @FINRA_News's move to the cloud with AWS Enterprise Support! https://amp.twimg.com/v/991837f1-4815-4edc-a88f-e68ded09a02a`.",
    "evidence": "\"One of our favorite stories is @FINRA_News's move to the cloud with AWS Enterprise Support! https://amp.twimg.com/v/991837f1-4815-4edc-a88f-e68ded09a02a\" is the text",
    "idx": 557
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_by_0:posted_by]->(`t2`:`user`)\nWHERE `t1`.`userid` = `t2`.`userid`\nAND (`t1`.`weekday` = 'Wednesday')\nORDER BY `t1`.`klout` IS NULL ASC, `t1`.`klout` DESC \nRETURN `t2`.`gender` AS `gender`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the gender of the user who made the highest klout tweet on Wednesdays.",
    "evidence": "highest klout refers to Max(Klout); 'Wednesday' is the Weekday",
    "idx": 559
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_by_0:posted_by]->(`t2`:`user`)\nWHERE `t1`.`userid` = `t2`.`userid`\nORDER BY `t1`.`likes` IS NULL ASC, `t1`.`likes` DESC \nRETURN `t2`.`gender` AS `gender`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the tweet which got the most likes, state the gender of the user who tweeted it.",
    "evidence": "most likes refers to Max(Likes)",
    "idx": 560
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_from_0:posted_from]->(`t2`:`location`)\nWHERE `t2`.`locationid` = `t1`.`locationid`\nAND (`t1`.`weekday` = 'Thursday' AND `t2`.`state` = 'Michigan')\nRETURN COUNT(`t1`.`tweetid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of tweets from Michigan on Thursdays.",
    "evidence": "\"Michigan\" is the State; 'Thursday' is the Weekday; number of tweets refers to Count(TweetID)",
    "idx": 561
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_from_0:posted_from]->(`t2`:`location`)\nWHERE `t2`.`locationid` = `t1`.`locationid`\nAND (`t1`.`tweetid` = 'tw-685681052912873473')\nRETURN `t2`.`statecode` AS `statecode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which state was the tweet `tw-685681052912873473` from? Give the state code.",
    "evidence": "tw-685681052912873473' is the TweetID",
    "idx": 562
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`twitter`:`twitter`)\nWHERE `twitter`.`lang` = 'en'\nRETURN COUNT(DISTINCT `twitter`.`tweetid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the total number of tweet IDs in `en`.",
    "evidence": "\"en\" is the language and refers to Lang = 'en'",
    "idx": 567
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`twitter`:`twitter`)\nWHERE `twitter`.`weekday` = 'Thursday'\nRETURN `twitter`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all of the texts posted on Twitter on Thursday.",
    "evidence": "\"Thursday\" is the Weekday",
    "idx": 570
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_by_0:posted_by]->(`t2`:`user`)\nWHERE `t1`.`userid` = `t2`.`userid`\nAND (`t2`.`gender` = 'Unknown')\nRETURN `t1`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the text of tweets posted by unknown gender users.",
    "evidence": "unknown gender user refers to Gender = 'Unknown'",
    "idx": 572
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_by_0:posted_by]->(`t2`:`user`)\nWHERE `t1`.`userid` = `t2`.`userid`\nAND (`t2`.`gender` = 'Male')\nRETURN COUNT(`t1`.`tweetid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total number of male tweet IDs.",
    "evidence": "\"Male\" is the Gender",
    "idx": 573
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`twitter`)-[posted_by_1:posted_by]->(`t2_sub0`:`user`)\nWHERE `t1_sub0`.`userid` = `t2_sub0`.`userid`\nAND (`t1_sub0`.`lang` = 'en')\nWITH `t2_sub0`.`gender` AS _groupby_col_0, COUNT(`t1_sub0`.`text`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `gender`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `gender`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What gender of users posted the most tweets in `en`?",
    "evidence": "\"en\" is the language and refers to Lang = 'en'; most tweet in 'en' refers to Max(Count(text where Lang = 'en'))",
    "idx": 574
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`twitter`)-[posted_from_1:posted_from]->(`t2_sub0`:`location`)\nWHERE `t1_sub0`.`locationid` = `t2_sub0`.`locationid`\nWITH `t2_sub0`.`country` AS _groupby_col_0, sum(`t1_sub0`.`likes`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country's tweets collected the most likes?",
    "evidence": "country collected the most likes refers to Country where Max(Sum(Likes))",
    "idx": 577
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_from_0:posted_from]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t2`.`country` = 'Australia')\nRETURN `t1`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all the tweet text posted from Australia.",
    "evidence": "\"Australia\" is the Country",
    "idx": 579
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_from_0:posted_from]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t2`.`city` = 'Rawang' AND `t2`.`state` = 'Selangor' AND `t2`.`country` = 'Malaysia')\nRETURN `t1`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the tweet text posted from Rawang, Selangor, Malaysia.",
    "evidence": "\"Rawang\" is the City; \"Selangor\" is the State; \"Malaysia\" is the Country",
    "idx": 580
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`twitter`)-[posted_from_1:posted_from]->(`t2_sub0`:`location`)\nWHERE `t1_sub0`.`locationid` = `t2_sub0`.`locationid`\nAND (`t1_sub0`.`sentiment` > 0)\nWITH `t2_sub0`.`country` AS _groupby_col_0, sum(`t1_sub0`.`sentiment`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the country where the most positive sentiment tweets were posted.",
    "evidence": "country with the most positive sentiment tweet refers to Country where Max(Count(Sentiment > 0))",
    "idx": 582
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_by_0:posted_by]->(`t2`:`user`)\nWHERE `t1`.`userid` = `t2`.`userid`\nAND (`t1`.`lang` = 'ru' AND `t2`.`gender` = 'Male')\nRETURN sum(`t1`.`likes`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total likes collected by tweets in `ru` posted by male users.",
    "evidence": "'ru' refers to Lang = 'ru'; male user refers to Gender = 'Male'",
    "idx": 583
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_by_0:posted_by]->(`t2`:`user`)\nWHERE `t1`.`userid` = `t2`.`userid`\nAND (`t2`.`gender` = 'Male' AND `t1`.`day` >= 1 AND `t1`.`day` <= 31)\nRETURN CASE WHEN 7=0 THEN NULL ELSE CASE WHEN COUNT(DISTINCT `t1`.`userid`)=0 THEN NULL ELSE COUNT(DISTINCT `t1`.`tweetid`) / COUNT(DISTINCT `t1`.`userid`) END / 7 END AS `avg`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average number of male users who posted tweets in a week.",
    "evidence": "male user refers to Gender = 'Male'; average tweet in a week per user refers to Divide ( Divide(Count(TweetID), Count (UserID)), Divide(31, 7))",
    "idx": 584
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`twitter`:`twitter`)\nWHERE `twitter`.`lang` <> 'en'\nRETURN `twitter`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the texts of all the tweets that are not in English.",
    "evidence": "not in English refers to Lang <> en'",
    "idx": 586
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`twitter`:`twitter`)\nORDER BY `twitter`.`reach` IS NULL ASC, `twitter`.`reach` DESC \nRETURN `twitter`.`text` AS `text`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the texts of the top 3 tweets with the most number of unique users seeing the tweet.",
    "evidence": "the most number of unique users seeing refers to Max(Reach)",
    "idx": 588
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_by_0:posted_by]->(`t2`:`user`)\nWHERE `t1`.`userid` = `t2`.`userid`\nAND (`t2`.`gender` = 'Male' AND `t1`.`lang` = 'fr')\nRETURN `t1`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the texts of all the tweets in French posted by male users.",
    "evidence": "\"French\" is the language and refers to Lang = 'fr'; male user refers to Gender = 'Male'",
    "idx": 592
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`twitter`)-[posted_from_1:posted_from]->(`t2_sub0`:`location`)\nWHERE `t1_sub0`.`locationid` = `t2_sub0`.`locationid`\nAND (`t2_sub0`.`country` = 'Canada')\nWITH `t2_sub0`.`city` AS _groupby_col_0, COUNT(`t1_sub0`.`tweetid`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `city`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `city`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the top 3 cities with the most number of tweets posted in Canada.",
    "evidence": "\"Canada\" is the Country; city with most number of tweets refers to City where Max(Count(TweetID))",
    "idx": 599
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (`t1`:`twitter`)-[posted_from_0:posted_from]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t1`.`sentiment` = 0)\nRETURN DISTINCT `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the cities from where tweets with neutral sentiments were posted.",
    "evidence": "neutral sentiment refers to Sentiment = 0",
    "idx": 600
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL(*) {\nMATCH (`course_sub0`:`course`)\nWHERE `course_sub0`.`name` = 'Machine Learning Theory'\nRETURN `course_sub0`.`credit` AS `credit`  \n}\nMATCH (`course`:`course`)\nWHERE `course`.`credit` < `credit`\nRETURN `course`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the courses that are less important than Machine Learning Theory.",
    "evidence": "lower credit means less important;",
    "idx": 605
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`prof`)-[t2:advises]->(`t3`:`student`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nAND (`t3`.`f_name` = 'Faina' AND `t3`.`l_name` = 'Mallinar')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which professor advised Faina Mallinar to become a research assistant? Please give his or her full name.",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; full name refers to f_name and l_name;",
    "idx": 608
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:advised_by]->()\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND (`t2`.`capability` = 5)\nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of all the students who are research assistants with the highest research capability.",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; the highest research capability refers to capability = 5; full name refers to f_name and l_name;",
    "idx": 610
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`name` = 'Machine Learning Theory')\nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of all the students who took the course Machine Learning Theory.",
    "evidence": "full name refers to f_name and l_name;",
    "idx": 612
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t1`.`f_name` = 'Laughton' AND `t1`.`l_name` = 'Antonio')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the courses taken by Laughton Antonio.",
    "evidence": "",
    "idx": 613
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t2`.`grade` IS NULL AND `t3`.`name` = 'Intro to Database 2')\nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which student failed the course Intro to Database 2? Please give his or her full name.",
    "evidence": "If grade is NULL, it means that this student fails to pass the course; full name refers to f_name and l_name;",
    "idx": 614
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`prof`)-[t2:advises]->(`t3`:`student`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nAND (`t3`.`f_name` = 'Willie' AND `t3`.`l_name` = 'Rechert')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which professor advised Willie Rechert to work as a research assistant? Please give his or her full name.",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; prof_id refers to professor’s ID; full name refers to f_name and l_name;",
    "idx": 617
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`type` = 'RPG'\nRETURN COUNT(`student`.`student_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of research postgraduate students.",
    "evidence": "RPG is an abbreviated name of research postgraduate student in which type = 'RPG';",
    "idx": 620
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL(*) {\nMATCH (`student_sub0`:`student`)\nRETURN MAX(`student_sub0`.`gpa`) AS `_col_0`  \n}\nMATCH (`student`:`student`)\nWHERE `student`.`gpa` = `_col_0`\nRETURN `student`.`f_name` AS `f_name`, `student`.`l_name` AS `l_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which student has the highest gpa? Give the full name.",
    "evidence": "GPA is an abbreviated name of Grade Point Average where highest GPA = MAX(gpa); full name refers to f_name and l_name;",
    "idx": 621
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`prof`)-[t2:advises]->(`t3`:`student`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nAND (`t3`.`f_name` = 'Oliy' AND `t3`.`l_name` = 'Spratling')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which professor is Oliy Spratling working with? Give the full name.",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; full name refers to f_name and l_name;",
    "idx": 624
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:advised_by]->(`t2`:`prof`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND (`t2`.`teachingability` = '1' AND `t2`.`gender` = 'Female')\nRETURN COUNT(`t1`.`student_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many research assistants does the female professor with the lowest teaching ability have?",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; professor with the lowest teaching ability refers to prof_id where teachability = '1';",
    "idx": 626
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`prof`)-[t2:advises]->(`t3`:`student`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nAND (`t1`.`first_name` = 'Zhihua' AND `t3`.`type` = 'RPG' AND `t1`.`last_name` = 'Zhou')\nRETURN `t3`.`f_name` AS `f_name`, `t3`.`l_name` AS `l_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of research postgraduate student among Professor Zhihua Zhou's research assistants.",
    "evidence": "research postgraduate student refers to type = 'RPG'; research assistant refers to the student who serves for research where the abbreviation is RA;",
    "idx": 628
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taken_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`name` = 'Statistical learning')\nRETURN COUNT(`t2`.`student_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of students enrolled in the \"Statistical Learning\" course.",
    "evidence": "",
    "idx": 629
  }
]