[
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`c_acctbal` < 0 AND customer.`c_mktsegment` = 'MACHINERY'\nRETURN COUNT(customer.`c_custkey`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers in the machinery segment are in debt?",
    "evidence": "machinery segment refers to c_mktsegment = 'MACHINERY'; in debt refers to c_acctbal < 0",
    "idx": 3494
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`orders`)-[placed_by_0:`placed_by`]->(t1@`customer`)-[located_in_1_0:`located_in_1`]->(t2@`nation`)\nWHERE t1.`c_nationkey` = t2.`n_nationkey`\nAND t1.`c_custkey` = t3.`o_custkey`\nAND (t2.`n_name` = 'ARGENTINA')\nRETURN sum(t3.`o_totalprice`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the total price of all the orders shipped to customers in Argentina?",
    "evidence": "total price = sum(o_totalprice); Argentina refers to n_name = 'Argentina'",
    "idx": 3495
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`orders`)-[placed_by_0:`placed_by`]->(t2@`customer`)\nWHERE t1.`o_custkey` = t2.`c_custkey`\nAND (t2.`c_mktsegment` = 'BUILDING' AND t1.`o_totalprice` > 50000)\nRETURN COUNT(t2.`c_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers in the building segments have orders with a total price of no less than 50,000?",
    "evidence": "building segment refers to c_mktsegment = 'BUILDING'; a total price of no less than 50,000 refers to o_totalprice > 50000",
    "idx": 3496
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`part`)-[t2:`supplied_by`]->()\nWHERE t1.`p_partkey` = t2.`ps_partkey`\nAND (t1.`p_name` = 'medium metallic grey dodger linen')\nRETURN t2.`ps_supplycost` AS `ps_supplycost`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the part supply cost for the medium metallic grey dodger linen?",
    "evidence": "part supply cost refers to ps_supplycost; medium metallic grey dodger linen refers to p_name = 'medium metallic grey dodger linen'",
    "idx": 3497
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`part`)-[t2:`supplied_by`]->()\nWHERE t1.`p_partkey` = t2.`ps_partkey`\nAND (t2.`ps_supplycost` > 1000)\nRETURN t1.`p_name` AS `p_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the parts that have a part supply cost of at least 1,000?",
    "evidence": "name of the part refers to p_name; part supply cost of at least 1,000 refers to ps_supplycost > 1000",
    "idx": 3498
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t1@`supplier`)-[located_in_2_0:`located_in_2`]->(t2@`nation`)\nWHERE t1.`s_nationkey` = t2.`n_nationkey`\nORDER BY t1.`s_suppkey` DESC NULLS LAST \nRETURN t2.`n_name` AS `n_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the country of the supplier with the highest debt?",
    "evidence": "name of the country refers to n_name; the highest debt refers to min(s_acctbal)",
    "idx": 3499
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nORDER BY t2.`l_extendedprice` DESC NULLS LAST \nRETURN t1.`o_clerk` AS `o_clerk` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the clerk in charge of handling the item with the highest amount of extended price?",
    "evidence": "clerk refers to o_clerk; the highest amount of extended price refers to max(l_extendedprice)",
    "idx": 3500
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND (t1.`o_orderdate` = date('1995-10-05') AND t1.`o_custkey` = 101660)\nRETURN sum(t2.`l_quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the total quantities of the items ordered by customer 101660 on 10/5/1995?",
    "evidence": "total quantity refers to sum(l_quantity); customer 101660 refers to o_custkey = 101660; on 10/5/1995 refers to o_orderdate = '1995-10-05'",
    "idx": 3501
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND (t1.`o_custkey` = 88931 AND t1.`o_orderdate` = date('1994-07-13'))\nRETURN sum(t2.`l_extendedprice` * (1 - t2.`l_discount`) * (1 + t2.`l_tax`)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total amount of tax charged for the order placed by customer 88931 on 7/13/994?",
    "evidence": "total amount of tax refers to sum(multiply(multiply(l_extendedprice, subtract(1, l_discount)), add(1, l_tax))); customer 88931 refers to o_custkey = 88931; on 7/13/1994 refers to o_orderdate = '1994-07-13'",
    "idx": 3502
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (t3@`part`)\nMATCH (t2@`lineitem`)-[belongs_to_order_0:`belongs_to_order`]->(t1@`orders`)\nWHERE t1.`o_orderkey` = t2.`l_orderkey`\nAND t2.`l_partkey` = t3.`p_partkey`\nAND (t1.`o_custkey` = 110942)\nRETURN t3.`p_name` AS `p_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the parts that were ordered by customer 110942?",
    "evidence": "name of the part refers to p_name; customer 110942 refers to o_custkey = 110942",
    "idx": 3503
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_height_0:`has_height`]->(t2@`height_info`)\nWHERE t1.`height` = t2.`height_id`\nAND (t1.`playername` = 'David Bornhammar')\nRETURN t2.`height_in_inch` AS `height_in_inch`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the height of David Bornhammar in inches?",
    "evidence": "heigh in inches refers to height_in_inch;",
    "idx": 3505
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_height_0:`has_height`]->(t2@`height_info`)\nWHERE t1.`height` = t2.`height_id`\nAND (t2.`height_in_inch` > '6\\'2\"' AND t1.`nation` = 'Sweden')\nRETURN COUNT(t1.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players with a height of over 6'2\" inches, how many of them were born in Sweden?",
    "evidence": "height of over 6'2\" inches refers to height_in_inch > '6''2\"'; born in Sweden refers to nation = 'Sweden' ;",
    "idx": 3507
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_height_0:`has_height`]->(t2@`height_info`)\nWHERE t1.`height` = t2.`height_id`\nORDER BY t2.`height_in_cm` DESC NULLS LAST \nRETURN t1.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the tallest player?",
    "evidence": "tallest player refers to MAX(height_in_cm);",
    "idx": 3508
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND (t1.`playername` = 'David Bornhammar')\nRETURN t2.`weight_in_kg` AS `weight_in_kg`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much does David Bornhammar weigh in kilograms?",
    "evidence": "weigh in kilograms refers to weight_in_kg;",
    "idx": 3509
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND (t2.`weight_in_kg` > 90)\nRETURN COUNT(t1.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many players weigh more than 90 kg?",
    "evidence": "weigh more than 90 kg refers to weight_in_kg > 90;",
    "idx": 3510
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND (t2.`weight_in_kg` > 90 AND t1.`position_info` = 'D')\nRETURN COUNT(t1.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players that weigh more than 90 kg, how many of them have a position of defense?",
    "evidence": "weigh more than 90 kg refers to weight_in_kg > 90; position of defense refers to position_info = 'D' ;",
    "idx": 3511
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL {\nMATCH (t1_sub0@`playerinfo`)-[has_weight_1:`has_weight`]->(t2_sub0@`weight_info`)\nWHERE t1_sub0.`weight` = t2_sub0.`weight_id`\nAND (t2_sub0.`weight_in_kg` > 90)\nRETURN MAX(t1_sub0.`sum_7yr_gp`) AS `_col_0` \n}\nMATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND (t2.`weight_in_kg` > 90 AND t1.`sum_7yr_gp` = _col_0)\nRETURN t1.`playername` AS `playername`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players that weigh more than 90 kg, what is the name of the player that has the most attendance in the player's first 7 years of NHL career?",
    "evidence": "weigh more than 90 kg refers to weight_in_kg > 90; name of the player refers to PlayerName; most attendance in the player's first 7 years of NHL career refers to MAX(sum_7yr_GP);",
    "idx": 3512
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL {\nMATCH (t_sub0@`playerinfo`)\nRETURN MAX(t_sub0.`sum_7yr_toi`) AS `_col_0` \n}\nMATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND (t1.`sum_7yr_toi` = _col_0)\nRETURN t2.`weight_in_kg` AS `weight_in_kg`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the weight of the player with the longest time on ice in the player’s first 7 years of NHL career in kilograms?",
    "evidence": "weight in kilograms refers to weight_in_kg; longest time on ice in the player's first 7 years of NHL career refers to MAX(sum_7yr_TOI);",
    "idx": 3513
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL {\nMATCH (t1_sub0@`playerinfo`)-[has_height_0:`has_height`]->(t2_sub0@`height_info`)\nWHERE t1_sub0.`height` = t2_sub0.`height_id`\nAND (t1_sub0.`playername` = 'David Bornhammar')\nRETURN t2_sub0.`height_in_cm` AS `height_in_cm` \n}\nCALL {\nMATCH (t1_sub0@`playerinfo`)-[has_height_1:`has_height`]->(t2_sub0@`height_info`)\nWHERE t1_sub0.`height` = t2_sub0.`height_id`\nAND (t1_sub0.`playername` = 'Pauli Levokari')\nRETURN t2_sub0.`height_in_cm` AS `height_in_cm_1` \n}\nRETURN height_in_cm - height_in_cm_1 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much taller is David Bornhammar than Pauli Levokari in centimeters?",
    "evidence": "how much taller = SUBTRACT(SUM(height_in_cm WHERE PlayerName = 'David Bornhammar'), SUM(height_in_cm WHERE PlayerName = 'Pauli Levokari')); height in centimeters refers to height_in_cm;",
    "idx": 3514
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND (t2.`weight_in_kg` > 90 AND t1.`shoots` = 'R')\nRETURN COUNT(t1.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the players that are right-shooted, how many of them weigh over 90 kg?",
    "evidence": "right-shooted refers to shoots = 'R'; weigh over 90 kg refers to weight_in_kg > 90;",
    "idx": 3515
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nMATCH (t1@`playerinfo`)-[has_height_0:`has_height`]->(t3@`height_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND t1.`height` = t3.`height_id`\nAND (t1.`playername` = 'David Bornhammar')\nRETURN cast (t2.`weight_in_kg` as float) / (cast (t3.`height_in_cm` as float) / 100 * (cast (t3.`height_in_cm` as float) / 100)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the BMI of David Bornhammar?",
    "evidence": "BMI = DIVIDE(weight_in_kg, power(DIVIDE(height_in_cm, 100), 2));",
    "idx": 3517
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_height_0:`has_height`]->(t2@`height_info`)\nWHERE t1.`height` = t2.`height_id`\nAND (t1.`position_info` = 'D')\nRETURN cast (sum(t2.`height_in_cm`) as float) / COUNT(t1.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average height in centimeters of all the players in the position of defense?",
    "evidence": "average = AVG(height_in_cm); players refers to PlayerName; position of defense refers to position_info = 'D' ;",
    "idx": 3518
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nRETURN MAX(t2.`weight_in_lbs`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the weight in pounds of the heaviest player?",
    "evidence": "weight in pounds refers to weight_in_lbs; heaviest player refers to MAX(weight_in_lbs);",
    "idx": 3519
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_height_0:`has_height`]->(t2@`height_info`)\nWHERE t1.`height` = t2.`height_id`\nAND (t2.`height_in_inch` = '5\\'7\"' AND t1.`shoots` = 'R')\nRETURN COUNT(t1.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many right-shooted players have a height of 5'7''?",
    "evidence": "right-shooted players refers to shoots = 'R'; height of 5'7'' refers to height_in_inch = '5''7\"';",
    "idx": 3520
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t1@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`sum_7yr_gp` > 500)\nORDER BY t2.`pim` DESC NULLS LAST \nRETURN t1.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players whose total NHL games played in their first 7 years of NHL career is no less than 500, what is the name of the player who committed the most rule violations?",
    "evidence": "total NHL games played in their first 7 years of NHL career is no less than 500 refers to sum_7yr_GP > 500; name of the player refers to PlayerName; committed the most rule violations refers to MAX(PIM);",
    "idx": 3521
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_height_0:`has_height`]->(t2@`height_info`)\nWHERE t1.`height` = t2.`height_id`\nAND (t1.`birthplace` = 'Edmonton, AB, CAN')\nORDER BY t2.`height_in_cm` DESC NULLS LAST \nRETURN t2.`height_in_cm` AS `height_in_cm` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the height in centimeter of the tallest player born in Edmonton, Alberta, Canada?",
    "evidence": "height in centimeter refers to height_in_cm; tallest player refers to MAX(height_in_cm); born in Edmonton, Alberta, Canada refers to birthplace = 'Edmonton, AB, CAN';",
    "idx": 3522
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t1@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`overallby` = 'Anaheim Ducks' AND t1.`draftyear` = 2008 AND t2.`team` = 'U.S. National U18 Team')\nRETURN COUNT(DISTINCT t1.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many players, who were drafted by Anaheim Ducks in 2008, have played for U.S. National U18 Team?",
    "evidence": "drafted by Anaheim Ducks refers to overallby = 'Anaheim Ducks'; in 2008 refers to draftyear = 2008; played for U.S. National U18 Team refers to TEAM = 'U.S. National U18 Team';",
    "idx": 3523
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)-[has_weight_0:`has_weight`]->(t3@`weight_info`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND t2.`weight` = t3.`weight_id`\nORDER BY t1.`plusminus` DESC NULLS LAST \nRETURN t3.`weight_in_kg` AS `weight_in_kg` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the weight in kilograms of the player with the highest number of goal differential of all time?",
    "evidence": "weight in kilograms refers to weight_in_kg; highest number of goal differential of all time refers to MAX(PLUSMINUS);",
    "idx": 3524
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`season` >= '2004' AND t1.`season` <= '2005' AND t1.`league` = 'QMJHL')\nORDER BY t1.`p` DESC NULLS LAST \nRETURN t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the most valuable player in QMJHL league during the 2004-2005 season?",
    "evidence": "most valuable player refers to MAX(P); QMJHL league refers to LEAGUE = 'QMJHL'; 2004-2005 season refers to SEASON = '2004-2005';",
    "idx": 3525
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`season` = '1998-1999' AND t1.`gametype` = 'Regular Season' AND t1.`team` = 'Acadie-Bathurst Titan')\nRETURN t2.`playername` AS `playername`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the players who played for Acadie-Bathurst Titan during the regular season in 1998-1999?",
    "evidence": "names of the players refers to PlayerName; played for Acadie-Bathurst Titan refers to TEAM = 'AcadieandBathurst Titan'; regular season refers to GAMETYPE = 'Regular Season'; in 1998-1999 refers to SEASON = '1998-1999';",
    "idx": 3526
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL {\nMATCH (t_sub0@`playerinfo`)\nORDER BY t_sub0.`height` DESC NULLS LAST \nRETURN t_sub0.`eliteid` AS `eliteid` \nLIMIT 1\n}\nMATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t2.`eliteid` = eliteid)\nRETURN t1.`gp` AS `gp`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games did the tallest player have ever played?",
    "evidence": "tallest player refers to MAX(height_in_cm);",
    "idx": 3527
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`season` = '1997-1998' AND t1.`league` = 'OHL')\nORDER BY t2.`birthdate` DESC NULLS LAST \nRETURN DISTINCT t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the youngest player to have played during the 1997-1998 season for OHL League?",
    "evidence": "youngest player refers to MAX(birthdate); 1997-1998 season refers to SEASON = '1997-1998'; OHL league refers to LEAGUE = 'OHL';",
    "idx": 3528
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`gp` = 72 AND t2.`shoots` = 'L')\nRETURN COUNT(t2.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players who played 72 games, how many are left-shooters?",
    "evidence": "played 72 games refers to GP = 72; left-shooters refers to shoots = 'L';",
    "idx": 3529
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL {\nMATCH (playerinfo_sub0@`playerinfo`)\nRETURN MAX(playerinfo_sub0.`css_rank`) AS `_col_0_1` \n}\nMATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND (t1.`css_rank` = _col_0_1)\nRETURN cast (sum(t2.`weight_in_lbs`) as float) / COUNT(t1.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average weight in pounds of all the players with the highest prospects for the draft?",
    "evidence": "average = AVG(weight_in_lbs); weight in pounds refers to weight_in_lbs; players refers to PlayerName; highest prospects for the draft refers to MAX(CSS_rank);",
    "idx": 3530
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`season` = '2007-2008' AND t1.`league` = 'WHL')\nORDER BY t1.`g` DESC NULLS LAST \nRETURN t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Name the player who scored the most goals in a single game in the 2007-2008 season of WHL?",
    "evidence": "name of the player refers to PlayerName; scored the most goals in a single game refers to MAX(G); WHL refers to LEAGUE = 'WHL'; 2007-2008 season refers to SEASON = '2007-2008';",
    "idx": 3532
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL {\nMATCH (playerinfo_sub0@`playerinfo`)\nWHERE playerinfo_sub0.`playername` = 'Brian Gionta'\nRETURN playerinfo_sub0.`height` AS `height` \n}\nMATCH (t2@`playerinfo`)-[has_height_0:`has_height`]->(t1@`height_info`)\nWHERE t1.`height_id` = t2.`height`\nAND (t2.`height` = height)\nRETURN t2.`playername` AS `playername`, t1.`height_in_cm` AS `height_in_cm`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Identify the players with the same height as Brian Gionta. How tall are they?",
    "evidence": "players refers to PlayerName; height refers to height_in_cm;",
    "idx": 3535
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (playerinfo@`playerinfo`)\nWHERE playerinfo.`overallby` = 'Toronto Maple Leafs' AND playerinfo.`sum_7yr_gp` > 300\nRETURN COUNT(playerinfo.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many players who were drafted by the Toronto Maple Leafs have played over 300 games in their first 7 years of the NHL career?",
    "evidence": "drafted by the Toronto Maple Leafs refers to overallby = 'Toronto Maple Leafs'; played over 300 games in their first 7 years of the NHL career refers to sum_7yr_GP > 300;",
    "idx": 3540
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)-[has_height_0:`has_height`]->(t3@`height_info`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND t2.`height` = t3.`height_id`\nAND (t1.`season` = '2005-2006' AND t1.`team` = 'Yale Univ.' AND t1.`pim` = 28)\nRETURN t3.`height_in_cm` AS `height_in_cm`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How tall is the player from Yale University who picked up 28 penalty minutes in the 2005-2006 season?",
    "evidence": "how tall refers to height_in_cm; Yale University refers to TEAM = 'Yale Univ.'; 28 penalty minutes refers to PIM = '28'; 2005-2006 season refers to SEASON = '2005-2006';",
    "idx": 3541
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (playerinfo@`playerinfo`)\nWHERE playerinfo.`playername` = 'Aaron Gagnon'\nRETURN playerinfo.`birthplace` AS `birthplace`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the birthplace of Aaron Gagnon?",
    "evidence": "FALSE;",
    "idx": 3544
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND (t1.`playername` = 'Tony Martensson')\nRETURN t2.`weight_in_kg` AS `weight_in_kg`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the weight in kg of Tony Martensson?",
    "evidence": "FALSE;",
    "idx": 3545
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nORDER BY t2.`weight_in_kg` DESC NULLS LAST \nRETURN t1.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who has the heaviest weight?",
    "evidence": "who refers to PlayerName; heaviest weight refers to MAX(weight_in_kg);",
    "idx": 3547
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nRETURN cast (COUNT(CASE  WHEN t1.`nation` = 'Denmark' AND t2.`weight_in_lbs` > 154 THEN t1.`eliteid` ELSE NULL END) as float) * 100 / COUNT(t1.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of players who were born in Denmark and weight above 154 lbs?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(weight_in_lbs > 154 and nation = 'Denmark'), COUNT(ELITEID)), 100); players refers to PlayerName; born in Denmark refers to nation = 'Denmark'; weight above 154 lbs refers to weight_in_lbs > 154;",
    "idx": 3548
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t2.`playername` = 'Andreas Jamtin')\nRETURN DISTINCT t1.`team` AS `team`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which team does Andreas Jamtin belong to?",
    "evidence": "FALSE;",
    "idx": 3549
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t2.`playername` = 'Per Mars')\nORDER BY t1.`p` DESC NULLS LAST \nRETURN t1.`p` AS `p` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the highest point highest point of Per Mars in the draft year?",
    "evidence": "highest point in the draft year refers to MAX(P);",
    "idx": 3553
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`playerinfo`)-[has_height_0:`has_height`]->(t1@`height_info`)\nWHERE t1.`height_id` = t2.`height`\nAND (t2.`nation` = 'Italy')\nORDER BY t1.`height_in_cm`  NULLS FIRST \nRETURN t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the Italian players, who has the shortest height?",
    "evidence": "Italian refers to nation = 'Italy'; players refers to PlayerName; shortest height refers to MIN(height_in_cm);",
    "idx": 3554
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`playerinfo`)-[has_height_0:`has_height`]->(t1@`height_info`)\nWHERE t1.`height_id` = t2.`height`\nRETURN cast (COUNT(CASE  WHEN t1.`height_in_cm` < 200 AND t2.`nation` = 'Russia' THEN t2.`eliteid` ELSE NULL END) as float) * 100 / COUNT(t2.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of Russian players who have a height of under 200 inch?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(nation = 'Russia' WHERE height_in_cm < 200), COUNT(ELITEID)), 100); Russian refers to nation = 'Russia'; players refers to PlayerName; height of under 200 inch refers to height_in_cm < 200;",
    "idx": 3556
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`playerinfo`)-[has_weight_0:`has_weight`]->(t1@`weight_info`)\nWHERE t1.`weight_id` = t2.`weight`\nAND (t2.`nation` = 'USA')\nORDER BY t1.`weight_in_lbs`  NULLS FIRST \nRETURN t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the USA players, who has the lightest weight?",
    "evidence": "USA refers to nation = 'USA' ; players refers to PlayerName; lightest weight refers to MIN(weight_in_lbs);\n",
    "idx": 3557
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`season` = '2000-2001')\nORDER BY t1.`pim` DESC NULLS LAST \nRETURN t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who among the players in season 2000-2001 has committed the highest rule violations or penalty minutes?",
    "evidence": "committed the highest rule violations or penalty minutes refers to MAX(PIM); 2000-2001 season refers to SEASON = '2000-2001'",
    "idx": 3558
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t2.`overallby` = 'Arizona Coyotes' AND t2.`draftyear` = 2000)\nORDER BY t1.`pim` DESC NULLS LAST \nRETURN t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who among the players drafted by Arizona Coyotes in 2000 has committed the highest rule violations?",
    "evidence": "who refers to PlayerName; drafted by Arizona Coyotes refers to overallby = 'Arizona Coyotes'; committed the highest rule violations refers to MAX(PIM); in 2000 refers to draftyear = 2000;",
    "idx": 3560
  }
]