[
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'nebraska'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` IN in_collect_0\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many major cities are in states bordering nebraska",
    "evidence": "",
    "idx": 430
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`t2`:`state`)-[t1:borders]->()\nWHERE `t2`.`state_name` = `t1`.`border`\nAND (`t1`.`state_name` = 'texas')\nRETURN sum(`t2`.`population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the total population of the states that border texas",
    "evidence": "",
    "idx": 431
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`lake`:`lake`)\nWHERE `lake`.`area` > 750\nRETURN `lake`.`lake_name` AS `lake_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major lakes in united states",
    "evidence": "",
    "idx": 432
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`lake`:`lake`)\nWHERE `lake`.`area` > 750\nRETURN `lake`.`lake_name` AS `lake_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "show me all the major lakes in the us",
    "evidence": "",
    "idx": 433
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`lake`:`lake`)\nRETURN `lake`.`lake_name` AS `lake_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "name all the lakes of us",
    "evidence": "",
    "idx": 434
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`length` > 750 AND `river`.`traverse` = 'ohio'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many major rivers cross ohio",
    "evidence": "",
    "idx": 435
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN min(DISTINCT `river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN DISTINCT `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the shortest river",
    "evidence": "",
    "idx": 436
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`length` > 750\nRETURN COUNT(DISTINCT `river`.`traverse`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states are next to major rivers",
    "evidence": "",
    "idx": 437
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_name` = 'mckinley'\nRETURN `mountain`.`mountain_altitude` AS `mountain_altitude`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the height of mount mckinley",
    "evidence": "",
    "idx": 438
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN min(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states does the shortest river run through",
    "evidence": "",
    "idx": 439
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`state_name` = 'alaska'\nRETURN `mountain`.`mountain_name` AS `mountain_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what mountains are in alaska",
    "evidence": "",
    "idx": 440
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`length` > 750\nRETURN COUNT(`river`.`traverse`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states have major rivers",
    "evidence": "",
    "idx": 441
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'colorado'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` IN in_collect_0\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers run through the states bordering colorado",
    "evidence": "",
    "idx": 442
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river_sub0`:`river`)\nRETURN `river_sub0`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH (`state`:`state`)\nWHERE NOT `state`.`state_name` IN in_collect_0\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has no rivers",
    "evidence": "",
    "idx": 443
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of the largest state",
    "evidence": "",
    "idx": 444
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital city of the largest state in the us",
    "evidence": "",
    "idx": 445
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'texas'\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many cities are in texas",
    "evidence": "",
    "idx": 446
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'texas'\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many cities does texas have",
    "evidence": "",
    "idx": 447
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the area of the states",
    "evidence": "",
    "idx": 448
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN min(DISTINCT `river_sub0`.`length`) AS `_col_0_1`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0_1`\nRETURN COUNT(DISTINCT `river`.`traverse`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states in the us does the shortest river run through",
    "evidence": "",
    "idx": 449
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the area of the smallest state",
    "evidence": "",
    "idx": 450
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`density` AS `density`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population density of the state with the smallest population",
    "evidence": "",
    "idx": 451
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'mississippi'\nRETURN `river`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` IN in_collect_0\nRETURN COUNT(DISTINCT `border_info`.`border`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states border the mississippi river",
    "evidence": "",
    "idx": 452
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`t1`:`state`)\nMATCH (`t2`:`highlow`)\nWHERE `t1`.`capital` = `t2`.`highest_point`\nRETURN `t1`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states have a capital that is the highest point in the state",
    "evidence": "",
    "idx": 453
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN MAX(`state`.`area`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the size of the largest state in the usa",
    "evidence": "",
    "idx": 454
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN MAX(`state`.`area`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the area of the largest state",
    "evidence": "",
    "idx": 455
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`t1`:`city`)\nMATCH (`t2`:`state`)\nWHERE `t2`.`capital` = `t1`.`city_name`\nAND (`t1`.`population` <= 150000)\nRETURN `t2`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which capitals are not major cities",
    "evidence": "",
    "idx": 456
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the cities in usa",
    "evidence": "",
    "idx": 457
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'massachusetts'\nRETURN `state`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is massachusetts",
    "evidence": "",
    "idx": 458
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the major rivers in the us",
    "evidence": "",
    "idx": 459
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'austin'\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many cities named austin are there in the usa",
    "evidence": "",
    "idx": 460
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'colorado' AND `river`.`traverse` = 'texas'\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the length of the colorado river in texas",
    "evidence": "",
    "idx": 461
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`capital` = 'austin'\nRETURN `state`.`density` AS `density`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population density in the state with capital austin",
    "evidence": "",
    "idx": 462
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN min(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how long is the shortest river in the usa",
    "evidence": "",
    "idx": 463
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_point` = 'death valley'\nRETURN `highlow`.`lowest_elevation` AS `lowest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the elevation of death valley",
    "evidence": "",
    "idx": 464
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN avg(`state`.`population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the average population of the us by state",
    "evidence": "",
    "idx": 465
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state`:`state`)\nWHERE `state`.`capital` = 'boston'\nRETURN `state`.`state_name` AS `state_name`  \n}\nMATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = `state_name`\nRETURN COUNT(`border_info`.`border`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states border on the state whose capital is boston",
    "evidence": "",
    "idx": 466
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'texas'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`state`:`state`)\nWHERE NOT `state`.`state_name` IN in_collect_0\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states does not border texas",
    "evidence": "",
    "idx": 467
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'montana'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'montana'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state is the largest city in montana in",
    "evidence": "",
    "idx": 468
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN min(`highlow_sub0`.`lowest_elevation`) AS `_col_0`  \n}\nMATCH (`t2`:`highlow`)-[describes_0:describes]->(`t1`:`state`)\nWHERE `t1`.`state_name` = `t2`.`state_name`\nAND (`t2`.`lowest_elevation` = `_col_0`)\nRETURN `t1`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is capital of the state with the lowest point",
    "evidence": "",
    "idx": 469
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`t2`:`highlow`)-[describes_0:describes]->(`t1`:`state`)\nWHERE `t1`.`state_name` = `t2`.`state_name`\nAND (`t2`.`highest_elevation` = `_col_0`)\nRETURN `t1`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the capital of the state with the highest point",
    "evidence": "",
    "idx": 470
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`t2`:`highlow`)-[describes_0:describes]->(`t1`:`state`)\nWHERE `t1`.`state_name` = `t2`.`state_name`\nAND (`t1`.`area` = `_col_0`)\nRETURN `t2`.`highest_point` AS `highest_point`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in the smallest state",
    "evidence": "",
    "idx": 472
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`t2`:`highlow`)-[describes_0:describes]->(`t1`:`state`)\nWHERE `t1`.`state_name` = `t2`.`state_name`\nAND (`t1`.`area` = `_col_0`)\nRETURN `t2`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how high is the highest point in the largest state",
    "evidence": "",
    "idx": 473
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'syntactic parsing')\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who has written the most syntactic parsing papers ?",
    "evidence": "",
    "idx": 495
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'syntactic parsing')\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who is the most published author in syntactic parsing ?",
    "evidence": "",
    "idx": 496
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'syntactic parsing')\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who has the most publications in syntactic parsing ?",
    "evidence": "",
    "idx": 497
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'syntactic parsing')\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who has written the most papers on syntactic parsing ?",
    "evidence": "",
    "idx": 498
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'syntactic parsing')\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List prominent scholars in syntactic parsing ?",
    "evidence": "",
    "idx": 499
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'syntactic parsing')\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who wrote the most papers on syntactic parsing ?",
    "evidence": "",
    "idx": 500
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'syntactic parsing')\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who are the authors with the most published papers in syntactic parsing ?",
    "evidence": "",
    "idx": 501
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'syntactic parsing')\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who published the most in syntactic parsing ?",
    "evidence": "",
    "idx": 504
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'syntactic parsing')\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who published the most papers in syntactic parsing ?",
    "evidence": "",
    "idx": 505
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'noah a smith')\nRETURN DISTINCT COUNT(`t4`.`citedpaperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many citation noah a smith has ?",
    "evidence": "",
    "idx": 506
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'noah a smith')\nRETURN DISTINCT COUNT(`t4`.`citedpaperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many citations does noah a smith have ?",
    "evidence": "",
    "idx": 508
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'noah a smith')\nRETURN DISTINCT COUNT(`t4`.`citedpaperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many times was noah a smith cited ?",
    "evidence": "",
    "idx": 512
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'noah a smith')\nRETURN DISTINCT COUNT(`t4`.`citedpaperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many citations does noah a smith has ?",
    "evidence": "",
    "idx": 513
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'chi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "chi papers",
    "evidence": "",
    "idx": 514
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'chi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "papers at chi",
    "evidence": "",
    "idx": 515
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'chi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "chi",
    "evidence": "",
    "idx": 517
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'chi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show me chi papers .",
    "evidence": "",
    "idx": 519
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'chi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what papers did chi publish ?",
    "evidence": "",
    "idx": 520
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'chi')\nRETURN DISTINCT `t1`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list papers published in chi",
    "evidence": "",
    "idx": 521
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'mirella lapata' AND `t3`.`year` = 2016)\nWITH `t2`.`authorid` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Has mirella lapata written any papers in 2016 ?",
    "evidence": "",
    "idx": 523
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'oren etzioni')\nORDER BY `t3`.`year` IS NULL ASC, `t3`.`year` DESC \nRETURN DISTINCT `t2`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What was oren etzioni 's latest paper ?",
    "evidence": "",
    "idx": 541
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'oren etzioni')\nORDER BY `t3`.`year` IS NULL ASC, `t3`.`year` DESC \nRETURN DISTINCT `t2`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the latest paper by oren etzioni ?",
    "evidence": "",
    "idx": 543
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'oren etzioni')\nORDER BY `t3`.`year` IS NULL ASC, `t3`.`year` DESC \nRETURN DISTINCT `t2`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is oren etzioni 's latest paper ?",
    "evidence": "",
    "idx": 544
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'oren etzioni')\nORDER BY `t3`.`year` IS NULL ASC, `t3`.`year` DESC \nRETURN DISTINCT `t2`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the latest papers by oren etzioni ?",
    "evidence": "",
    "idx": 545
  }
]