[
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`book_club`:`book_club`)\nRETURN `book_club`.`year` AS `year`, `book_club`.`book_title` AS `book_title`, `book_club`.`publisher` AS `publisher` ORDER BY `year` IS NULL ASC, `year` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the years, book titles, and publishers for all books, in descending order by year.",
    "evidence": "",
    "idx": 6886
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`book_club`:`book_club`)\nWITH `book_club`.`publisher` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `publisher`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all publishers and the number of books for each publisher.",
    "evidence": "",
    "idx": 6888
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`book_club`:`book_club`)\nWITH `book_club`.`category` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `category`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all book categories and the number of books in each category.",
    "evidence": "",
    "idx": 6890
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`book_club`:`book_club`)\nWHERE `book_club`.`year` > 1989\nWITH `book_club`.`category` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `category`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List categories that have at least two books after year 1989.",
    "evidence": "",
    "idx": 6892
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`movie`:`movie`)\nORDER BY `movie`.`budget_million` IS NULL DESC, `movie`.`budget_million`  \nRETURN `movie`.`title` AS `title`, `movie`.`year` AS `year`, `movie`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all movie titles, years, and directors, ordered by budget.",
    "evidence": "",
    "idx": 6894
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`movie`:`movie`)\nRETURN COUNT(DISTINCT `movie`.`director`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different directors.",
    "evidence": "",
    "idx": 6897
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`year` <= 2000\nORDER BY `movie`.`gross_worldwide` IS NULL ASC, `movie`.`gross_worldwide` DESC \nRETURN `movie`.`title` AS `title`, `movie`.`director` AS `director`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the title and director of the movie released in the year 2000 or earlier that had the highest worldwide gross.",
    "evidence": "",
    "idx": 6899
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`year` = 1999 OR `movie`.`year` = 2000\nRETURN `movie`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all director names who have a movie in the year 1999 or 2000.",
    "evidence": "",
    "idx": 6900
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`year` < 2000\nRETURN avg(`movie`.`budget_million`) AS `_col_0`, MAX(`movie`.`budget_million`) AS `_col_1`, min(`movie`.`budget_million`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average, maximum, and minimum budget for all movies before 2000.",
    "evidence": "",
    "idx": 6902
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`t1`:`culture_company`)-[invests_in_0:invests_in]->(`t2`:`book_club`)\nWHERE `t1`.`book_club_id` = `t2`.`book_club_id`\nAND (`t2`.`publisher` = 'Alyson')\nRETURN `t1`.`company_name` AS `company_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all company names with a book published by Alyson.",
    "evidence": "",
    "idx": 6904
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`t2`:`culture_company`)-[invests_in_0:invests_in]->(`t1`:`movie`)\nMATCH (`t2`:`culture_company`)-[invests_in_1:invests_in]->(`t3`:`book_club`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t3`.`book_club_id` = `t2`.`book_club_id`\nAND (`t2`.`incorporated_in` = 'China')\nRETURN `t1`.`title` AS `title`, `t3`.`book_title` AS `book_title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the movie titles and book titles for all companies in China.",
    "evidence": "",
    "idx": 6906
  },
  {
    "filename": "train_spider.json",
    "db_id": "culture_company",
    "gql_statement": "MATCH (`t2`:`culture_company`)-[invests_in_0:invests_in]->(`t1`:`movie`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (`t1`.`year` = 1999)\nRETURN `t2`.`company_name` AS `company_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all company names with a movie directed in year 1999.",
    "evidence": "",
    "idx": 6908
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "{MATCH (employee@`employee`)\nRETURN employee.`eid` AS `eid` \n} \nEXCEPT DISTINCT\n{MATCH ()-[certificate:`certified_to_fly`]->()\nRETURN certificate.`eid` AS `eid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of all employees that don't have certificates?",
    "evidence": "",
    "idx": 1359
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "{MATCH (t1@`employee`)-[t2:`certified_to_fly`]->(t3@`aircraft`)\nWHERE t1.`eid` = t2.`eid`\nAND t3.`aid` = t2.`aid`\nAND (t3.`name` = 'Boeing 737-800')\nRETURN t1.`name` AS `name` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`employee`)-[t2:`certified_to_fly`]->(t3@`aircraft`)\nWHERE t1.`eid` = t2.`eid`\nAND t3.`aid` = t2.`aid`\nAND (t3.`name` = 'Airbus A340-300')\nRETURN t1.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of all employees who can fly both the Boeing 737-800 and the Airbus A340-300?",
    "evidence": "",
    "idx": 1365
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "{MATCH (employee@`employee`)\nRETURN employee.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`employee`)-[t2:`certified_to_fly`]->(t3@`aircraft`)\nWHERE t1.`eid` = t2.`eid`\nAND t3.`aid` = t2.`aid`\nAND (t3.`name` = 'Boeing 737-800')\nRETURN t1.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of all employees who are not certified to fly Boeing 737-800s?",
    "evidence": "",
    "idx": 1367
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "{MATCH (student@`student`)\nRETURN student.`stuid` AS `stuid` \n} \nEXCEPT DISTINCT\n{MATCH ()-[has_allergy:`has_allergy`]->()\nRETURN has_allergy.`stuid` AS `stuid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the student ids of students who don't have any allergies?",
    "evidence": "",
    "idx": 1426
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "{MATCH (student@`student`)\nRETURN student.`stuid` AS `stuid` \n} \nEXCEPT DISTINCT\n{MATCH ()-[has_allergy:`has_allergy`]->()\nRETURN has_allergy.`stuid` AS `stuid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which students are unaffected by allergies?",
    "evidence": "",
    "idx": 1427
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "{MATCH (t1@`tracks`)-[t2:`in_playlist`]->(t3@`playlists`)\nWHERE t1.`id` = t2.`track_id`\nAND t2.`playlist_id` = t3.`id`\nAND (t3.`name` = 'Movies')\nRETURN t1.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`tracks`)-[t2:`in_playlist`]->(t3@`playlists`)\nWHERE t1.`id` = t2.`track_id`\nAND t2.`playlist_id` = t3.`id`\nAND (t3.`name` = 'Music')\nRETURN t1.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of all tracks that are on the Movies playlist but not in the music playlist?",
    "evidence": "",
    "idx": 1539
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "{MATCH (t1@`tracks`)-[t2:`in_playlist`]->(t3@`playlists`)\nWHERE t1.`id` = t2.`track_id`\nAND t2.`playlist_id` = t3.`id`\nAND (t3.`name` = 'Movies')\nRETURN t1.`name` AS `name` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`tracks`)-[t2:`in_playlist`]->(t3@`playlists`)\nWHERE t1.`id` = t2.`track_id`\nAND t2.`playlist_id` = t3.`id`\nAND (t3.`name` = 'Music')\nRETURN t1.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of all the tracks that are in both the Movies and music playlists?",
    "evidence": "",
    "idx": 1541
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "{MATCH (member@`member`)\nWHERE member.`age` < 30\nRETURN member.`address` AS `address` \n} \nINTERSECT DISTINCT\n{MATCH (member@`member`)\nWHERE member.`age` > 40\nRETURN member.`address` AS `address` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which address has both members younger than 30 and members older than 40?",
    "evidence": "",
    "idx": 1628
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "{MATCH (member@`member`)\nWHERE member.`address` = 'Hartford'\nRETURN member.`membership_card` AS `membership_card` \n} \nINTERSECT DISTINCT\n{MATCH (member@`member`)\nWHERE member.`address` = 'Waterbury'\nRETURN member.`membership_card` AS `membership_card` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What is the membership card held by both members living in Hartford and ones living in Waterbury address?",
    "evidence": "",
    "idx": 1629
  },
  {
    "filename": "train_spider.json",
    "db_id": "coffee_shop",
    "gql_statement": "{MATCH (member@`member`)\nRETURN member.`address` AS `address` \n} \nEXCEPT DISTINCT\n{MATCH (member@`member`)\nWHERE member.`membership_card` = 'Black'\nRETURN member.`address` AS `address` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which address do not have any member with the black membership card?",
    "evidence": "",
    "idx": 1631
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "{MATCH (customer@`customer`)\nRETURN customer.`lastname` AS `lastname` \n} \nEXCEPT DISTINCT\n{MATCH (t2@`invoice`)-[placed_by_0:`placed_by`]->(t1@`customer`)\nWHERE t1.`customerid` = t2.`customerid`\nAND (t2.`total` > 20)\nRETURN t1.`lastname` AS `lastname` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the last names of customers without invoice totals exceeding 20?",
    "evidence": "",
    "idx": 1679
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "{MATCH (artist@`artist`)\nRETURN artist.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`album`)-[by_artist_0:`by_artist`]->(t2@`artist`)\nWHERE t1.`artistid` = t2.`artistid`\nRETURN t2.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of artists who have not released any albums?",
    "evidence": "",
    "idx": 1693
  },
  {
    "filename": "train_spider.json",
    "db_id": "medicine_enzyme_interaction",
    "gql_statement": "{MATCH ()-[t2:`interacts_with_2`]->(t1@`medicine`)\nWHERE t2.`medicine_id` = t1.`id`\nAND (t2.`interaction_type` = 'inhibitor')\nRETURN t1.`name` AS `name`, t1.`trade_name` AS `trade_name` \n} \nINTERSECT DISTINCT\n{MATCH ()-[t2:`interacts_with_2`]->(t1@`medicine`)\nWHERE t2.`medicine_id` = t1.`id`\nAND (t2.`interaction_type` = 'activitor')\nRETURN t1.`name` AS `name`, t1.`trade_name` AS `trade_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the medicine and trade names that can interact as an inhibitor and activitor with enzymes?",
    "evidence": "",
    "idx": 1759
  },
  {
    "filename": "train_spider.json",
    "db_id": "medicine_enzyme_interaction",
    "gql_statement": "{MATCH (medicine@`medicine`)\nRETURN medicine.`name` AS `name`, medicine.`trade_name` AS `trade_name` \n} \nEXCEPT DISTINCT\n{MATCH (t3@`enzyme`)-[t2:`interacts_with_2`]->(t1@`medicine`)\nWHERE t2.`medicine_id` = t1.`id`\nAND t3.`id` = t2.`enzyme_id`\nAND (t3.`product` = 'Protoporphyrinogen IX')\nRETURN t1.`name` AS `name`, t1.`trade_name` AS `trade_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the medicine and trade names that cannot interact with the enzyme with the product 'Heme'?",
    "evidence": "",
    "idx": 1761
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "{MATCH ()-[t2:`from_country`]->(t1@`country`)\nWHERE t1.`country_id` = t2.`country`\nAND (t2.`position` = 'Forward')\nRETURN t1.`country_name` AS `country_name` \n} \nINTERSECT DISTINCT\n{MATCH ()-[t2:`from_country`]->(t1@`country`)\nWHERE t1.`country_id` = t2.`country`\nAND (t2.`position` = 'Defender')\nRETURN t1.`country_name` AS `country_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of countries that have both players with position forward and players with position defender?",
    "evidence": "",
    "idx": 1878
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "{MATCH ()-[match_season:`plays_for_2`]->()\nWHERE match_season.`position` = 'Midfielder'\nRETURN match_season.`college` AS `college` \n} \nINTERSECT DISTINCT\n{MATCH ()-[match_season:`plays_for_2`]->()\nWHERE match_season.`position` = 'Defender'\nRETURN match_season.`college` AS `college` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which college have both players with position midfielder and players with position defender?",
    "evidence": "",
    "idx": 1880
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "{MATCH (mountain@`mountain`)\nWHERE mountain.`height` > 5600\nRETURN mountain.`country` AS `country` \n} \nINTERSECT DISTINCT\n{MATCH (mountain@`mountain`)\nWHERE mountain.`height` < 5200\nRETURN mountain.`country` AS `country` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the countries that have both mountains that are higher than 5600 and lower than 5200?",
    "evidence": "",
    "idx": 1915
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "{MATCH (course@`course`)\nWHERE course.`dept_name` = 'Statistics'\nRETURN course.`title` AS `title` \n} \nINTERSECT DISTINCT\n{MATCH (course@`course`)\nWHERE course.`dept_name` = 'Psychology'\nRETURN course.`title` AS `title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What is the title of a course that is listed in both the Statistics and Psychology departments?",
    "evidence": "",
    "idx": 2083
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "{MATCH (course@`course`)\nWHERE course.`dept_name` = 'Statistics'\nRETURN course.`title` AS `title` \n} \nEXCEPT DISTINCT\n{MATCH (course@`course`)\nWHERE course.`dept_name` = 'Psychology'\nRETURN course.`title` AS `title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the titles of courses that are in the Statistics department but not the Psychology department?",
    "evidence": "",
    "idx": 2085
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "{MATCH ()-[teaches:`teaches`]->()\nWHERE teaches.`semester` = 'Fall' AND teaches.`year` = 2009\nRETURN teaches.`id` AS `id` \n} \nEXCEPT DISTINCT\n{MATCH ()-[teaches:`teaches`]->()\nWHERE teaches.`semester` = 'Spring' AND teaches.`year` = 2010\nRETURN teaches.`id` AS `id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of instructors who taught in the Fall of 2009 but not in the Spring of 2010?",
    "evidence": "",
    "idx": 2087
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "{MATCH (course@`course`)\nRETURN course.`course_id` AS `course_id` \n} \nEXCEPT DISTINCT\n{MATCH ()-[prereq:`has_prerequisite`]->()\nRETURN prereq.`course_id` AS `course_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Find the id of the courses that do not have any prerequisite?",
    "evidence": "",
    "idx": 2118
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "{MATCH (course@`course`)\nRETURN course.`course_id` AS `course_id` \n} \nEXCEPT DISTINCT\n{MATCH ()-[prereq:`has_prerequisite`]->()\nRETURN prereq.`course_id` AS `course_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of courses without prerequisites?",
    "evidence": "",
    "idx": 2119
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "{MATCH (instructor@`instructor`)\nRETURN instructor.`id` AS `id` \n} \nEXCEPT DISTINCT\n{MATCH ()-[teaches:`teaches`]->()\nRETURN teaches.`id` AS `id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Find the id of instructors who didn't teach any courses?",
    "evidence": "",
    "idx": 2142
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "{MATCH (instructor@`instructor`)\nRETURN instructor.`id` AS `id` \n} \nEXCEPT DISTINCT\n{MATCH ()-[teaches:`teaches`]->()\nRETURN teaches.`id` AS `id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of instructors who didnt' teach?",
    "evidence": "",
    "idx": 2143
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "{MATCH (section@`section`)\nWHERE section.`semester` = 'Fall' AND section.`year` = 2009\nRETURN section.`course_id` AS `course_id` \n} \nINTERSECT DISTINCT\n{MATCH (section@`section`)\nWHERE section.`semester` = 'Spring' AND section.`year` = 2010\nRETURN section.`course_id` AS `course_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids for courses that were offered in both Fall of 2009 and Spring of 2010?",
    "evidence": "",
    "idx": 2173
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "{MATCH (section@`section`)\nWHERE section.`semester` = 'Fall' AND section.`year` = 2009\nRETURN section.`course_id` AS `course_id` \n} \nEXCEPT DISTINCT\n{MATCH (section@`section`)\nWHERE section.`semester` = 'Spring' AND section.`year` = 2010\nRETURN section.`course_id` AS `course_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of courses offered in Fall of 2009 but not in Spring of 2010?",
    "evidence": "",
    "idx": 2175
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "{MATCH (customers@`customers`)\nRETURN customers.`customer_details` AS `customer_details` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`policies`)-[belongs_to_1_0:`belongs_to_1`]->(t2@`customers`)\nWHERE t1.`customer_id` = t2.`customer_id`\nRETURN t2.`customer_details` AS `customer_details` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of customers who do not have any policies?",
    "evidence": "",
    "idx": 2210
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "{MATCH (customers@`customers`)\nRETURN customers.`customer_id` AS `customer_id` \n} \nEXCEPT DISTINCT\n{MATCH (accounts@`accounts`)\nRETURN accounts.`customer_id` AS `customer_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the customer ids for customers who do not have an account?",
    "evidence": "",
    "idx": 2244
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "{MATCH (products@`products`)\nRETURN products.`product_name` AS `product_name` \n} \nEXCEPT DISTINCT\n{MATCH ()-[t2:`contains`]->(t1@`products`)\nWHERE t1.`product_id` = t2.`product_id`\nRETURN t1.`product_name` AS `product_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of products that have never been ordered?",
    "evidence": "",
    "idx": 2276
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "{MATCH (artist@`artist`)\nRETURN artist.`name` AS `name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`exhibition`)-[created_by_0:`created_by`]->(t2@`artist`)\nWHERE t1.`artist_id` = t2.`artist_id`\nAND (t1.`year` = 2004)\nRETURN t2.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of artists who did not have an exhibition in 2004?",
    "evidence": "",
    "idx": 2334
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "{MATCH (t1@`exhibition_record`)-[record_of_0:`record_of`]->(t2@`exhibition`)\nWHERE t1.`exhibition_id` = t2.`exhibition_id`\nAND (t1.`attendance` < 100)\nRETURN t2.`theme` AS `theme` \n} \nINTERSECT DISTINCT\n{MATCH (t1@`exhibition_record`)-[record_of_1:`record_of`]->(t2@`exhibition`)\nWHERE t1.`exhibition_id` = t2.`exhibition_id`\nAND (t1.`attendance` > 500)\nRETURN t2.`theme` AS `theme` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which themes have had corresponding exhibitions that have had attendance both below 100 and above 500?",
    "evidence": "",
    "idx": 2336
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "{MATCH (people@`people`)\nRETURN DISTINCT people.`hometown` AS `hometown` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`gymnast`)-[is_a_0:`is_a`]->(t2@`people`)\nWHERE t1.`gymnast_id` = t2.`people_id`\nRETURN DISTINCT t2.`hometown` AS `hometown` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "From which hometowns did no gymnasts come from?",
    "evidence": "",
    "idx": 2389
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_for_hire",
    "gql_statement": "{MATCH (t2@`customers`)-[has_coupon_0:`has_coupon`]->(t1@`discount_coupons`)\nWHERE t1.`coupon_id` = t2.`coupon_id`\nAND (t2.`good_or_bad_customer` = 'good')\nRETURN t1.`coupon_amount` AS `coupon_amount` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`customers`)-[has_coupon_1:`has_coupon`]->(t1@`discount_coupons`)\nWHERE t1.`coupon_id` = t2.`coupon_id`\nAND (t2.`good_or_bad_customer` = 'bad')\nRETURN t1.`coupon_amount` AS `coupon_amount` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the coupon amount of the coupons owned by both good and bad customers?",
    "evidence": "",
    "idx": 2502
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "{MATCH (company@`company`)\nWHERE company.`main_industry` = 'Banking'\nRETURN company.`headquarters` AS `headquarters` \n} \nINTERSECT DISTINCT\n{MATCH (company@`company`)\nWHERE company.`main_industry` = 'Oil and gas'\nRETURN company.`headquarters` AS `headquarters` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the headquarters that have both a company in the banking and 'oil and gas' industries?",
    "evidence": "",
    "idx": 2528
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "{MATCH (company@`company`)\nRETURN company.`headquarters` AS `headquarters` \n} \nEXCEPT DISTINCT\n{MATCH (company@`company`)\nWHERE company.`main_industry` = 'Banking'\nRETURN company.`headquarters` AS `headquarters` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the headquarters without companies that are in the banking industry?",
    "evidence": "",
    "idx": 2530
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_in_alabama",
    "gql_statement": "{MATCH (events@`events`)\nRETURN events.`event_id` AS `event_id` \n} \nEXCEPT DISTINCT\n{MATCH ()-[t1:`participates_in_2`]->(t2@`participants`)\nWHERE t1.`participant_id` = t2.`participant_id`\nAND (t2.`participant_details` = 'Kenyatta Kuhn')\nRETURN t1.`event_id` AS `event_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which events id does not have any participant with detail 'Kenyatta Kuhn'?",
    "evidence": "",
    "idx": 2599
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_in_alabama",
    "gql_statement": "{MATCH (t2@`events`)-[for_service_0:`for_service`]->(t1@`services`)\nWHERE t1.`service_id` = t2.`service_id`\nAND (t2.`event_details` = 'Success')\nRETURN t1.`service_type_code` AS `service_type_code` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`events`)-[for_service_1:`for_service`]->(t1@`services`)\nWHERE t1.`service_id` = t2.`service_id`\nAND (t2.`event_details` = 'Fail')\nRETURN t1.`service_type_code` AS `service_type_code` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which services type had both successful and failure event details?",
    "evidence": "",
    "idx": 2600
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "{MATCH (entrepreneur@`entrepreneur`)\nWHERE entrepreneur.`money_requested` > 140000\nRETURN entrepreneur.`investor` AS `investor` \n} \nINTERSECT DISTINCT\n{MATCH (entrepreneur@`entrepreneur`)\nWHERE entrepreneur.`money_requested` < 120000\nRETURN entrepreneur.`investor` AS `investor` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the investors who have invested in both entrepreneurs who requested more than 140000 and entrepreneurs who requested less than 120000?",
    "evidence": "",
    "idx": 2634
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "{MATCH (movie@`movie`)\nRETURN DISTINCT movie.`title` AS `title` \n} \nEXCEPT DISTINCT\n{MATCH (t3@`reviewer`)-[t1:`rated`]->(t2@`movie`)\nWHERE t1.`mid` = t2.`mid`\nAND t1.`rid` = t3.`rid`\nAND (t3.`name` = 'Chris Jackson')\nRETURN t2.`title` AS `title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the titles of all movies that were not reviewed by Chris Jackson?",
    "evidence": "",
    "idx": 2741
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "{MATCH ()-[rating:`rated`]->()\nRETURN rating.`mid` AS `mid` \n} \nEXCEPT DISTINCT\n{MATCH (t2@`reviewer`)-[t1:`rated`]->()\nWHERE t1.`rid` = t2.`rid`\nAND (t2.`name` = 'Brittany Harris')\nRETURN t1.`mid` AS `mid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of all moviest hat have not been reviewed by Britanny Harris?",
    "evidence": "",
    "idx": 2757
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "{MATCH ()-[rating:`rated`]->()\nRETURN rating.`rid` AS `rid` \n} \nEXCEPT DISTINCT\n{MATCH ()-[rating:`rated`]->()\nWHERE rating.`stars` = 4\nRETURN rating.`rid` AS `rid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of all reviewers who did not give 4 stars?",
    "evidence": "",
    "idx": 2759
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "{MATCH (t2@`reviewer`)-[t1:`rated`]->()\nWHERE t1.`rid` = t2.`rid`\nAND (t1.`stars` = 3)\nRETURN t2.`name` AS `name` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`reviewer`)-[t1:`rated`]->()\nWHERE t1.`rid` = t2.`rid`\nAND (t1.`stars` = 4)\nRETURN t2.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of reviewers who had rated 3 star and 4 star?",
    "evidence": "",
    "idx": 2766
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "{MATCH (t2@`reviewer`)-[t1:`rated`]->()\nWHERE t1.`rid` = t2.`rid`\nAND (t1.`stars` = 3)\nRETURN t2.`name` AS `name` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`reviewer`)-[t1:`rated`]->()\nWHERE t1.`rid` = t2.`rid`\nAND (t1.`stars` = 4)\nRETURN t2.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of all reviewers that have given 3 or 4 stars for reviews?",
    "evidence": "",
    "idx": 2767
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "{MATCH ()-[t1:`rated`]->(t2@`movie`)\nWHERE t1.`mid` = t2.`mid`\nAND (t1.`stars` = 3)\nRETURN t2.`title` AS `title` \n} \nINTERSECT DISTINCT\n{MATCH ()-[t1:`rated`]->(t2@`movie`)\nWHERE t1.`mid` = t2.`mid`\nAND (t1.`stars` = 4)\nRETURN t2.`title` AS `title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of movies that get 3 star and 4 star?",
    "evidence": "",
    "idx": 2768
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "{MATCH ()-[t1:`rated`]->(t2@`movie`)\nWHERE t1.`mid` = t2.`mid`\nAND (t1.`stars` = 3)\nRETURN t2.`title` AS `title` \n} \nINTERSECT DISTINCT\n{MATCH ()-[t1:`rated`]->(t2@`movie`)\nWHERE t1.`mid` = t2.`mid`\nAND (t1.`stars` = 4)\nRETURN t2.`title` AS `title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of all movies that received 3 or 4 stars?",
    "evidence": "",
    "idx": 2769
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "{MATCH (county_public_safety@`county_public_safety`)\nWHERE county_public_safety.`location` = 'East'\nRETURN county_public_safety.`police_force` AS `police_force` \n} \nINTERSECT DISTINCT\n{MATCH (county_public_safety@`county_public_safety`)\nWHERE county_public_safety.`location` = 'West'\nRETURN county_public_safety.`police_force` AS `police_force` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which police forces operate in both counties that are located in the East and in the West?",
    "evidence": "",
    "idx": 2803
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_mdm",
    "gql_statement": "{MATCH (cmi_cross_references@`cmi_cross_references`)\nRETURN cmi_cross_references.`cmi_cross_ref_id` AS `cmi_cross_ref_id` \n} \nEXCEPT DISTINCT\n{MATCH (parking_fines@`parking_fines`)\nRETURN parking_fines.`cmi_cross_ref_id` AS `cmi_cross_ref_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which cmi cross reference id is not related to any parking taxes?",
    "evidence": "",
    "idx": 2882
  }
]