[
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'monte carlo simulation' AND `t3`.`year` > 2011)\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "monte carlo simulation papers later than 2011",
    "evidence": "",
    "idx": 548
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'ras bodik')\nRETURN COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "does ras bodik publish a lot ?",
    "evidence": "",
    "idx": 552
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'David M. Blei' AND `t4`.`venuename` = 'AISTATS')\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers did David M. Blei publish at AISTATS ?",
    "evidence": "",
    "idx": 553
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'David M. Blei' AND `t4`.`venuename` = 'AISTATS')\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers does David M. Blei have in AISTATS ?",
    "evidence": "",
    "idx": 554
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'David M. Blei' AND `t4`.`venuename` = 'AISTATS')\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers has David M. Blei published in AISTATS ?",
    "evidence": "",
    "idx": 555
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'David M. Blei' AND `t4`.`venuename` = 'AISTATS')\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many David M. Blei papers are in AISTATS ?",
    "evidence": "",
    "idx": 558
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'David M. Blei' AND `t4`.`venuename` = 'AISTATS')\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers David M. Blei has in AISTATS ?",
    "evidence": "",
    "idx": 559
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`title` = 'machine networks for one shot learning'\nRETURN DISTINCT `paper`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all academic papers on machine networks for one shot learning",
    "evidence": "",
    "idx": 561
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`title` = 'machine networks for one shot learning'\nRETURN DISTINCT `paper`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "machine networks for one shot learning",
    "evidence": "",
    "idx": 562
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2010 AND `t2`.`venuename` = 'EMNLP')\nWITH `t3`.`citedpaperid` AS _groupby_col_0, COUNT(`t3`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which EMNLP 2010 papers have the most citations ?",
    "evidence": "",
    "idx": 563
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2010 AND `t2`.`venuename` = 'EMNLP')\nWITH `t3`.`citedpaperid` AS _groupby_col_0, COUNT(`t3`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which paper from EMNLP 2010 was cited most ?",
    "evidence": "",
    "idx": 564
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2010 AND `t2`.`venuename` = 'EMNLP')\nWITH `t3`.`citedpaperid` AS _groupby_col_0, COUNT(`t3`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which EMNLP 2010 papers have been cited the most ?",
    "evidence": "",
    "idx": 566
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'deep learning')\nRETURN DISTINCT COUNT(DISTINCT `t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers are in deep learning ?",
    "evidence": "",
    "idx": 567
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'deep learning')\nRETURN DISTINCT COUNT(DISTINCT `t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers are about deep learning ?",
    "evidence": "",
    "idx": 568
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'deep learning')\nRETURN DISTINCT COUNT(DISTINCT `t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many papers about deep learning ?",
    "evidence": "",
    "idx": 569
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'deep learning')\nRETURN DISTINCT COUNT(DISTINCT `t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers are related to deep learning ?",
    "evidence": "",
    "idx": 570
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Christopher D. Manning')\nRETURN DISTINCT COUNT(DISTINCT `t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers has Christopher D. Manning written ?",
    "evidence": "",
    "idx": 571
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Christopher D. Manning')\nRETURN DISTINCT COUNT(DISTINCT `t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers does Christopher D. Manning have ?",
    "evidence": "",
    "idx": 572
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Christopher D. Manning')\nRETURN DISTINCT COUNT(DISTINCT `t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers has Christopher D. Manning ?",
    "evidence": "",
    "idx": 573
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Christopher D. Manning')\nRETURN DISTINCT COUNT(DISTINCT `t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers has Christopher D. Manning published ?",
    "evidence": "",
    "idx": 574
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Christopher D. Manning')\nRETURN DISTINCT COUNT(DISTINCT `t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Has Christopher D. Manning published any papers ?",
    "evidence": "",
    "idx": 576
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Christopher D. Manning')\nRETURN DISTINCT COUNT(DISTINCT `t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many paper does Christopher D. Manning have ?",
    "evidence": "",
    "idx": 579
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Christopher D. Manning')\nRETURN DISTINCT COUNT(DISTINCT `t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many publications does Christopher D. Manning have ?",
    "evidence": "",
    "idx": 580
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t5`:`author`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t5`.`authorid`\nAND (`t5`.`authorname` = 'Luke Zettlemoyer')\nRETURN DISTINCT `t1`.`keyphraseid` AS `keyphraseid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what kind of papers does Luke Zettlemoyer publish",
    "evidence": "",
    "idx": 583
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t5`:`author`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t5`.`authorid`\nAND (`t5`.`authorname` = 'Luke Zettlemoyer')\nRETURN DISTINCT `t1`.`keyphraseid` AS `keyphraseid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What keywords are in papers by Luke Zettlemoyer ?",
    "evidence": "",
    "idx": 585
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t5`:`author`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t5`.`authorid`\nAND (`t5`.`authorname` = 'Luke Zettlemoyer')\nRETURN DISTINCT `t1`.`keyphraseid` AS `keyphraseid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What topic does Luke Zettlemoyer write about ?",
    "evidence": "",
    "idx": 591
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'Daniella Coelho')\nRETURN DISTINCT `t3`.`venueid` AS `venueid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "conferences that Daniella Coelho has published in",
    "evidence": "",
    "idx": 597
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nRETURN DISTINCT COUNT(DISTINCT `paper`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers are there ?",
    "evidence": "",
    "idx": 603
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t1:has_keyphrase]->(`t4`:`keyphrase`)\nMATCH ()-[t3:written_by]->(`t2`:`author`)\nWHERE `t1`.`keyphraseid` = `t4`.`keyphraseid`\nAND `t3`.`paperid` = `t1`.`paperid`\nAND `t3`.`authorid` = `t2`.`authorid`\nAND (`t2`.`authorname` = 'Ed Desmond' AND `t4`.`keyphrasename` = 'Semantic Parsing')\nRETURN DISTINCT COUNT(DISTINCT `t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers by Ed Desmond contain the keyphrases Semantic Parsing ?",
    "evidence": "",
    "idx": 604
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t1:has_keyphrase]->(`t4`:`keyphrase`)\nMATCH ()-[t3:written_by]->(`t2`:`author`)\nWHERE `t1`.`keyphraseid` = `t4`.`keyphraseid`\nAND `t3`.`paperid` = `t1`.`paperid`\nAND `t3`.`authorid` = `t2`.`authorid`\nAND (`t2`.`authorname` = 'Ed Desmond' AND `t4`.`keyphrasename` = 'Semantic Parsing')\nRETURN DISTINCT COUNT(DISTINCT `t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers does Ed Desmond have in Semantic Parsing area ?",
    "evidence": "",
    "idx": 605
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t1:has_keyphrase]->(`t4`:`keyphrase`)\nMATCH ()-[t3:written_by]->(`t2`:`author`)\nWHERE `t1`.`keyphraseid` = `t4`.`keyphraseid`\nAND `t3`.`paperid` = `t1`.`paperid`\nAND `t3`.`authorid` = `t2`.`authorid`\nAND (`t2`.`authorname` = 'Ed Desmond' AND `t4`.`keyphrasename` = 'Semantic Parsing')\nRETURN DISTINCT COUNT(DISTINCT `t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many Semantic Parsing papers has Ed Desmond written ?",
    "evidence": "",
    "idx": 606
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH ()-[t1:has_keyphrase]->(`t4`:`keyphrase`)\nMATCH ()-[t3:written_by]->(`t2`:`author`)\nWHERE `t1`.`keyphraseid` = `t4`.`keyphraseid`\nAND `t3`.`paperid` = `t1`.`paperid`\nAND `t3`.`authorid` = `t2`.`authorid`\nAND (`t2`.`authorname` = 'Ed Desmond' AND `t4`.`keyphrasename` = 'Semantic Parsing')\nRETURN DISTINCT COUNT(DISTINCT `t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many paper has Ed Desmond written about Semantic Parsing ?",
    "evidence": "",
    "idx": 607
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'li dong' AND `t3`.`year` = 2016)\nRETURN DISTINCT `t3`.`venueid` AS `venueid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where did li dong publish in 2016",
    "evidence": "",
    "idx": 609
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'Parsing' AND `t3`.`year` = 2012 AND `t4`.`venuename` = 'acl')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "acl papers in 2012 on Parsing",
    "evidence": "",
    "idx": 612
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'Parsing' AND `t3`.`year` = 2012 AND `t4`.`venuename` = 'acl')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What papers were published in acl in 2012 about Parsing ?",
    "evidence": "",
    "idx": 613
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'Parsing' AND `t3`.`year` = 2012 AND `t4`.`venuename` = 'acl')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What papers were published at acl in 2012 were about Parsing ?",
    "evidence": "",
    "idx": 619
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'Parsing' AND `t3`.`year` = 2012 AND `t4`.`venuename` = 'acl')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many Parsing papers did acl 2012 have ?",
    "evidence": "",
    "idx": 621
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'Parsing' AND `t3`.`year` = 2012 AND `t4`.`venuename` = 'acl')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which papers in acl 2012 had Parsing in them ?",
    "evidence": "",
    "idx": 623
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'Parsing' AND `t3`.`year` = 2012 AND `t4`.`venuename` = 'acl')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what were some Parsing based papers in acl 2012 ?",
    "evidence": "",
    "idx": 624
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'dependent types')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the popular publications on dependent types",
    "evidence": "",
    "idx": 625
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'Question Answering')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List papers that has a keyword Question Answering",
    "evidence": "",
    "idx": 628
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t2:has_keyphrase]->()\nWHERE `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Luke S Zettlemoyer')\nRETURN DISTINCT `t2`.`keyphraseid` AS `keyphraseid`, `t3`.`year` AS `year` ORDER BY `t3`.`year` IS NULL DESC, `t3`.`year` , `t2`.`keyphraseid` IS NULL DESC, `t2`.`keyphraseid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "keyphrases used by Luke S Zettlemoyer for each year",
    "evidence": "",
    "idx": 651
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t5`:`author`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t5`.`authorid`\nAND (`t5`.`authorname` = 'sanjeev arora')\nRETURN DISTINCT `t1`.`keyphrasename` AS `keyphrasename`, `t3`.`year` AS `year` ORDER BY `t3`.`year` IS NULL ASC, `t3`.`year` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "recent research interests of sanjeev arora",
    "evidence": "",
    "idx": 652
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'balakrishnan prabhakaran')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`, `t3`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list papers published by balakrishnan prabhakaran",
    "evidence": "",
    "idx": 655
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'zachary tatlock')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`, `t3`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "citation count of zachary tatlock 's papers",
    "evidence": "",
    "idx": 656
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'subhasis chaudhuri')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "subhasis chaudhuri",
    "evidence": "",
    "idx": 657
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'parsing' AND `t3`.`year` = 2014 AND `t4`.`venuename` = 'ACL')\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many parsing papers in ACL 2014",
    "evidence": "",
    "idx": 661
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'parsing' AND `t3`.`year` = 2014 AND `t4`.`venuename` = 'ACL')\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many parsing papers appeared in the proceeeding of ACL 2014 ?",
    "evidence": "",
    "idx": 662
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'parsing' AND `t3`.`year` = 2014 AND `t4`.`venuename` = 'ACL')\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many parsing papers were published at ACL 2014 ?",
    "evidence": "",
    "idx": 663
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'brian curless' AND `t5`.`keyphrasename` = 'convolution')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`, `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "brian curless convolution paper",
    "evidence": "",
    "idx": 664
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'brian curless' AND `t5`.`keyphrasename` = 'convolution')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`, `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the papers of brian curless in convolution ?",
    "evidence": "",
    "idx": 668
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'brian curless' AND `t5`.`keyphrasename` = 'convolution')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`, `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the paper about convolution from brian curless ?",
    "evidence": "",
    "idx": 671
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'brian curless' AND `t5`.`keyphrasename` = 'convolution')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`, `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What papers has brian curless written on convolution ?",
    "evidence": "",
    "idx": 675
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'brian curless' AND `t5`.`keyphrasename` = 'convolution')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`, `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What papers has brian curless written about convolution ?",
    "evidence": "",
    "idx": 676
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'brian curless' AND `t5`.`keyphrasename` = 'convolution')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`, `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Does brian curless do convolution ?",
    "evidence": "",
    "idx": 678
  }
]