[
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t3`:`player_allstar`)\nMATCH (`t1`:`players_teams`)-[for_team_0:for_team]->(`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND `t3`.`playerid` = `t1`.`playerid`\nAND (`t3`.`season_id` = 1997)\nORDER BY `t1`.`rebounds` IS NULL ASC, `t1`.`rebounds` DESC \nRETURN `t2`.`tmid` AS `tmid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the year 1997 allstar game, which teams did the players had the most rebounds play in? List their team ids.",
    "evidence": "in 1997 refers to year = 1997; the most rebounds refers to max(rebounds); team id refers to tmID",
    "idx": 2179
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players`)\nMATCH (`t2`:`players_teams`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`pos` = 'C-F-G')\nWITH `t2`.`playerid` AS _groupby_col_0, `t2`.`year` AS _groupby_col_1, sum(`t2`.`points`) AS _groupby_col_2\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_2 AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the latest passing player who could play all the positions in the court, how many points did he have in his career?",
    "evidence": "the latest passing refers to max(season_id); play all the positions refers to pos like '%C%' or pos like '%F%' or pos like '%G%'",
    "idx": 2180
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players`)\nMATCH (`t2`:`players_teams`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`gp` = 82 AND `t2`.`year` = 1995)\nORDER BY `t2`.`turnovers` IS NULL ASC, `t2`.`turnovers` DESC \nRETURN `t1`.`firstname` AS `firstname`, `t1`.`middlename` AS `middlename`, `t1`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all the full attendence players in 1995, which player had most turnovers? Give the full name of the player.",
    "evidence": "full attendance refers to GP = 82; in 1995 refers to year = 1995; the most turnovers refers to max(turnovers); full name refers to first_name, last_name",
    "idx": 2182
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`players_teams`)-[for_team_0:for_team]->(`t1`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` = 2011 AND `t2`.`gp` = `t2`.`gs`)\nWITH `t1`.`tmid` AS _groupby_col_0, `t2`.`steals` AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `tmid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the player in 2011 who started every game he played, which team had the player who had the most steals?",
    "evidence": "in 2011 refers to year = 2011; started every game refers to GP = GS; the most steals refers to max(steals); team refers to tmID",
    "idx": 2183
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`players_teams`)-[for_team_0:for_team]->(`t1`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t2`.`gp` = `t2`.`gs`)\nRETURN DISTINCT `t1`.`tmid` AS `tmid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team had the most same starting players througout the season? Give the full name of the team.",
    "evidence": "the same starting player refers to GP = GS; full name of the team refers to teams.name",
    "idx": 2184
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "CALL(*) {\nMATCH (`players_teams_sub0`:`players_teams`)\nWHERE `players_teams_sub0`.`year` = 2001\nWITH `players_teams_sub0`.`playerid` AS _groupby_col_0, sum(`players_teams_sub0`.`rebounds` + `players_teams_sub0`.`drebounds`) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `playerid`  LIMIT 1\n}\nMATCH (`players`:`players`)\nWHERE `players`.`playerid` = `playerid`\nRETURN `players`.`birthdate` AS `birthdate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the 2001 rebounds leader in the league, when was his birthday?",
    "evidence": "2001 refers to year = 2001; rebounds leader refers to max(rebounds); birthday refers to birthDate",
    "idx": 2185
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`players_teams`)-[for_team_0:for_team]->(`t1`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` = 2011 AND `t2`.`rebounds` > 600)\nRETURN `t1`.`tmid` AS `tmid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team had more than one player who grabbed more than 600 rebounds in 2011? Give the full name of the team.",
    "evidence": "more than one player refers to count(playerID) > 1; grabbed more than 600 rebounds refers to rebounds > 600; in 2011 refers to 2011; full name refers to teams.name",
    "idx": 2186
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`characters`)\nMATCH (`t1`:`paragraphs`)\nWHERE `t1`.`character_id` = `t2`.`id`\nAND (`t2`.`description` = 'son to Tamora')\nRETURN `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the paragraphs in which the character \"son to Tamora\" appears.",
    "evidence": "character \"son to Tamora\"  refers to characters.Description = 'son to Tamora'",
    "idx": 2192
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`characters`:`characters`)\nWHERE `characters`.`charname` = 'Earl of Westmoreland'\nRETURN DISTINCT `characters`.`abbrev` AS `abbrev`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the abbreviation name for the character \"Earl of Westmoreland\".",
    "evidence": "abbreviation name refers to Abbrev; character \"Earl of Westmoreland\" refers to CharName = 'Earl of Westmoreland'",
    "idx": 2197
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`chapters`)\nMATCH (`t2`:`paragraphs`)\nWHERE `t1`.`id` = `t2`.`chapter_id`\nORDER BY `t2`.`paragraphnum` IS NULL ASC, `t2`.`paragraphnum` DESC \nRETURN `t1`.`description` AS `description`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which chapter has the most paragraphs? Give the description of the chapter.",
    "evidence": "most paragraphs refers to max(count(chapter_id))",
    "idx": 2198
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t2`.`plaintext` = 'Would he do so, I\\'ld beg your precious mistress,Which he counts but a trifle.')\nRETURN `t1`.`charname` AS `charname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which character was mentioned in the paragraph \"Would he do so, I'ld beg your precious mistress, Which he counts but a trifle.\"? Give the character name.",
    "evidence": "paragraph \"Would he do so, I'ld beg your precious mistress, Which he counts but a trifle.\"  refers to PlainText = 'Would he do so, I'ld beg your precious mistress, Which he counts but a trifle.'",
    "idx": 2199
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t2`.`id` = '640171')\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the description for the character mentioned in paragraph No.640171?",
    "evidence": "paragraph No.640171 refers to paragraphs.id = '640171'",
    "idx": 2200
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`works`)\nMATCH (`t2`:`chapters`)\nWHERE `t1`.`id` = `t2`.`work_id`\nAND (`t2`.`act` = '2' AND `t2`.`scene` = '2' AND `t1`.`title` = 'Midsummer Night\\'s Dream')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the description for the Act No.2, Scene No.2 of Midsummer Night's Dream.",
    "evidence": "Act No.2 refers to Act = '2'; Scene No.2  refers to Scene = '2'; Midsummer Night's Dream refers to Title = 'Midsummer Night''s Dream'",
    "idx": 2203
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`works`)\nMATCH (`t2_sub0`:`chapters`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`work_id`\nAND (`t1_sub0`.`genretype` = 'Tragedy')\nWITH `t1_sub0`.`longtitle` AS _groupby_col_0, `t2_sub0`.`scene` AS _groupby_col_1, COUNT(`t2_sub0`.`scene`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `longtitle`, _groupby_col_2 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `longtitle`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which Shakespeare tragedy has the most scenes? Give the long title.",
    "evidence": "tragedy refers to GenreType = 'Tragedy'; most scenes refers to max(count(Scene))",
    "idx": 2204
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`chapters`)\nMATCH (`t2`:`paragraphs`)\nWHERE `t1`.`id` = `t2`.`chapter_id`\nAND (`t1`.`description` = 'A Sea-port in Cyprus. An open place near the quay.')\nRETURN sum(`t2`.`paragraphnum`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many paragraphs are there in the scene whose description is \"A Sea-port in Cyprus. An open place near the quay.\"?",
    "evidence": "",
    "idx": 2205
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`chapters`)\nMATCH (`t2`:`works`)\nWHERE `t1`.`work_id` = `t2`.`id`\nAND (`t2`.`date` = '1594')\nRETURN CASE WHEN COUNT(`t1`.`scene`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`genretype` = 'Tragedy' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`scene`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of all scenes are tragic scenes in Shakespeare's work in 1594?",
    "evidence": "tragic scenes refers to GenreType = 'Tragedy'; work in 1594 refers to Date = '1594'; percentage = divide((sum(Scene) when GenreType = 'Tragedy'), count(Scene))as percentage",
    "idx": 2206
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`chapters`)\nMATCH (`t2`:`works`)\nWHERE `t1`.`work_id` = `t2`.`id`\nAND (`t2`.`date` = '1599')\nRETURN CASE WHEN COUNT(DISTINCT `t2`.`id`)=0 THEN NULL ELSE toFloat(COUNT(`t1`.`id`)) / COUNT(DISTINCT `t2`.`id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Gives the average number of chapters in Shakespeare's 1599 work.",
    "evidence": "1599 work refers to Date = '1599'; average number refers to divide(count(chapters.id), count(works.id))",
    "idx": 2207
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`paragraphs`:`paragraphs`)\nWHERE `paragraphs`.`plaintext` = 'Ay, surely, mere the truth: I know his lady.'\nRETURN `paragraphs`.`paragraphnum` AS `paragraphnum`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many paragraphs are there in \"Ay, surely, mere the truth: I know his lady.\"?",
    "evidence": "\"Ay, surely, mere the truth: I know his lady.\" refers to PlainText = 'Ay, surely, mere the truth: I know his lady.'",
    "idx": 2214
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`chapters`)\nMATCH (`t2`:`works`)\nWHERE `t1`.`work_id` = `t2`.`id`\nAND (`t1`.`description` = 'A field near Windsor.')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which of Shakespeare's work has chapter description of \"A field near Windsor\"?",
    "evidence": "",
    "idx": 2219
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`paragraphs`)\nMATCH (`t2`:`chapters`)\nWHERE `t1`.`chapter_id` = `t2`.`id`\nAND (`t1`.`plaintext` = 'His name, I pray you.' AND `t2`.`description` = 'Florence. Without the walls. A tucket afar off.')\nRETURN `t1`.`character_id` AS `character_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In \"Florence. Without the walls. A tucket afar off\", what is the id of the character that was mentioned in \"His name, I pray you.\"?",
    "evidence": "\"Florence. Without the walls. A tucket afar off\" refers to chapters.Description = 'Florence. Without the walls. A tucket afar off.'; \"His name, I pray you.\" refers to PlainText = 'His name, I pray you.'",
    "idx": 2221
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`works`)\nMATCH (`t2`:`chapters`)\nWHERE `t1`.`id` = `t2`.`work_id`\nAND (`t2`.`act` = 5 AND `t1`.`longtitle` = 'History of Henry VIII')\nRETURN sum(`t2`.`scene`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many scenes are there in the 5th act of \"History of Henry VIII\"?",
    "evidence": "5th act refers to Act = 5; \"History of Henry VIII\" refers to LongTitle = 'History of Henry VIII'",
    "idx": 2222
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`paragraphs`:`paragraphs`)\nWHERE `paragraphs`.`plaintext` = 'This is Illyria, lady.'\nRETURN `paragraphs`.`paragraphnum` AS `paragraphnum`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the paragraph number with plain text \"This is Illyria, lady\"?",
    "evidence": "paragraph number refers to ParagraphNum",
    "idx": 2230
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`works`:`works`)\nWHERE `works`.`genretype` = 'History'\nRETURN `works`.`title` AS `title`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down any 5 titles in the history genre.",
    "evidence": "in the history genre refers to GenreType = 'History'",
    "idx": 2232
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t2`.`chapter_id` = 18710)\nRETURN DISTINCT `t1`.`charname` AS `charname`, `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the character names and descriptions of chapter ID 18710.",
    "evidence": "character names refers to CharName",
    "idx": 2234
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`works`)\nMATCH (`t2`:`chapters`)\nWHERE `t1`.`id` = `t2`.`work_id`\nAND (`t1`.`title` = 'Midsummer Night\\'s Dream')\nRETURN COUNT(`t2`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many chapters are there in \"Midsummer Night's Dream\"?",
    "evidence": "in \"Midsummer Night's Dream\" refers to Title = 'Midsummer Night's Dream'",
    "idx": 2235
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t1`.`charname` = 'First Witch')\nRETURN COUNT(`t2`.`chapter_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many chapters include the character name \"First Witch\"?",
    "evidence": "character name \"First Witch\" refers to CharName = 'First Witch'",
    "idx": 2236
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`works`)\nMATCH (`t2`:`chapters`)\nWHERE `t1`.`id` = `t2`.`work_id`\nAND (`t1`.`longtitle` = 'Pericles, Prince of Tyre' AND `t2`.`act` = 1)\nRETURN `t2`.`scene` AS `scene`, `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the scenes and descriptions in Act 1 of \" Pericles, Prince of Tyre\".",
    "evidence": "\" Pericles, Prince of Tyre\" refers to LongTitle = 'Pericles, Prince of Tyre'",
    "idx": 2237
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`works`)\nMATCH (`t2`:`chapters`)\nWHERE `t1`.`id` = `t2`.`work_id`\nAND (`t2`.`description` = 'The house of ANTIPHOLUS of Ephesus.')\nRETURN `t2`.`act` AS `act`, `t2`.`scene` AS `scene`, `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the scene number, act, and title of work which had the description of \"The house of ANTIPHOLUS of Ephesus\" in chapter.",
    "evidence": "",
    "idx": 2238
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t1`.`description` = 'cousin to the king')\nRETURN `t1`.`charname` AS `charname`, `t2`.`paragraphnum` AS `paragraphnum`, `t2`.`plaintext` AS `plaintext`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the character name, paragraph number, and plain text of \"cousin to the king\" description.",
    "evidence": "character name refers to CharName; paragraph number refers to ParagraphNum",
    "idx": 2239
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`works`)\nMATCH (`t2`:`chapters`)\nWHERE `t1`.`id` = `t2`.`work_id`\nAND (`t1`.`title` = 'Antony and Cleopatra')\nRETURN CASE WHEN COUNT(`t2`.`act`)=0 THEN NULL ELSE toFloat(sum(`t2`.`scene`)) / COUNT(`t2`.`act`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate average scene per act in Antony and Cleopatra.",
    "evidence": "Antony and Cleopatra refers to Title = 'Antony and Cleopatra'; average scene per act = divide(sum(Scene), count(act))\n",
    "idx": 2240
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`characters`:`characters`)\nWHERE `characters`.`abbrev` = 'All'\nRETURN COUNT(`characters`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many \"all\" character names have the \"all\" abbreviation?",
    "evidence": "character names refers to CharName；\"all\" abbreviation refers to Abbrev = 'all'",
    "idx": 2241
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`works`:`works`)\nWHERE `works`.`genretype` = 'comedy'\nRETURN `works`.`title` AS `title`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please name any three comedic works.",
    "evidence": "comedic works refers to GenreType = 'comedy'",
    "idx": 2242
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`works`:`works`)\nWHERE `works`.`genretype` = 'History'\nORDER BY `works`.`date` IS NULL ASC, `works`.`date` DESC \nRETURN `works`.`longtitle` AS `longtitle`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please name the latest historical work.",
    "evidence": "name refers to LongTitle; latest historical work refers to GenreType = 'History' and max(Date)",
    "idx": 2244
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`works`)\nMATCH (`t2`:`chapters`)\nWHERE `t1`.`id` = `t2`.`work_id`\nAND (`t1`.`longtitle` = 'Cymbeline, King of Britain')\nRETURN COUNT(`t2`.`scene`) AS `cnt`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many scenes can be found in \"Twelfth Night, Or What You Will\"?",
    "evidence": "\"Twelfth Night, Or What You Will\" refers to LongTitle",
    "idx": 2248
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t2`.`paragraphnum` = 20)\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all of the character descriptions in paragraph 20.",
    "evidence": "paragraph 20 refers to ParagraphNum = 20",
    "idx": 2249
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t1`.`charname` = 'Gratiano' AND `t1`.`description` = 'friend to Antonio and Bassiano')\nRETURN COUNT(DISTINCT `t2`.`chapter_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many chapters have the name Gratiano as a character for \"friend to Antonio and Bassiano\"?",
    "evidence": "name Gratiano as a character refers to CharName = 'Gratiano'; \"friend to Antonio and Bassiano\" refers to characters.Description = 'friend to Antonio and Bassiano'",
    "idx": 2250
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`works`)\nMATCH (`t2`:`chapters`)\nWHERE `t1`.`id` = `t2`.`work_id`\nAND (`t2`.`id` = 18706 AND `t1`.`title` = 'All\\'s Well That Ends Well')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the description of chapter 18706 in \"All's Well That Ends Well\"?",
    "evidence": "chapter 18706 refers to chapters.id; \"All's Well That Ends Well\" refers to Title = 'All's Well That Ends Well'",
    "idx": 2251
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t1`.`charname` = 'Aedile')\nRETURN `t2`.`paragraphnum` AS `paragraphnum`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all of the paragraphs that have the character name Aedile.",
    "evidence": "paragraphs  refers to ParagraphNum; character name Aedile refers to CharName = 'Aedile'",
    "idx": 2253
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t2`.`chapter_id` = 18708)\nRETURN `t1`.`charname` AS `charname`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any two character names in chapter 18708.",
    "evidence": "character names refers to CharName; chapter 18708 refers to chapter_id = 18708",
    "idx": 2254
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`chapters`)\nOPTIONAL MATCH (`t2`:`works`)\nWHERE `t2`.`genretype` = 'Comedy' AND `t2`.`title` = 'Two Gentlemen of Verona'\nAND `t1`.`work_id` = `t2`.`id`\nRETURN COUNT(`t1`.`act`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many acts can be found in the comedy \"Two Gentlemen of Verona\"?",
    "evidence": "comedy refers to GenreType = 'comedy'; \"Two Gentlemen of Verona\" refers to Title = 'Two Gentlemen of Verona'",
    "idx": 2255
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`works`:`works`)\nWHERE `works`.`title` =~ '(?i)(?s).*Henry.*'\nRETURN COUNT(`works`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the works of Shakespeare, how many of them have the word \"Henry\" on its title?",
    "evidence": "works refers to Title; have the word \"Henry\" on its title refers to Title = '%Henry%'",
    "idx": 2258
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`paragraphs`:`paragraphs`)\nWHERE `paragraphs`.`plaintext` = 'O my poor brother! and so perchance may he be.'\nRETURN `paragraphs`.`character_id` AS `character_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the character's ID of the character that said the paragraph \"O my poor brother! and so perchance may he be.\"",
    "evidence": "\"O my poor brother! and so perchance may he be.\" refers to  PlainText = 'O my poor brother! and so perchance may he be.'",
    "idx": 2259
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t1`.`charname` = 'Sir Andrew Aguecheek')\nRETURN `t2`.`paragraphnum` AS `paragraphnum`, `t2`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the paragraph number and paragraphs said by the character named \"Sir Andrew Aguecheek\".",
    "evidence": "paragraph number refers to ParagraphNum; character named \"Sir Andrew Aguecheek\" refers to CharName = 'Sir Andrew Aguecheek'",
    "idx": 2260
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t2`.`plaintext` = 'a sea captain, friend to Sebastian' AND `t2`.`paragraphnum` >= 1500 AND `t2`.`paragraphnum` <= 1950)\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among paragraphs with paragraph number between 1900 to 1950, list the texts said by a character described as a sea captain, friend to Sebatian.",
    "evidence": "paragraph number between 1900 to 1950 refers to ParagraphNum > = 1500 AND ParagraphNum < = 1950; texts refers to PlainText; a character described as a sea captain, friend to Sebatian refers to characters.Description = 'a sea captain, friend to Sebastian'",
    "idx": 2261
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`chapters`)\nOPTIONAL MATCH (`t1`:`works`)\nWHERE `t2`.`description` = 'Mytilene. A street before the brothel.'\nAND `t1`.`id` = `t2`.`work_id`\nRETURN `t1`.`longtitle` AS `longtitle`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the long title of the Shakespeare's work with Act 4 Scene 5 described as \"Mytilene. A street before the brothel.\"?",
    "evidence": "described as \"Mytilene. A street before the brothel.\" refers to chapters.Description = 'Mytilene. A street before the brothel.'",
    "idx": 2262
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t2`:`paragraphs`)\nMATCH (`t1`:`characters`)\nWHERE `t1`.`id` = `t2`.`character_id`\nAND (`t2`.`plaintext` = 'This is Illyria, lady.')\nRETURN `t1`.`charname` AS `charname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the character that said \"This is Illyria, lady.\"?",
    "evidence": "character refers to CharName; \"This is Illyria, lady.\" refers to PlainText = 'This is Illyria, lady.'",
    "idx": 2263
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (`t1`:`chapters`)\nMATCH (`t2`:`paragraphs`)\nWHERE `t1`.`id` = `t2`.`chapter_id`\nAND (`t2`.`plaintext` = 'Fear not thou, man, thou shalt lose nothing here.')\nRETURN `t2`.`character_id` AS `character_id`, `t1`.`work_id` AS `work_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the character and work ID of the text \"Fear not thou, man, thou shalt lose nothing here.\"?",
    "evidence": "character refers to chapter_id; text \"Fear not thou, man, thou shalt lose nothing here.\"  refers to PlainText = 'Fear not thou, man, thou shalt lose nothing here.'",
    "idx": 2265
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`cylinders` = 8)\nORDER BY `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t1`.`car_name` AS `car_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cars with 8 cylinders, what is the name of the one that's the most expensive?",
    "evidence": "with 8 cylinders refers to cylinders = 8; name of the car refers to car_name; the most expensive refers to max(price)",
    "idx": 2267
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`weight` > 3000 AND `t2`.`price` < 30000)\nRETURN COUNT(`t1`.`car_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cars over 3000lbs, how many of them cost less than $30000?",
    "evidence": "over 3000lbs refers to weight > 3000; cost less than $30000 refers to price < 30000",
    "idx": 2268
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t1`.`acceleration` AS `acceleration`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the acceleration of the most expensive car?",
    "evidence": "the most expensive refers to max(price)",
    "idx": 2269
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'ford torino')\nRETURN `t2`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much US dollars does a Ford Torino cost?",
    "evidence": "cost refers to price; Ford Torino refers to car_name = 'ford torino'",
    "idx": 2270
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t1`.`car_name` = 'ford torino' AND `t2`.`model_year` = 1970)\nRETURN `t3`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the origin country of the car model ford torino produced in 1970?",
    "evidence": "origin country refers to country; Ford Torino refers to car_name = 'ford torino'; produced in 1970 refers to model_year = 1970",
    "idx": 2271
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`production`)-[produced_in_0:produced_in]->(`t2`:`country`)\nWHERE `t1`.`country` = `t2`.`origin`\nAND (`t1`.`model_year` = 1970 AND `t2`.`country` = 'USA')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the car models introduced in the market in 1970, how many of them have the USA as their origin country?",
    "evidence": "introduced in the market in 1970 refers to model_year = 1970; have the USA as origin country refers to country = 'USA'",
    "idx": 2272
  }
]