[
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (conference@`conference`)\nORDER BY char_length(conference.`fullname`) DESC NULLS LAST \nRETURN conference.`fullname` AS `fullname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which conference has the longest name?",
    "evidence": "the longest name refers to MAX(length(FullName))",
    "idx": 1966
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (author@`author`)\nWHERE author.`affiliation` = 'NASA Langley Research Center'\nRETURN COUNT(author.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many authors are affiliated with NASA Langley Research Center?",
    "evidence": "NASA Langley Research Center is the Affiliation",
    "idx": 1967
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (journal@`journal`)\nWHERE journal.`shortname` = ''\nRETURN COUNT(journal.`shortname`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many journals don’t have a short name?",
    "evidence": "don’t have a short name means ShortName is null",
    "idx": 1968
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (paper@`paper`)\nWHERE paper.`conferenceid` = 0 AND paper.`journalid` = 0\nRETURN COUNT(paper.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the papers are preprinted?",
    "evidence": "year = 0 means this paper is preprint; papers refers to Paper.Id",
    "idx": 1969
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t2@`paper`)-[published_in_0:`published_in`]->(t1@`journal`)\nWHERE t1.`id` = t2.`journalid`\nAND (t1.`shortname` = 'TUBERCLE LUNG DIS')\nORDER BY t2.`year`  NULLS FIRST \nRETURN t2.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which paper published by the \"TUBERCLE LUNG DIS\" journal is the oldest?",
    "evidence": "paper refers to Title; TUBERCLE LUNG DIS is the ShortName of journal; the oldest refers to MIN(Year)",
    "idx": 1970
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t2@`paper`)-[presented_at_0:`presented_at`]->(t1@`conference`)\nWHERE t1.`id` = t2.`conferenceid`\nAND (t1.`fullname` = 'Virtual Reality, IEEE Annual International Symposium' AND t2.`year` = 2012)\nRETURN COUNT(t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many papers were published by the \"Virtual Reality, IEEE Annual International Symposium\" conference in 2012?",
    "evidence": "'Virtual Reality, IEEE Annual International Symposium' is the FullName of conference; in 2012 refers to Year = 2012;",
    "idx": 1972
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored_by`]->(t2@`author`)\nWHERE t1.`authorid` = t2.`id`\nAND (t2.`name` = 'Mark A. Musen')\nRETURN t1.`affiliation` AS `affiliation`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the affiliations of the author \"Mark A. Musen\" written on and off paper?",
    "evidence": "Mark A. Musen refer to Author.Name;",
    "idx": 1974
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored_by`]->(t2@`author`)\nWHERE t1.`authorid` = t2.`id`\nAND (t2.`name` = 'Randall Davis' AND t1.`name` <> 'Randall Davis')\nRETURN DISTINCT t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the different ways the name of the author, Randall Davis, is written on their papers?",
    "evidence": "Randall Davis refer to Author.Name",
    "idx": 1977
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (author@`author`)\nWHERE author.`id` = 1722\nRETURN author.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of author with the ID of 1722?",
    "evidence": "",
    "idx": 1980
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (paper@`paper`)\nWHERE paper.`year` = 0 OR (paper.`conferenceid` = 0 AND paper.`journalid` = 0)\nRETURN COUNT(paper.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many papers are preprint or not published?",
    "evidence": "preprint or not published refer to Year = 0;",
    "idx": 1981
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (author@`author`)\nWHERE author.`affiliation` = 'University of Illinois Chicago'\nRETURN author.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List the name of the author that affiliated with University of Illinois Chicago?",
    "evidence": "'University of Illinois Chicago' is an affiliation",
    "idx": 1982
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[t2:`authored_by`]->()\nWHERE t1.`id` = t2.`paperid`\nAND (t1.`title` = 'Education, democracy and growth')\nRETURN t2.`name` AS `name`, t2.`affiliation` AS `affiliation`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "State the name and affiliation of author for the 'Education, democracy and growth' paper?",
    "evidence": "Education, democracy and growth' refer to title of paper\n",
    "idx": 1985
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[t2:`authored_by`]->()\nMATCH (t1@`paper`)-[published_in_0:`published_in`]->(t3@`journal`)\nWHERE t1.`id` = t2.`paperid`\nAND t1.`journalid` = t3.`id`\nAND (t3.`fullname` = 'IEEE Computer')\nRETURN COUNT(t2.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many author published papers in the 'IEEE Computer' journal?",
    "evidence": "IEEE Computer refer to FullName; How many author published papers refer to COUNT(PaperAuthor.Name) where FullName = ’IEEE Computer’",
    "idx": 1986
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[presented_at_0:`presented_at`]->(t2@`conference`)\nWHERE t1.`conferenceid` = t2.`id`\nAND (t2.`fullname` = 'International Workshop on Inductive Logic Programming' AND t1.`year` >= 2001 AND t1.`year` <= 2009)\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many papers were published in International Workshop on Inductive Logic Programming from 2001 to 2009?",
    "evidence": "From 2001 to 2009 refer to Year 2001 BETWEEN 2009; 'International Workshop on Inductive Logic Programming' refer to Conference.FullName\n",
    "idx": 1988
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[t2:`authored_by`]->()\nWHERE t1.`id` = t2.`paperid`\nAND (t1.`title` = 'Real-Time Automata')\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the author of the publication named 'Real-Time Automata'?",
    "evidence": "'Real-Time Automata' is the title of paper; publication refers to title;",
    "idx": 1991
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t2@`paper`)-[presented_at_0:`presented_at`]->(t1@`conference`)\nWHERE t1.`id` = t2.`conferenceid`\nAND (t1.`fullname` = 'Adaptive Multimedia Retrieval' AND t2.`year` = 2007)\nRETURN COUNT(t2.`conferenceid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many publications were published in relation to the conference 'Adaptive Multimedia Retrieval' in 2007?",
    "evidence": "'Adaptive Multimedia Retrieval is the FullName of paper; in 2007 refer to Year = 2007",
    "idx": 1995
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[paperauthor:`authored_by`]->()\nWHERE paperauthor.`name` = 'Howard F. Lipson'\nRETURN COUNT(paperauthor.`paperid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many publications were published by author named 'Howard F. Lipson'?",
    "evidence": "'Howard F. Lipson' is the name of author",
    "idx": 1997
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[published_in_0:`published_in`]->(t2@`journal`)\nWHERE t1.`journalid` = t2.`id`\nRETURN cast (sum(CASE  WHEN t1.`keyword` = 'Turbulent Fluids' THEN 1 ELSE 0 END) as float) / sum(CASE  WHEN t2.`fullname` = 'Physics of Fluids' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all publications containing keywords 'Turbulent Fluids', what percentage of them was published in the journal named 'Physics of Fluids'?",
    "evidence": "'Physics of Fluids' is the FullName of journal; percentage = DIVIDE(SUM(Keyword = 'Turbulent Fluids'), SUM(FullName = 'Physics of Fluids')) as percentage",
    "idx": 1998
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (conference@`conference`)\nWHERE conference.`shortname` = 'ICCI'\nRETURN conference.`fullname` AS `fullname`, conference.`homepage` AS `homepage`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List out the full name and URL link of ICCI?",
    "evidence": "'ICCI' is the ShortName of conference; URL refer to HomePage",
    "idx": 2000
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`author`)-[t2:`authored`]->()\nWHERE t1.`id` = t2.`authorid`\nAND (t1.`affiliation` = 'University of Hong Kong')\nRETURN COUNT(t2.`paperid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many papers were written by authors who cooperated with University of Hong Kong?",
    "evidence": "University of Hong Kong' is an affiliation",
    "idx": 2002
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`author`)-[t2:`authored`]->(t3@`paper`)\nWHERE t1.`id` = t2.`authorid`\nAND t2.`paperid` = t3.`id`\nAND (t2.`paperid` = 2)\nRETURN t1.`name` AS `name`, t3.`year` AS `year`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Sate the author name and published year for paper id 2?",
    "evidence": "published year refers to year",
    "idx": 2004
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`state`,'AZ') AND like(business.`active`,'False')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the quantity of the closed or not running Yelp Businesses in 'AZ'?",
    "evidence": "closed or not running refers to active = 'False'; AZ refers to state = 'AZ';",
    "idx": 2008
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`user_id` = 36139 AND like(reviews.`review_length`,'long')\nRETURN COUNT(reviews.`review_length`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many long reviews does user No. 36139 give for the Yelp businesses?",
    "evidence": "long reviews refers to review_length = 'long'; user No. refers to user_id;",
    "idx": 2009
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`attributes`)\nMATCH (t2@`business_attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (like(t1.`attribute_name`,'Open 24 Hours') AND like(t2.`attribute_value`,'TRUE'))\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Yelp businesses are opened 24 hours?",
    "evidence": "open 24 hours refers to attribute_name = 'Open 24 Hours' AND attribute_value = 'true';",
    "idx": 2011
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`categories`)\nMATCH (t2@`business_categories`)\nWHERE t1.`category_id` = t2.`category_id`\nAND (like(t1.`category_name`,'Bars'))\nRETURN COUNT(t1.`category_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many \"bars\" are there in the Yelp business?",
    "evidence": "bars refers to category_name = 'Bars';",
    "idx": 2013
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`business`)\nMATCH (t1@`tips`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`user_id` = 69722)\nRETURN t2.`stars` AS `stars`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "There was only one tip that user No. 69722 gave to the Yelp business, what was the ratings of that business?",
    "evidence": "short tip refers to tip_lenghth = 'short'; user No. refers to user_id; ratings refers to stars; stars = 5 means great experience; stars = 4 means good experience; stars = 3 means average experience; stars = 2 means bad experience; stars = 1 means terrible experience;\n",
    "idx": 2015
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`reviews`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (like(t1.`city`,'Yuma') AND like(t2.`review_length`,'Medium'))\nRETURN COUNT(t2.`review_length`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the only Yelp business in \"Yuma\" city, how many \"medium\" reviews did it get?",
    "evidence": "medium reviews refers to review_length = 'Medium';",
    "idx": 2023
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`tips`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`likes` = 1 AND t2.`user_id` = 63469)\nRETURN t1.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "User No.\"63469\" has got \"1\" like for a tip to the Yelp business, which city is that business located in?",
    "evidence": "user No. refers to user_id;",
    "idx": 2028
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`compliments`)\nMATCH (t2@`users_compliments`)\nWHERE t1.`compliment_id` = t2.`compliment_id`\nAND (like(t1.`compliment_type`,'cute') AND t2.`user_id` = 57400)\nRETURN COUNT(t1.`compliment_type`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many \"cute\" type of compliments does user No. 57400 get?",
    "evidence": "type of compliments refers to compliment_type; user No. refers to user_id;",
    "idx": 2030
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`review_count`,'Low') AND like(business.`active`,'TRUE')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many active businesses of city are underrated?",
    "evidence": "active businesses refers to active = 'true'; underrated refers to review_count = 'Low';",
    "idx": 2033
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (users@`users`)\nWHERE users.`user_id` >= 1 AND users.`user_id` <= 20 AND like(users.`user_fans`,'None') AND like(users.`user_review_count`,'Low')\nRETURN COUNT(users.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many user ids from 1 to 20 have no fan users and have low ratings?",
    "evidence": "user_id BETWEEN 1 AND 20; no fan users refers to user_fans = 'None'; low ratings refers to user_review_count = 'Low';",
    "idx": 2034
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`city`,'Phoenix') AND like(business.`active`,'TRUE')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many active businesses are there in Phoenix?",
    "evidence": "active businesses refers to active = 'true'; Phoenix refers to city = 'Phoenix';",
    "idx": 2035
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`active`,'FALSE')\nRETURN cast (sum(business.`stars`) as float) / COUNT(business.`business_id`) AS `average`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average rating of inactive businesses?",
    "evidence": "rating refers to stars; inactive refers to active = 'False'; average rating of inactive businesses = DIVIDE(SUM(stars), COUNT(business_id));",
    "idx": 2037
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`business_attributes`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (like(t2.`attribute_value`,'beer_and_wine') AND like(t1.`state`,'AZ'))\nRETURN COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses in AZ state have the beer_and_wine attribute?",
    "evidence": "beer_and_wine refers to attribute_value = 'beer_and_wine';",
    "idx": 2038
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (users@`users`)\nWHERE users.`user_yelping_since_year` = 2012 AND like(users.`user_votes_funny`,'High')\nRETURN COUNT(users.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users who started yelping since 2012 have sent a high number of funny votes?",
    "evidence": "users who started yelping in 2012 refers to user_yelping_since_year = '2012'; high number of funny votes refers to user_votes_funny = 'High';",
    "idx": 2039
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`user_id` = 52592 AND reviews.`business_id` = 2\nRETURN reviews.`review_votes_useful` AS `review_votes_useful`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of useful votes that the user 52592 received when reviewed for business number 2?",
    "evidence": "number of useful votes refers to review_votes_useful; business number refers to business_id;",
    "idx": 2040
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (attributes@`attributes`)\nWHERE like(attributes.`attribute_name`,'%payment%')\nRETURN attributes.`attribute_id` AS `attribute_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the attribute numbers that are related to payment?",
    "evidence": "attribute numbers refers to attribute_id; related to payment refers to attribute_name like '%payment%';",
    "idx": 2041
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`user_id` = 612 AND reviews.`review_stars` = 5 AND reviews.`business_id` = 2\nRETURN reviews.`review_length` AS `review_length`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How long was the review for business number 2 that user number 612 wrote?",
    "evidence": "how long was the review refers to review_length; business number refers to business_id; user number refers to user_id;",
    "idx": 2042
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`city`,'Gilbert') AND like(business.`active`,'True')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses are actively running in Gilbert City?",
    "evidence": "actively running refers to active = 'true';",
    "idx": 2043
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`state`,'AZ') AND like(business.`review_count`,'Low')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses in the AZ state got low quality of reviews?",
    "evidence": "low quality of reviews refers to review_count = 'low';",
    "idx": 2044
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`compliments`)\nMATCH (t1@`users_compliments`)\nWHERE t1.`compliment_id` = t2.`compliment_id`\nAND (t1.`user_id` = 33 AND like(t2.`compliment_type`,'cool'))\nRETURN COUNT(t2.`compliment_type`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many \"cool\" compliments did user number 33 receive?",
    "evidence": "cool compliments refers to compliment_type = 'cool'; user number refers to user_id;",
    "idx": 2047
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`attributes`)\nMATCH (t2@`business_attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (like(t2.`attribute_value`,'TRUE') AND t2.`business_id` = 56)\nRETURN t1.`attribute_name` AS `attribute_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the attributes that business number 56 have?",
    "evidence": "business number refers to business_id; attributes that business have refers to attribute_value = 'true';",
    "idx": 2048
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`categories`)\nMATCH (t1@`business_categories`)\nWHERE t1.`category_id` = t2.`category_id`\nAND (t1.`business_id` = 15)\nRETURN t2.`category_name` AS `category_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the categories that business number 15 belongs to?",
    "evidence": "business number refers to business_id;",
    "idx": 2049
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`city`,'Scottsdale')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses of Yelp are in Scottsdale?",
    "evidence": "Scottsdale refers to city = 'Scottsdale';",
    "idx": 2051
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`state`,'AZ') AND like(business.`active`,'True')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the Yelp_Businesses in Arizona, how many of them are still running?",
    "evidence": "Arizona refers to state = 'AZ'; still running refers to active = 'true';",
    "idx": 2052
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`city`,'Scottsdale') AND business.`stars` > 3\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Yelp_Businesses in Scottsdale have received positive comments in the Elitestar rating?",
    "evidence": "Scottsdale refers to city = 'Scottsdale'; positive comments refers to stars > 3; Elitestar rating refers to stars;",
    "idx": 2053
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nORDER BY business.`review_count` DESC NULLS LAST \nRETURN business.`city` AS `city` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city has more Yelp_Business that's more appealing to users, Scottsdale or Anthem?",
    "evidence": "more appealing to users refers to MAX(review_count);",
    "idx": 2054
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`state`,'AZ') AND business.`stars` > 4\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Yelp_Businesses in Arizona have a Elitestar rating of over 4?",
    "evidence": "Arizona refers to state = 'AZ'; Elitestar rating of over 4 refers to stars > 4;",
    "idx": 2055
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`state`,'AZ')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Yelp_Businesses are there in Arizona in total?",
    "evidence": "Arizona refers to state = 'AZ';",
    "idx": 2056
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`user_id` = 3\nRETURN COUNT(reviews.`review_length`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many reviews have the user whose ID is 3 posted?",
    "evidence": "",
    "idx": 2057
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`user_id` = 3 AND like(reviews.`review_length`,'Long')\nRETURN COUNT(reviews.`review_length`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many reviews made by user whose ID is 3 are long?",
    "evidence": "long refers to review_length = 'Long';",
    "idx": 2058
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`user_id` = 3 AND like(reviews.`review_length`,'Long') AND like(reviews.`review_votes_useful`,'Medium')\nRETURN COUNT(reviews.`review_length`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the long reviews made by user ID 3, how many of them have received a medium number of useful votes?",
    "evidence": "long reviews refers to review_length = 'Long'; medium number of useful votes refers to review_votes_useful = 'medium';",
    "idx": 2059
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (users@`users`)\nWHERE users.`user_yelping_since_year` = 2012\nRETURN COUNT(users.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users have joined Yelp since the year 2012?",
    "evidence": "since year 2012 refers to user_yelping_since_year = '2012'",
    "idx": 2060
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`attributes`)\nMATCH (t2@`business_attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (like(t1.`attribute_name`,'Alcohol') AND like(t2.`attribute_value`,'none'))\nRETURN COUNT(t1.`attribute_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Yelp_Businesses do not provide alcohol?",
    "evidence": "do not provide alcohol refers to attribute_name = 'Alcohol'and attribute_value = 'none'\n",
    "idx": 2061
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`categories`)\nMATCH (t2@`business_categories`)\nWHERE t1.`category_id` = t2.`category_id`\nAND (t2.`business_id` = 1)\nRETURN t1.`category_name` AS `category_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Under which categories is Yelp_Business no. 1?",
    "evidence": "categories refers to category_name; Yelp_Business no.1 refers to business_id = 1",
    "idx": 2064
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`business`)\nMATCH (t1@`reviews`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (like(t2.`state`,'AZ') AND t1.`user_id` = 3)\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Yelp_Business in Arizona has user no. 3 reviewed?",
    "evidence": "in Arizona refers to state = 'AZ'; user no. 3 refers to user_id = 3",
    "idx": 2065
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`days`)\nMATCH (t1@`business_hours`)\nWHERE t1.`day_id` = t2.`day_id`\nAND (like(t2.`day_of_week`,'Tuesday') AND t1.`business_id` = 1)\nRETURN cast (t1.`closing_time` as float) - cast (t1.`opening_time` as float) AS `opening hours`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How long does Yelp_Business no.1 open on Tuesdays?",
    "evidence": "\"How long\" and \"how much time\" are synonyms; how much time does this business open refers to subtract(closing_time, opening_time); Yelp_Business no.1 refers to business_id = 1; Tuesdays refers to day_of_week = 'Tuesday'",
    "idx": 2066
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`days`)\nMATCH (t1@`business_hours`)\nWHERE t1.`day_id` = t2.`day_id`\nAND (like(t2.`day_of_week`,'Tuesday') AND t1.`business_id` = 1)\nRETURN t1.`opening_time` AS `opening_time`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When does Yelp_Business no.1 open on Tuesdays?",
    "evidence": "Yelp_Business no.1 refers to business_id = 1; open on refers to opening_time; Tuesdays refers to day_of_week = 'Tuesday'",
    "idx": 2067
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`days`)\nMATCH (t1@`business_hours`)\nWHERE t1.`day_id` = t2.`day_id`\nAND (like(t2.`day_of_week`,'Monday') AND t1.`closing_time` > '8PM')\nRETURN COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Yelp_Business close after 8PM on Mondays?",
    "evidence": "close after 8PM refers to closing_time = '9PM' or closing_time = '10PM' closing_time = '11PM' closing_time = '12PM'; Mondays refers to day_of_week = 'Monday'",
    "idx": 2068
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`elite`)\nWHERE t1.`user_id` = t2.`user_id`\nAND (t1.`user_yelping_since_year` = t2.`year_id`)\nRETURN COUNT(t1.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users became an elite user the same year they joined Yelp?",
    "evidence": "became an elite user the same year they joined Yelp refers to user_yelping_since_year = year_id",
    "idx": 2069
  }
]