[
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[store_0:`store`]->(t1@`sales_in_weather`)\nMATCH (t2@`relation`)-[station_0:`station`]->(t3@`weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND t2.`station_nbr` = t3.`station_nbr`\nAND (t2.`store_nbr` = 3 AND t1.`item_nbr` = 5)\nRETURN sum(CASE  WHEN t3.`preciptotal` > 0.05 THEN t1.`units` ELSE 0 END) AS `sum`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many units of item no.5 were sold in store no.3 in total on days with a total precipitation of over 0.05?",
    "evidence": "item no. 5 refers to item_nbr = 5; store no.3 refers to store_nbr = 3; with a total precipitation of over 0.05 refers to preciptotal > 0.05",
    "idx": 3991
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[store_0:`store`]->(t1@`sales_in_weather`)\nMATCH (t2@`relation`)-[station_0:`station`]->(t3@`weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND t2.`station_nbr` = t3.`station_nbr`\nAND (t1.`store_nbr` = 3 AND t1.`item_nbr` = 5 AND t3.`tmax` > 90)\nRETURN cast (sum(t1.`units`) as float) / COUNT(t1.`date`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many units of item no.5 were sold in store no.3 on average on the days when the max temperature exceeded 90?",
    "evidence": "item no. 5 refers to item_nbr = 5; store no.3 refers to store_nbr = 3;  when the maximum temperature exceed 90 refers to tmax > 90; average = Divide (Sum(units), Count(date))",
    "idx": 3993
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (sales_in_weather@`sales_in_weather`)\nWHERE sales_in_weather.`date` = date('2012-12-07') AND sales_in_weather.`store_nbr` = 11 AND sales_in_weather.`item_nbr` = 9\nRETURN sales_in_weather.`units` AS `units`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many no.9 items from store no.11 were sold on 2012/12/7?",
    "evidence": "no. 9 item refers to item_nbr = 9; store no.11 refers to store_nbr = 11; sold on 2012/12/7 refers to date = '2012-12-07'",
    "idx": 3995
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (relation@`relation`)\nWHERE relation.`store_nbr` = 20\nRETURN relation.`station_nbr` AS `station_nbr`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which weather station does store no.20 belong to?",
    "evidence": "store no.20 refers to store_nbr = 20; weather station refers to station_nbr",
    "idx": 3998
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "CALL {\nMATCH (weather_sub0@`weather`)\nORDER BY weather_sub0.`depart` DESC NULLS LAST \nRETURN weather_sub0.`station_nbr` AS `station_nbr` \nLIMIT 1\n}\nMATCH (relation@`relation`)\nWHERE relation.`station_nbr` = station_nbr\nRETURN relation.`store_nbr` AS `store_nbr`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the weather station which recorded the highest temperature above the 30-year normal, how many stores does it have?",
    "evidence": "highest temperature above the 30-year normal refers to Max(depart)",
    "idx": 4000
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[station_0:`station`]->(t1@`weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND (t2.`store_nbr` = 15 AND t1.`date` = date('2012-02-18'))\nRETURN t1.`dewpoint` AS `dewpoint`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the home weather station of store no.15, what was the dew point on 2012/2/18?",
    "evidence": "store no. 15 refers to store_nbr = 15; on 2012/2/18 refers to date = '2012-02-18'",
    "idx": 4001
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[station_0:`station`]->(t1@`weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND (t1.`date` = date('2012-12-25') AND t2.`store_nbr` = 2)\nRETURN t1.`preciptotal` AS `preciptotal`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many inches of total precipitation was recorded by the weather station of store no.2 on 2012/12/25?",
    "evidence": "store no.2 refers to store_nbr = 2; on 2012/12/25 refers to date = '2012-12-25'; total precipitation refers to preciptotal",
    "idx": 4008
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[store_0:`store`]->(t1@`sales_in_weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND (t1.`date` = date('2014-10-31'))\nRETURN cast (sum(CASE  WHEN t2.`store_nbr` = 10 THEN t1.`units` * 1 ELSE 0 END) as float) * 100 / sum(t1.`units`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage was the total unit sales of store no.10 to the total sales of its weather station on 2014/10/31?",
    "evidence": "store no.10 refers to store_nbr = 10; on 2014/10/31 refers to date = '2014-10-31'; percentage = Divide (Sum(units where store_nbr = 10), Sum(units)) * 100",
    "idx": 4010
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[station_0:`station`]->(t1@`weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND (t2.`store_nbr` = 9)\nRETURN cast ((sum(CASE  WHEN t1.`date` = date('2012-02-03') THEN t1.`tavg` * 1 ELSE 0 END) - sum(CASE  WHEN t1.`date` = date('2012-02-02') THEN t1.`tavg` * 1 ELSE 0 END)) as float) * 100 / sum(CASE  WHEN t1.`date` = date('2012-02-02') THEN t1.`tavg` * 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the weather station has store no.9, what was the increased percentage of the average temperature from 2012/2/2 to 2012/2/3?",
    "evidence": "store no.9 refers to store_nbr = 9; 2012/2/2 refers to date = '2012-02-02'; 2012/2/3 refers to date = '2012-02-03'; average temperature refers to tavg; increase percentage = Divide (Subtract (tavg where date = '2012-02-03', tavg where date = '2012-02-02'), tavg where date = '2012-02-02') * 100",
    "idx": 4011
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (sales_in_weather@`sales_in_weather`)\nWHERE sales_in_weather.`date` = date('2012-01-01') AND sales_in_weather.`store_nbr` = 1\nORDER BY sales_in_weather.`units` DESC NULLS LAST \nRETURN sales_in_weather.`item_nbr` AS `item_nbr` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the item number of the product with the highest number of units sold in store number 1 on 1/1/2012?",
    "evidence": "item number refers to item_nbr; highest number of units sold refers to Max(units); store no.1 refers to store_nbr = 1; on 1/1/2012 refers to date = '2012-01-01'",
    "idx": 4012
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (relation@`relation`)\nWHERE relation.`station_nbr` = 12\nRETURN sum(relation.`store_nbr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stores are in weather station 12?",
    "evidence": "weather station 12 refers to station_nbr = 12; number of stores refers to Count(store_nbr)",
    "idx": 4013
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (sales_in_weather@`sales_in_weather`)\nWHERE sales_in_weather.`store_nbr` = 2 AND sales_in_weather.`units` = 0 AND sales_in_weather.`date` = date('2012-01-01')\nRETURN COUNT(sales_in_weather.`item_nbr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many items weren't sold in store 2 on 1/1/2012?",
    "evidence": "store no.2 refers to store_nbr = 2; item weren't sold refers to units = 0; on 1/1/2012 refers to date = '2012-01-01'",
    "idx": 4014
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "CALL {\nMATCH (weather_sub0@`weather`)\nORDER BY weather_sub0.`avgspeed` DESC NULLS LAST \nRETURN weather_sub0.`station_nbr` AS `station_nbr` \nLIMIT 1\n}\nMATCH (relation@`relation`)\nWHERE relation.`station_nbr` = station_nbr\nRETURN COUNT(relation.`store_nbr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stores belong to the most windy station?",
    "evidence": "most windy station refers to Max(avgspeed)",
    "idx": 4015
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[store_0:`store`]->(t1@`sales_in_weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND (t2.`station_nbr` = 14 AND like(cast (t1.`date` as string),'%2014-02%') AND t1.`item_nbr` = 44 AND t1.`units` >= 300)\nRETURN t1.`store_nbr` AS `store_nbr`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the stores in weather station 14 in February 2014, which store had sold no less than 300 quantities for item number 44 in a single day?",
    "evidence": "weather station 14 refers to station_nbr = 14; February 2014 refers to substring (date, 1, 7) = '2014-02' ; sold no less than 300 quantities refers to units > = 300; item no.44 refers to item_nbr = 44; store refers to store_nbr",
    "idx": 4016
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[store_0:`store`]->(t1@`sales_in_weather`)\nMATCH (t2@`relation`)-[station_0:`station`]->(t3@`weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND t2.`station_nbr` = t3.`station_nbr`\nAND (t3.`station_nbr` = 9 AND like(cast (t1.`date` as string),'%2013-06%') AND t3.`codesum` = 'RA')\nORDER BY t1.`units` DESC NULLS LAST \nRETURN t1.`item_nbr` AS `item_nbr` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the most purchased products during the rainy days in June 2013 in weather station 9?",
    "evidence": "most purchased product refers to Max(units); during the rainy day refers to codesum = RA; in June 2013 refers to SUBSTR(date, 1, 7) = '2013-06'; weather station 9 refers to station_nbr = 9; product refers to item_nbr",
    "idx": 4017
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "CALL {\nMATCH (weather_sub0@`weather`)\nORDER BY weather_sub0.`snowfall` DESC NULLS LAST \nRETURN weather_sub0.`station_nbr` AS `station_nbr`, weather_sub0.`date` AS `date` \nLIMIT 1\n}\nMATCH (t2@`relation`)-[store_0:`store`]->(t1@`sales_in_weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND t2.`station_nbr` = station_nbr\nRETURN t1.`item_nbr` AS `item_nbr`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the items sold by the store during the day whose station recorded the thickest snowfall?",
    "evidence": "thickest snowfall refers to Max(snowfall); item refers to item_nbr",
    "idx": 4018
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[store_0:`store`]->(t1@`sales_in_weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nORDER BY t1.`units` DESC NULLS LAST \nRETURN t2.`station_nbr` AS `station_nbr` \nLIMIT 3",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the top 3 stations that have sold the highest quantities for an item in a single day?",
    "evidence": "highest quantity refers to Max(units); station refers to station_nbr",
    "idx": 4019
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t1@`relation`)-[station_0:`station`]->(t2@`weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND (t1.`store_nbr` = 29 AND t2.`date` = date('2014-02-08'))\nRETURN t2.`tmin` AS `tmin`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On February 8, 2014, what is the minimum temperature in the station where store 29 belongs?",
    "evidence": "On February 8, 2014 refers to date = '2014-02-08'; store 29 refers to store_nbr = 29; minimum temperature refers to tmin; station refers to station_nbr",
    "idx": 4020
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t1@`relation`)-[store_0:`store`]->(t2@`sales_in_weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND (t1.`station_nbr` = 12 AND t2.`item_nbr` = 5 AND like(cast (t2.`date` as string),'%2014%'))\nRETURN cast (sum(CASE  WHEN t2.`store_nbr` = 10 THEN t2.`units` * 1 ELSE 0 END) as float) * 100 / sum(t2.`units`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Between the stores under weather station 12, what is the percentage of item 5 sold in store 10 in 2014?",
    "evidence": "weather station 12 refers to station_nbr = 12; item 5 refers to item_nbr = 5; 10 store refers to store_nbr = 10; in 2014 refers to SUBSTR(date, 1, 4) = '2014'; percentage = Divide (Sum(units where store_nbr = 10), Sum(units)) * 100",
    "idx": 4021
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (weather@`weather`)\nRETURN MAX(weather.`avgspeed`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the maximum average speed?",
    "evidence": "maximum average speed refers to Max(avgspeed)",
    "idx": 4022
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (weather@`weather`)\nWHERE weather.`snowfall` > 5\nRETURN COUNT(DISTINCT weather.`date`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many days did the show fell more than 5 inches?",
    "evidence": "snow fell more than 5 inches refers to snowfall > 5",
    "idx": 4023
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (weather@`weather`)\nRETURN min(weather.`dewpoint`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the minimum dew point?",
    "evidence": "minimum dew point refers to Min(dewpoint)",
    "idx": 4024
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (weather@`weather`)\nWHERE weather.`station_nbr` = 1 AND weather.`date` = date('2012-01-15')\nRETURN weather.`tmax` AS `tmax`, weather.`tmin` AS `tmin`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the maximum and minimum temperature for station number 1 on 15 January 2012?",
    "evidence": "station number 1 refers to station_nbr = 1 ; minimum temperature = tmin; maximum temperature = tmax; on 15 January 2012 refers to date = '2012-01-15'",
    "idx": 4025
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[station_0:`station`]->(t1@`weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND (t2.`store_nbr` = 16 AND like(cast (t1.`date` as string),'%2012-01%'))\nRETURN min(t1.`tmin`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the lowest minimum temperature recorded in store 16 on January 2012?",
    "evidence": "lowest minimum temperature refers to Min(tmin); store 16 refers to store_nbr = 16; on January 2012 refers to Substring (date, 1, 7) = '2012-01'",
    "idx": 4026
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[station_0:`station`]->(t1@`weather`)\nMATCH (t2@`relation`)-[store_0:`store`]->(t3@`sales_in_weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND t2.`store_nbr` = t3.`store_nbr`\nAND (t2.`store_nbr` = 7 AND t3.`item_nbr` = 7 AND t1.`snowfall` < 5)\nRETURN sum(t3.`units`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many units of item 7 have been sold by store 7 when the snow is less than 5 inches?",
    "evidence": "item 7 refers to item_nbr = 7; store 7 refers to store_nbr = 7; snow is less than 5 inches refers to snowfall < 5",
    "idx": 4027
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[station_0:`station`]->(t1@`weather`)\nMATCH (t2@`relation`)-[store_0:`store`]->(t3@`sales_in_weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND t2.`store_nbr` = t3.`store_nbr`\nAND (t3.`store_nbr` = 9 AND t1.`snowfall` <> 0 AND NOT t1.`snowfall` IS NULL)\nRETURN COUNT(DISTINCT t3.`item_nbr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many items were sold by store 9 during a snowy day?",
    "evidence": "store 9 refers to store_nbr = 9; snowy day refers to snowfall < > 0 and snowfall is not null; item refers to item_nbr",
    "idx": 4028
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[station_0:`station`]->(t1@`weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND (t2.`store_nbr` = 3 OR t2.`store_nbr` = 4)\nRETURN t1.`sealevel` AS `sealevel`, t1.`avgspeed` AS `avgspeed`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the sea level and average speed for store number 3 and store number 4?",
    "evidence": "store number 3 refers to store_nbr = 3; average speed refers to avgspeed; store number 4 refers to store_nbr = 4",
    "idx": 4030
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t2@`relation`)-[station_0:`station`]->(t1@`weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND (t2.`store_nbr` = 11)\nRETURN cast ((MAX(t1.`tmax`) - min(t1.`tmin`)) as float) / min(t1.`tmin`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio of the highest and lowest temperature in store 11?",
    "evidence": "store 11 refers to store_nbr = 11; highest temperature refers to Max(tmax); lowest temperature refers to Min(tmin); ration = Divide (Max(tmax), Min(tmin))",
    "idx": 4031
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t1@`relation`)-[store_0:`store`]->(t2@`sales_in_weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND (like(cast (t2.`date` as string),'%2012%'))\nRETURN sum(CASE  WHEN t1.`station_nbr` = 1 THEN t2.`units` ELSE 0 END) - sum(CASE  WHEN t1.`station_nbr` = 2 THEN t2.`units` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the difference of number of units sold in station number 1 and number 2 on year 2012?",
    "evidence": "station 1 refers to station_nbr = 1; station 2 refers to station_nbr = 2; on year 2012 refers to substring (date, 1, 4) = '2012'; difference = Subtract (Sum(units where station_nbr = 1), Sum(units where station_nbr = 2))",
    "idx": 4032
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t1@`relation`)-[station_0:`station`]->(t2@`weather`)\nWHERE t1.`station_nbr` = t2.`station_nbr`\nAND (t2.`date` = date('2012-09-16'))\nRETURN sum(CASE  WHEN t1.`store_nbr` = 18 THEN t2.`tavg` ELSE 0 END) - sum(CASE  WHEN t1.`store_nbr` = 19 THEN t2.`tavg` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the average temperature difference between store number 18 and 19 on 16 September 2022?",
    "evidence": "store number 18 refers to store_nbr = 18; store number 19 refers to store_nbr = 19; on 16 September 2022 refers to date = '2022-09-16'; average temperature difference = Subtract(tavg where store_nbr = 18, tavg where store_nbr = 19)",
    "idx": 4033
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t1@`weather`)\nMATCH (t3@`relation`)-[store_0:`store`]->(t2@`sales_in_weather`)\nWHERE t1.`date` = t2.`date`\nAND t2.`store_nbr` = t3.`store_nbr`\nAND (t2.`item_nbr` = 1 AND t1.`tavg` = 83)\nRETURN sum(t2.`units`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many units are being sold for item 1 when the average temperature is 83?",
    "evidence": "item 1 refers to item_nbr = 1; when the average temperature is 83 refers to tavg = 83",
    "idx": 4034
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "CALL {\nMATCH (t2_sub0@`relation`)-[station_0:`station`]->(t1_sub0@`weather`)\nWHERE t1_sub0.`station_nbr` = t2_sub0.`station_nbr` AND like(cast (t1_sub0.`date` as string),'%2012-05%') AND t2_sub0.`store_nbr` = 6\nRETURN cast (sum(t1_sub0.`tavg`) as float) / COUNT(t1_sub0.`date`) AS `_col_0_1` \n}\nCALL {\nMATCH (t2_sub0@`relation`)-[station_1:`station`]->(t1_sub0@`weather`)\nWHERE t1_sub0.`station_nbr` = t2_sub0.`station_nbr`\nAND (like(cast (t1_sub0.`date` as string),'%2012-05%') AND t2_sub0.`store_nbr` = 7)\nRETURN cast (sum(t1_sub0.`tavg`) as float) / COUNT(t1_sub0.`date`) AS `_col_0_2` \n}\nRETURN _col_0_1 - _col_0_2 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the average temperature differences during May 2012 for store number 6 and 7?",
    "evidence": "during May 2012 refers to SUBSTR(date, 1, 7) = '2012-05'; store number 6 refers to store_nbr = 6; store number 7 refers to store_nbr = 7; average temperature difference = Subtract (Divide (Sum(tavg), Count (date) where the store_nbr = 6), Divide (Sum(tavg), Count(date) where store_nbr = 7))",
    "idx": 4035
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`ethnicgroup`)\nMATCH (t2@`country`)\nWHERE t1.`country` = t2.`code`\nAND (t1.`percentage` = 100 AND t1.`name` = 'African')\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the country with 100% Africans?",
    "evidence": "Percentage = 100 means 100% of the population",
    "idx": 4038
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`area` > 600000 AND NOT t2.`agriculture` IS NULL)\nRETURN t2.`agriculture` AS `agriculture`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For country with area greater than 600000, what is agriculture percentage of GDP the country contributes?",
    "evidence": "",
    "idx": 4040
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`politics`)\nMATCH (t1@`population`)\nWHERE t1.`country` = t2.`country`\nAND (t2.`government` = 'republic')\nORDER BY t1.`population_growth` DESC NULLS LAST \nRETURN t2.`country` AS `country` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Provide the country with republic government which has the highest population growth?",
    "evidence": "",
    "idx": 4041
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`politics`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Bulgaria')\nRETURN t2.`independence` AS `independence`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did 'Bulgaria' gain independence?",
    "evidence": "",
    "idx": 4042
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`ethnicgroup`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'Arab')\nRETURN t2.`percentage` * t1.`population` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Calculate the population of Arab in each country?",
    "evidence": "Arab is the name of enthic groups in the country; Population of (Arab in each country) = (percentage of Arab) * (population of each country)",
    "idx": 4043
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`ethnicgroup`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'African' AND t1.`name` = 'Turks and Caicos Islands')\nRETURN t2.`percentage` * t1.`population` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the population of African in 'Turks and Caicos Islands'?",
    "evidence": "African is the name of enthic groups in the country; Population of (African in Turks and Calcos Island) = (percentage of African) * (population of Turks and Calcos Island)",
    "idx": 4044
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`population`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (NOT t2.`infant_mortality` IS NULL)\nORDER BY t2.`infant_mortality`  NULLS FIRST \nRETURN t2.`population_growth` * t1.`population` AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of growth population for country with the lowest infant mortality?",
    "evidence": "Growth population = population_growth * population",
    "idx": 4045
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`population`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Ethiopia')\nRETURN t2.`infant_mortality` AS `infant_mortality`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the infant mortality rate for Ethiopia?",
    "evidence": "Ethiopia is one of country names",
    "idx": 4051
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Singapore')\nRETURN t2.`gdp` * t2.`industry` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much does the gross domestic products goes to the industry sector for Singapore?",
    "evidence": "Singapore is one of country names; GDP refers to gross domestic products; GDP to the industry sector = GDP * Industry",
    "idx": 4052
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nORDER BY t1.`area`  NULLS FIRST \nRETURN t2.`gdp` * t2.`agriculture` AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is her GDP in agriculture for the country with the least area?",
    "evidence": "",
    "idx": 4053
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`ethnicgroup`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'Albanian')\nORDER BY t2.`percentage` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country has the biggest percentage of the albanian ethnic group?",
    "evidence": "",
    "idx": 4054
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`ethnicgroup`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'African' AND t1.`area` > 10000000)\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the countries with the African ethnic group, how many of them has a population of over 10000000?",
    "evidence": "",
    "idx": 4055
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nORDER BY t2.`gdp` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country has the highest GDP?",
    "evidence": "",
    "idx": 4056
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`gdp` > 500000 AND t1.`population` > 10000000)\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the countries with a population of over 10000000, how many of them have a GDP of over 500000?",
    "evidence": "",
    "idx": 4057
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (NOT t2.`inflation` IS NULL)\nORDER BY t2.`inflation`  NULLS FIRST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country has the lowest inflation rate?",
    "evidence": "",
    "idx": 4059
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`agriculture` < 50 AND t1.`area` > 8000000)\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the countries whose agriculture percentage of the GDP is under 50%, how many of them have an area of over 8000000?",
    "evidence": "",
    "idx": 4060
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`located`)\nMATCH (t2@`lake`)\nWHERE t1.`lake` = t2.`name`\nAND (t2.`type` = 'salt')\nRETURN COUNT(t1.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities have a salt lake located in it?",
    "evidence": "",
    "idx": 4061
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`lake`)\nOPTIONAL MATCH (t2@`located`)\nWHERE t2.`lake` = t1.`name`\nORDER BY t1.`altitude` DESC NULLS LAST \nRETURN t2.`city` AS `city` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "The lake with the highest altitude is located in which city?",
    "evidence": "",
    "idx": 4063
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`located`)\nMATCH (t2@`lake`)\nWHERE t1.`lake` = t2.`name`\nAND (t1.`province` = 'Canary Islands' AND t2.`area` > 1000000)\nRETURN COUNT(t2.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many lakes in the Canary Islands cover an area of over 1000000?",
    "evidence": "",
    "idx": 4064
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`language`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'Armenian' AND t2.`percentage` > 90)\nRETURN t1.`capital` AS `capital`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the capital city of the country that has the percentage of Armenian speakers over 90%?",
    "evidence": "Percentage of country > 90% refers to percentage > 90; America is one of country names",
    "idx": 4065
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`organization`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`population` < 1000000)\nRETURN COUNT(t2.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many organizations are founded in countries with a population of under 1000000?",
    "evidence": "",
    "idx": 4066
  }
]