[
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`payments`)-[is_made_by_0:`is_made_by`]->(t2@`customers`)\nWHERE t1.`customernumber` = t2.`customernumber`\nAND (t2.`customername` = 'Petit Auto' AND t1.`paymentdate` = date('2004-08-09'))\nRETURN t1.`amount` AS `amount`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much did Petit Auto pay on 2004-08-09?",
    "evidence": "Petit Auto is name of customer; paymentDate = '2004-08-09';",
    "idx": 832
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`products`)-[belongs_to_0:`belongs_to`]->(t1@`productlines`)\nWHERE t1.`productline` = t2.`productline`\nAND (t2.`productcode` = 'S18_2949')\nRETURN t1.`textdescription` AS `textdescription`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the productline where the product No.S18_2949 was produced, what's the text description for that product line?",
    "evidence": "",
    "idx": 834
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`customers`)-[is_assigned_to_0:`is_assigned_to`]->(t2@`employees`)\nWHERE t1.`salesrepemployeenumber` = t2.`employeenumber`\nAND (t1.`customername` = 'Dragon Souveniers, Ltd.')\nRETURN t2.`email` AS `email`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "If Dragon Souveniers, Ltd. aren't satisfied with their order and want to send a complain e-mail, which e-mail address should they send to?",
    "evidence": "E-mail address belongs to employee; customerName = 'Dragon Souveniers, Ltd.';",
    "idx": 835
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`customers`)-[is_assigned_to_0:`is_assigned_to`]->(t2@`employees`)\nWHERE t1.`salesrepemployeenumber` = t2.`employeenumber`\nAND (t1.`country` = 'France' AND t2.`firstname` = 'Gerard' AND t2.`lastname` = 'Hernandez')\nRETURN COUNT(t1.`customernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many French customers does Gerard Hernandez take care of?",
    "evidence": "Gerakd Hermandez is an employee; French customer refers to customer from France where country = 'France'",
    "idx": 836
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t@`employees`)\nWHERE t.`jobtitle` = 'President'\nRETURN t.`email` AS `email`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How do I contact the President of the company?",
    "evidence": "President refers to the jobTitle;",
    "idx": 838
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`customers`)-[is_assigned_to_0:`is_assigned_to`]->(t2@`employees`)\nWHERE t1.`salesrepemployeenumber` = t2.`employeenumber`\nAND (t1.`customername` = 'Muscle Machine Inc')\nRETURN t2.`email` AS `email`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "If I'm from the Muscle Machine Inc, to which e-mail adress should I write a letter if I want to reach the superior of my sales representitive?",
    "evidence": "Muscle Machine Inc is name of customer; superior refers to 'reportsTO', who is the leader of the 'employeeNumber'",
    "idx": 840
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`customers`)-[is_assigned_to_0:`is_assigned_to`]->(t2@`employees`)\nWHERE t1.`salesrepemployeenumber` = t2.`employeenumber`\nAND (t2.`firstname` = 'William' AND t2.`lastname` = 'Patterson')\nRETURN COUNT(t1.`customernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers have an employee who reports to William Patterson as their sales representitive?",
    "evidence": "reportsTO' is the leader of the 'employeeNumber';",
    "idx": 842
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`employees`)-[works_in_0:`works_in`]->(t2@`offices`)\nWHERE t1.`officecode` = t2.`officecode`\nAND (t2.`country` = 'USA' AND t1.`jobtitle` = 'Sales Rep')\nRETURN COUNT(t1.`employeenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales representitives are based in the offices in the USA?",
    "evidence": "Sales representative refers to jobTitle = 'Sales Rep'; country = 'USA';",
    "idx": 844
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`employees`)-[works_in_0:`works_in`]->(t2@`offices`)\nWHERE t1.`officecode` = t2.`officecode`\nAND (t1.`jobtitle` = 'President')\nRETURN t2.`addressline1` AS `addressline1`, t2.`addressline2` AS `addressline2`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Where can I find the office of the President of the company?",
    "evidence": "Where can I find the office refers to address, comprising of addressLine1 and addressLine2; President is a jobTitle",
    "idx": 845
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`employees`)-[works_in_0:`works_in`]->(t2@`offices`)\nWHERE t1.`officecode` = t2.`officecode`\nAND (t1.`jobtitle` = 'VP Sales')\nRETURN t2.`postalcode` AS `postalcode`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the postal code of the office the VP Sales is at?",
    "evidence": "VP Sales refers to jobTitle",
    "idx": 846
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`orderdetails`)\nMATCH (t2@`orders`)-[is_placed_by_0:`is_placed_by`]->(t3@`customers`)\nWHERE t1.`ordernumber` = t2.`ordernumber`\nAND t2.`customernumber` = t3.`customernumber`\nAND (t3.`customername` = 'Cruz & Sons Co.' AND t2.`orderdate` = date('2003-03-03'))\nRETURN sum(t1.`priceeach` * t1.`quantityordered`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total price of the order made by Cruz & Sons Co. on 2003/3/3?",
    "evidence": "SUM(MULTIPLY(quantityOrdered, priceEach)) where orderDate = '2003-03-03'; customerName = 'Cruz & Sons Co.'",
    "idx": 847
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`orders`)-[is_placed_by_0:`is_placed_by`]->(t2@`customers`)\nWHERE t1.`customernumber` = t2.`customernumber`\nAND (t2.`customername` = 'Cruz & Sons Co.' AND t1.`orderdate` = date('2003-03-03'))\nRETURN t1.`shippeddate` AS `shippeddate`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When were the products ordered by Cruz & Sons Co. on 2003-03-03 shipped?",
    "evidence": "Cruz & Sons Co. is name of customer; ordered on 2003-03-03 refers to orderDate;",
    "idx": 848
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "CALL {\nMATCH (orderdetails_sub0@`orderdetails`)\nORDER BY orderdetails_sub0.`quantityordered` DESC NULLS LAST \nRETURN orderdetails_sub0.`productcode` AS `productcode` \nLIMIT 1\n}\nMATCH (products@`products`)\nWHERE products.`productcode` = productcode\nRETURN products.`productname` AS `productname`, products.`msrp` - products.`buyprice` AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which is the most ordered quantity product? What is its expected profit margin per piece?",
    "evidence": "The most ordered quantity product refers to productName where Max(quantityOrdered); SUBTRACT(MSRP, buyPrice);",
    "idx": 851
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`employees`)-[works_in_0:`works_in`]->(t1@`offices`)\nWHERE t1.`officecode` = t2.`officecode`\nRETURN cast (COUNT(CASE  WHEN t1.`city` = 'Paris' THEN t2.`employeenumber` ELSE NULL END) as float) * 100 / COUNT(t2.`employeenumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of employees are in Paris office?",
    "evidence": "DIVIDE(COUNT(employeeNumber) when city = 'Paris'), (COUNT(employeeNumber)) as percentage;",
    "idx": 854
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`employees`)-[works_in_0:`works_in`]->(t1@`offices`)\nWHERE t1.`officecode` = t2.`officecode`\nAND (t2.`jobtitle` = 'Sale Manager (EMEA)')\nRETURN t2.`firstname` AS `firstname`, t2.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Name the Sales Manager of Europe, Middle East, and Africa region. In which office does he/she report to?",
    "evidence": "Sales Manager refers to jobTitle; Europe, Middle East, and Africa region refers to territory = 'EMEA';",
    "idx": 855
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`products`)\nMATCH (t2@`orderdetails`)\nWHERE t1.`productcode` = t2.`productcode`\nAND (t1.`productname` = '2003 Harley-Davidson Eagle Drag Bike')\nRETURN sum(t2.`quantityordered`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many 2003 Harley-Davidson Eagle Drag Bikes were ordered?",
    "evidence": "2003 Harley-Davidson Eagle Drag Bikes refers to productName; how many ordered refers to COUNT(quantityOrdered);",
    "idx": 858
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t1@`orders`)\nMATCH (t2@`orderdetails`)\nWHERE t1.`ordernumber` = t2.`ordernumber`\nORDER BY t2.`priceeach` DESC NULLS LAST \nRETURN t1.`shippeddate` AS `shippeddate` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When was the product with the highest unit price shipped?",
    "evidence": "The highest unit price refers to MAX(priceEach); when shipped refers to shippedDate;",
    "idx": 859
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`products`)\nMATCH (t1@`orderdetails`)\nWHERE t1.`productcode` = t2.`productcode`\nAND (t2.`productname` = '2001 Ferrari Enzo')\nRETURN sum(t1.`ordernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many 2001 Ferrari Enzo were ordered?",
    "evidence": "2001 Ferrari Enzo refers to productName;",
    "idx": 863
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (t2@`orders`)-[is_placed_by_0:`is_placed_by`]->(t1@`customers`)\nWHERE t1.`customernumber` = t2.`customernumber`\nAND (t2.`status` = 'On Hold' AND t1.`country` = 'USA')\nRETURN COUNT(t2.`ordernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many countries from the USA have an In Process order status?",
    "evidence": "country = 'USA'",
    "idx": 865
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`review` < 3\nRETURN COUNT(generalinfo.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants have not obtained a minimum of 3 in their reviews?",
    "evidence": "have not obtained a minimum of 3 in review refers to review < 3",
    "idx": 866
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "CALL {\nMATCH (generalinfo_sub0@`generalinfo`)\nRETURN MAX(generalinfo_sub0.`review`) AS `_col_0` \n}\nMATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`review` = _col_0\nRETURN generalinfo.`food_type` AS `food_type` \nLIMIT 4",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What types of food are served at the 4 top-reviewed restaurants?",
    "evidence": "top-reviewed refers to review = 4; type of food refers to food_type\n\n",
    "idx": 867
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`food_type` = 'mediterranean' AND generalinfo.`city` = 'richmond'\nRETURN COUNT(generalinfo.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants in the city of Richmond serve Mediterranean food?",
    "evidence": "Mediterranean food refers to food_type =   'mediterranean'",
    "idx": 868
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (geographic@`geographic`)\nWHERE geographic.`region` <> 'bay area'\nRETURN DISTINCT geographic.`county` AS `county`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What counties are not in the Bay Area Region?",
    "evidence": "not in the Bay Area region refers to region ! = 'bay area'",
    "idx": 870
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (location@`location`)\nWHERE location.`street_num` = 871\nRETURN COUNT(location.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants can we find at number 871 on its street?",
    "evidence": "number 871 on its street refers to street_num = 871",
    "idx": 873
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (location@`location`)\nWHERE location.`city` = 'san francisco' AND location.`street_name` = '9th avenue'\nRETURN location.`id_restaurant` AS `id_restaurant`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "At what numbers on 9th Avenue of San Francisco there are restaurants?",
    "evidence": "9th Avenue refers to street_name = '9th avenue'; San Francisco refers to City = 'san francisco'",
    "idx": 874
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t2.`street_name` = 'adeline st' AND t2.`city` = 'berkeley')\nRETURN t1.`food_type` AS `food_type`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What type of food is there in the restaurants on Adeline Street in Berkeley city?",
    "evidence": "Adeline Street refers to street_name = 'adeline st'; type of food refers to food_type\n\n",
    "idx": 875
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`food_type` <> 'african')\nRETURN DISTINCT t2.`region` AS `region`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which regions are there no African food restaurants?",
    "evidence": "no African food restaurants refers to food_type <> 'african'",
    "idx": 876
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`label` = 'a & w root beer')\nRETURN DISTINCT t2.`county` AS `county`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which counties are there A&W Root Beer Restaurants?",
    "evidence": "A&W Root Beer Restaurant refers to label = 'a & w root beer'",
    "idx": 877
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t3@`geographic`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND t2.`city` = t3.`city`\nAND (t3.`county` = 'san mateo county' AND t1.`street_name` = 'alpine rd' AND t1.`street_num` = 3140)\nRETURN t2.`food_type` AS `food_type`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What type of food is served at the restaurant located at 3140, Alpine Road at San Mateo County?",
    "evidence": "3140 Alpine Road at San Mateo County refers to street_num = 3140 AND street_name = 'alpine rd' AND County = 'san mateo county'; type of food refers to food_type",
    "idx": 879
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`city` = 'san francisco' AND t2.`food_type` = 'seafood' AND NOT t1.`street_name` IS NULL)\nRETURN t1.`street_name` AS `street_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which streets of the city of San Francisco are there restaurants that serve seafood?",
    "evidence": "street refers to street_name; seafood refers to food_type = 'seafood'",
    "idx": 880
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[located_in_2_0:`located_in_2`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`street_name` = 'appian way')\nRETURN COUNT(DISTINCT t2.`county`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In how many counties is there a street called Appian Way?",
    "evidence": "a street called Appian Way refers to street_name = 'appian way'",
    "idx": 882
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t2.`street_name` = 'atlantic ave')\nRETURN t1.`review` AS `review`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the rating of each restaurant reviews on Atlantic Ave?",
    "evidence": "Atlantic Ave refers to street_name = 'atlantic ave'; rating refers to review",
    "idx": 883
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t2.`street_name` = 'drive' AND t1.`food_type` <> 'american' AND t2.`city` = 'san rafael')\nRETURN t1.`label` AS `label`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What restaurant on Drive Street in San Rafael doesn't serve American food?",
    "evidence": "Drive Street refers to street_name = 'drive'; San Rafael refers to city = 'san rafael'; American food refers to food_type <> 'american'",
    "idx": 886
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`city` = 'san francisco' AND t1.`review` = 1.7)\nRETURN t2.`street_name` AS `street_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On which streets in the city of San Francisco are there restaurants with a review of 1.7?",
    "evidence": "street refers to street_name; review of 1.7 refers to review = 1.7",
    "idx": 887
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`street_name` = 'avenida de las pulgas' AND t2.`city` = 'menlo park')\nORDER BY t2.`review`  NULLS FIRST \nRETURN t2.`label` AS `label` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which restaurant on the street Alameda de las Pulgas in the city of Menlo Park is the worst rated?",
    "evidence": "restaurant refers to label; street Alameda de las Pulgas refers to street_name = 'avenida de las pulgas'; the worst rated refers to min(review)",
    "idx": 888
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[for_restaurant_0:`for_restaurant`]->(t2@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t3@`geographic`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND t2.`city` = t3.`city`\nAND (t2.`label` = 'good heavens' AND t3.`county` = 'tuolumne county')\nRETURN t1.`street_name` AS `street_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On what street in Tuolumne County is Good Heavens restaurant located?",
    "evidence": "street refers to street_name; Good Heavens restaurant refers to label = 'good heavens'",
    "idx": 889
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`food_type` = 'pizza' AND t2.`region` <> 'unknown')\nRETURN DISTINCT t2.`region` AS `region`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which regions are there no pizza restaurants?",
    "evidence": "no pizza restaurants refers to food_type = 'pizza'",
    "idx": 892
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t1@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`county` = 'monterey county')\nRETURN cast (sum(CASE WHEN t2.`food_type` = 'mexican' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of restaurants in Monterey County have Mexican food?",
    "evidence": "Mexican food refers to food_type = 'mexican'; percentage = divide(count(id_restaurant where food_type = 'mexican'), count(id_restaurant)) where county = 'monterey county' * 100%",
    "idx": 894
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[located_in_2_0:`located_in_2`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t2.`county` = 'alameda county')\nRETURN cast (sum(CASE WHEN t1.`street_name` = '11th st' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of streets named 11th Street are in Alameda County?",
    "evidence": "street named 11th Street refers to street_name = '11th st'; percentage = divide(count(street_name = '11th st' and County = 'alameda county'), count(street_name where County = 'alameda county')) * 100%",
    "idx": 895
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (geographic@`geographic`)\nWHERE geographic.`region` = 'northern california'\nRETURN geographic.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What cities are located in Northern California?",
    "evidence": "Northern California refers to region = 'northern california'",
    "idx": 897
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`food_type` = '24 hour diner'\nRETURN generalinfo.`label` AS `label`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What does the one and only 24-hour diner's name?",
    "evidence": "24-hour diner refers to food_type = '24 hour diner'; diner name refers to label",
    "idx": 898
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (geographic@`geographic`)\nWHERE geographic.`city` = 'Davis'\nRETURN geographic.`county` AS `county`, geographic.`region` AS `region`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the county and region of Davis City?",
    "evidence": "",
    "idx": 900
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "CALL {\nMATCH (generalinfo_sub0@`generalinfo`)\nWHERE generalinfo_sub0.`city` = 'San Francisco'\nRETURN MAX(generalinfo_sub0.`review`) AS `_col_0` \n}\nMATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`city` = 'San Francisco' AND generalinfo.`review` = _col_0\nRETURN generalinfo.`id_restaurant` AS `id_restaurant`, generalinfo.`label` AS `label`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the most popular restaurants in San Francisco among diners?",
    "evidence": "the most popular refers to max(review); restaurant refers to label; San Francisco refers to city = 'San Francisco'",
    "idx": 902
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "CALL {\nMATCH (generalinfo_sub0@`generalinfo`)\nWHERE generalinfo_sub0.`food_type` = 'american' AND generalinfo_sub0.`city` = 'carmel'\nRETURN min(generalinfo_sub0.`review`) AS `_col_0_1` \n}\nMATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`food_type` = 'american' AND generalinfo.`city` = 'carmel' AND generalinfo.`review` = _col_0_1\nRETURN COUNT(generalinfo.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many American food restaurants are unpopular in Carmel?",
    "evidence": "American Food Restaurant refers to food_type = 'ameraican'; unpopular refers to min(review); Carmel refers to city = 'Carmel'",
    "idx": 903
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`city` = 'dublin'\nRETURN cast (sum(CASE WHEN generalinfo.`food_type` = 'american food' THEN 1 ELSE 0 END) as float) * 100 / COUNT(generalinfo.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of restaurants that serve American food in Dublin city?",
    "evidence": "American food refers to food_type = 'american food'; percentage = divide(count(id_restaurant), count(id_restaurant where food_type = 'american food')) where city = 'dublin' * 100%",
    "idx": 904
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`label` = 'Albert\\'s Café')\nRETURN t2.`street_num` AS `street_num`, t2.`street_name` AS `street_name`, t1.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full address of Albert's Café?",
    "evidence": "full address = street_num, street_name, city; Albert's Café refers to label = 'Albert's Café'",
    "idx": 905
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t2.`street_num` = 104 AND t1.`city` = 'campbell' AND t2.`street_name` = 'san tomas aquino road')\nRETURN t1.`label` AS `label`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the Chinese restaurant that can be found at 104 San Tomas Aquino Road, Campbell?",
    "evidence": "restaurant name refers to label; Chinese restaurant refers to food_type = 'chinese'; 104 San Tomas Aquino Road Campbell refers to street_num = 104 AND street_name = 'san tomas aquino road' AND city = 'campbell'",
    "idx": 909
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`food_type` = 'thai' AND t1.`city` = 'albany' AND t2.`street_name` = 'san pablo ave')\nRETURN COUNT(t1.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Thai restaurants can be found in San Pablo Ave, Albany?",
    "evidence": "Thai restaurant refers to food_type = 'thai'; San Pablo Ave Albany refers to street_name = 'san pablo ave' AND T1.city = 'albany'",
    "idx": 910
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t1@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t2.`label` = 'plearn-thai cuisine')\nRETURN t1.`county` AS `county`, t1.`region` AS `region`, t2.`label` AS `label`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the county and region of Plearn-Thai Cuisine restaurant?",
    "evidence": "Plearn-Thai Cuisine restaurant refers to label = 'plearn-thai cuisine'",
    "idx": 911
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t1@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`region` = 'lake tahoe' AND t1.`county` = 'el dorado county')\nRETURN t2.`label` AS `label`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the restaurant that is located in El Dorado County, Lake Tahoe region?",
    "evidence": "restaurant name refers to label",
    "idx": 912
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t1@`location`)-[located_in_2_0:`located_in_2`]->(t2@`geographic`)\nWHERE t1.`city` = t2.`city`\nAND (t1.`street_name` = 'E. El Camino Real')\nRETURN DISTINCT t2.`county` AS `county`, t2.`region` AS `region`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which county and region does the street E. El Camino Real belong to?",
    "evidence": "street E. El Camino Real refers to street_name = 'E. El Camino Real'",
    "idx": 913
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`location`)-[for_restaurant_0:`for_restaurant`]->(t1@`generalinfo`)\nWHERE t1.`id_restaurant` = t2.`id_restaurant`\nAND (t1.`city` = 'berkeley' AND t2.`street_name` = 'shattuck ave' AND t1.`food_type` = 'Indian restaurant')\nORDER BY t1.`review`  NULLS FIRST \nRETURN t1.`id_restaurant` AS `id_restaurant` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the least popular Indian restaurant on Shattuck Avenue in Berkeley?",
    "evidence": "restaurant name refers to label; the least popular refers to min(review); Indian restaurant refers to food_type = 'Indian restaurant'; Shattuck Avenue in Berkeley refers to street_name = 'shattuck ave' and city = 'berkeley'",
    "idx": 914
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (t2@`generalinfo`)\nOPTIONAL MATCH (t2@`generalinfo`)-[located_in_1_0:`located_in_1`]->(t1@`geographic`)\nWHERE t1.`region` = 'bay area'\nAND t1.`city` = t2.`city`\nRETURN cast (sum(CASE WHEN t2.`review` > 4 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`id_restaurant`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of restaurants in the Bay Area region that scored over 4 for the review rating?",
    "evidence": "scored over 4 refers to review > 4; percentage = divide(count(id_restaurant where region = 'bay area' and review > 4), count(id_restaurant where region = 'Bay Area')) * 100%",
    "idx": 915
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (generalinfo@`generalinfo`)\nWHERE generalinfo.`review` > 4\nRETURN COUNT(generalinfo.`id_restaurant`) AS `cnt`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants have more than 4 star reviews?",
    "evidence": "more than 4 star review refers to review > 4",
    "idx": 917
  }
]