[
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`keyword`:`keyword`)\nRETURN `keyword`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me all the keywords .",
    "evidence": "",
    "idx": 1088
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`organization`:`organization`)\nRETURN `organization`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me all the organizations .",
    "evidence": "",
    "idx": 1089
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`organization`:`organization`)\nWHERE `organization`.`continent` = 'North America'\nRETURN `organization`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me all the organizations in \" North America \" .",
    "evidence": "",
    "idx": 1090
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`organization`:`organization`)\nWHERE `organization`.`name` = 'University of Michigan'\nRETURN `organization`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the homepage of \" University of Michigan \" .",
    "evidence": "",
    "idx": 1091
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`title` = 'Making database systems usable'\nRETURN `publication`.`reference_num` AS `reference_num`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of references of \" Making database systems usable \" .",
    "evidence": "",
    "idx": 1092
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`title` = 'Making database systems usable'\nRETURN `publication`.`citation_num` AS `citation_num`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of citations of \" Making database systems usable \" .",
    "evidence": "",
    "idx": 1094
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`citation_num` > 200\nRETURN `publication`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper with more than 200 citations .",
    "evidence": "",
    "idx": 1096
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`domain`)-[t1:has_journal]->()\nMATCH (`t2`:`journal`)-[t1:belongs_to_domain]->()\nWHERE `t3`.`did` = `t1`.`did`\nAND `t2`.`jid` = `t1`.`jid`\nAND (`t2`.`name` = 'PVLDB')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the area of PVLDB .",
    "evidence": "",
    "idx": 1102
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t1`:`author`)\nMATCH (`t2`:`organization`)\nWHERE `t2`.`oid` = `t1`.`oid`\nAND (`t1`.`name` = 'H. V. Jagadish')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the organization \" H. V. Jagadish \" is in .",
    "evidence": "",
    "idx": 1104
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`domain`)-[t3:has_author]->(`t1`:`author`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`did` = `t3`.`did`\nAND (`t1`.`name` = 'H. V. Jagadish')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the domain where \" H. V. Jagadish \" is focused .",
    "evidence": "",
    "idx": 1107
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t2`.`title` = 'Making database systems usable')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the conference, which published \" Making database systems usable \" .",
    "evidence": "",
    "idx": 1109
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the papers on VLDB conference .",
    "evidence": "",
    "idx": 1111
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the papers on PVLDB .",
    "evidence": "",
    "idx": 1112
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB' AND `t2`.`year` > 2000)\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the papers on PVLDB after 2000 .",
    "evidence": "",
    "idx": 1113
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB' AND `t2`.`year` > 2000)\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the papers on VLDB conference after 2000 .",
    "evidence": "",
    "idx": 1114
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`domain`)-[t3:has_conference]->(`t1`:`conference`)\nWHERE `t3`.`cid` = `t1`.`cid`\nAND `t2`.`did` = `t3`.`did`\nAND (`t1`.`name` = 'VLDB')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the area of the VLDB conference .",
    "evidence": "",
    "idx": 1120
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`domain`)-[t2:has_keyword]->()\nMATCH (`t1`:`keyword`)-[t2:belongs_to_domain]->()\nWHERE `t3`.`did` = `t2`.`did`\nAND `t1`.`kid` = `t2`.`kid`\nAND (`t3`.`name` = 'Databases')\nRETURN `t1`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me all the keywords in Databases area .",
    "evidence": "",
    "idx": 1122
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`publication`)-[t2:has_keyword]->(`t1`:`keyword`)\nWHERE `t2`.`kid` = `t1`.`kid`\nAND `t3`.`pid` = `t2`.`pid`\nAND (`t1`.`keyword` = 'Natural Language')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me all the papers, which contain the keyword \" Natural Language \" .",
    "evidence": "",
    "idx": 1123
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[t3:has_keyword]->(`t1`:`keyword`)\nWHERE `t3`.`kid` = `t1`.`kid`\nAND `t2`.`pid` = `t3`.`pid`\nAND (`t2`.`title` = 'Making database systems usable')\nRETURN `t1`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the keywords of \" Making database systems usable \" .",
    "evidence": "",
    "idx": 1124
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`publication`)-[t4:has_keyword]->(`t1`:`keyword`)\nMATCH (`t3`:`publication`)-[published_in_0:published_in]->(`t2`:`conference`)\nWHERE `t4`.`kid` = `t1`.`kid`\nAND `t3`.`pid` = `t4`.`pid`\nAND `t3`.`cid` = `t2`.`cid`\nAND (`t2`.`name` = 'VLDB')\nRETURN `t1`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the keywords in VLDB conference .",
    "evidence": "",
    "idx": 1126
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[t4:has_keyword]->(`t1`:`keyword`)\nMATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t4`.`kid` = `t1`.`kid`\nAND `t2`.`pid` = `t4`.`pid`\nAND `t2`.`jid` = `t3`.`jid`\nAND (`t3`.`name` = 'PVLDB')\nRETURN `t1`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the keywords in PVLDB .",
    "evidence": "",
    "idx": 1127
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t4`:`publication`)-[t2:has_keyword]->(`t1`:`keyword`)\nMATCH (`t4`:`publication`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t2`.`kid` = `t1`.`kid`\nAND `t4`.`pid` = `t2`.`pid`\nAND `t4`.`jid` = `t3`.`jid`\nAND (`t3`.`name` = 'PVLDB' AND `t1`.`keyword` = 'Keyword search')\nRETURN `t4`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the papers in PVLDB containing keyword \" Keyword search \" .",
    "evidence": "",
    "idx": 1129
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t4`:`publication`)-[t3:has_keyword]->(`t1`:`keyword`)\nMATCH (`t4`:`publication`)-[published_in_0:published_in]->(`t2`:`conference`)\nWHERE `t3`.`kid` = `t1`.`kid`\nAND `t4`.`pid` = `t3`.`pid`\nAND `t4`.`cid` = `t2`.`cid`\nAND (`t2`.`name` = 'VLDB' AND `t1`.`keyword` = 'Information Retrieval')\nRETURN `t4`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the papers in VLDB conference containing keyword \" Information Retrieval \" .",
    "evidence": "",
    "idx": 1130
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`organization`)\nMATCH (`t3`:`domain`)-[t4:has_author]->(`t1`:`author`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t3`.`did` = `t4`.`did`\nAND `t2`.`oid` = `t1`.`oid`\nAND (`t3`.`name` = 'Databases')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me all the organizations in Databases area .",
    "evidence": "",
    "idx": 1132
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`organization`)\nMATCH (`t3`:`domain`)-[t4:has_author]->(`t1`:`author`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t3`.`did` = `t4`.`did`\nAND `t2`.`oid` = `t1`.`oid`\nAND (`t3`.`name` = 'Databases' AND `t2`.`continent` = 'North America')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me all the organizations in Databases area located in \" North America \" .",
    "evidence": "",
    "idx": 1133
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t1`:`author`)\nMATCH (`t2`:`organization`)\nWHERE `t2`.`oid` = `t1`.`oid`\nAND (`t2`.`name` = 'University of Michigan')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me all the researchers in \" University of Michigan \" .",
    "evidence": "",
    "idx": 1134
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`organization`)\nMATCH (`t3`:`domain`)-[t4:has_author]->(`t1`:`author`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t3`.`did` = `t4`.`did`\nAND `t2`.`oid` = `t1`.`oid`\nAND (`t3`.`name` = 'Databases' AND `t2`.`name` = 'University of Michigan')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me all the researchers in Databases area in \" University of Michigan \" .",
    "evidence": "",
    "idx": 1135
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`domain`)-[t1:has_publication]->()\nMATCH (`t3`:`publication`)-[t1:belongs_to_domain]->()\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`pid` = `t1`.`pid`\nAND (`t2`.`name` = 'Databases' AND `t3`.`citation_num` > 200)\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper in Databases area with more than 200 citations .",
    "evidence": "",
    "idx": 1136
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB' AND `t2`.`citation_num` > 200)\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper in PVLDB with more than 200 citations .",
    "evidence": "",
    "idx": 1137
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB' AND `t2`.`citation_num` > 200)\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper in VLDB conference with more than 200 citations .",
    "evidence": "",
    "idx": 1138
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`citation_num` > 200 AND `publication`.`year` > 2000\nRETURN `publication`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper after 2000 with more than 200 citations .",
    "evidence": "",
    "idx": 1142
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`domain`)-[t1:has_publication]->()\nMATCH (`t3`:`publication`)-[t1:belongs_to_domain]->()\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`pid` = `t1`.`pid`\nAND (`t2`.`name` = 'Databases' AND `t3`.`citation_num` > 200 AND `t3`.`year` > 2000)\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper after 2000 in Databases area with more than 200 citations .",
    "evidence": "",
    "idx": 1143
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB' AND `t2`.`citation_num` > 200 AND `t2`.`year` > 2000)\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper after 2000 in PVLDB with more than 200 citations .",
    "evidence": "",
    "idx": 1144
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB' AND `t2`.`citation_num` > 200 AND `t2`.`year` > 2000)\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper after 2000 in VLDB conference with more than 200 citations .",
    "evidence": "",
    "idx": 1145
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`title` = 'Making database systems usable'\nWITH `publication`.`year` AS _groupby_col_0, sum(`publication`.`citation_num`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `year`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of citations of \" Making database systems usable \" in each year .",
    "evidence": "",
    "idx": 1150
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`publication`)-[t1:cites]->()\nMATCH (`t2`:`publication`)-[t1:cites]->()\nWHERE `t3`.`pid` = `t1`.`cited`\nAND `t2`.`pid` = `t1`.`citing`\nAND (`t3`.`title` = 'Making database systems usable' AND `t2`.`year` < 2010)\nRETURN COUNT(DISTINCT `t2`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of citations of \" Making database systems usable \" before 2010 .",
    "evidence": "",
    "idx": 1151
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB')\nRETURN COUNT(DISTINCT `t2`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers on VLDB conference .",
    "evidence": "",
    "idx": 1153
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB')\nRETURN COUNT(DISTINCT `t2`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers on PVLDB .",
    "evidence": "",
    "idx": 1154
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`year` > 2000\nRETURN COUNT(DISTINCT `publication`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers after 2000 .",
    "evidence": "",
    "idx": 1155
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB' AND `t2`.`year` > 2000)\nRETURN COUNT(DISTINCT `t2`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers on PVLDB after 2000 .",
    "evidence": "",
    "idx": 1156
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB' AND `t2`.`year` > 2000)\nRETURN COUNT(DISTINCT `t2`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers on VLDB conference after 2000 .",
    "evidence": "",
    "idx": 1157
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`keyword`:`keyword`)\nRETURN COUNT(DISTINCT `keyword`.`keyword`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of keywords .",
    "evidence": "",
    "idx": 1163
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`domain`)-[t2:has_keyword]->()\nMATCH (`t1`:`keyword`)-[t2:belongs_to_domain]->()\nWHERE `t3`.`did` = `t2`.`did`\nAND `t1`.`kid` = `t2`.`kid`\nAND (`t3`.`name` = 'Databases')\nRETURN COUNT(DISTINCT `t1`.`keyword`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of keywords in Databases area .",
    "evidence": "",
    "idx": 1164
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`publication`)-[t2:has_keyword]->(`t1`:`keyword`)\nWHERE `t2`.`kid` = `t1`.`kid`\nAND `t3`.`pid` = `t2`.`pid`\nAND (`t1`.`keyword` = 'Natural Language')\nRETURN COUNT(DISTINCT `t3`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers which contain the keyword \" Natural Language \" .",
    "evidence": "",
    "idx": 1165
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[t3:has_keyword]->(`t1`:`keyword`)\nWHERE `t3`.`kid` = `t1`.`kid`\nAND `t2`.`pid` = `t3`.`pid`\nAND (`t2`.`title` = 'Making database systems usable')\nRETURN COUNT(DISTINCT `t1`.`keyword`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of the keywords of \" Making database systems usable \" .",
    "evidence": "",
    "idx": 1166
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`publication`)-[t4:has_keyword]->(`t1`:`keyword`)\nMATCH (`t3`:`publication`)-[published_in_0:published_in]->(`t2`:`conference`)\nWHERE `t4`.`kid` = `t1`.`kid`\nAND `t3`.`pid` = `t4`.`pid`\nAND `t3`.`cid` = `t2`.`cid`\nAND (`t2`.`name` = 'VLDB')\nRETURN COUNT(DISTINCT `t1`.`keyword`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of keywords in VLDB conference .",
    "evidence": "",
    "idx": 1168
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[t4:has_keyword]->(`t1`:`keyword`)\nMATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t4`.`kid` = `t1`.`kid`\nAND `t2`.`pid` = `t4`.`pid`\nAND `t2`.`jid` = `t3`.`jid`\nAND (`t3`.`name` = 'PVLDB')\nRETURN COUNT(DISTINCT `t1`.`keyword`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of keywords in PVLDB .",
    "evidence": "",
    "idx": 1169
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t4`:`publication`)-[t2:has_keyword]->(`t1`:`keyword`)\nMATCH (`t4`:`publication`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t2`.`kid` = `t1`.`kid`\nAND `t4`.`pid` = `t2`.`pid`\nAND `t4`.`jid` = `t3`.`jid`\nAND (`t3`.`name` = 'PVLDB' AND `t1`.`keyword` = 'Keyword search')\nRETURN COUNT(DISTINCT `t4`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers in PVLDB containing keyword \" Keyword search \" .",
    "evidence": "",
    "idx": 1171
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t4`:`publication`)-[t3:has_keyword]->(`t1`:`keyword`)\nMATCH (`t4`:`publication`)-[published_in_0:published_in]->(`t2`:`conference`)\nWHERE `t3`.`kid` = `t1`.`kid`\nAND `t4`.`pid` = `t3`.`pid`\nAND `t4`.`cid` = `t2`.`cid`\nAND (`t2`.`name` = 'VLDB' AND `t1`.`keyword` = 'Information Retrieval')\nRETURN COUNT(DISTINCT `t4`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers in VLDB conference containing keyword \" Information Retrieval \" .",
    "evidence": "",
    "idx": 1172
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`publication`)-[t2:has_keyword]->(`t1`:`keyword`)\nWHERE `t2`.`kid` = `t1`.`kid`\nAND `t3`.`pid` = `t2`.`pid`\nAND (`t1`.`keyword` = 'Natural Language')\nRETURN sum(`t3`.`citation_num`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the total citations of the papers containing keyword \" Natural Language \"",
    "evidence": "",
    "idx": 1174
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`organization`:`organization`)\nRETURN COUNT(DISTINCT `organization`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of the organizations .",
    "evidence": "",
    "idx": 1175
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`organization`:`organization`)\nWHERE `organization`.`continent` = 'North America'\nRETURN COUNT(DISTINCT `organization`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of the organizations in \" North America \" .",
    "evidence": "",
    "idx": 1176
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`organization`)\nMATCH (`t3`:`domain`)-[t4:has_author]->(`t1`:`author`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t3`.`did` = `t4`.`did`\nAND `t2`.`oid` = `t1`.`oid`\nAND (`t3`.`name` = 'Databases')\nRETURN COUNT(DISTINCT `t2`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of organizations in Databases area .",
    "evidence": "",
    "idx": 1177
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`organization`)\nMATCH (`t3`:`domain`)-[t4:has_author]->(`t1`:`author`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t3`.`did` = `t4`.`did`\nAND `t2`.`oid` = `t1`.`oid`\nAND (`t3`.`name` = 'Databases' AND `t2`.`continent` = 'North America')\nRETURN COUNT(DISTINCT `t2`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of organizations in Databases area located in \" North America \" .",
    "evidence": "",
    "idx": 1178
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t1`:`author`)\nMATCH (`t2`:`organization`)\nWHERE `t2`.`oid` = `t1`.`oid`\nAND (`t2`.`name` = 'University of Michigan')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of researchers in \" University of Michigan \" .",
    "evidence": "",
    "idx": 1179
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`organization`)\nMATCH (`t3`:`domain`)-[t4:has_author]->(`t1`:`author`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t3`.`did` = `t4`.`did`\nAND `t2`.`oid` = `t1`.`oid`\nAND (`t3`.`name` = 'Databases' AND `t2`.`name` = 'University of Michigan')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of researchers in Databases area in \" University of Michigan \" .",
    "evidence": "",
    "idx": 1180
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB')\nRETURN sum(`t2`.`citation_num`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the total citations of all the papers in PVLDB .",
    "evidence": "",
    "idx": 1185
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB')\nRETURN `t2`.`citation_num` AS `citation_num`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the citations of each paper in PVLDB .",
    "evidence": "",
    "idx": 1186
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB' AND `t2`.`year` = 2005)\nRETURN sum(`t2`.`citation_num`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the total citations of papers in PVLDB in 2005 .",
    "evidence": "",
    "idx": 1187
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB')\nWITH `t2`.`year` AS _groupby_col_0, sum(`t2`.`citation_num`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `year`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the total citations of papers in PVLDB in each year .",
    "evidence": "",
    "idx": 1189
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB')\nWITH `t2`.`year` AS _groupby_col_0, COUNT(DISTINCT `t2`.`title`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers published in PVLDB in each year .",
    "evidence": "",
    "idx": 1190
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB')\nRETURN sum(`t2`.`citation_num`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the total citations of all the papers in the VLDB conference .",
    "evidence": "",
    "idx": 1191
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB')\nRETURN `t2`.`citation_num` AS `citation_num`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the citations of each paper in the VLDB conference .",
    "evidence": "",
    "idx": 1192
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB' AND `t2`.`year` = 2005)\nRETURN sum(`t2`.`citation_num`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the total citations of papers in the VLDB conference in 2005 .",
    "evidence": "",
    "idx": 1193
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB')\nWITH `t2`.`year` AS _groupby_col_0, sum(`t2`.`citation_num`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `year`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the total citations of papers in the VLDB conference in each year .",
    "evidence": "",
    "idx": 1195
  }
]