[
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`region`:`region`)\nRETURN `region`.`region_code` AS `region_code`, `region`.`region_name` AS `region_name` ORDER BY `region_code` IS NULL DESC, `region_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all region code and region name sorted by the codes.",
    "evidence": "",
    "idx": 3532
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`region`:`region`)\nRETURN `region`.`region_name` AS `region_name` ORDER BY `region_name` IS NULL DESC, `region_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all region names in alphabetical order.",
    "evidence": "",
    "idx": 3534
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`region`:`region`)\nWHERE `region`.`region_name` <> 'Denmark'\nRETURN `region`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names for all regions except for Denmark.",
    "evidence": "",
    "idx": 3536
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`region`:`region`)\nWHERE `region`.`region_name` <> 'Denmark'\nRETURN `region`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of all regions other than Denmark.",
    "evidence": "",
    "idx": 3537
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`storm`:`storm`)\nWHERE `storm`.`number_deaths` > 0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of storms in which at least 1 person died.",
    "evidence": "",
    "idx": 3539
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`storm`:`storm`)\nWHERE `storm`.`number_deaths` >= 1\nRETURN `storm`.`name` AS `name`, `storm`.`dates_active` AS `dates_active`, `storm`.`number_deaths` AS `number_deaths`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List name, dates active, and number of deaths for all storms with at least 1 death.",
    "evidence": "",
    "idx": 3540
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`storm`:`storm`)\nWHERE `storm`.`max_speed` > 1000\nRETURN avg(`storm`.`damage_millions_usd`) AS `_col_0`, MAX(`storm`.`damage_millions_usd`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average and maximum damage for all storms with max speed higher than 1000.",
    "evidence": "",
    "idx": 3542
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "CALL(*) {\nMATCH (`storm_sub0`:`storm`)\nRETURN avg(`storm_sub0`.`max_speed`) AS `_col_0_1`  \n}\nMATCH (`storm`:`storm`)\nWHERE `storm`.`max_speed` > `_col_0_1`\nRETURN sum(`storm`.`number_deaths`) AS `_col_0`, sum(`storm`.`damage_millions_usd`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of deaths and damage for all storms with a max speed greater than the average?",
    "evidence": "",
    "idx": 3544
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "CALL(*) {\nMATCH (`storm_sub0`:`storm`)\nRETURN avg(`storm_sub0`.`max_speed`) AS `_col_0_1`  \n}\nMATCH (`storm`:`storm`)\nWHERE `storm`.`max_speed` > `_col_0_1`\nRETURN sum(`storm`.`number_deaths`) AS `_col_0`, sum(`storm`.`damage_millions_usd`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the total number of deaths and total damange in millions for storms that had a max speed greater than the average.",
    "evidence": "",
    "idx": 3545
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`storm`:`storm`)\nORDER BY `storm`.`max_speed` IS NULL ASC, `storm`.`max_speed` DESC \nRETURN `storm`.`name` AS `name`, `storm`.`damage_millions_usd` AS `damage_millions_usd`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List name and damage for all storms in a descending order of max speed.",
    "evidence": "",
    "idx": 3546
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[affected_region_sub0:affects]->()\nRETURN `affected_region_sub0`.`region_id` AS `region_id`   } AS in_collect_0\nMATCH (`region`:`region`)\nWHERE NOT `region`.`region_id` IN in_collect_0\nRETURN `region`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name for regions not affected.",
    "evidence": "",
    "idx": 3550
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[affected_region_sub0:affects]->()\nRETURN `affected_region_sub0`.`storm_id` AS `storm_id`   } AS in_collect_0\nMATCH (`storm`:`storm`)\nWHERE NOT `storm`.`storm_id` IN in_collect_0\nRETURN `storm`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of storms which don't have affected region in record.",
    "evidence": "",
    "idx": 3552
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`t3`:`storm`)-[t1:affects]->(`t2`:`region`)\nWHERE `t1`.`region_id` = `t2`.`region_id`\nAND `t1`.`storm_id` = `t3`.`storm_id`\nAND (`t3`.`number_deaths` >= 10)\nRETURN `t2`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of the regions affected by storms that had a death count of at least 10.",
    "evidence": "",
    "idx": 3555
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`t3`:`storm`)-[t1:affects]->(`t2`:`region`)\nWHERE `t1`.`region_id` = `t2`.`region_id`\nAND `t1`.`storm_id` = `t3`.`storm_id`\nAND (`t2`.`region_name` = 'Denmark')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all storm names affecting region \"Denmark\".",
    "evidence": "",
    "idx": 3556
  },
  {
    "filename": "train_spider.json",
    "db_id": "storm_record",
    "gql_statement": "MATCH (`t3`:`storm`)-[t1:affects]->(`t2`:`region`)\nWHERE `t1`.`region_id` = `t2`.`region_id`\nAND `t1`.`storm_id` = `t3`.`storm_id`\nORDER BY `t3`.`number_deaths` IS NULL ASC, `t3`.`number_deaths` DESC \nRETURN `t2`.`region_name` AS `region_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the regions which were affected by the storm that killed the greatest number of people.",
    "evidence": "",
    "idx": 3558
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the total number of counties.",
    "evidence": "",
    "idx": 3561
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nRETURN `county`.`county_name` AS `county_name`, `county`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the county name and population of all counties.",
    "evidence": "",
    "idx": 3562
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nRETURN avg(`county`.`population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average population of all counties.",
    "evidence": "",
    "idx": 3564
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nRETURN MAX(`county`.`population`) AS `_col_0`, min(`county`.`population`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the maximum and minimum population among all counties.",
    "evidence": "",
    "idx": 3566
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`election`:`election`)\nRETURN DISTINCT `election`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the distinct districts for elections.",
    "evidence": "",
    "idx": 3568
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nWHERE `county`.`county_name` = 'Howard'\nRETURN `county`.`zip_code` AS `zip_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the zip code of the county with name \"Howard\".",
    "evidence": "",
    "idx": 3570
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nWHERE `county`.`county_name` = 'Howard'\nRETURN `county`.`zip_code` AS `zip_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the zip code the county named \"Howard\" is located in?",
    "evidence": "",
    "idx": 3571
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`election`:`election`)\nWHERE `election`.`district` = 1\nRETURN `election`.`delegate` AS `delegate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the delegate from district 1 in election.",
    "evidence": "",
    "idx": 3572
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`election`:`election`)\nRETURN `election`.`delegate` AS `delegate`, `election`.`committee` AS `committee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the delegate and committee information of elections.",
    "evidence": "",
    "idx": 3574
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`party`:`party`)\nRETURN COUNT(DISTINCT `party`.`governor`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of distinct governors.",
    "evidence": "",
    "idx": 3577
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`party`:`party`)\nWHERE `party`.`party` = 'Democratic'\nRETURN `party`.`lieutenant_governor` AS `lieutenant_governor`, `party`.`comptroller` AS `comptroller`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the lieutenant governor and comptroller from the democratic party.",
    "evidence": "",
    "idx": 3578
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`party`:`party`)\nWHERE `party`.`governor` = 'Eliot Spitzer'\nRETURN DISTINCT `party`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "In which distinct years was the governor \"Eliot Spitzer\"?",
    "evidence": "",
    "idx": 3580
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`party`:`party`)\nWHERE `party`.`governor` = 'Eliot Spitzer'\nRETURN DISTINCT `party`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct years when the governor was named \"Eliot Spitzer\".",
    "evidence": "",
    "idx": 3581
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`election`:`election`)\nRETURN `election`.`election_id` AS `election_id`, `election`.`counties_represented` AS `counties_represented`, `election`.`district` AS `district`, `election`.`delegate` AS `delegate`, `election`.`party` AS `party`, `election`.`first_elected` AS `first_elected`, `election`.`committee` AS `committee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the information about election.",
    "evidence": "",
    "idx": 3582
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`t2`:`election`)-[held_in_0:held_in]->(`t1`:`county`)\nWHERE `t1`.`county_id` = `t2`.`district`\nRETURN `t2`.`delegate` AS `delegate`, `t1`.`county_name` AS `county_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the delegates and the names of county they belong to.",
    "evidence": "",
    "idx": 3584
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`t2`:`election`)-[held_in_0:held_in]->(`t1`:`county`)\nWHERE `t1`.`county_id` = `t2`.`district`\nAND (`t1`.`population` < 100000)\nRETURN `t2`.`delegate` AS `delegate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the delegates who are from counties with population below 100000.",
    "evidence": "",
    "idx": 3587
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`t2`:`election`)-[held_in_0:held_in]->(`t1`:`county`)\nWHERE `t1`.`county_id` = `t2`.`district`\nAND (`t1`.`population` > 50000)\nRETURN COUNT(DISTINCT `t2`.`delegate`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of distinct delegates who are from counties with population above 50000.",
    "evidence": "",
    "idx": 3589
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`t2`:`election`)-[held_in_0:held_in]->(`t1`:`county`)\nWHERE `t1`.`county_id` = `t2`.`district`\nAND (`t2`.`committee` = 'Appropriations')\nRETURN `t1`.`county_name` AS `county_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which county do the delegates on \"Appropriations\" committee belong to? Give me the county names.",
    "evidence": "",
    "idx": 3591
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`t1`:`election`)-[affiliated_with_0:affiliated_with]->(`t2`:`party`)\nWHERE `t1`.`party` = `t2`.`party_id`\nRETURN `t1`.`delegate` AS `delegate`, `t2`.`party` AS `party`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the delegates and the names of the party they belong to.",
    "evidence": "",
    "idx": 3592
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`t1`:`election`)-[affiliated_with_0:affiliated_with]->(`t2`:`party`)\nWHERE `t1`.`party` = `t2`.`party_id`\nRETURN `t1`.`delegate` AS `delegate`, `t2`.`party` AS `party`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each delegate, find the names of the party they are part of.",
    "evidence": "",
    "idx": 3593
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`t1`:`election`)-[affiliated_with_0:affiliated_with]->(`t2`:`party`)\nWHERE `t1`.`party` = `t2`.`party_id`\nAND (`t2`.`party` = 'Democratic')\nRETURN `t1`.`committee` AS `committee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return all the committees that have delegates from Democratic party.",
    "evidence": "",
    "idx": 3598
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nORDER BY `county`.`population` IS NULL DESC, `county`.`population`  \nRETURN `county`.`county_name` AS `county_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of all counties sorted by population in ascending order.",
    "evidence": "",
    "idx": 3600
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nORDER BY `county`.`population` IS NULL DESC, `county`.`population`  \nRETURN `county`.`county_name` AS `county_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort the names of all counties in ascending order of population.",
    "evidence": "",
    "idx": 3601
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nRETURN `county`.`county_name` AS `county_name` ORDER BY `county_name` IS NULL ASC, `county_name` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of all counties sorted by county name in descending alphabetical order.",
    "evidence": "",
    "idx": 3602
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nRETURN `county`.`county_name` AS `county_name` ORDER BY `county_name` IS NULL ASC, `county_name` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort the names of all counties in descending alphabetical order.",
    "evidence": "",
    "idx": 3603
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nORDER BY `county`.`population` IS NULL ASC, `county`.`population` DESC \nRETURN `county`.`county_name` AS `county_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of the county with the biggest population.",
    "evidence": "",
    "idx": 3604
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nORDER BY `county`.`population` IS NULL ASC, `county`.`population` DESC \nRETURN `county`.`county_name` AS `county_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which county has the largest population? Give me the name of the county.",
    "evidence": "",
    "idx": 3605
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nORDER BY `county`.`population` IS NULL DESC, `county`.`population`  \nRETURN `county`.`county_name` AS `county_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the 3 counties with the smallest population.",
    "evidence": "",
    "idx": 3606
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`county`:`county`)\nORDER BY `county`.`population` IS NULL DESC, `county`.`population`  \nRETURN `county`.`county_name` AS `county_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the 3 counties that have the smallest population? Give me the county names.",
    "evidence": "",
    "idx": 3607
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`party`:`party`)\nWITH `party`.`party` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `party`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of the party that has at least two records.",
    "evidence": "",
    "idx": 3608
  },
  {
    "filename": "train_spider.json",
    "db_id": "election",
    "gql_statement": "MATCH (`party`:`party`)\nWITH `party`.`comptroller` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `comptroller`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the people that have been comptroller the most times and the corresponding number of times.",
    "evidence": "",
    "idx": 3610
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`journalist`:`journalist`)\nORDER BY `journalist`.`years_working` IS NULL DESC, `journalist`.`years_working`  \nRETURN `journalist`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of journalists in ascending order of years working.",
    "evidence": "",
    "idx": 3615
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`journalist`:`journalist`)\nWHERE `journalist`.`nationality` = 'England' OR `journalist`.`nationality` = 'Wales'\nRETURN `journalist`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of journalists from \"England\" or \"Wales\".",
    "evidence": "",
    "idx": 3617
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`journalist`:`journalist`)\nRETURN avg(`journalist`.`years_working`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average number of years spent working as a journalist?",
    "evidence": "",
    "idx": 3618
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`journalist`:`journalist`)\nWITH `journalist`.`nationality` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `nationality`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the different nationalities and the number of journalists of each nationality.",
    "evidence": "",
    "idx": 3620
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`event`:`event`)\nORDER BY `event`.`event_attendance` IS NULL ASC, `event`.`event_attendance` DESC \nRETURN `event`.`date` AS `date`, `event`.`name` AS `name`, `event`.`venue` AS `venue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the dates, places, and names of events in descending order of the attendance.",
    "evidence": "",
    "idx": 3621
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`t3`:`journalist`)-[t1:reports]->(`t2`:`event`)\nWHERE `t1`.`event_id` = `t2`.`event_id`\nAND `t1`.`journalist_id` = `t3`.`journalist_id`\nRETURN `t3`.`name` AS `name`, `t2`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of journalists and the dates of the events they reported.",
    "evidence": "",
    "idx": 3622
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`t3`:`journalist`)-[t1:reports]->(`t2`:`event`)\nWHERE `t1`.`event_id` = `t2`.`event_id`\nAND `t1`.`journalist_id` = `t3`.`journalist_id`\nORDER BY `t2`.`event_attendance` IS NULL DESC, `t2`.`event_attendance`  \nRETURN `t3`.`name` AS `name`, `t2`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of journalists and the names of the events they reported in ascending order",
    "evidence": "",
    "idx": 3623
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`t3`:`journalist`)-[t1:reports]->(`t2`:`event`)\nWHERE `t1`.`event_id` = `t2`.`event_id`\nAND `t1`.`journalist_id` = `t3`.`journalist_id`\nWITH `t3`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of journalists and the number of events they reported.",
    "evidence": "",
    "idx": 3624
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`t3`:`journalist`)-[t1:reports]->(`t2`:`event`)\nWHERE `t1`.`event_id` = `t2`.`event_id`\nAND `t1`.`journalist_id` = `t3`.`journalist_id`\nWITH `t3`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of journalists that have reported more than one event.",
    "evidence": "",
    "idx": 3625
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[news_report_sub0:reports]->()\nRETURN `news_report_sub0`.`journalist_id` AS `journalist_id`   } AS in_collect_0\nMATCH (`journalist`:`journalist`)\nWHERE NOT `journalist`.`journalist_id` IN in_collect_0\nRETURN `journalist`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of journalists who have not reported any event.",
    "evidence": "",
    "idx": 3626
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`t1`:`journalist`)-[t2:reports]->()\nWHERE `t1`.`journalist_id` = `t2`.`journalist_id`\nWITH `t2`.`work_type` AS _groupby_col_0, avg(toFloat(`t1`.`age`)) AS _groupby_col_1, avg(`t1`.`years_working`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `work_type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age and experience working length of journalists working on different role type.",
    "evidence": "",
    "idx": 3628
  },
  {
    "filename": "train_spider.json",
    "db_id": "news_report",
    "gql_statement": "MATCH (`event`:`event`)\nORDER BY `event`.`event_attendance` IS NULL ASC, `event`.`event_attendance` DESC \nRETURN `event`.`venue` AS `venue`, `event`.`name` AS `name`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the event venues and names that have the top 2 most number of people attended.",
    "evidence": "",
    "idx": 3629
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`restaurant`:`restaurant`)\nRETURN `restaurant`.`resname` AS `resname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show me all the restaurants.",
    "evidence": "",
    "idx": 3630
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`restaurant_type`:`restaurant_type`)\nRETURN `restaurant_type`.`restypename` AS `restypename`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all restaurant types.",
    "evidence": "",
    "idx": 3633
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`restaurant`:`restaurant`)\nRETURN `restaurant`.`resname` AS `resname`, `restaurant`.`rating` AS `rating` ORDER BY `rating` IS NULL ASC, `rating` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which restaurants have highest rating? List the restaurant name and its rating.",
    "evidence": "",
    "idx": 3635
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`major` = 600\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all students' first names and last names who majored in 600.",
    "evidence": "",
    "idx": 3638
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`age` > 18 AND `student`.`major` = 600\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which student's age is older than 18 and is majoring in 600? List each student's first and last name.",
    "evidence": "",
    "idx": 3641
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`age` > 18 AND `student`.`major` <> 600 AND `student`.`sex` = 'F'\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all female students age is older than 18 who is not majoring in 600. List students' first name and last name.",
    "evidence": "",
    "idx": 3642
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`restaurant`:`restaurant`)-[type_of_restaurant:has_type]->(`restaurant_type`:`restaurant_type`)\nWHERE `restaurant`.`resid` = `type_of_restaurant`.`resid`\nAND `type_of_restaurant`.`restypeid` = `restaurant_type`.`restypeid`\nWITH `type_of_restaurant`.`restypeid` AS _groupby_col_0, `restaurant_type`.`restypename` AS _groupby_col_1, COUNT(*) AS _groupby_col_2\nWHERE _groupby_col_1 = 'Sandwich'\nRETURN _groupby_col_2 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many restaurant is the Sandwich type restaurant?",
    "evidence": "",
    "idx": 3643
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`student`:`student`)-[visits_restaurant:visited]->()\nWHERE `student`.`stuid` = `visits_restaurant`.`stuid`\nAND (`student`.`fname` = 'Linda' AND `student`.`lname` = 'Smith')\nRETURN sum(`visits_restaurant`.`spent`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How long does student Linda Smith spend on the restaurant in total?",
    "evidence": "",
    "idx": 3644
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`student`:`student`)-[visits_restaurant:visited]->(`restaurant`:`restaurant`)\nWHERE `student`.`stuid` = `visits_restaurant`.`stuid`\nAND `visits_restaurant`.`resid` = `restaurant`.`resid`\nAND (`student`.`fname` = 'Linda' AND `student`.`lname` = 'Smith' AND `restaurant`.`resname` = 'Subway')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many times has the student Linda Smith visited Subway?",
    "evidence": "",
    "idx": 3645
  },
  {
    "filename": "train_spider.json",
    "db_id": "restaurant_1",
    "gql_statement": "MATCH (`student`:`student`)-[visits_restaurant:visited]->(`restaurant`:`restaurant`)\nWHERE `student`.`stuid` = `visits_restaurant`.`stuid`\nAND `visits_restaurant`.`resid` = `restaurant`.`resid`\nAND (`student`.`fname` = 'Linda' AND `student`.`lname` = 'Smith' AND `restaurant`.`resname` = 'Subway')\nRETURN `visits_restaurant`.`time` AS `time`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When did Linda Smith visit Subway?",
    "evidence": "",
    "idx": 3646
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "MATCH (`actual_orders`:`actual_orders`)\nWHERE `actual_orders`.`order_status_code` = 'Success'\nRETURN `actual_orders`.`actual_order_id` AS `actual_order_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the ids of orders whose status is 'Success'.",
    "evidence": "",
    "idx": 3647
  },
  {
    "filename": "train_spider.json",
    "db_id": "customer_deliveries",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of customers in total.",
    "evidence": "",
    "idx": 3648
  }
]