[
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`submitted via` = 'Postal mail')\nRETURN t1.`email` AS `email`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the email address of clients who submitted their complaints via postal mail?",
    "evidence": "via postal mail refers to Submitted via = 'Postal mail'",
    "idx": 158
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[located_in_0:`located_in`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`division` = 'Middle Atlantic' AND t1.`sex` = 'Female' AND t1.`age` < 18)\nRETURN COUNT(t1.`sex`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the clients in Middle Atlantic, how many are them are female and no more than 18 years old?",
    "evidence": "in Middle Atlantic refers to division = 'Middle Atlantic'; female refers to sex = 'Female'; no more than 18 refers to age < 18",
    "idx": 161
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (client@`client`)\nWHERE client.`sex` = 'Female' AND client.`age` > 30\nRETURN COUNT(client.`sex`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female clients are there older than 30?",
    "evidence": "female refers to sex = 'Female'; older than 30 refers to age > 30",
    "idx": 166
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (client@`client`)\nWHERE client.`sex` = 'Male'\nRETURN MAX(client.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the oldest age of male clients?",
    "evidence": "oldest age refers to max(age); male refers to sex = 'Male'",
    "idx": 168
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[located_in_0:`located_in`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`division` = 'South Atlantic')\nRETURN cast (sum(CASE  WHEN t1.`sex` = 'Female' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`sex`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of female clients in the Middle Atlantic?",
    "evidence": "female refers to sex = 'Female'; the Middle Atlantic refers to division = 'Middle Atlantic'; percentage = divide(count(client_id where sex = 'Female' and division = 'Middle Atlantic') , count(client_id where division = 'Middle Atlantic')) * 100%",
    "idx": 170
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[located_in_0:`located_in`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`division` = 'South Atlantic')\nRETURN avg(t1.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average age of clients in South Atlantic?",
    "evidence": "in South Atlantic refers to division = 'South Atlantic'; average age refers to avg(age)",
    "idx": 171
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[located_in_0:`located_in`]->(t2@`district`)-[in_state_0:`in_state`]->(t3@`state`)\nWHERE t1.`district_id` = t2.`district_id`\nAND t2.`state_abbrev` = t3.`statecode`\nAND (t3.`region` = 'Northeast' AND like(t1.`email`,'%@outlook.com'))\nRETURN COUNT(t1.`email`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers in the Northeast use Microsoft email?",
    "evidence": "the Northeast refers to Region = 'Northeast'; Microsoft email refers to email like '%@outlook.com'",
    "idx": 172
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`city` = 'Portland' AND like(cast (t2.`date received` as string),'2015%') AND t2.`issue` = 'Billing disputes')\nRETURN COUNT(t1.`client_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In 2015, how many complaints about Billing disputes were sent by clients in Portland?",
    "evidence": "in 2015 refers to Date received LIKE'2015%'; about Billing disputes refers to Issue = 'Billing disputes'; Portland refers to city = 'Portland'",
    "idx": 176
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`reviews`)-[from_district_0:`from_district`]->(t1@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t1.`city` = 'Nashville' AND t1.`state_abbrev` = 'TN' AND t2.`product` = 'Eagle National Mortgage' AND t2.`stars` = 5)\nRETURN COUNT(t2.`stars`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In reviews for the Eagle National Bank product, how many of the 5 star reviews where from Nashville, Tennessee?",
    "evidence": "5 star refers to Stars = 5; Nashville refers to city = 'Nashville'; Tennessee refers to state_abbrev = 'TN'",
    "idx": 181
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`sex` = 'Male' AND t1.`age` < 25)\nRETURN DISTINCT t2.`issue` AS `issue`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the issues of the complains of male clients and products from age 25 and below?",
    "evidence": "male refers to sex = 'Male'; age 25 and below refers to age < 25",
    "idx": 182
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t3@`reviews`)-[from_district_0:`from_district`]->(t2@`district`)-[in_state_0:`in_state`]->(t1@`state`)\nWHERE t1.`statecode` = t2.`state_abbrev`\nAND t2.`district_id` = t3.`district_id`\nAND (t1.`region` = 'Midwest' AND t3.`stars` = 1)\nRETURN DISTINCT t3.`product` AS `product_`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the reviews from midwest region, what are the products that received 1 star?",
    "evidence": "1 star refers to Stars = 1",
    "idx": 183
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`reviews`)-[from_district_0:`from_district`]->(t1@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`stars` = 5 AND t2.`date` = date('2017-12-17') AND t2.`product` = 'Eagle National Mortgage')\nRETURN t1.`division` AS `division`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the division of the review of 5 stars received on December 17, 2017 for the product Eagle National Mortgage?",
    "evidence": "5 stars refers to Stars = 5; on December 17 2017 refers to Date = '2017-12-17'",
    "idx": 185
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`reviews`)-[from_district_0:`from_district`]->(t1@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`stars` = 5)\nRETURN cast (sum(CASE  WHEN t1.`division` = 'East North Central' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`division`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In reviews of product with 5 stars, what is the percentage of the reviews coming from the division of East North Central?",
    "evidence": "5 stars refers to Stars = 5; percentage = divide(count(division = 'East North Central', count(division)) * 100%",
    "idx": 188
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`person`)-[t2:`worked_on`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`person_name` = 'Dariusz Wolski' AND t2.`job` = 'Director of Photography')\nRETURN COUNT(t2.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In how many movie does Dariusz Wolski work as the director of photography?",
    "evidence": "director of photography refers to job = 'Director of Photography'",
    "idx": 194
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_crew`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t3.`person_name` = 'Dariusz Wolski' AND t2.`job` = 'Director of Photography')\nORDER BY t1.`vote_average` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the movie in which Dariusz Wolski works as the director of photography, what is the title of the one with the highest average vote?",
    "evidence": "director of photography refers to job = 'Director of Photography'; highest average vote refers to max(vote_average)",
    "idx": 195
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_crew`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t3.`person_name` = 'Dariusz Wolski')\nORDER BY t1.`release_date` DESC NULLS LAST \nRETURN t1.`release_date` AS `release_date` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When was the release date of the latest movie in which Dariusz Wolski worked as a crew member?",
    "evidence": "release date of the latest movie refers to max(release_date)",
    "idx": 196
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_crew`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t3.`person_name` = 'Dariusz Wolski' AND t2.`job` = 'Director of Photography')\nRETURN cast (COUNT(CASE  WHEN t1.`vote_average` > 5 THEN 1 ELSE NULL END) as float) * 100 / COUNT(t1.`vote_average`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the movie in which Dariusz Wolski works as the director of photography, what is the percentage of those movie whose vote average is over 5.0?",
    "evidence": "director of photography refers to job = 'Director of Photography'; vote average is over 8.0 refers to vote_average > 5; percentage = divide(sum(movie_id) when vote_average > 5, count(movie_id)) as percentage",
    "idx": 197
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_crew`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t3.`person_name` = 'Dariusz Wolski' AND t2.`job` = 'Director of Photography')\nRETURN cast (sum(t1.`revenue`) as float) / COUNT(t1.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average revenue of the movie in which Dariusz Wolski works as the director of photography?",
    "evidence": "director of photography refers to job = 'Director of Photography'; average revenue = divide(sum(revenue), count(movie_id))",
    "idx": 198
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`person`)-[t2:`worked_on`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`person_name` = 'Michael Bay' AND t2.`job` = 'Director')\nRETURN COUNT(t2.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies were directed by Michael Bay?",
    "evidence": "directed by refers to job = 'Director'",
    "idx": 201
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_crew`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t1.`title` = 'Land of the Dead' AND t2.`job` = 'Director')\nRETURN t3.`person_name` AS `person_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the movie \"Land of the Dead\", who is its director?",
    "evidence": "\"Land of the Dead\" refers to title = 'Land of the Dead'; director refers to person_name where job = 'Director'",
    "idx": 203
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t4@`department`)\nMATCH (t1@`movie`)-[t2:`has_crew`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND t2.`department_id` = t4.`department_id`\nAND (t3.`person_name` = 'Marcia Ross' AND t1.`title` = 'Reign of Fire')\nRETURN t4.`department_name` AS `department_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the movie \"Reign of Fire\", which department was Marcia Ross in?",
    "evidence": "movie \"Reign of Fire\" refers to title = 'Reign of Fire'; which department refers to department_name",
    "idx": 208
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (movie@`movie`)\nORDER BY movie.`budget` DESC NULLS LAST \nRETURN movie.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the movie that was made with the most money and resources?",
    "evidence": "made with the most money and resources refers to max(budget)",
    "idx": 211
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (movie@`movie`)\nWHERE movie.`revenue` > 1000000000\nRETURN COUNT(movie.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies have made at least 1 Billion at the box office?",
    "evidence": "have made at least 1 Billion at the box office refers to revenue > 1000000000",
    "idx": 212
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (person@`person`)\nWHERE person.`person_name` = 'John Young'\nRETURN COUNT(person.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many crew are named John Young?",
    "evidence": "",
    "idx": 213
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (person@`person`)\nWHERE person.`person_id` = 1325273\nRETURN person.`person_name` AS `person_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the person associated with the crew id 1325273?",
    "evidence": "Who is the person refers to person_name; crew id 1325273 refers to person_id = 1325273",
    "idx": 215
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_cast`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t2.`character_name` = 'Captain Jack Sparrow' AND like(t1.`title`,'Pirates of the Caribbean%'))\nRETURN DISTINCT t3.`person_name` AS `person_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who played Captain Jack Sparrow in all of the Pirates of the Caribbean movies?",
    "evidence": "Captain Jack Sparrow refers to character_name = 'Captain Jack Sparrow'; Pirates of the Caribbean movies refers to title LIKE 'Pirates of the Carribbean%'",
    "idx": 216
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`production_company`)\nMATCH (t2@`movie_company`)\nWHERE t1.`company_id` = t2.`company_id`\nAND (t1.`company_name` = 'Universal Studios')\nRETURN COUNT(t2.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies did Universal Studios release?",
    "evidence": "Universal Studios refers to company_name = 'Universal Studios'",
    "idx": 217
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`person`)-[t2:`acted_in`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`person_name` = 'Harrison Ford')\nRETURN COUNT(t2.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies did Harrison Ford appear in total?",
    "evidence": "",
    "idx": 219
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_cast`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t3.`person_name` = 'Jamie Foxx')\nORDER BY t1.`release_date` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of Jamie Foxx's most recent movie?",
    "evidence": "most recent movie refers to max(release_date)",
    "idx": 220
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_genre`]->(t3@`genre`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`genre_id` = t3.`genre_id`\nAND (t3.`genre_name` = 'Crime')\nORDER BY t1.`release_date`  NULLS FIRST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the first crime movie ever released?",
    "evidence": "first crime movie ever released refers to min(release_date) and genre_name = 'Crime'",
    "idx": 221
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH ()-[t1:`has_genre`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`genre_id`\nAND (t2.`genre_name` = 'Horror')\nRETURN COUNT(t1.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many horror movies are there?",
    "evidence": "horror movies refers to genre_name = 'Horror'",
    "idx": 222
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH ()-[movie_crew:`has_crew`]->()\nWHERE movie_crew.`movie_id` = 129 AND movie_crew.`job` = 'Animation'\nRETURN COUNT(movie_crew.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many animators does Movie No. 129 have?",
    "evidence": "animators refers to job = 'Animation'; Movie No. 129 refers to movie_id = 129",
    "idx": 224
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`person`)-[t2:`acted_in`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`person_name` = 'Bob Peterson')\nRETURN COUNT(t2.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times did Bob Peterson appear in the movie credits?",
    "evidence": "",
    "idx": 227
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_cast`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t3.`person_name` = 'Uma Thurman' AND t1.`release_date` >= date('1990-01-01') AND t1.`release_date` <= date('2000-12-31'))\nRETURN COUNT(t1.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many films released between 1/2/1990 and 12/30/2000 starred Uma Thurman?",
    "evidence": "released between 1/2/1990 and 12/30/2000 refers to release_date BETWEEN '1990-01-02' AND '2000-12-30'; film has the same meaning as movie; starred Uma Thurman refers to person_name = 'Uma Thurman'",
    "idx": 231
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`produced_in`]->()\nWHERE t1.`movie_id` = t2.`movie_id`\nAND (t1.`revenue` > 75000000 AND t1.`popularity` >= 20 AND t1.`release_date` >= date('1990-01-01') AND t1.`release_date` <= date('2003-12-31'))\nRETURN COUNT(t2.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Indian movies between 1/2/1990 and 12/30/2003 have revenue of more than 75,000,000 and popularity of no less than 20?",
    "evidence": "Indian movies refers to country_name = 'India'; between 1/2/1990 and 12/30/2003 refers to release_date BETWEEN '1990-01-02' AND '2003-12-30'; revenue of more than 75,000,000 refers to revenue > 75000000; popularity of no less than 20 refers to popularity > = 20",
    "idx": 234
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_genre`]->(t4@`genre`)\nMATCH (t1@`movie`)-[t3:`produced_in`]->(t5@`country`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t1.`movie_id` = t3.`movie_id`\nAND t2.`genre_id` = t4.`genre_id`\nAND t3.`country_id` = t5.`country_id`\nAND (t5.`country_name` = 'India' AND t1.`release_date` >= date('2015-01-01') AND t1.`release_date` <= date('2015-12-31'))\nRETURN cast (COUNT(CASE  WHEN t4.`genre_name` = 'Romance' THEN t1.`movie_id` ELSE NULL END) as float) * 100 / COUNT(t1.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of romance films among films produced in India in 2015?",
    "evidence": "romance films refers to genre_name = 'Romance'; in India refers to country_name = 'India'; 2015 refers to release_date BETWEEN '2015-01-01' AND '2015-01-31'; percentage = divide(sum(movie_id) when genre_name = 'Romance', count(movie_id)) as percentage",
    "idx": 237
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`person`)-[t2:`acted_in`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t2.`character_name` = 'Optimus Prime (voice)')\nRETURN DISTINCT t1.`person_name` AS `person_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which actor plays Optimus Prime?",
    "evidence": "Which actor refers to person_name; Optimus Prime refers to character_name = 'Optimus Prime (voice)'",
    "idx": 238
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_genre`]->(t3@`genre`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`genre_id` = t3.`genre_id`\nAND (t1.`title` = 'Sky Captain and the World of Tomorrow')\nRETURN t3.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the genres of Sky Captain and the World of Tomorrow?",
    "evidence": "genres refers to genre_name; Sky Captain and the World of Tomorrow refers to title = 'Sky Captain and the World of Tomorrow'",
    "idx": 240
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`produced_in`]->(t3@`country`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`country_id` = t3.`country_id`\nAND (t1.`title` = 'Gojira ni-sen mireniamu')\nRETURN t3.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "The movie 'Gojira ni-sen mireniamu' is from which country?",
    "evidence": "movie 'Gojira ni-sen mireniamu' refers to title = 'Gojira ni-sen mireniamu'; which country refers to country_name",
    "idx": 241
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_genre`]->(t4@`genre`)\nMATCH (t1@`movie`)-[t3:`produced_in`]->(t5@`country`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t1.`movie_id` = t3.`movie_id`\nAND t2.`genre_id` = t4.`genre_id`\nAND t3.`country_id` = t5.`country_id`\nAND (t5.`country_name` = 'Japan')\nRETURN cast (COUNT(CASE  WHEN t4.`genre_name` = 'Animation' THEN t1.`movie_id` ELSE NULL END) as float) * 100 / COUNT(t1.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of movies that came from Japan belong in the 'animation' genre?",
    "evidence": "from Japan refers to country_name = 'Japan'; in the 'animation' genre refers to genre_name = 'animation'; percentage = divide(sum(movie_id) when genre_name = 'animation', count(movie_id)) as percentage",
    "idx": 245
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_genre`]->(t3@`genre`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`genre_id` = t3.`genre_id`\nORDER BY t1.`revenue`  NULLS FIRST \nRETURN t3.`genre_name` AS `genre_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre of the movie title with the lowest revenue generated?",
    "evidence": "genre refers to genre_name; lowest revenue refers to min(revenue)",
    "idx": 251
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_genre`]->(t3@`genre`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`genre_id` = t3.`genre_id`\nORDER BY t1.`vote_average` DESC NULLS LAST,t1.`revenue`  NULLS FIRST \nRETURN t3.`genre_name` AS `genre_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre of the movie title which was well-received by the audiences but made the lowest revenue?",
    "evidence": "genre refers to genre_name; well-received by the audiences refers to max(vote_average); lowest revenue refers to min(revenue)",
    "idx": 253
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (movie@`movie`)\nWHERE movie.`budget` = 0\nORDER BY movie.`revenue` DESC NULLS LAST \nRETURN movie.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the zero-budget movie titles, which one has made the highest revenue?",
    "evidence": "zero-budget refers to budget = 0; highest revenue refers to max(revenue)",
    "idx": 258
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_language`]->(t3@`language`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`language_id` = t3.`language_id`\nAND (t3.`language_name` = 'Nederlands')\nRETURN DISTINCT CASE  WHEN t1.`movie_status` = 'Post Production' THEN 'YES' ELSE 'NO' END AS `yorn`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Are there any post-production movies in Nederlands?",
    "evidence": "post-production movies refers to movie_status = 'Post Production'; Nederlands refers to language_name = 'Nederlands';",
    "idx": 263
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_language`]->(t3@`language`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`language_id` = t3.`language_id`\nAND (t3.`language_name` = 'Latin')\nRETURN avg(t1.`revenue`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average revenue made by Latin movies?",
    "evidence": "Latin movies refers to language_name = 'Latin'; average revenue = AVG(revenue)",
    "idx": 267
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (movie@`movie`)\nRETURN MAX(movie.`runtime`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the longest runtime of all movies?",
    "evidence": "longest runtime refers to max(runtime)",
    "idx": 269
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH ()-[t1:`has_language`]->(t2@`language`)\nWHERE t1.`language_id` = t2.`language_id`\nAND (t2.`language_code` = 'vi')\nRETURN COUNT(t1.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies have \"vi\" as their language code?",
    "evidence": "\"vi\" as their language code refers to language_code = 'vi'",
    "idx": 274
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_crew`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t2.`job` = 'Director')\nORDER BY t1.`popularity` DESC NULLS LAST \nRETURN t3.`person_name` AS `person_name` \nLIMIT 5",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the top 5 most popular movie directors?",
    "evidence": "directors refers to job = 'Director'; most popular refers to max(popularity)",
    "idx": 278
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`produced_in`]->(t3@`country`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`country_id` = t3.`country_id`\nRETURN cast (COUNT(CASE  WHEN t3.`country_iso_code` = 'US' THEN t1.`movie_id` ELSE NULL END) as float) * 100 / COUNT(t1.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of films are made in the US?",
    "evidence": "films' and 'movies' are synonyms; made in the US refers to country_iso_code = 'US'; percentage = divide(sum(country_id) when country_iso_code = 'US', count(country_id)) * 100 as percentage",
    "idx": 280
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t2@`gender`)\nMATCH ()-[t1:`has_cast`]->()\nWHERE t1.`gender_id` = t2.`gender_id`\nRETURN cast (COUNT(CASE  WHEN t2.`gender` = 'Female' THEN t1.`person_id` ELSE NULL END) as float) / COUNT(CASE  WHEN t2.`gender` = 'Male' THEN t1.`person_id` ELSE NULL END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average ratio between female and male actors in a movie?",
    "evidence": "female refers to gender = 'Female'；male refers to gender = 'Male'; average ratio = divide(divide(sum(gender_id) when gender = 'Female', sum(gender_id) when gender = 'Male'), count(movie_id)) as percentage",
    "idx": 281
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`country`)-[t2:`country_produced`]->()\nWHERE t1.`country_id` = t2.`country_id`\nAND (t1.`country_name` = 'Canada')\nRETURN COUNT(t2.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies were produced in Canada?",
    "evidence": "produced in Canada refers to country_name = 'Canada'",
    "idx": 292
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_genre`]->(t3@`genre`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`genre_id` = t3.`genre_id`\nAND (t1.`title` = 'Dancer in the Dark')\nRETURN t3.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which genre does the movie Dancer in the Dark belong to?",
    "evidence": "genre refers to genre_name; movie Dancer in the Dark refers to title = 'Dancer in the Dark'",
    "idx": 295
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`person`)-[t2:`worked_on`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`person_name` = 'Mark Hammel')\nRETURN t2.`job` AS `job`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the role of Mark Hammel?",
    "evidence": "role refers to job",
    "idx": 297
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_cast`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t3.`person_name` = 'Harrison Ford')\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which movies have the participation of actor Harrison Ford?",
    "evidence": "Which movies refers to title; actor refers to person_name",
    "idx": 298
  }
]