[
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`chip_model`:`chip_model`)\nWHERE `chip_model`.`launch_year` >= 2002 AND `chip_model`.`launch_year` <= 2004\nRETURN `chip_model`.`model_name` AS `model_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "the names of models that launched between 2002 and 2004.",
    "evidence": "",
    "idx": 2185
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`chip_model`:`chip_model`)\nRETURN `chip_model`.`model_name` AS `model_name`, `chip_model`.`ram_mib` AS `ram_mib` ORDER BY `ram_mib` IS NULL DESC, `ram_mib`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which model has the least amount of RAM? List the model name and the amount of RAM.",
    "evidence": "",
    "idx": 2186
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`phone`:`phone`)\nWHERE `phone`.`hardware_model_name` = 'LG-P760'\nRETURN `phone`.`chip_model` AS `chip_model`, `phone`.`screen_mode` AS `screen_mode`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the chip model and screen mode of the phone with hardware model name \"LG-P760\"?",
    "evidence": "",
    "idx": 2187
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`phone`:`phone`)\nWHERE `phone`.`company_name` = 'Nokia Corporation'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many phone hardware models are produced by the company named \"Nokia Corporation\"?",
    "evidence": "",
    "idx": 2188
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_chip_model_0:has_chip_model]->(`t1`:`chip_model`)\nWHERE `t1`.`model_name` = `t2`.`chip_model`\nAND (`t2`.`company_name` = 'Nokia Corporation')\nRETURN MAX(`t1`.`ram_mib`) AS `_col_0`, min(`t1`.`ram_mib`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is maximum and minimum RAM size of phone produced by company named \"Nokia Corporation\"?",
    "evidence": "",
    "idx": 2189
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_chip_model_0:has_chip_model]->(`t1`:`chip_model`)\nWHERE `t1`.`model_name` = `t2`.`chip_model`\nAND (`t2`.`company_name` = 'Nokia Corporation')\nRETURN avg(`t1`.`rom_mib`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average ROM size of phones produced by the company named \"Nokia Corporation\"?",
    "evidence": "",
    "idx": 2190
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_chip_model_0:has_chip_model]->(`t1`:`chip_model`)\nWHERE `t1`.`model_name` = `t2`.`chip_model`\nAND (`t1`.`launch_year` = 2002 OR `t1`.`ram_mib` > 32)\nRETURN `t2`.`hardware_model_name` AS `hardware_model_name`, `t2`.`company_name` AS `company_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the hardware model name and company name for all the phones that were launched in year 2002 or have RAM size greater than 32.",
    "evidence": "",
    "idx": 2191
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`phone`:`phone`)\nWHERE `phone`.`accreditation_type` =~ '(?i)(?s)Full'\nRETURN `phone`.`hardware_model_name` AS `hardware_model_name`, `phone`.`company_name` AS `company_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all phones that have word 'Full' in their accreditation types. List the Hardware Model name and Company name.",
    "evidence": "",
    "idx": 2192
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_screen_mode_0:has_screen_mode]->(`t1`:`screen_mode`)\nWHERE `t1`.`graphics_mode` = `t2`.`screen_mode`\nAND (`t2`.`hardware_model_name` = 'LG-P760')\nRETURN `t1`.`char_cells` AS `char_cells`, `t1`.`pixels` AS `pixels`, `t1`.`hardware_colours` AS `hardware_colours`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the Char cells, Pixels and Hardware colours for the screen of the phone whose hardware model name is \"LG-P760\".",
    "evidence": "",
    "idx": 2193
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_screen_mode_0:has_screen_mode]->(`t1`:`screen_mode`)\nWHERE `t1`.`graphics_mode` = `t2`.`screen_mode`\nAND (`t1`.`type` = 'Graphics')\nRETURN `t2`.`hardware_model_name` AS `hardware_model_name`, `t2`.`company_name` AS `company_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the hardware model name and company name for the phone whose screen mode type is \"Graphics.\"",
    "evidence": "",
    "idx": 2194
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`phone`:`phone`)\nWITH `phone`.`company_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `company_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL DESC, `_col_1`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the company that has the least number of phone models. List the company name and the number of phone model produced by that company.",
    "evidence": "",
    "idx": 2195
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`phone`:`phone`)\nWITH `phone`.`company_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `company_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of the company that produced more than one phone model.",
    "evidence": "",
    "idx": 2196
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`screen_mode`:`screen_mode`)\nRETURN MAX(`screen_mode`.`used_kb`) AS `_col_0`, min(`screen_mode`.`used_kb`) AS `_col_1`, avg(`screen_mode`.`used_kb`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the maximum, minimum and average number of used kb in screen mode.",
    "evidence": "",
    "idx": 2197
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_chip_model_0:has_chip_model]->(`t1`:`chip_model`)\nWHERE `t1`.`model_name` = `t2`.`chip_model`\nAND (`t1`.`launch_year` = 2002)\nORDER BY `t1`.`ram_mib` IS NULL ASC, `t1`.`ram_mib` DESC \nRETURN `t2`.`hardware_model_name` AS `hardware_model_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of the phone model launched in year 2002 and with the highest RAM size.",
    "evidence": "",
    "idx": 2198
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_chip_model_0:has_chip_model]->(`t1`:`chip_model`)\nMATCH (`t2`:`phone`)-[has_screen_mode_0:has_screen_mode]->(`t3`:`screen_mode`)\nWHERE `t1`.`model_name` = `t2`.`chip_model`\nAND `t2`.`screen_mode` = `t3`.`graphics_mode`\nAND (`t2`.`hardware_model_name` = 'LG-P760')\nRETURN `t1`.`wifi` AS `wifi`, `t3`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the wifi and screen mode type of the hardware model named \"LG-P760\"?",
    "evidence": "",
    "idx": 2199
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_chip_model_0:has_chip_model]->(`t1`:`chip_model`)\nMATCH (`t2`:`phone`)-[has_screen_mode_0:has_screen_mode]->(`t3`:`screen_mode`)\nWHERE `t1`.`model_name` = `t2`.`chip_model`\nAND `t2`.`screen_mode` = `t3`.`graphics_mode`\nAND (`t3`.`type` = 'Text' OR `t1`.`ram_mib` > 32)\nRETURN `t2`.`hardware_model_name` AS `hardware_model_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the hardware model name for the phones that have screen mode type \"Text\" or RAM size greater than 32.",
    "evidence": "",
    "idx": 2200
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_screen_mode_0:has_screen_mode]->(`t1`:`screen_mode`)\nWHERE `t1`.`graphics_mode` = `t2`.`screen_mode`\nAND (`t1`.`type` = 'Graphics' OR `t2`.`company_name` = 'Nokia Corporation')\nRETURN DISTINCT `t2`.`hardware_model_name` AS `hardware_model_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the hardware model name for the phones that were produced by \"Nokia Corporation\" or whose screen mode type is \"Graphics.\"",
    "evidence": "",
    "idx": 2201
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_screen_mode_0:has_screen_mode]->(`t1`:`screen_mode`)\nWHERE `t1`.`graphics_mode` = `t2`.`screen_mode`\nAND (`t2`.`company_name` = 'Nokia Corporation' AND `t1`.`type` <> 'Text')\nRETURN DISTINCT `t2`.`hardware_model_name` AS `hardware_model_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the hardware model name for the phons that were produced by \"Nokia Corporation\" but whose screen mode type is not Text.",
    "evidence": "",
    "idx": 2202
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`t2`:`phone`)-[has_screen_mode_0:has_screen_mode]->(`t1`:`screen_mode`)\nWHERE `t1`.`graphics_mode` = `t2`.`screen_mode`\nAND (`t1`.`used_kb` >= 10 AND `t1`.`used_kb` <= 15)\nRETURN DISTINCT `t2`.`hardware_model_name` AS `hardware_model_name`, `t2`.`company_name` AS `company_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the phone hardware model and company name for the phones whose screen usage in kb is between 10 and 15.",
    "evidence": "",
    "idx": 2203
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`phone`:`phone`)\nWITH `phone`.`accreditation_type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `accreditation_type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of phones for each accreditation type.",
    "evidence": "",
    "idx": 2204
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`phone`:`phone`)\nWITH `phone`.`accreditation_level` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `accreditation_level`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the accreditation level that more than 3 phones use.",
    "evidence": "",
    "idx": 2206
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`chip_model`:`chip_model`)\nRETURN `chip_model`.`model_name` AS `model_name`, `chip_model`.`launch_year` AS `launch_year`, `chip_model`.`ram_mib` AS `ram_mib`, `chip_model`.`rom_mib` AS `rom_mib`, `chip_model`.`slots` AS `slots`, `chip_model`.`wifi` AS `wifi`, `chip_model`.`bluetooth` AS `bluetooth`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the details for all chip models.",
    "evidence": "",
    "idx": 2207
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`chip_model`:`chip_model`)\nWHERE `chip_model`.`wifi` = 'No'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of chip model that do not have wifi.",
    "evidence": "",
    "idx": 2209
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "MATCH (`chip_model`:`chip_model`)\nORDER BY `chip_model`.`launch_year` IS NULL DESC, `chip_model`.`launch_year`  \nRETURN `chip_model`.`model_name` AS `model_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the model names sorted by their launch year.",
    "evidence": "",
    "idx": 2210
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`phone_sub0`:`phone`)\nRETURN `phone_sub0`.`chip_model` AS `chip_model`   } AS in_collect_0\nMATCH (`chip_model`:`chip_model`)\nWHERE NOT `chip_model`.`model_name` IN in_collect_0\nRETURN avg(`chip_model`.`ram_mib`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average ram mib size of the chip models that are never used by any phone.",
    "evidence": "",
    "idx": 2211
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "MATCH (`country`:`country`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of countries.",
    "evidence": "",
    "idx": 2213
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "MATCH (`country`:`country`)\nRETURN `country`.`country_name` AS `country_name`, `country`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the country name and capital of all countries.",
    "evidence": "",
    "idx": 2214
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`official_native_language` =~ '(?i)(?s).*English.*'\nRETURN `country`.`official_native_language` AS `official_native_language`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all official native languages that contain the word \"English\".",
    "evidence": "",
    "idx": 2216
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "MATCH (`player`:`player`)\nRETURN `player`.`player` AS `player`, `player`.`years_played` AS `years_played`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the players and the years played.",
    "evidence": "",
    "idx": 2228
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "MATCH (`team`:`team`)\nRETURN `team`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all team names.",
    "evidence": "",
    "idx": 2230
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "MATCH (`t1`:`player`)-[plays_for_0:plays_for]->(`t2`:`team`)\nWHERE `t1`.`team` = `t2`.`team_id`\nAND (`t2`.`name` = 'Columbus Crew')\nRETURN `t1`.`player` AS `player`, `t1`.`years_played` AS `years_played`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the players and years played for players from team \"Columbus Crew\".",
    "evidence": "",
    "idx": 2248
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "MATCH ()-[match_season:plays_for]->()\nWITH `match_season`.`college` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `college` ORDER BY `college` IS NULL ASC, `college` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of colleges that have two or more players, listed in descending alphabetical order?",
    "evidence": "",
    "idx": 2259
  },
  {
    "filename": "train_spider.json",
    "db_id": "match_season",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[match_season_sub0:plays_for]->()\nRETURN `match_season_sub0`.`team` AS `team`   } AS in_collect_0\nMATCH (`team`:`team`)\nWHERE NOT `team`.`team_id` IN in_collect_0\nRETURN `team`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of teams that have no match season record.",
    "evidence": "",
    "idx": 2261
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`climber`:`climber`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of climbers.",
    "evidence": "",
    "idx": 2263
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`climber`:`climber`)\nORDER BY `climber`.`points` IS NULL ASC, `climber`.`points` DESC \nRETURN `climber`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of climbers in descending order of points.",
    "evidence": "",
    "idx": 2264
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`climber`:`climber`)\nWHERE `climber`.`country` <> 'Switzerland'\nRETURN `climber`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of climbers whose country is not Switzerland.",
    "evidence": "",
    "idx": 2266
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`climber`:`climber`)\nWHERE `climber`.`country` = 'United Kingdom'\nRETURN MAX(`climber`.`points`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the maximum number of points for climbers from the United Kingdom.",
    "evidence": "",
    "idx": 2269
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`climber`:`climber`)\nRETURN COUNT(DISTINCT `climber`.`country`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different countries that climbers are from.",
    "evidence": "",
    "idx": 2271
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nRETURN `mountain`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the names of mountains in alphabetical order.",
    "evidence": "",
    "idx": 2273
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`height` > 5000\nRETURN `mountain`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the countries of the mountains that have a height larger than 5000.",
    "evidence": "",
    "idx": 2275
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nORDER BY `mountain`.`height` IS NULL ASC, `mountain`.`height` DESC \nRETURN `mountain`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name of the mountain with the greatest height.",
    "evidence": "",
    "idx": 2277
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nORDER BY `mountain`.`prominence` IS NULL ASC, `mountain`.`prominence` DESC \nRETURN DISTINCT `mountain`.`range` AS `range`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the distinct ranges of the mountains with the top 3 prominence.",
    "evidence": "",
    "idx": 2278
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nORDER BY `mountain`.`prominence` IS NULL ASC, `mountain`.`prominence` DESC \nRETURN DISTINCT `mountain`.`range` AS `range`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different ranges of the 3 mountains with the highest prominence?",
    "evidence": "",
    "idx": 2279
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`t1`:`climber`)-[climbs_0:climbs]->(`t2`:`mountain`)\nWHERE `t1`.`mountain_id` = `t2`.`mountain_id`\nRETURN `t1`.`name` AS `name`, `t2`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of climbers and the names of mountains they climb.",
    "evidence": "",
    "idx": 2280
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`t1`:`climber`)-[climbs_0:climbs]->(`t2`:`mountain`)\nWHERE `t1`.`mountain_id` = `t2`.`mountain_id`\nRETURN `t1`.`name` AS `name`, `t2`.`height` AS `height`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of climbers and the heights of mountains they climb.",
    "evidence": "",
    "idx": 2282
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`t1`:`climber`)-[climbs_0:climbs]->(`t2`:`mountain`)\nWHERE `t1`.`mountain_id` = `t2`.`mountain_id`\nORDER BY `t1`.`points` IS NULL ASC, `t1`.`points` DESC \nRETURN `t2`.`height` AS `height`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the height of the mountain climbed by the climber with the maximum points.",
    "evidence": "",
    "idx": 2284
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`t1`:`climber`)-[climbs_0:climbs]->(`t2`:`mountain`)\nWHERE `t1`.`mountain_id` = `t2`.`mountain_id`\nAND (`t1`.`country` = 'West Germany')\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the distinct names of mountains climbed by climbers from country \"West Germany\".",
    "evidence": "",
    "idx": 2286
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`t1`:`climber`)-[climbs_0:climbs]->(`t2`:`mountain`)\nWHERE `t1`.`mountain_id` = `t2`.`mountain_id`\nAND (`t2`.`country` = 'Uganda')\nRETURN `t1`.`time` AS `time`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the times used by climbers to climb mountains in Country Uganda.",
    "evidence": "",
    "idx": 2288
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`climber`:`climber`)\nWITH `climber`.`country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the countries and the number of climbers from each country.",
    "evidence": "",
    "idx": 2290
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWITH `mountain`.`country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the countries that have more than one mountain.",
    "evidence": "",
    "idx": 2292
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "WITH *, COLLECT { MATCH (`climber_sub0`:`climber`)\nRETURN `climber_sub0`.`mountain_id` AS `mountain_id`   } AS in_collect_0\nMATCH (`mountain`:`mountain`)\nWHERE NOT `mountain`.`mountain_id` IN in_collect_0\nRETURN `mountain`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of mountains that do not have any climber.",
    "evidence": "",
    "idx": 2294
  },
  {
    "filename": "train_spider.json",
    "db_id": "climbing",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`height` > 5000 OR `mountain`.`prominence` > 1000\nRETURN `mountain`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of mountains with height more than 5000 or prominence more than 1000.",
    "evidence": "",
    "idx": 2296
  },
  {
    "filename": "train_spider.json",
    "db_id": "body_builder",
    "gql_statement": "MATCH (`body_builder`:`body_builder`)\nRETURN `body_builder`.`total` AS `total` ORDER BY `total` IS NULL DESC, `total`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the total scores of body builders in ascending order.",
    "evidence": "",
    "idx": 2299
  },
  {
    "filename": "train_spider.json",
    "db_id": "body_builder",
    "gql_statement": "MATCH (`body_builder`:`body_builder`)\nRETURN `body_builder`.`snatch` AS `snatch`, `body_builder`.`clean_jerk` AS `clean_jerk` ORDER BY `snatch` IS NULL DESC, `snatch`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the snatch score and clean jerk score of body builders in ascending order of snatch score.",
    "evidence": "",
    "idx": 2300
  },
  {
    "filename": "train_spider.json",
    "db_id": "body_builder",
    "gql_statement": "MATCH (`people`:`people`)\nWITH `people`.`birth_place` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `birth_place`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List each birth place along with the number of people from there.",
    "evidence": "",
    "idx": 2311
  },
  {
    "filename": "train_spider.json",
    "db_id": "body_builder",
    "gql_statement": "MATCH (`people`:`people`)\nRETURN `people`.`height` AS `height`, `people`.`weight` AS `weight` ORDER BY `height` IS NULL ASC, `height` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the height and weight of people in descending order of height.",
    "evidence": "",
    "idx": 2313
  },
  {
    "filename": "train_spider.json",
    "db_id": "body_builder",
    "gql_statement": "MATCH (`body_builder`:`body_builder`)\nRETURN `body_builder`.`body_builder_id` AS `body_builder_id`, `body_builder`.`people_id` AS `people_id`, `body_builder`.`snatch` AS `snatch`, `body_builder`.`clean_jerk` AS `clean_jerk`, `body_builder`.`total` AS `total`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all information about each body builder.",
    "evidence": "",
    "idx": 2314
  },
  {
    "filename": "train_spider.json",
    "db_id": "body_builder",
    "gql_statement": "MATCH (`t1`:`body_builder`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t1`.`snatch` > 140 OR `t2`.`height` > 200)\nRETURN `t2`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the weight of the body builders who have snatch score higher than 140 or have the height greater than 200.",
    "evidence": "",
    "idx": 2317
  },
  {
    "filename": "train_spider.json",
    "db_id": "body_builder",
    "gql_statement": "MATCH (`t1`:`body_builder`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t2`.`birth_date` =~ '(?i)(?s).*January.*')\nRETURN `t1`.`total` AS `total`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total scores of the body builders whose birthday contains the string \"January\" ?",
    "evidence": "",
    "idx": 2318
  },
  {
    "filename": "train_spider.json",
    "db_id": "election_representative",
    "gql_statement": "MATCH (`election`:`election`)\nRETURN `election`.`votes` AS `votes` ORDER BY `votes` IS NULL ASC, `votes` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the votes of elections in descending order.",
    "evidence": "",
    "idx": 2321
  },
  {
    "filename": "train_spider.json",
    "db_id": "election_representative",
    "gql_statement": "MATCH (`election`:`election`)\nRETURN `election`.`date` AS `date`, `election`.`vote_percent` AS `vote_percent`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the dates and vote percents of elections.",
    "evidence": "",
    "idx": 2322
  },
  {
    "filename": "train_spider.json",
    "db_id": "election_representative",
    "gql_statement": "MATCH (`representative`:`representative`)\nWHERE `representative`.`party` <> 'Republican'\nRETURN `representative`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of representatives whose party is not \"Republican\"?",
    "evidence": "",
    "idx": 2325
  },
  {
    "filename": "train_spider.json",
    "db_id": "election_representative",
    "gql_statement": "MATCH (`t1`:`election`)-[has_representative_0:has_representative]->(`t2`:`representative`)\nWHERE `t1`.`representative_id` = `t2`.`representative_id`\nRETURN `t2`.`name` AS `name`, `t1`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of representatives and the dates of elections they participated in.",
    "evidence": "",
    "idx": 2327
  },
  {
    "filename": "train_spider.json",
    "db_id": "election_representative",
    "gql_statement": "MATCH (`t1`:`election`)-[has_representative_0:has_representative]->(`t2`:`representative`)\nWHERE `t1`.`representative_id` = `t2`.`representative_id`\nORDER BY `t1`.`votes` IS NULL DESC, `t1`.`votes`  \nRETURN `t2`.`party` AS `party`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the party of the representative that has the smallest number of votes.",
    "evidence": "",
    "idx": 2330
  },
  {
    "filename": "train_spider.json",
    "db_id": "election_representative",
    "gql_statement": "MATCH (`t1`:`election`)-[has_representative_0:has_representative]->(`t2`:`representative`)\nWHERE `t1`.`representative_id` = `t2`.`representative_id`\nAND (`t2`.`party` = 'Republican')\nRETURN avg(`t1`.`votes`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average number of votes of representatives from party \"Republican\"?",
    "evidence": "",
    "idx": 2332
  },
  {
    "filename": "train_spider.json",
    "db_id": "election_representative",
    "gql_statement": "MATCH (`representative`:`representative`)\nWITH `representative`.`party` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `party`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different parties of representative? Show the party name and the number of representatives in each party.",
    "evidence": "",
    "idx": 2333
  },
  {
    "filename": "train_spider.json",
    "db_id": "election_representative",
    "gql_statement": "WITH *, COLLECT { MATCH (`election_sub0`:`election`)\nRETURN `election_sub0`.`representative_id` AS `representative_id`   } AS in_collect_0\nMATCH (`representative`:`representative`)\nWHERE NOT `representative`.`representative_id` IN in_collect_0\nRETURN `representative`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of representatives that have not participated in elections listed here.",
    "evidence": "",
    "idx": 2337
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartment_buildings`:`apartment_buildings`)\nRETURN DISTINCT `apartment_buildings`.`building_description` AS `building_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all distinct building descriptions.",
    "evidence": "",
    "idx": 2343
  }
]