[
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWITH `invoices`.`billing_country` AS _groupby_col_0, avg(`invoices`.`total`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_country`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 10",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the countries and average invoice size of the top countries by size?",
    "evidence": "",
    "idx": 1803
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`invoices`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t2`.`customer_id` = `t1`.`id`\nORDER BY `t2`.`invoice_date` IS NULL ASC, `t2`.`invoice_date` DESC \nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find out 5 customers who most recently purchased something. List customers' first and last name.",
    "evidence": "",
    "idx": 1804
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`invoices`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t2`.`customer_id` = `t1`.`id`\nORDER BY `t2`.`invoice_date` IS NULL ASC, `t2`.`invoice_date` DESC \nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first and last names of the 5 customers who purchased something most recently?",
    "evidence": "",
    "idx": 1805
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`albums`:`albums`)\nRETURN `albums`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List every album's title.",
    "evidence": "",
    "idx": 1806
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`albums`:`albums`)\nRETURN `albums`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of all the albums?",
    "evidence": "",
    "idx": 1807
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`albums`:`albums`)\nRETURN `albums`.`title` AS `title` ORDER BY `title` IS NULL DESC, `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List every album ordered by album title in ascending order.",
    "evidence": "",
    "idx": 1808
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`albums`:`albums`)\nRETURN `albums`.`title` AS `title` ORDER BY `title` IS NULL DESC, `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of all the albums alphabetically ascending?",
    "evidence": "",
    "idx": 1809
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`albums`:`albums`)\nWHERE `albums`.`title` =~ '(?i)(?s)A.*'\nRETURN `albums`.`title` AS `title` ORDER BY `title` IS NULL DESC, `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List every album whose title starts with A in alphabetical order.",
    "evidence": "",
    "idx": 1810
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`albums`:`albums`)\nWHERE `albums`.`title` =~ '(?i)(?s)A.*'\nRETURN `albums`.`title` AS `title` ORDER BY `title` IS NULL DESC, `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of all albums that start with A in alphabetical order?",
    "evidence": "",
    "idx": 1811
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`invoices`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t2`.`customer_id` = `t1`.`id`\nORDER BY `t2`.`total` IS NULL DESC, `t2`.`total`  \nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the customers first and last name of 10 least expensive invoices.",
    "evidence": "",
    "idx": 1812
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`invoices`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t2`.`customer_id` = `t1`.`id`\nORDER BY `t2`.`total` IS NULL DESC, `t2`.`total`  \nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first and last names of the customers with the 10 cheapest invoices?",
    "evidence": "",
    "idx": 1813
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_city` = 'Chicago' AND `invoices`.`billing_state` = 'IL'\nRETURN sum(`invoices`.`total`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List total amount of  invoice from Chicago, IL.",
    "evidence": "",
    "idx": 1814
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_city` = 'Chicago' AND `invoices`.`billing_state` = 'IL'\nRETURN sum(`invoices`.`total`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total amount of money in the invoices billed from Chicago, Illinois?",
    "evidence": "",
    "idx": 1815
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_city` = 'Chicago' AND `invoices`.`billing_state` = 'IL'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the number of invoices from Chicago, IL.",
    "evidence": "",
    "idx": 1816
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_city` = 'Chicago' AND `invoices`.`billing_state` = 'IL'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many invoices were billed from Chicago, IL?",
    "evidence": "",
    "idx": 1817
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_country` = 'USA'\nWITH `invoices`.`billing_state` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_state`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the number of invoices from the US, grouped by state.",
    "evidence": "",
    "idx": 1818
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_country` = 'USA'\nWITH `invoices`.`billing_state` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_state`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many invoices were billed from each state?",
    "evidence": "",
    "idx": 1819
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_country` = 'USA'\nWITH `invoices`.`billing_state` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_state`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the state in the US with the most invoices.",
    "evidence": "",
    "idx": 1820
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_country` = 'USA'\nWITH `invoices`.`billing_state` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_state`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the states with the most invoices?",
    "evidence": "",
    "idx": 1821
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_state` = 'CA'\nRETURN `invoices`.`billing_state` AS `billing_state`, COUNT(*) AS `_col_1`, sum(`invoices`.`total`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the number of invoices and the invoice total from California.",
    "evidence": "",
    "idx": 1822
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWHERE `invoices`.`billing_state` = 'CA'\nRETURN `invoices`.`billing_state` AS `billing_state`, COUNT(*) AS `_col_1`, sum(`invoices`.`total`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of invoices and total money billed in them from CA?",
    "evidence": "",
    "idx": 1823
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t1`:`albums`)-[by_artist_0:by_artist]->(`t2`:`artists`)\nWHERE `t1`.`artist_id` = `t2`.`id`\nAND (`t2`.`name` = 'Aerosmith')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List Aerosmith's albums.",
    "evidence": "",
    "idx": 1824
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t1`:`albums`)-[by_artist_0:by_artist]->(`t2`:`artists`)\nWHERE `t1`.`artist_id` = `t2`.`id`\nAND (`t2`.`name` = 'Aerosmith')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of all the Aerosmith albums?",
    "evidence": "",
    "idx": 1825
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t1`:`albums`)-[by_artist_0:by_artist]->(`t2`:`artists`)\nWHERE `t1`.`artist_id` = `t2`.`id`\nAND (`t2`.`name` = 'Billy Cobham')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many albums does Billy Cobham has?",
    "evidence": "",
    "idx": 1826
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t1`:`albums`)-[by_artist_0:by_artist]->(`t2`:`artists`)\nWHERE `t1`.`artist_id` = `t2`.`id`\nAND (`t2`.`name` = 'Billy Cobham')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many albums has Billy Cobam released?",
    "evidence": "",
    "idx": 1827
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`first_name` = 'Eduardo' AND `customers`.`last_name` = 'Martins'\nRETURN `customers`.`company` AS `company`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Eduardo Martins is a customer at which company?",
    "evidence": "",
    "idx": 1828
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`first_name` = 'Eduardo' AND `customers`.`last_name` = 'Martins'\nRETURN `customers`.`company` AS `company`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the company where Eduardo Martins is a customer?",
    "evidence": "",
    "idx": 1829
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`first_name` = 'Astrid' AND `customers`.`last_name` = 'Gruber'\nRETURN `customers`.`email` AS `email`, `customers`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is Astrid Gruber's email and phone number?",
    "evidence": "",
    "idx": 1830
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`first_name` = 'Astrid' AND `customers`.`last_name` = 'Gruber'\nRETURN `customers`.`email` AS `email`, `customers`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the email and phone number of Astrid Gruber the customer?",
    "evidence": "",
    "idx": 1831
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`city` = 'Prague'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers live in Prague city?",
    "evidence": "",
    "idx": 1832
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`city` = 'Prague'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers live in the city of Prague?",
    "evidence": "",
    "idx": 1833
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`state` = 'CA'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers in state of CA?",
    "evidence": "",
    "idx": 1834
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`state` = 'CA'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers are from California?",
    "evidence": "",
    "idx": 1835
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`first_name` = 'Roberto' AND `customers`.`last_name` = 'Almeida'\nRETURN `customers`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What country does Roberto Almeida live?",
    "evidence": "",
    "idx": 1836
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`first_name` = 'Roberto' AND `customers`.`last_name` = 'Almeida'\nRETURN `customers`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "In which country does Roberto Almeida?",
    "evidence": "",
    "idx": 1837
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`albums`)-[by_artist_0:by_artist]->(`t1`:`artists`)\nWHERE `t1`.`id` = `t2`.`artist_id`\nAND (`t1`.`name` =~ '(?i)(?s).*Led.*')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of albums that are released by aritist whose name has 'Led'",
    "evidence": "",
    "idx": 1838
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`albums`)-[by_artist_0:by_artist]->(`t1`:`artists`)\nWHERE `t1`.`id` = `t2`.`artist_id`\nAND (`t1`.`name` =~ '(?i)(?s).*Led.*')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the title of the album that was released by the artist whose name has the phrase 'Led'?",
    "evidence": "",
    "idx": 1839
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`customers`)-[supported_by_0:supported_by]->(`t1`:`employees`)\nWHERE `t2`.`support_rep_id` = `t1`.`id`\nAND (`t1`.`first_name` = 'Steve' AND `t1`.`last_name` = 'Johnson')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers does Steve Johnson support?",
    "evidence": "",
    "idx": 1840
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`customers`)-[supported_by_0:supported_by]->(`t1`:`employees`)\nWHERE `t2`.`support_rep_id` = `t1`.`id`\nAND (`t1`.`first_name` = 'Steve' AND `t1`.`last_name` = 'Johnson')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the count of customers that Steve Johnson supports?",
    "evidence": "",
    "idx": 1841
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Nancy' AND `employees`.`last_name` = 'Edwards'\nRETURN `employees`.`title` AS `title`, `employees`.`phone` AS `phone`, `employees`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the title, phone and hire date of Nancy Edwards?",
    "evidence": "",
    "idx": 1842
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Nancy' AND `employees`.`last_name` = 'Edwards'\nRETURN `employees`.`title` AS `title`, `employees`.`phone` AS `phone`, `employees`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the title, phone number and hire date for the employee named Nancy Edwards?",
    "evidence": "",
    "idx": 1843
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`employees`)-[reports_to_0:reports_to]->(`t1`:`employees`)\nWHERE `t1`.`id` = `t2`.`reports_to`\nAND (`t1`.`first_name` = 'Nancy' AND `t1`.`last_name` = 'Edwards')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the full name of employees who report to Nancy Edwards?",
    "evidence": "",
    "idx": 1844
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`employees`)-[reports_to_0:reports_to]->(`t1`:`employees`)\nWHERE `t1`.`id` = `t2`.`reports_to`\nAND (`t1`.`first_name` = 'Nancy' AND `t1`.`last_name` = 'Edwards')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first and last name of the employee who reports to Nancy Edwards?",
    "evidence": "",
    "idx": 1845
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Nancy' AND `employees`.`last_name` = 'Edwards'\nRETURN `employees`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the address of employee Nancy Edwards?",
    "evidence": "",
    "idx": 1846
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Nancy' AND `employees`.`last_name` = 'Edwards'\nRETURN `employees`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is Nancy Edwards's address?",
    "evidence": "",
    "idx": 1847
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`country` = 'Canada'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many employees are living in Canada?",
    "evidence": "",
    "idx": 1848
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`country` = 'Canada'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many employees live in Canada?",
    "evidence": "",
    "idx": 1849
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Nancy' AND `employees`.`last_name` = 'Edwards'\nRETURN `employees`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is employee Nancy Edwards's phone number?",
    "evidence": "",
    "idx": 1850
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` = 'Nancy' AND `employees`.`last_name` = 'Edwards'\nRETURN `employees`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the the phone number of Nancy Edwards?",
    "evidence": "",
    "idx": 1851
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nORDER BY `employees`.`birth_date` IS NULL ASC, `employees`.`birth_date` DESC \nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the youngest employee in the company? List employee's first and last name.",
    "evidence": "",
    "idx": 1852
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nORDER BY `employees`.`birth_date` IS NULL ASC, `employees`.`birth_date` DESC \nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What si the youngest employee's first and last name?",
    "evidence": "",
    "idx": 1853
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nORDER BY `employees`.`hire_date` IS NULL DESC, `employees`.`hire_date`  \nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List top 10 employee work longest in the company. List employee's first and last name.",
    "evidence": "",
    "idx": 1854
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nORDER BY `employees`.`hire_date` IS NULL DESC, `employees`.`hire_date`  \nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first and last names of the top 10 longest-serving employees?",
    "evidence": "",
    "idx": 1855
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`title` = 'IT Staff'\nWITH `employees`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of employees whose title is IT Staff from each city?",
    "evidence": "",
    "idx": 1856
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`title` = 'IT Staff'\nWITH `employees`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many employees who are IT staff are from each city?",
    "evidence": "",
    "idx": 1857
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`invoices`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'Lucas' AND `t1`.`last_name` = 'Mancini')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many orders does Lucas Mancini has?",
    "evidence": "",
    "idx": 1858
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`invoices`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'Lucas' AND `t1`.`last_name` = 'Mancini')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many orders does Luca Mancini have in his invoices?",
    "evidence": "",
    "idx": 1859
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`invoices`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'Lucas' AND `t1`.`last_name` = 'Mancini')\nRETURN sum(`t2`.`total`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of money spent by Lucas Mancini?",
    "evidence": "",
    "idx": 1860
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`invoices`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'Lucas' AND `t1`.`last_name` = 'Mancini')\nRETURN sum(`t2`.`total`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How much money did Lucas Mancini spend?",
    "evidence": "",
    "idx": 1861
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`media_types`:`media_types`)\nRETURN `media_types`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all media types.",
    "evidence": "",
    "idx": 1862
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`media_types`:`media_types`)\nRETURN `media_types`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the media types?",
    "evidence": "",
    "idx": 1863
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`genres`:`genres`)\nRETURN DISTINCT `genres`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all different genre types.",
    "evidence": "",
    "idx": 1864
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`genres`:`genres`)\nRETURN DISTINCT `genres`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different names of the genres?",
    "evidence": "",
    "idx": 1865
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`playlists`:`playlists`)\nRETURN `playlists`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of all playlist.",
    "evidence": "",
    "idx": 1866
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`playlists`:`playlists`)\nRETURN `playlists`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the playlists?",
    "evidence": "",
    "idx": 1867
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`tracks`:`tracks`)\nWHERE `tracks`.`name` = 'Fast As a Shark'\nRETURN `tracks`.`composer` AS `composer`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the composer of track Fast As a Shark?",
    "evidence": "",
    "idx": 1868
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`tracks`:`tracks`)\nWHERE `tracks`.`name` = 'Fast As a Shark'\nRETURN `tracks`.`composer` AS `composer`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the composer who created the track \"Fast As a Shark\"?",
    "evidence": "",
    "idx": 1869
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`tracks`:`tracks`)\nWHERE `tracks`.`name` = 'Fast As a Shark'\nRETURN `tracks`.`milliseconds` AS `milliseconds`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How long does track Fast As a Shark has?",
    "evidence": "",
    "idx": 1870
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`tracks`:`tracks`)\nWHERE `tracks`.`name` = 'Fast As a Shark'\nRETURN `tracks`.`milliseconds` AS `milliseconds`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many milliseconds long is Fast As a Shark?",
    "evidence": "",
    "idx": 1871
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t1`.`name` = 'Rock')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of tracks whose genre is Rock?",
    "evidence": "",
    "idx": 1872
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)-[of_genre_0:of_genre]->(`t1`:`genres`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t1`.`name` = 'Rock')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of all tracks in the Rock genre?",
    "evidence": "",
    "idx": 1873
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)\nMATCH (`t1`:`albums`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t2`.`name` = 'Balls to the Wall')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is title of album which track Balls to the Wall belongs to?",
    "evidence": "",
    "idx": 1874
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)\nMATCH (`t1`:`albums`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t2`.`name` = 'Balls to the Wall')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the album that has the track Ball to the Wall?",
    "evidence": "",
    "idx": 1875
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`t2`:`tracks`)\nMATCH (`t1`:`albums`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t1`.`title` = 'Balls to the Wall')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List name of all tracks in Balls to the Wall.",
    "evidence": "",
    "idx": 1876
  }
]