[
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population of the smallest state",
    "evidence": "",
    "idx": 347
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population of the state with the highest population density",
    "evidence": "",
    "idx": 348
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`density`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`density` = `_col_0`\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people live in the state with the largest population density",
    "evidence": "",
    "idx": 349
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN min(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the smallest city in the usa",
    "evidence": "",
    "idx": 350
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN min(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the smallest city in the us",
    "evidence": "",
    "idx": 351
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN min(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what city has the least population",
    "evidence": "",
    "idx": 352
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN min(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the city with the smallest population",
    "evidence": "",
    "idx": 353
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the state with the smallest area",
    "evidence": "",
    "idx": 354
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which is the smallest state",
    "evidence": "",
    "idx": 355
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state is the smallest",
    "evidence": "",
    "idx": 356
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the smallest state in the usa",
    "evidence": "",
    "idx": 357
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the smallest state by area",
    "evidence": "",
    "idx": 358
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the smallest area",
    "evidence": "",
    "idx": 359
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nRETURN sum(`river`.`length`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the total length of all rivers in the usa",
    "evidence": "",
    "idx": 360
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'alabama'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` IN in_collect_0\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what rivers are in states that border alabama",
    "evidence": "",
    "idx": 361
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'alabama'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` IN in_collect_0\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which rivers run through states bordering alabama",
    "evidence": "",
    "idx": 362
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'alabama'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` IN in_collect_0\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what rivers flow through states that alabama borders",
    "evidence": "",
    "idx": 363
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'oklahoma'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`state`:`state`)\nWHERE `state`.`state_name` IN in_collect_0\nORDER BY `state`.`population` IS NULL ASC, `state`.`population` DESC \nRETURN `state`.`state_name` AS `state_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state bordering oklahoma has the largest population",
    "evidence": "",
    "idx": 364
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(DISTINCT `river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN DISTINCT `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the longest river",
    "evidence": "",
    "idx": 368
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'mississippi'\nRETURN `river`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` IN in_collect_0\nRETURN `border_info`.`border` AS `border`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states border states that the mississippi runs through",
    "evidence": "",
    "idx": 370
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`length` > 750\nRETURN `river`.`traverse` AS `traverse`   } AS in_collect_0\nMATCH ()-[border_info:borders]->()\nWHERE `border_info`.`border` = 'texas' AND `border_info`.`state_name` IN in_collect_0\nRETURN `border_info`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states border texas and have a major river",
    "evidence": "",
    "idx": 373
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`length` > 750\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states contain at least one major rivers",
    "evidence": "",
    "idx": 374
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nRETURN `mountain`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where are mountains",
    "evidence": "",
    "idx": 375
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`mountain_sub0`:`mountain`)\nRETURN MAX(`mountain_sub0`.`mountain_altitude`) AS `_col_0`  \n}\nMATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_altitude` = `_col_0`\nRETURN `mountain`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the highest mountain of the united states",
    "evidence": "",
    "idx": 376
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`mountain_sub0`:`mountain`)\nRETURN MAX(`mountain_sub0`.`mountain_altitude`) AS `_col_0`  \n}\nMATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_altitude` = `_col_0`\nRETURN `mountain`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the highest peak in the country",
    "evidence": "",
    "idx": 377
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN min(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the smallest city",
    "evidence": "",
    "idx": 378
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`mountain`:`mountain`)\nWHERE `mountain`.`state_name` <> 'alaska'\nRETURN MAX(`mountain`.`mountain_altitude`) AS `_col_0`  \n}\nMATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_altitude` = `_col_0`\nRETURN `mountain`.`mountain_name` AS `mountain_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which is the highest peak not in alaska",
    "evidence": "",
    "idx": 379
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'tennessee'\nRETURN `river`.`river_name` AS `river_name`   } AS in_collect_0\nMATCH (`river`:`river`)\nWHERE NOT `river`.`river_name` IN in_collect_0\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which rivers do not run through tennessee",
    "evidence": "",
    "idx": 380
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'tennessee'\nRETURN `river`.`river_name` AS `river_name`   } AS in_collect_0\nMATCH (`river`:`river`)\nWHERE NOT `river`.`river_name` IN in_collect_0\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what rivers do not run through tennessee",
    "evidence": "",
    "idx": 381
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`country_name` <> 'usa'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which rivers do not run through usa",
    "evidence": "",
    "idx": 382
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the highest elevation",
    "evidence": "",
    "idx": 383
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the highest point",
    "evidence": "",
    "idx": 384
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the highest elevation",
    "evidence": "",
    "idx": 385
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "in which state does the highest point in usa exist",
    "evidence": "",
    "idx": 386
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has highest elevation",
    "evidence": "",
    "idx": 387
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the state with the highest elevation in the united states",
    "evidence": "",
    "idx": 388
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the state that contains the highest point",
    "evidence": "",
    "idx": 389
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN MAX(`highlow_sub0`.`highest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state contains the highest point in the us",
    "evidence": "",
    "idx": 390
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN min(`highlow_sub0`.`lowest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the lowest elevation",
    "evidence": "",
    "idx": 391
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN min(`highlow_sub0`.`lowest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the name of the state with the lowest point",
    "evidence": "",
    "idx": 392
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow_sub0`:`highlow`)\nRETURN min(`highlow_sub0`.`lowest_elevation`) AS `_col_0`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_elevation` = `_col_0`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the state with the lowest point",
    "evidence": "",
    "idx": 393
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_name` = 'whitney'\nRETURN `mountain`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state is mount whitney in",
    "evidence": "",
    "idx": 394
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_name` = 'whitney'\nRETURN `mountain`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "in what state is mount whitney",
    "evidence": "",
    "idx": 395
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_name` = 'whitney'\nRETURN `mountain`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is mount whitney",
    "evidence": "",
    "idx": 396
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`mountain`:`mountain`)\nWHERE `mountain`.`mountain_name` = 'whitney'\nRETURN `mountain`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is mount whitney located",
    "evidence": "",
    "idx": 397
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states have a river",
    "evidence": "",
    "idx": 398
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states have rivers running through them",
    "evidence": "",
    "idx": 399
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'austin' AND `city`.`population` > 150000\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states have a major city named austin",
    "evidence": "",
    "idx": 400
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH (`state`:`state`)\nWHERE `state`.`capital` = 'albany'\nRETURN `state`.`state_name` AS `state_name`   } AS in_collect_0\nMATCH (`river`:`river`)\nWHERE NOT `river`.`traverse` IN in_collect_0\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers do not traverse the state with the capital albany",
    "evidence": "",
    "idx": 401
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN min(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0` AND `river`.`traverse` = 'texas'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the shortest river in texas",
    "evidence": "",
    "idx": 402
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN min(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the shortest river in the usa",
    "evidence": "",
    "idx": 403
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN min(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the shortest river",
    "evidence": "",
    "idx": 404
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN min(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the shortest river in the us",
    "evidence": "",
    "idx": 405
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN min(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the shortest river in the united states",
    "evidence": "",
    "idx": 406
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN min(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which is the shortest river",
    "evidence": "",
    "idx": 407
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`capital` = 'salem'\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state is salem the capital of",
    "evidence": "",
    "idx": 408
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`capital` = 'salem'\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states capital is salem",
    "evidence": "",
    "idx": 409
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`capital` = 'salem'\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "salem is the capital of which state",
    "evidence": "",
    "idx": 410
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`capital` = 'salem'\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the capital salem",
    "evidence": "",
    "idx": 411
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers are there in us",
    "evidence": "",
    "idx": 412
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN DISTINCT `state`.`capital` AS `capital`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "name the 50 capitals in the usa",
    "evidence": "",
    "idx": 413
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN COUNT(`city`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states have a city named springfield",
    "evidence": "",
    "idx": 414
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN COUNT(`city`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states have a city called springfield",
    "evidence": "",
    "idx": 415
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN COUNT(`city`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states have cities named springfield",
    "evidence": "",
    "idx": 416
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN COUNT(`city`.`state_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states have cities or towns named springfield",
    "evidence": "",
    "idx": 417
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[border_info:borders]->()\nWHERE `border_info`.`state_name` = 'texas'\nRETURN `border_info`.`border` AS `border`   } AS in_collect_0\nMATCH (`lake`:`lake`)\nWHERE `lake`.`state_name` IN in_collect_0\nRETURN `lake`.`lake_name` AS `lake_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the lakes in states bordering texas",
    "evidence": "",
    "idx": 418
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'texas'\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many major cities are in texas",
    "evidence": "",
    "idx": 419
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'texas'\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many big cities are in texas",
    "evidence": "",
    "idx": 420
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`population` > 150000 AND `city`.`state_name` = 'texas'\nRETURN COUNT(`city`.`city_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many major cities are there in texas",
    "evidence": "",
    "idx": 421
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how high are the highest points of all the states",
    "evidence": "",
    "idx": 422
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'missouri'\nRETURN COUNT(`river`.`traverse`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states does the missouri run through",
    "evidence": "",
    "idx": 423
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'missouri'\nRETURN COUNT(`river`.`traverse`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states does the missouri river flow through",
    "evidence": "",
    "idx": 424
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'missouri'\nRETURN COUNT(`river`.`traverse`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many states does the missouri river run through",
    "evidence": "",
    "idx": 425
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'pennsylvania'\nRETURN CASE WHEN `state`.`area`=0 THEN NULL ELSE `state`.`population` / `state`.`area` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the average population per square km in pennsylvania",
    "evidence": "",
    "idx": 426
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'texas'\nRETURN MAX(DISTINCT `highlow`.`highest_elevation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the height of the highest mountain in texas",
    "evidence": "",
    "idx": 428
  }
]