[
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`captain`:`captain`)\nWITH `captain`.`class` AS _groupby_col_0, avg(toFloat(`captain`.`age`)) AS _groupby_col_1, min(`captain`.`age`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `class`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average and minimum age of captains in different class?",
    "evidence": "",
    "idx": 6330
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`captain`:`captain`)\nORDER BY `captain`.`age` IS NULL DESC, `captain`.`age`  \nRETURN `captain`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name of the youngest captain.",
    "evidence": "",
    "idx": 6333
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`ship`:`ship`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of ships.",
    "evidence": "",
    "idx": 6335
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`ship`:`ship`)\nORDER BY `ship`.`built_year` IS NULL ASC, `ship`.`built_year` DESC \nRETURN `ship`.`name` AS `name`, `ship`.`type` AS `type`, `ship`.`flag` AS `flag`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, type, and flag of the ship that is built in the most recent year.",
    "evidence": "",
    "idx": 6336
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`ship`:`ship`)\nWITH `ship`.`flag` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `flag`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Group by ships by flag, and return number of ships that have each flag.",
    "evidence": "",
    "idx": 6338
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`ship`:`ship`)\nORDER BY `ship`.`built_year` IS NULL DESC, `ship`.`built_year` , `ship`.`class` IS NULL DESC, `ship`.`class`  \nRETURN `ship`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all ship names in the order of built year and class.",
    "evidence": "",
    "idx": 6340
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`t2`:`captain`)-[commands_0:commands]->(`t1`:`ship`)\nWHERE `t1`.`ship_id` = `t2`.`ship_id`\nORDER BY `t2`.`age` IS NULL DESC, `t2`.`age`  \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the ship that is steered by the youngest captain.",
    "evidence": "",
    "idx": 6344
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`captain_sub0`:`captain`)\nWHERE `captain_sub0`.`rank` = 'Midshipman'\nRETURN `captain_sub0`.`ship_id` AS `ship_id`   } AS in_collect_0\nMATCH (`ship`:`ship`)\nWHERE NOT `ship`.`ship_id` IN in_collect_0\nRETURN `ship`.`name` AS `name`, `ship`.`flag` AS `flag`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and flag of ships that are not steered by any captain with Midshipman rank.",
    "evidence": "",
    "idx": 6346
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`captain_sub0`:`captain`)\nWHERE `captain_sub0`.`rank` = 'Midshipman'\nRETURN `captain_sub0`.`ship_id` AS `ship_id`   } AS in_collect_0\nMATCH (`ship`:`ship`)\nWHERE NOT `ship`.`ship_id` IN in_collect_0\nRETURN `ship`.`name` AS `name`, `ship`.`flag` AS `flag`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and flags of ships that do not have a captain with the rank of Midshipman?",
    "evidence": "",
    "idx": 6347
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE `match`.`competition` = '1994 FIFA World Cup qualification'\nRETURN `match`.`match_id` AS `match_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the match ids of the cities that hosted competition \"1994 FIFA World Cup qualification\"?",
    "evidence": "",
    "idx": 6350
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE `match`.`competition` = '1994 FIFA World Cup qualification'\nRETURN `match`.`match_id` AS `match_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the match id of the competition called \"1994 FIFA World Cup qualification\"?",
    "evidence": "",
    "idx": 6351
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`t2`:`hosting_city`)-[hosted_by_0:hosted_by]->(`t1`:`city`)\nMATCH (`t2`:`hosting_city`)-[hosts_0:hosts]->(`t3`:`match`)\nWHERE `t1`.`city_id` = `t2`.`host_city`\nAND `t2`.`match_id` = `t3`.`match_id`\nAND (`t1`.`city` = 'Nanjing ( Jiangsu )' AND `t3`.`competition` = '1994 FIFA World Cup qualification')\nRETURN `t3`.`venue` AS `venue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the venue of the competition \"1994 FIFA World Cup qualification\" hosted by \"Nanjing ( Jiangsu )\"?",
    "evidence": "",
    "idx": 6354
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`t1`:`city`)-[has_temperature_0:has_temperature]->(`t2`:`temperature`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`city` = 'Shanghai')\nRETURN `t2`.`jan` AS `jan`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the temperature of Shanghai in January.",
    "evidence": "",
    "idx": 6356
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`t1`:`city`)-[has_temperature_0:has_temperature]->(`t2`:`temperature`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`city` = 'Shanghai')\nRETURN `t2`.`jan` AS `jan`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the temperature of \"Shanghai\" city in January?",
    "evidence": "",
    "idx": 6357
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`t2`:`hosting_city`)-[hosted_by_0:hosted_by]->(`t1`:`city`)\nWHERE `t1`.`city_id` = `t2`.`host_city`\nAND (`t1`.`city` = 'Taizhou ( Zhejiang )')\nRETURN `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the host year of city \"Taizhou ( Zhejiang )\"?",
    "evidence": "",
    "idx": 6358
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN `city`.`city` AS `city`, `city`.`gdp` AS `gdp` ORDER BY `gdp` IS NULL DESC, `gdp`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which city has the lowest GDP? Please list the city name and its GDP.",
    "evidence": "",
    "idx": 6362
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN `city`.`city` AS `city`, `city`.`gdp` AS `gdp` ORDER BY `gdp` IS NULL DESC, `gdp`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the city with the smallest GDP? Return the city and its GDP.",
    "evidence": "",
    "idx": 6363
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`regional_population` > 10000000\nRETURN `city`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please give me a list of cities whose regional population is over 10000000.",
    "evidence": "",
    "idx": 6370
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`regional_population` > 10000000\nRETURN `city`.`city` AS `city`   \nUNION DISTINCT\nMATCH (`city`:`city`)\nWHERE `city`.`regional_population` < 5000000\nRETURN `city`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please give me a list of cities whose regional population is over 8000000 or under 5000000.",
    "evidence": "",
    "idx": 6372
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`match`:`match`)\nWITH `match`.`competition` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `competition`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of matches in different competitions.",
    "evidence": "",
    "idx": 6374
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`match`:`match`)\nWITH `match`.`competition` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `competition`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each competition, count the number of matches.",
    "evidence": "",
    "idx": 6375
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`match`:`match`)\nORDER BY `match`.`date` IS NULL ASC, `match`.`date` DESC \nRETURN `match`.`venue` AS `venue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List venues of all matches in the order of their dates starting from the most recent one.",
    "evidence": "",
    "idx": 6376
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`match`:`match`)\nORDER BY `match`.`date` IS NULL ASC, `match`.`date` DESC \nRETURN `match`.`venue` AS `venue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the venues of all the matches? Sort them in the descending order of match date.",
    "evidence": "",
    "idx": 6377
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`city`:`city`)\nORDER BY `city`.`regional_population` IS NULL ASC, `city`.`regional_population` DESC \nRETURN `city`.`gdp` AS `gdp`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the GDP of the city with the largest population.",
    "evidence": "",
    "idx": 6378
  },
  {
    "filename": "train_spider.json",
    "db_id": "city_record",
    "gql_statement": "MATCH (`city`:`city`)\nORDER BY `city`.`regional_population` IS NULL ASC, `city`.`regional_population` DESC \nRETURN `city`.`gdp` AS `gdp`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the GDP of the city with the largest regional population.",
    "evidence": "",
    "idx": 6379
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`individuals`:`individuals`)\nRETURN `individuals`.`individual_first_name` AS `individual_first_name`, `individuals`.`individual_middle_name` AS `individual_middle_name`, `individuals`.`individual_last_name` AS `individual_last_name` ORDER BY `individual_last_name` IS NULL DESC, `individual_last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List every individual's first name, middle name and last name in alphabetical order by last name.",
    "evidence": "",
    "idx": 6380
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`forms`:`forms`)\nRETURN DISTINCT `forms`.`form_type_code` AS `form_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the types of forms.",
    "evidence": "",
    "idx": 6382
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`parties`:`parties`)\nWHERE `parties`.`party_email` = 'enrico09@example.com'\nRETURN `parties`.`payment_method_code` AS `payment_method_code`, `parties`.`party_phone` AS `party_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the payment method and phone of the party with email \"enrico09@example.com\".",
    "evidence": "",
    "idx": 6384
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`parties`:`parties`)\nWHERE `parties`.`party_email` = 'enrico09@example.com'\nRETURN `parties`.`payment_method_code` AS `payment_method_code`, `parties`.`party_phone` AS `party_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the payment method code and party phone of the party with the email 'enrico09@example.com'?",
    "evidence": "",
    "idx": 6385
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "CALL(*) {\nMATCH ()-[party_forms_sub0:completed_form]->()\nWITH `party_forms_sub0`.`form_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `form_id`  LIMIT 1\n}\nMATCH (`t1`:`parties`)-[t2:completed_form]->()\nWHERE `t1`.`party_id` = `t2`.`party_id`\nAND (`t2`.`form_id` = `form_id`)\nRETURN `t1`.`party_email` AS `party_email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the emails of parties with the most popular party form.",
    "evidence": "",
    "idx": 6386
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "CALL(*) {\nMATCH ()-[party_forms_sub0:completed_form]->()\nWITH `party_forms_sub0`.`form_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `form_id`  LIMIT 1\n}\nMATCH (`t1`:`parties`)-[t2:completed_form]->()\nWHERE `t1`.`party_id` = `t2`.`party_id`\nAND (`t2`.`form_id` = `form_id`)\nRETURN `t1`.`party_email` AS `party_email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the party emails associated with parties that used the party form that is the most common?",
    "evidence": "",
    "idx": 6387
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`organizations`:`organizations`)\nORDER BY `organizations`.`date_formed` IS NULL DESC, `organizations`.`date_formed`  \nRETURN `organizations`.`organization_name` AS `organization_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the name of organizations in order of the date formed.",
    "evidence": "",
    "idx": 6388
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`organizations`:`organizations`)\nORDER BY `organizations`.`date_formed` IS NULL ASC, `organizations`.`date_formed` DESC \nRETURN `organizations`.`organization_name` AS `organization_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the youngest organization.",
    "evidence": "",
    "idx": 6390
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`t1`:`organizations`)-[t2:contacts]->(`t3`:`individuals`)\nWHERE `t1`.`organization_id` = `t2`.`organization_id`\nAND `t2`.`individual_id` = `t3`.`individual_id`\nAND (`t1`.`organization_name` = 'Labour Party')\nORDER BY `t2`.`date_contact_to` IS NULL ASC, `t2`.`date_contact_to` DESC \nRETURN `t3`.`individual_last_name` AS `individual_last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last name of the latest contact individual of the organization \"Labour Party\".",
    "evidence": "",
    "idx": 6392
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "CALL(*) {\nMATCH (`organizations_sub0`:`organizations`)\nRETURN MAX(`organizations_sub0`.`uk_vat_number`) AS `_col_0`  \n}\nMATCH (`t1`:`organizations`)-[t2:contacts]->(`t3`:`individuals`)\nWHERE `t1`.`organization_id` = `t2`.`organization_id`\nAND `t2`.`individual_id` = `t3`.`individual_id`\nAND (`t1`.`uk_vat_number` = `_col_0`)\nORDER BY `t2`.`date_contact_to` IS NULL DESC, `t2`.`date_contact_to`  \nRETURN `t3`.`individual_last_name` AS `individual_last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last name of the first ever contact person of the organization with the highest UK Vat number.",
    "evidence": "",
    "idx": 6394
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "CALL(*) {\nMATCH (`organizations_sub0`:`organizations`)\nRETURN MAX(`organizations_sub0`.`uk_vat_number`) AS `_col_0`  \n}\nMATCH (`t1`:`organizations`)-[t2:contacts]->(`t3`:`individuals`)\nWHERE `t1`.`organization_id` = `t2`.`organization_id`\nAND `t2`.`individual_id` = `t3`.`individual_id`\nAND (`t1`.`uk_vat_number` = `_col_0`)\nORDER BY `t2`.`date_contact_to` IS NULL DESC, `t2`.`date_contact_to`  \nRETURN `t3`.`individual_last_name` AS `individual_last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the last name of the first individual contacted from the organization with the maximum UK Vat number across all organizations?",
    "evidence": "",
    "idx": 6395
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`services`:`services`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of services.",
    "evidence": "",
    "idx": 6397
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nRETURN `addresses`.`town_city` AS `town_city`   \nUNION DISTINCT\nMATCH (`addresses`:`addresses`)\nRETURN `addresses`.`state_province_county` AS `town_city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of all the cities and states.",
    "evidence": "",
    "idx": 6398
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nRETURN `addresses`.`town_city` AS `town_city`   \nUNION DISTINCT\nMATCH (`addresses`:`addresses`)\nRETURN `addresses`.`state_province_county` AS `town_city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all cities and states?",
    "evidence": "",
    "idx": 6399
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nWHERE `addresses`.`state_province_county` = 'Colorado'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many cities are there in state \"Colorado\"?",
    "evidence": "",
    "idx": 6400
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nWHERE `addresses`.`state_province_county` = 'Colorado'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of cities in the state of Colorado.",
    "evidence": "",
    "idx": 6401
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`parties`:`parties`)\nWITH `parties`.`payment_method_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `payment_method_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the payment method code used by more than 3 parties.",
    "evidence": "",
    "idx": 6402
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`organizations`:`organizations`)\nWHERE `organizations`.`organization_name` =~ '(?i)(?s).*Party.*'\nRETURN `organizations`.`organization_name` AS `organization_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of organizations whose names contain \"Party\".",
    "evidence": "",
    "idx": 6404
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`parties`:`parties`)\nRETURN COUNT(DISTINCT `parties`.`payment_method_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different payment method codes used by parties.",
    "evidence": "",
    "idx": 6407
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nWHERE `addresses`.`line_1_number_building` =~ '(?i)(?s).*6862 Kaitlyn Knolls.*'\nRETURN `addresses`.`state_province_county` AS `state_province_county`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which state can address \"6862 Kaitlyn Knolls\" possibly be in?",
    "evidence": "",
    "idx": 6408
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "MATCH (`driver`:`driver`)\nRETURN `driver`.`name` AS `name`, `driver`.`home_city` AS `home_city`, `driver`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name, home city, and age for all drivers.",
    "evidence": "",
    "idx": 6413
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "MATCH (`driver`:`driver`)\nWITH `driver`.`party` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `party`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the party and the number of drivers in each party.",
    "evidence": "",
    "idx": 6414
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "MATCH (`driver`:`driver`)\nORDER BY `driver`.`age` IS NULL ASC, `driver`.`age` DESC \nRETURN `driver`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of drivers in descending order of age.",
    "evidence": "",
    "idx": 6415
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "MATCH (`driver`:`driver`)\nRETURN DISTINCT `driver`.`home_city` AS `home_city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all different home cities.",
    "evidence": "",
    "idx": 6416
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "MATCH (`driver`:`driver`)\nWHERE `driver`.`home_city` = 'Hartford' AND `driver`.`age` > 40\nRETURN `driver`.`party` AS `party`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the party with drivers from Hartford and drivers older than 40.",
    "evidence": "",
    "idx": 6417
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "MATCH (`driver`:`driver`)\nWHERE `driver`.`age` > 40\nWITH `driver`.`home_city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `home_city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show home city where at least two drivers older than 40 are from.",
    "evidence": "",
    "idx": 6418
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[school_bus_sub0:assigned_to]->()\nRETURN `school_bus_sub0`.`driver_id` AS `driver_id`   } AS in_collect_0\nMATCH (`driver`:`driver`)\nWHERE NOT `driver`.`driver_id` IN in_collect_0\nRETURN `driver`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of the drivers without a school bus.",
    "evidence": "",
    "idx": 6419
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "MATCH (`school`:`school`)\nWITH `school`.`type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 = 2\nRETURN _groupby_col_0 AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the types of schools that have two schools.",
    "evidence": "",
    "idx": 6420
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[school_bus_sub0:assigned_to]->()\nRETURN `school_bus_sub0`.`school_id` AS `school_id`   } AS in_collect_0\nMATCH (`school`:`school`)\nWHERE NOT `school`.`school_id` IN in_collect_0\nRETURN `school`.`school` AS `school`, `school`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the school name and type for schools without a school bus.",
    "evidence": "",
    "idx": 6423
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "MATCH (`driver`:`driver`)\nWHERE `driver`.`home_city` = 'Hartford' AND `driver`.`age` < 40\nRETURN `driver`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List names for drivers from Hartford city and younger than 40.",
    "evidence": "",
    "idx": 6426
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_bus",
    "gql_statement": "MATCH (`t1`:`driver`)-[t2:assigned_to]->()\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nORDER BY `t2`.`years_working` IS NULL ASC, `t2`.`years_working` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the name of driver who is driving the school bus with the longest working history.",
    "evidence": "",
    "idx": 6427
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_company",
    "gql_statement": "MATCH (`flight`:`flight`)\nORDER BY `flight`.`altitude` IS NULL DESC, `flight`.`altitude`  \nRETURN `flight`.`vehicle_flight_number` AS `vehicle_flight_number`, `flight`.`date` AS `date`, `flight`.`pilot` AS `pilot`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the vehicle flight number, date and pilot of all the flights, ordered by altitude.",
    "evidence": "",
    "idx": 6429
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_company",
    "gql_statement": "MATCH (`airport`:`airport`)\nRETURN `airport`.`id` AS `id`, `airport`.`country` AS `country`, `airport`.`city` AS `city`, `airport`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the id, country, city and name of the airports ordered alphabetically by the name.",
    "evidence": "",
    "idx": 6430
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_company",
    "gql_statement": "MATCH (`t2`:`flight`)-[operated_by_0:operated_by]->(`t1`:`operate_company`)\nWHERE `t1`.`id` = `t2`.`company_id`\nAND (`t2`.`velocity` < 200)\nRETURN DISTINCT `t1`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct types of the companies that have operated any flights with velocity less than 200?",
    "evidence": "",
    "idx": 6435
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_company",
    "gql_statement": "WITH *, COLLECT { MATCH (`flight_sub0`:`flight`)\nWHERE `flight_sub0`.`pilot` = 'Thompson'\nRETURN `flight_sub0`.`airport_id` AS `airport_id`   } AS in_collect_0\nMATCH (`airport`:`airport`)\nWHERE NOT `airport`.`id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many airports haven't the pilot 'Thompson' driven an aircraft?",
    "evidence": "",
    "idx": 6438
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of accounts.",
    "evidence": "",
    "idx": 6444
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN `accounts`.`account_id` AS `account_id`, `accounts`.`account_details` AS `account_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all account ids and account details.",
    "evidence": "",
    "idx": 6445
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`statements`:`statements`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of statements.",
    "evidence": "",
    "idx": 6448
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`statements`:`statements`)\nRETURN `statements`.`statement_id` AS `statement_id`, `statements`.`statement_details` AS `statement_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all statement ids and statement details.",
    "evidence": "",
    "idx": 6449
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`t1`:`accounts`)-[belongs_to_statement_0:belongs_to_statement]->(`t2`:`statements`)\nWHERE `t1`.`statement_id` = `t2`.`statement_id`\nRETURN `t1`.`statement_id` AS `statement_id`, `t2`.`statement_details` AS `statement_details`, `t1`.`account_details` AS `account_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show statement id, statement detail, account detail for accounts.",
    "evidence": "",
    "idx": 6451
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nWITH `accounts`.`statement_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `statement_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all statement id and the number of accounts for each statement.",
    "evidence": "",
    "idx": 6453
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of documents.",
    "evidence": "",
    "idx": 6455
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "MATCH (`documents`:`documents`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of documents.",
    "evidence": "",
    "idx": 6456
  }
]