[
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:produced_in]->(`t3`:`country`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`country_id` = `t3`.`country_id`\nAND (`t3`.`country_name` = 'France')\nRETURN avg(`t1`.`revenue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the average revenue of all the French movies.",
    "evidence": "French movies refers to country_name = 'France'; average revenue = AVG(revenue)",
    "idx": 313
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t2`:`gender`)\nMATCH ()-[t1:has_cast]->()\nWHERE `t1`.`gender_id` = `t2`.`gender_id`\nAND (`t2`.`gender` = 'Unspecified')\nRETURN `t1`.`character_name` AS `character_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the unspecified gender characters.",
    "evidence": "characters refers to character_name; gender = 'Unspecified'",
    "idx": 314
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->(`t3`:`genre`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`genre_id` = `t3`.`genre_id`\nWITH `t3`.`genre_name` AS _groupby_col_0, MAX(`t1`.`budget`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `genre_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the film with the highest budget in each genre.",
    "evidence": "highest budget refers to max(budget); each genre refers to genre_name; film also means movie; list the film refers to title of movie",
    "idx": 316
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE toInteger(CASE WHEN `movie`.`release_date` is not NULL THEN apoc.temporal.format(`movie`.`release_date`,'yyyy') ELSE NULL END) = 1945\nRETURN `movie`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the movies released in 1945.",
    "evidence": "List the movies refers to title; released in 1945 refers to release_date LIKE '1945%'",
    "idx": 319
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`country_name` = 'Belgium'\nRETURN `country`.`country_id` AS `country_id`, `country`.`country_iso_code` AS `country_iso_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ID and ISO code of Belgium.",
    "evidence": "ID refers to country_id; ISO code refers to country_iso_code; Belgium refers to country_name = 'Belgium'",
    "idx": 320
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:acted_in]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t1`.`person_name` = 'Catherine Deneuve')\nRETURN `t2`.`character_name` AS `character_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the character names played by Catherine Deneuve.",
    "evidence": "",
    "idx": 321
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_language]->(`t3`:`language`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`language_id` = `t3`.`language_id`\nAND (`t3`.`language_name` = 'Somali')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the movies in the Somali language.",
    "evidence": "List the movies refers to title; Somali language refers to language_name = 'Somali'",
    "idx": 322
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_language]->(`t3`:`language`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`language_id` = `t3`.`language_id`\nORDER BY `t1`.`popularity` IS NULL ASC, `t1`.`popularity` DESC \nRETURN `t1`.`release_date` AS `release_date`, `t3`.`language_name` AS `language_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the release date and language of the most popular movie.",
    "evidence": "language refers to langauge_name; most popular movie refers to max(popularity)",
    "idx": 323
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t4`:`language_role`)\nMATCH (`t1`:`movie`)-[t2:has_language]->(`t3`:`language`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`language_id` = `t3`.`language_id`\nAND `t2`.`language_role_id` = `t4`.`role_id`\nAND (`t4`.`language_role` = 'Original' AND `t1`.`title` = 'Four Rooms')\nRETURN `t3`.`language_name` AS `language_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the original language of the \"Four Rooms\" movie?",
    "evidence": "language refers to language_name; original language refers to language_role = 'Original'; \"Four Rooms\" refers to title = 'Four Rooms'",
    "idx": 324
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_cast]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (`t1`.`title` = 'Open Water')\nRETURN `t2`.`character_name` AS `character_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the character names in the \"Open Water\" movie.",
    "evidence": "\"Open Water\" movie refers to title = 'Open Water'",
    "idx": 325
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_cast]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t1`.`title` =~ '(?i)(?s)Pirates of the Caribbean: At World.*s End')\nORDER BY `t2`.`cast_order` IS NULL DESC, `t2`.`cast_order`  \nRETURN `t3`.`person_name` AS `person_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the main actor in the \"Pirates of the Caribbean: At World's End\" movie?",
    "evidence": "main actor refers to person_name where Min(cast_order); \"Pirates of the Caribbean: At World's End\" refers to title = 'Pirates of the Caribbean: At World''s End'",
    "idx": 326
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:worked_on]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t2`.`job` = 'Camera Supervisor')\nRETURN `t1`.`person_name` AS `person_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of camera supervisors in the crew.",
    "evidence": "names refers to person_name; camera supervisors refers to job = 'Camera Supervisor';",
    "idx": 327
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:worked_on]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t1`.`person_name` = 'Sally Menke')\nRETURN DISTINCT `t2`.`job` AS `job`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the job titles of Sally Menke in the crew.",
    "evidence": "job titles refers to job",
    "idx": 328
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t4`:`department`)\nMATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND `t2`.`department_id` = `t4`.`department_id`\nAND (`t1`.`title` =~ '(?i)(?s)Pirates of the Caribbean: At World.*s End' AND `t2`.`job` = 'Music Editor')\nRETURN `t3`.`person_name` AS `person_name`, `t4`.`department_name` AS `department_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names and departments of the person who worked as a music editor in the \"Pirates of the Caribbean: At World's End\" movie.",
    "evidence": "names refers to person_name; departments refers to department_name; worked as a music editor refers to job = 'Music Editor'; \"Pirates of the Caribbean: At World's End\" refers to title = 'Pirates of the Caribbean: At World''s End'",
    "idx": 329
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->(`t3`:`genre`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`genre_id` = `t3`.`genre_id`\nAND (`t1`.`title` = 'Forrest Gump')\nRETURN `t3`.`genre_name` AS `genre_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the genres of Forrest Gump movie.",
    "evidence": "genres refers to genre_name; Forrest Gump movie refers to title = 'Forrest Gump'",
    "idx": 331
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`keyword`)\nMATCH (`t2`:`movie_keywords`)\nWHERE `t1`.`keyword_id` = `t2`.`keyword_id`\nRETURN CASE WHEN sum(CASE  WHEN `t1`.`keyword_name` = 'independent film' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat((sum(CASE  WHEN `t1`.`keyword_name` = 'woman director' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t1`.`keyword_name` = 'independent film' THEN 1 ELSE 0 END))) * 100 / sum(CASE  WHEN `t1`.`keyword_name` = 'independent film' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the difference in percentage of the movies under keywords of \"woman director\" and \"independent film\".",
    "evidence": "under keywords of \"woman director\" and \"independent film\" refers to keyword_name = 'woman director' and keyword_name = 'independent film'; difference in percentage = divide(subtract(count(movie_id) when keyword_name = 'woman director', count(movie_id) when keyword_name = 'independent film'), count(movie_id)) as percentage",
    "idx": 332
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->(`t3`:`genre`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`genre_id` = `t3`.`genre_id`\nAND (`t3`.`genre_name` = 'Adventure' AND toInteger(CASE WHEN `t1`.`release_date` is not NULL THEN apoc.temporal.format(`t1`.`release_date`,'yyyy') ELSE NULL END) = 2000)\nRETURN COUNT(`t1`.`movie_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many adventure movies are there that were released in 2000?",
    "evidence": "adventure movies refers to genre_name = 'Adventure'; released in 2000 refers to release_date LIKE '2000%'",
    "idx": 334
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t1`.`title` = 'Pirates of the Caribbean: The Curse of the Black Pearl' AND `t2`.`job` = 'Producer')\nRETURN `t3`.`person_name` AS `person_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of all the producers in the movie \"Pirates of the Caribbean: At World's End\".",
    "evidence": "List the names refers to person_name; producers refers to job = 'Producer'; \"Pirates of the Caribbean: At World's End\" refers to title = 'Pirates of the Caribbean: The Curse of the Black Pearl'",
    "idx": 340
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "CALL(*) {\nMATCH (`method_sub0`:`method`)\nRETURN MAX(`method_sub0`.`sampledat`) AS `_col_0`  \n}\nMATCH (`method`:`method`)\nWHERE `method`.`sampledat` = `_col_0`\nRETURN DISTINCT `method`.`sampledat` AS `sampledat`, `method`.`solutionid` AS `solutionid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the time of sampling of the solution with the highest sampling time? Indicate the id number of the solution.",
    "evidence": "highest sampling time refers to max(SampledAt); id number of the solution refers to SolutionId;",
    "idx": 343
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "CALL(*) {\nMATCH (`repo_sub0`:`repo`)\nRETURN MAX(`repo_sub0`.`forks`) AS `_col_0`  \n}\nMATCH (`repo`:`repo`)\nWHERE `repo`.`forks` = `_col_0`\nRETURN `repo`.`forks` AS `forks`, `repo`.`url` AS `url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many followers do the most followed repository on Github have? Give the github address of the repository.",
    "evidence": "more forks refers to more people follow this repository; most followed repository refers to max(Forks);  the github address of the repository refers to Url;",
    "idx": 344
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "CALL(*) {\nMATCH (`repo_sub0`:`repo`)\nRETURN MAX(`repo_sub0`.`stars`) AS `_col_0`  \n}\nMATCH (`repo`:`repo`)\nWHERE `repo`.`stars` = `_col_0`\nRETURN `repo`.`url` AS `url`, `repo`.`stars` AS `stars`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the most liked repository? Indicate its github address and the amount of stars it has received.",
    "evidence": "more stars mean more people like this repository; most liked refers to max(Stars); the github address of repository refers to Url;",
    "idx": 345
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`path` = 'nofear_MaraMara.sln')\nRETURN `t1`.`url` AS `url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the github address of the \"nofear_Mara\\Mara.sln\" solution path?",
    "evidence": "github address of repository refers to Url;",
    "idx": 348
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`path` = 'maravillas_linq-to-delicious')\nRETURN DISTINCT `t2`.`nametokenized` AS `nametokenized`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the tokenized name of the solution whose path is \"maravillas_linq-to-delicious\\tasty.sln\"?",
    "evidence": "tokenized name refers to NameTokenized",
    "idx": 349
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`url` = 'https://github.com/zphingphong/DiscardCustomerApp.git')\nRETURN CASE WHEN COUNT(`t2`.`repoid`)=0 THEN NULL ELSE toFloat(sum(`t2`.`processedtime`)) / COUNT(`t2`.`repoid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average processed time of the solution paths inside the \"https://github.com/zphingphong/DiscardCustomerApp.git\"?",
    "evidence": "average processed time = avg(Solution.ProcessedTime);",
    "idx": 351
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`path` = 'bmatzelle_niniSourceNini.sln' AND `t2`.`nametokenized` = 'alias text add alias')\nRETURN `t2`.`fullcomment` AS `fullcomment`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full comment on the method whose solution path is \"bmatzelle_nini\\Source\\Nini.sln\" with a tokenized name of \"alias text add alias\"?",
    "evidence": "",
    "idx": 352
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`path` = 'mauriciodeamorim_tdd.encontro2Tdd.Encontro2.sln')\nRETURN `t2`.`apicalls` AS `apicalls`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the linearized sequenced of API calls of the method whose solution path is \"mauriciodeamorim_tdd.encontro2\\Tdd.Encontro2.sln\"?",
    "evidence": "linearized sequenced of API calls refers to ApiCalls;",
    "idx": 353
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`url` = 'https://github.com/jeffdik/tachy.git' AND `t2`.`wascompiled` = 0)\nRETURN COUNT(`t2`.`path`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many solution paths that needs to be compiled if user wants to implement it in \"https://github.com/jeffdik/tachy.git\"?",
    "evidence": "needs to be compiled if user wants to implement refers to WasCompiled = 0; https://github.com/jeffdik/tachy.git is url of repository",
    "idx": 354
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`nametokenized` = 'about box1 dispose')\nRETURN DISTINCT `t1`.`processedtime` AS `processedtime`, `t2`.`lang` AS `lang`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the processed time of the method whose tokenized name is \"about box1 dispose\"? Indicate the language of the method.",
    "evidence": "language refers to Lang;",
    "idx": 355
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`path` = 'maxild_playgroundPlayground.sln' AND `t2`.`name` = 'GitHubRepo.Cli.GitHubClientWrapper.GetReleases')\nRETURN `t2`.`sampledat` AS `sampledat`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In \"maxild_playground\\Playground.sln\", what is the time of sampling for the method \"GitHubRepo.Cli.GitHubClientWrapper.GetReleases\"?",
    "evidence": "the time of sampling refers to SampledAt; 'maxild_playground\\Playground.sln' is the path of a solution",
    "idx": 356
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`path` = 'opendns_diagnosticappwindowsOpenDnsDiagnostic.sln')\nRETURN `t2`.`lang` AS `lang`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the language of the method used in the solution path \"opendns_diagnosticapp\\windows\\OpenDnsDiagnostic.sln\"?",
    "evidence": "language refers to Lang;",
    "idx": 357
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`method`:`method`)\nWHERE `method`.`name` = 'HtmlSharp.HtmlParser.Feed'\nRETURN CASE  WHEN `method`.`commentisxml` = 0 THEN 'No' WHEN `method`.`commentisxml` = 1 THEN 'Yes'  END AS `isxmlformat`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Are the comments for the method \"HtmlSharp.HtmlParser.Feed\" in XML format?",
    "evidence": "the comment for this method is not XML refers to CommentsXML = 0; the comments for this method is XML refers to CommentsXML = 1",
    "idx": 359
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`method`:`method`)\nWHERE `method`.`summary` = 'Write a command to the log'\nRETURN `method`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which method has the summary \"Write a command to the log\"?",
    "evidence": "",
    "idx": 360
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`path` = 'jeffdik_tachysrcTachy.sln')\nRETURN DISTINCT `t2`.`processedtime` AS `processedtime`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the processed time to download the repository whose files are contained in the solution with the path \"jeffdik_tachy\\src\\Tachy.sln\".",
    "evidence": "",
    "idx": 364
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`url` = 'https://github.com/maxild/playground.git')\nRETURN `t2`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the paths of the solutions containing files within the repository whose url is \"https://github.com/maxild/playground.git\".",
    "evidence": "",
    "idx": 366
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nORDER BY `t1`.`forks` IS NULL ASC, `t1`.`forks` DESC \nRETURN `t2`.`id` AS `id`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the solutions that contain files within the top 3 followed repositories.",
    "evidence": "more forks refers to more people follow this repository;",
    "idx": 368
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`url` = 'https://github.com/jeffdik/tachy.git')\nRETURN CASE WHEN COUNT(`t2`.`repoid`)=0 THEN NULL ELSE toFloat(sum(`t2`.`processedtime`)) / COUNT(`t2`.`repoid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average time needed for the solutions containing files within the repository whose url is \"https://github.com/jeffdik/tachy.git\" to be processd?",
    "evidence": "average time = avg(ProcessedTime)；",
    "idx": 369
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`method`:`method`)\nWHERE `method`.`name` = 'PixieTests.SqlConnectionLayerTests.TestSqlCreateGuidColumn'\nRETURN `method`.`lang` AS `lang`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the language of the method ''PixieTests.SqlConnectionLayerTests.TestSqlCreateGuidColumn\"?",
    "evidence": "language refers to Lang；",
    "idx": 371
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`method`:`method`)\nWHERE `method`.`name` = 'DE2_UE_Fahrradkurier.de2_uebung_fahrradkurierDataSet1TableAdapters.TableAdapterManager.UpdateInsertedRows'\nRETURN `method`.`fullcomment` AS `fullcomment`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the full Comment of the method \"DE2_UE_Fahrradkurier.de2_uebung_fahrradkurierDataSet1TableAdapters.TableAdapterManager.UpdateInsertedRows\".",
    "evidence": "",
    "idx": 372
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`method`:`method`)\nWHERE `method`.`name` = 'Castle.MonoRail.Framework.Test.StubViewComponentContext.RenderSection'\nRETURN DISTINCT `method`.`summary` AS `summary`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the summary of the method \"Castle.MonoRail.Framework.Test.StubViewComponentContext.RenderSection\".",
    "evidence": "",
    "idx": 373
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`method`:`method`)\nWHERE `method`.`name` = 'Supay.Irc.Messages.KnockMessage.GetTokens'\nRETURN `method`.`nametokenized` AS `nametokenized`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the tokenized name for the method \"Supay.Irc.Messages.KnockMessage.GetTokens\".",
    "evidence": "",
    "idx": 374
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`name` = 'IQ.Data.DbQueryProvider.CanBeEvaluatedLocally')\nRETURN `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the solution path for the method \"IQ.Data.DbQueryProvider.CanBeEvaluatedLocally\"?",
    "evidence": "solution path refers to Path; method refers to Name; Name = 'IQ.Data.DbQueryProvider.CanBeEvaluatedLocally'",
    "idx": 377
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`name` = 'SCore.Poisson.ngtIndex')\nRETURN `t1`.`repoid` AS `repoid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the repository number for the solution of method \"SCore.Poisson.ngtIndex\"?",
    "evidence": "repository number refers to RepoId; method refers to Name; Name = ‘SCore.Poisson.ngtIndex’",
    "idx": 379
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`name` = 'ExportToRTF.RTFStyleSheet.H6Write')\nRETURN `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the path of the solution for the method \"ExportToRTF.RTFStyleSheet.H6Write\".",
    "evidence": "path of the solution refers to Path; method refers to Name; Name = 'ExportToRTF.RTFStyleSheet.H6Write';",
    "idx": 380
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`id` = 338082)\nRETURN `t1`.`watchers` AS `watchers`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of watchers that the repository of the solution No. 338082 have.",
    "evidence": "number of watchers refers to Watchers; solution number refers to Solution.Id;",
    "idx": 383
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`name` = 'Mosa.Platform.x86.Instructions.IMul.EmitLegacy')\nRETURN `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the solution path for the method \"Mosa.Platform.x86.Instructions.IMul.EmitLegacy\"?",
    "evidence": "solution path refers to Path; method refers to Name; Name = 'Mosa.Platform.x86.Instructions.IMul.EmitLegacy';",
    "idx": 385
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`name` = 'Kalibrasi.Data.EntityClasses.THistoryJadwalEntity.GetSingleTjadwal')\nRETURN DISTINCT `t1`.`repoid` AS `repoid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the repository ID for the solution of method \"Kalibrasi.Data.EntityClasses.THistoryJadwalEntity.GetSingleTjadwal\".",
    "evidence": "repository ID refers to RepoID; method refers to Name; Name = 'Kalibrasi.Data.EntityClasses.THistoryJadwalEntity.GetSingleTjadwal';",
    "idx": 387
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`stars` = 3060)\nRETURN COUNT(`t2`.`repoid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of solutions that the repository which has 3060 Stars contains.",
    "evidence": "solutions refers to Solution.Id; repository refers to Repository.Id;",
    "idx": 389
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`processedtime` = 636449700980488000)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the methods with a solution with a \"636449700980488000\" processed time.",
    "evidence": "methods refers to Name; solution refers to SolutionId;",
    "idx": 394
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`url` = 'https://github.com/derickbailey/presentations-and-training.git')\nRETURN COUNT(`t2`.`repoid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many solutions are in \"https://github.com/derickbailey/presentations-and-training.git\"?",
    "evidence": "solutions refers to Solution.Id; https://github.com/derickbailey/presentations-and-training.git refers to Url; Url; = 'https://github.com/derickbailey/presentations-and-training.git';",
    "idx": 395
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`lang` = 'it')\nRETURN DISTINCT `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the path of solution from all the \"it\" lang code method.",
    "evidence": "path of the solution refers to Path; solution refers to Solution.Id;",
    "idx": 396
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`name` = 'spinachLexer.mT__55')\nRETURN `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the path of solution of \"spinachLexer.mT__55\" method?",
    "evidence": "path of the solution refers to Path; solution refers to Solution.Id; method refers to Name; Name = 'spinachLexer.mT__55';",
    "idx": 397
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`repoid` = 1093 AND `t2`.`lang` = 'en')\nRETURN DISTINCT `t2`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the \"en\" methods with solutions from repository \"1093\"",
    "evidence": "en methods refers to lang = 'en'; solution refers to Solution.Id; repository refers to RepoId; RepoId = 1093;",
    "idx": 398
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`url` = 'https://github.com/ecoffey/Bebop.git')\nRETURN DISTINCT `t2`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the paths of solutions in repository \"https://github.com/ecoffey/Bebop.git\"",
    "evidence": "path of solutions refers to Path; https://github.com/ecoffey/Bebop.git refers to Url; Url = 'https://github.com/ecoffey/Bebop.git';",
    "idx": 399
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`lang` = 'ro')\nRETURN DISTINCT `t1`.`repoid` AS `repoid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the ids of repositories for solutions with \"ro\" methods.",
    "evidence": "ids of repositories refers to RepoId; ro refers to lang = 'ro';",
    "idx": 400
  }
]