[
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Keven' AND `t1`.`last` = 'Kuhn' AND `t2`.`description` = 'DTaP')\nRETURN COUNT(`t2`.`code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times did Keven Kuhn receive DTaP immunization?",
    "evidence": "DTaP immunization refers to immunizations where DESCRIPTION = 'DTaP';",
    "idx": 915
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Clopidogrel 75 MG Oral Tablet' AND toFloat(CASE WHEN `t2`.`stop` is not NULL THEN apoc.temporal.format(`t2`.`stop`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END) > 10)\nRETURN `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who had to take Clopidogrel 75 MG Oral Tablet for over 10 years?",
    "evidence": "Who implies the full name of the patient which refers to first, last; Clopidogrel 75 MG Oral Tablet refers to medications where DESCRIPTION = 'Clopidogrel 75 MG Oral Tablet'; for over 10 years refers to SUBTRACT(strftime('%Y', STOP), strftime('%Y', START)) > 10;",
    "idx": 916
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)\nMATCH (`t1`:`allergies`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`start` = '6/6/16' AND `t1`.`description` = 'Allergy to mould')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide medications received by patients with an allergy to mould on 6th June 2016.",
    "evidence": "medications refers to DESCRIPTION from medications; allergy to mould refers to allergies where DESCRIPTION = 'Allergy to mould'; on 6th June 2016 refers to START = '6/6/16';",
    "idx": 917
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)\nMATCH (`t1`:`careplans`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Secondary malignant neoplasm of colon')\nRETURN DISTINCT `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the care plans received by the patient with secondary malignant neoplasm of the colon.",
    "evidence": "care plans refer to DESCRIPTION from careplans; secondary malignant neoplasm of the colon refers to conditions where DESCRIPTION = 'Secondary malignant neoplasm of colon';",
    "idx": 918
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[prevalence_0:prevalence]->(`t2`:`all_prevalences`)\nWHERE lower(`t1`.`description`) = lower(`t2`.`item`)\nAND (`t1`.`start` = localdatetime('2014-05-09T00:00:00'))\nRETURN `t2`.`prevalence rate` AS `prevalence rate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the prevalence rate of the patients' diseases started on 9th May 2014?",
    "evidence": "diseases started on 9th May 2014 refer to DESCRIPTION from conditions where START = '5/9/2014';",
    "idx": 919
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`observations`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Systolic Blood Pressure' AND `t1`.`value` = 200 AND `t1`.`units` = 'mmHg' AND CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END = '2011')\nRETURN `t2`.`first` AS `first`, `t2`.`last` AS `last`, CASE  WHEN `t2`.`deathdate` IS NULL THEN toFloat(CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) ELSE toFloat(CASE WHEN `t2`.`deathdate` is not NULL THEN apoc.temporal.format(`t2`.`deathdate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) END AS `age`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among observations in 2011, provide the names and ages of patients whose Systolic Blood Pressures are 200mmHg.",
    "evidence": "name implies the patient's full name which refers to first, last; age refers to deathdate is null then SUBTRACT(strftime('%Y', DATE), strftime('%Y', birthdate)); Systolic Blood Pressures are 200mmHg refers to DESCRIPTION = 'Systolic Blood Pressure' and VALUE = 200 and UNITS = 'mmHg' from observations; in 2011 refers to DATE like '2011%';",
    "idx": 920
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy') ELSE NULL END = '2017')\nRETURN CASE WHEN COUNT(`t1`.`patient`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`description` = 'Influenza seasonal injectable preservative free' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`patient`) END AS `_col_0`, sum(CASE  WHEN `t1`.`ethnicity` = 'english' THEN 1 ELSE 0 END) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the immunizations in 2017, calculate the percentage of patients who received the Influenza seasonal injectable preservative free. Among them, how many patients are English?",
    "evidence": "DIVIDE(COUNT(PATIENT when DESCRIPTION = 'Influenza seasonal injectable preservative free'), COUNT(PATIENT)) as percentage where strftime('%Y', 2017); English refers ethnicity = 'english';",
    "idx": 921
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`reasondescription` = 'Normal pregnancy')\nRETURN DISTINCT `t1`.`first` AS `first`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the first name of patients who encountered normal pregnancy.",
    "evidence": "encountered normal pregnancy refers to encounters where REASONDESCRIPTION = 'Normal pregnancy';",
    "idx": 922
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Outpatient Encounter')\nRETURN DISTINCT `t1`.`birthdate` AS `birthdate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the birth date of patients who took outpatient encounter care plan?",
    "evidence": "outpatient encounter care plan refers to careplans where DESCRIPTION = 'Outpatient Encounter';",
    "idx": 923
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Cystitis')\nRETURN DISTINCT `t1`.`first` AS `first`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the first name of patients who have cystitis condition.",
    "evidence": "cystitis refers to conditions where DESCRIPTION = 'Cystitis';",
    "idx": 924
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Stroke' AND `t1`.`marital` = 'M')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many stroke patients have married?",
    "evidence": "stroke refers to conditions where DESCRIPTION = 'Stroke'; married refers to the marital status of the patient in which marital = 'M';",
    "idx": 925
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)\nMATCH (`t2`:`claims`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (toString(`t2`.`billableperiod`) =~ '(?i)(?s)2010.*')\nRETURN DISTINCT `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the address of patients who have billable period in 2010.",
    "evidence": "",
    "idx": 926
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`allergies`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Allergy to dairy product')\nRETURN DISTINCT `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the last name of patients who are allergic to dairy products.",
    "evidence": "allergic to dairy products refers to allergies where DESCRIPTION = 'Allergy to dairy product';",
    "idx": 927
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`allergies`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Adolfo' AND `t1`.`last` = 'Schmitt' AND NOT `t2`.`stop` IS NULL)\nRETURN `t2`.`start` AS `start`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When the allergy starts for Angelo Buckridge.",
    "evidence": "",
    "idx": 928
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`allergies`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'House dust mite allergy' AND `t1`.`gender` = 'M')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the male patients are allergic to house dust mites?",
    "evidence": "male patients refer to PATIENT where gender = 'M'; allergic to house dust mites refers to allergies where DESCRIPTION = 'House dust mite allergy';",
    "idx": 929
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Influenza  seasonal  injectable  preservative free')\nRETURN DISTINCT `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the first name of patients who received \"Influenza seasonal injectable preservative free\" immunization.",
    "evidence": "\"Influenza seasonal injectable preservative free\" immunization refers to immunizations where DESCRIPTION = 'Influenza seasonal injectable preservative free';",
    "idx": 930
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'HPV  quadrivalent' AND `t1`.`gender` = 'F')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the number of female patients who accepted \"HPV quadrivalent\" immunization.",
    "evidence": "female refers to gender = 'F'; \"HPV quadrivalent\" immunization refers to immunizations where DESCRIPTION = 'HPV quadrivalent';",
    "idx": 931
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`birthplace` = 'Pittsfield MA US')\nRETURN DISTINCT `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the encounter descriptions of patients who were born in Pittsfield MA US.",
    "evidence": "born in Pittsfield MA US refers to birthplace = 'Pittsfield MA US';",
    "idx": 932
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`allergies`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`ethnicity` = 'german')\nRETURN COUNT(DISTINCT `t2`.`description`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total type of allergies for German people.",
    "evidence": "type of allergies refers to DESCRIPTION from allergies; German people refer to PATIENT where ethnicity = 'german';",
    "idx": 933
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`careplans`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`reasondescription` = 'Prediabetes')\nRETURN CASE WHEN COUNT(DISTINCT `t1`.`patient`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`deathdate` IS NULL THEN toFloat(CASE WHEN `t2`.`stop` is not NULL THEN apoc.temporal.format(`t2`.`stop`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) ELSE toFloat(CASE WHEN `t1`.`deathdate` is not NULL THEN apoc.temporal.format(`t1`.`deathdate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) END)) / COUNT(DISTINCT `t1`.`patient`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average age of patients with prediabetes care plan.",
    "evidence": "SUBTRACT(SUM(deathdate), SUM(birthdate)), COUNT(patient) where REASONDESCRIPTION = 'Prediabetes' from careplans;",
    "idx": 934
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`medications`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`reasondescription` = 'Coronary Heart Disease' AND NOT `t1`.`stop` IS NULL AND `t2`.`deathdate` IS NULL)\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the patients who have stopped taking medication for 'coronary heart disease' are still alive?",
    "evidence": "patients who have stopped taking medication for 'coronary heart disease' refer to PATIENT where REASONDESCRIPTION = 'Coronary Heart Disease' and STOP is not null from medications; if deathdate is null, it means this patient is still alive;",
    "idx": 935
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`procedures`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Bone immobilization' AND NOT `t1`.`drivers` IS NULL)\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the patients who underwent a 'bone immobilization' procedure have a driver's license?",
    "evidence": "patients who underwent a 'bone immobilization' procedure refer to PATIENT from procedures where DESCRIPTION = 'Bone immobilization'; have a driver's license refers to drivers is not null;",
    "idx": 936
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`allergies`)-[patient_0:patient]->(`t2`:`patients`)-[t3:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND `t2`.`patient` = `t3`.`patient`\nAND (`t1`.`description` = 'Allergy to eggs' AND `t3`.`description` = 'Td (adult) preservative free')\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients with 'allergy to eggs' have been immunized with 'Td (adult) preservative free'?",
    "evidence": "allergy to eggs' refers to allergies where DESCRIPTION = 'Allergy to eggs'; immunized with 'Td (adult) preservative free' refers to immunizations where DESCRIPTION = 'Td (adult) preservative free';",
    "idx": 937
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nMATCH (`t3`:`observations`)-[patient_1:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND `t2`.`patient` = `t3`.`patient`\nAND (`t3`.`description` = 'Body Weight' AND `t1`.`description` = 'Diabetes self management plan' AND `t3`.`value` > 100 AND `t3`.`units` = 'kg')\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients with a body weight of more than 100 kg have a 'diabetes self-management plan' care plan?",
    "evidence": "body weight of more than 100 kg refers to observations.DESCRIPTION = 'Body Weight' AND observations.VALUE > 100 AND observations.UNITS = 'kg'; diabetes self-management plan refers to careplans.DESCRIPTION = 'Diabetes self management plan';",
    "idx": 938
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)\nMATCH (`t2`:`claims`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`last` = 'Dickinson')\nRETURN DISTINCT `t2`.`billableperiod` AS `billableperiod`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On what dates did the billable period begin for patients with the last name Dickinson?",
    "evidence": "dates when the billable period begin refers to BILLABLEPERIOD;",
    "idx": 939
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Otitis media')\nRETURN DISTINCT `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name of all patients with 'otitis media'.",
    "evidence": "full name = first, last; otitis media refers to conditions.DESCRIPTION = 'Otitis media';",
    "idx": 940
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`reasondescription` = 'Myocardial Infarction' AND `t1`.`ethnicity` = 'irish')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients of Irish ethnicity take medication for 'myocardial infarction'?",
    "evidence": "take medication for myocardial infarction refers to medications.REASONDESCRIPTION = 'Myocardial Infarction';",
    "idx": 941
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`careplans`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`marital` = 'M' AND `t2`.`reasondescription` = 'Concussion with loss of consciousness')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients with care plan for 'concussion with loss of consciousness' are married?",
    "evidence": "concussion with loss of consciousness refers to careplans.DESCRIPTION = 'Concussion with loss of consciousness'; married refers to marital = 'M';",
    "idx": 942
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)\nMATCH ()-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'rotavirus  monovalent' AND `t1`.`stop` = localdatetime('2013-11-23T00:00:00'))\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients immunized against 'monovalent rotavirus' ceased their care plan on 11/23/2013?",
    "evidence": "immunized against monovalent rotavirus refers to immunizations.DESCRIPTION = 'rotavirus monovalent'; ceased their care plan on 11/23/2013 refers to careplans.STOP = '2013-11-23';",
    "idx": 943
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Nitroglycerin 0.4 MG/ACTUAT [Nitrolingual]' AND `t1`.`gender` = 'F')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many women need to take 'Nitroglycerin 0.4 MG/ACTUAT [Nitrolingual]'?",
    "evidence": "women refers to gender = 'F'; Nitroglycerin 0.4 MG/ACTUAT [Nitrolingual] refers to medications.DESCRIPTION = 'Nitroglycerin 0.4 MG/ACTUAT [Nitrolingual]'",
    "idx": 944
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`race` = 'asian' AND `t2`.`description` = 'Body Weight' AND `t2`.`units` = 'kg')\nRETURN CASE WHEN COUNT(`t1`.`patient`)=0 THEN NULL ELSE sum(`t2`.`value`) / COUNT(`t1`.`patient`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average body weight of Asian patients?",
    "evidence": "average = AVG(observations.VALUE WHERE observations.DESCRIPTION = 'Body Weight' AND observations.UNITS = 'kg'); body weight refers to observations.DESCRIPTION = 'Body Weight'; Asian refers to race = 'asian';",
    "idx": 945
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`allergies`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Latex allergy')\nRETURN `t1`.`ssn` AS `ssn`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the Social Security numbers of patients who have latex allergies.",
    "evidence": "Social Security numbers refers to ssn; latex allergies refers to allergies.DESCRIPTION = 'Latex allergy';",
    "idx": 946
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`allergies`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t2`.`patient` = `t1`.`patient`\nAND (NOT `t1`.`stop` IS NULL AND NOT `t1`.`start` IS NULL AND `t2`.`first` = 'Isadora' AND `t2`.`last` = 'Moen')\nRETURN CASE  WHEN CASE  WHEN -2-1 < 0 AND 1 < 0  THEN substring(`t1`.`stop`,(case when size(`t1`.`stop`)+1+(-2-1)+1 < 0 then 0 else size(`t1`.`stop`)+1+(-2-1)+1 end),-(1))  WHEN -2-1 < 0 AND 1 >= 0  THEN substring(`t1`.`stop`,size(`t1`.`stop`)+1+(-2-1),1)  WHEN -2-1 >= 0 AND 1 < 0  THEN substring(`t1`.`stop`,(case when -2-1+1+(1) < 0 then 0 else -2-1+1+(1) end),-(1))  ELSE substring(`t1`.`stop`,-2-1,1) END <> '9' THEN toFloat(CASE WHEN char_length(`t1`.`stop`) - 1-1 < 0 THEN substring(`t1`.`stop`,size(`t1`.`stop`)+1+(char_length(`t1`.`stop`) - 1-1)) ELSE substring(`t1`.`stop`,char_length(`t1`.`stop`) - 1-1) END) + 2000  END - CASE  WHEN CASE  WHEN -2-1 < 0 AND 1 < 0  THEN substring(`t1`.`start`,(case when size(`t1`.`start`)+1+(-2-1)+1 < 0 then 0 else size(`t1`.`start`)+1+(-2-1)+1 end),-(1))  WHEN -2-1 < 0 AND 1 >= 0  THEN substring(`t1`.`start`,size(`t1`.`start`)+1+(-2-1),1)  WHEN -2-1 >= 0 AND 1 < 0  THEN substring(`t1`.`start`,(case when -2-1+1+(1) < 0 then 0 else -2-1+1+(1) end),-(1))  ELSE substring(`t1`.`start`,-2-1,1) END = '9' THEN toFloat(CASE WHEN char_length(`t1`.`start`) - 1-1 < 0 THEN substring(`t1`.`start`,size(`t1`.`start`)+1+(char_length(`t1`.`start`) - 1-1)) ELSE substring(`t1`.`start`,char_length(`t1`.`start`) - 1-1) END) + 1900 ELSE toFloat(CASE WHEN char_length(`t1`.`start`) - 1-1 < 0 THEN substring(`t1`.`start`,size(`t1`.`start`)+1+(char_length(`t1`.`start`) - 1-1)) ELSE substring(`t1`.`start`,char_length(`t1`.`start`) - 1-1) END) + 2000 END AS `years`, `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How long did Isadora Moen's allergy last? Tell me what kind of allergy she has.",
    "evidence": "how long the allergies last = SUBTRACT(allergies.STOP, allergies.START); kind of allergy refers to allergies.DESCRIPTION;",
    "idx": 947
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`careplans`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`start` >= localdatetime('2009-01-11T00:00:00') AND `t2`.`start` <= localdatetime('2010-10-23T00:00:00'))\nRETURN COUNT(`t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times was Elly Koss given a care plan between 1/11/2009 and 10/23/2010?",
    "evidence": "between 1/11/2009 and 10/23/2010 refers to careplans.START between '2009-11-1' and '2010-10-23';",
    "idx": 948
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Influenza  seasonal  injectable  preservative free' AND `t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss')\nRETURN `t2`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the dates on which Elly Koss was immunized with the influenza seasonal injectable preservative-free vaccine.",
    "evidence": "date of immunization refers to immunizations.DATE; immunized with the influenza seasonal injectable preservative-free vaccine refers to immunizations.DESCRIPTION = 'Influenza seasonal injectable preservative free';",
    "idx": 949
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'meningococcal MCV4P' AND `t2`.`date` >= localdatetime('2010-07-09T00:00:00') AND `t2`.`date` <= localdatetime('2013-10-29T00:00:00') AND `t1`.`race` = 'black')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 7/9/2010 to 10/29/2013, how many black patients were immunized with the meningococcal MCV4P vaccine?",
    "evidence": "From 7/9/2010 to 10/29/2013 refers to DATE between '2010-07-09' and '2013-10-29'; black patients refers to race = 'black'; immunized with the meningococcal MCV4P vaccine refers to immunizations.DESCRIPTION = 'meningococcal MCV4P';",
    "idx": 950
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`prefix` = 'Ms.' AND `t1`.`first` = 'Jacquelyn' AND `t1`.`last` = 'Shanahan' AND `t2`.`description` = 'Influenza  seasonal  injectable  preservative free')\nRETURN DISTINCT `t2`.`code` AS `code`, `t2`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give me the immunization codes and dates on which Ms. Jacquelyn Shanahan was immunized with influenza seasonal injectable preservative-free vaccine.",
    "evidence": "immunization codes refers to immunizations.CODE; immunization dates refers to immunizations.DATE; immunized with influenza seasonal injectable preservative-free vaccine refers to immunizations.DESCRIPTION = 'Influenza seasonal injectable preservative free'; 4 consecutive years refers to 4 succeeding years;",
    "idx": 951
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`marital` = 'S' AND `t2`.`reasondescription` = 'Cystitis' AND `t2`.`description` = 'Nitrofurantoin 5 MG/ML [Furadantin]' AND CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END = '2010')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2010, how many single patients took Nitrofurantoin 5 mg/ML [Furadantin] to cure cystitis?",
    "evidence": "in 2010 refers to substr(medications.START, 1, 4) = '2010' AND substr(medications.stop, 1, 4) = '2010'; Nitrofurantoin 5 mg/ML [Furadantin] refers to medications.DESCRIPTION = 'Nitrofurantoin 5 MG/ML [Furadantin]'; cystitis refers to medications.REASONDESCRIPTION = 'Cystitis';",
    "idx": 952
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`date` = localdatetime('2013-11-20T00:00:00') AND `t1`.`first` = 'Lavelle' AND `t1`.`last` = 'Vandervort')\nRETURN `t2`.`reasondescription` AS `reasondescription`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell me the reason for Lavelle Vandervort's encounter on 11/20/2013?",
    "evidence": "reason for encounter refers to encounters.REASONDESCRIPTION; on 11/20/2013 refers to encounters.DATE = '2013-11-20';",
    "idx": 953
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`ethnicity` = 'german' AND `t2`.`date` >= localdatetime('2011-01-09T00:00:00') AND `t2`.`date` <= localdatetime('2012-08-29T00:00:00') AND `t2`.`description` = 'Outpatient Encounter')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 1/9/2011 to 8/29/2012, how many German patients have their outpatient encounters?",
    "evidence": "From 1/9/2011 to 8/29/2012 refers to encounters.DATE between '2011-09-01' and '2012-08-29'; German patients refers to ethnicity = 'german'; outpatient encounters refers to encounters.DESCRIPTION = 'Outpatient Encounter';",
    "idx": 954
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`date` = localdatetime('2008-06-13T00:00:00') AND `t2`.`reasondescription` = 'Viral sinusitis (disorder)' AND `t2`.`description` = 'Encounter for symptom')\nRETURN `t1`.`ssn` AS `ssn`, `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the social security number and address of the patient who encountered viral sinusitis symptoms on 6/13/2008?",
    "evidence": "social security number refers to ssn; encountered viral sinusitis refers to encounters.REASONDESCRIPTION = 'Viral sinusitis (disorder)'; on 6/13/2008 refers to encounters.DATE = '2008-06-13';",
    "idx": 955
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Major' AND `t1`.`last` = 'D\\'Amore')\nRETURN COUNT(DISTINCT `t2`.`description`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many types of medication have been prescribed to Mr. Major D'Amore since his visit to the hospital?",
    "evidence": "types of medications refers to medications.DESCRIPTION;",
    "idx": 956
  }
]