[
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[workorderrouting:processed_at]->()\nWHERE `workorderrouting`.`productid` = 818\nRETURN `workorderrouting`.`plannedcost` - `workorderrouting`.`actualcost` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference between the actual manufacturing cost of product number 818 and the estimated manufacturing cost?",
    "evidence": "product number 818 refers to ProductID = 818; estimated manufacturing cost refers PlannedCost; actual manufacturing cost refers to ActualCost; difference = Substract(PlannedCost(ProductID(818))),(ActualCost(ProductID(818)));",
    "idx": 5564
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`billofmaterials`:`billofmaterials`)\nWHERE `billofmaterials`.`bomlevel` = 2 AND `billofmaterials`.`enddate` IS NULL\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many materials still need to be assembled and have a depth of 2 between each component and their parent product?",
    "evidence": "still need to be assembled means the assembly doesn't finish or still going on which refers to EndDate IS NULL; a depth of 2 refers to BOMLevel = 2;",
    "idx": 5565
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`document`:`document`)\nWHERE `document`.`status` = 2 AND `document`.`documentsummary` IS NULL\nRETURN COUNT(`document`.`documentnode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the approved documents are confidential?",
    "evidence": "approved refers to Status = 2; confidential document refers to DocumentSummary is null;",
    "idx": 5566
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salestaxrate`:`salestaxrate`)\nWHERE `salestaxrate`.`name` =~ '(?i)(?s).*\\+.*'\nRETURN `salestaxrate`.`salestaxrateid` AS `salestaxrateid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the sales tax records charged by multiple types of tax?",
    "evidence": "multiple types of tax refers to Name like '%+%';\n",
    "idx": 5567
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`transactionhistory`:`transactionhistory`)\nWHERE `transactionhistory`.`transactiontype` = 'W'\nORDER BY `transactionhistory`.`quantity` IS NULL ASC, `transactionhistory`.`quantity` DESC \nRETURN `transactionhistory`.`transactionid` AS `transactionid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which work order transaction number has the highest product quantity?",
    "evidence": "work order transaction refers to TransactionType = 'W';",
    "idx": 5568
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`vendor`:`vendor`)\nWHERE `vendor`.`preferredvendorstatus` = 0\nRETURN `vendor`.`name` AS `name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any 3 vendors that are not recommended by Adventure Works.",
    "evidence": "not recommended refers to PreferredVendorStatus = 0;",
    "idx": 5569
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`vendor`:`vendor`)\nWHERE `vendor`.`preferredvendorstatus` = 0 AND `vendor`.`activeflag` = 1\nRETURN COUNT(`vendor`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many vendors does Adventure Works still work with but are not preferable?",
    "evidence": "not preferable refers to PreferredVendorStatus = 0; still work refers to ActiveFlag = 1;",
    "idx": 5570
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employeedepartmenthistory`)\nMATCH (`t2`:`shift`)\nWHERE `t1`.`shiftid` = `t2`.`shiftid`\nAND (`t2`.`shiftid` = 3 AND CASE WHEN `t2`.`starttime` is not NULL THEN apoc.temporal.format(`t2`.`starttime`,'yyyy') ELSE NULL END >= '2009')\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees who began working in 2009 or later had night shifts?",
    "evidence": "began work in 2009 or later refers to StartDate> = 2009;",
    "idx": 5571
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`salesorderheader`)\nMATCH (`t1`:`shipmethod`)\nWHERE `t1`.`shipmethodid` = `t2`.`shipmethodid`\nAND (`t1`.`name` = 'XRQ - TRUCK GROUND')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many shipments by truck were made?",
    "evidence": "shipment by truck refers to Name = 'XRQ - TRUCK GROUND';",
    "idx": 5572
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t1:has_sales_reason]->(`t2`:`salesreason`)\nWHERE `t1`.`salesreasonid` = `t2`.`salesreasonid`\nAND (`t1`.`salesorderid` = 43718)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the sales reasons for order 43718?",
    "evidence": "order refers to SalesOrderID",
    "idx": 5573
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productsubcategory`)-[subcategory_of_0:subcategory_of]->(`t2`:`productcategory`)\nWHERE `t1`.`productcategoryid` = `t2`.`productcategoryid`\nAND (`t2`.`name` = 'Bikes')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What bike subcategories are there?",
    "evidence": "bikes is product category",
    "idx": 5574
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)\nMATCH (`t2`:`salesorderdetail`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`salesorderid` = 43660)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What goods were sold to customers in accordance with sales order number 43660?",
    "evidence": "goods refers to products",
    "idx": 5575
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)-[t2:stored_at]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'Down Tube')\nRETURN `t2`.`shelf` AS `shelf`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where are the shelves where the down tube product was stored?",
    "evidence": "shelves refer to shelf; down tube is a product",
    "idx": 5576
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`transactionhistory`)-[transaction_for_0:transaction_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'Mountain End Caps')\nRETURN `t2`.`referenceorderid` AS `referenceorderid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the order reference number for the \"Mountain End Caps\" product?",
    "evidence": "Order Reference Number refers to ReferenceOrderID",
    "idx": 5577
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:has_address]->(`t1`:`address`)\nWHERE `t1`.`addressid` = `t2`.`addressid`\nAND (`t2`.`businessentityid` = 12)\nRETURN `t1`.`addressline1` AS `addressline1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the 12th business's first line address?",
    "evidence": "12th business refers to BusinessEntityID = 12;",
    "idx": 5578
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`stateprovince`)\nMATCH (`t1`:`address`)\nWHERE `t1`.`stateprovinceid` = `t2`.`stateprovinceid`\nAND (`t1`.`city` = 'Racine')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the state that Racine belongs to?",
    "evidence": "Racine is a city",
    "idx": 5580
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`culture`)\nMATCH ()-[t2:has_description_in_culture]->()\nWHERE `t1`.`cultureid` = `t2`.`cultureid`\nRETURN CASE WHEN sum(CASE  WHEN `t1`.`name` = 'Thai' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`name` = 'Arabic' THEN 1 ELSE 0 END)) * 100 / sum(CASE  WHEN `t1`.`name` = 'Thai' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference in percentage between the product descriptions written in Arabic and Thai?",
    "evidence": "Arabic and Thai are language names refers to name = 'Arabic'and name = 'Thai'; Differencce in percentage = Subtract(((Count(CultureID(name = 'Arabic'))/Count(CultureID))*100),((Count(CultureID(name = 'Thai'))/Count(CultureID))*100)));",
    "idx": 5581
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`salesperson`)-[assigned_to_0:assigned_to]->(`t2`:`salesterritory`)\nWHERE `t1`.`territoryid` = `t2`.`territoryid`\nAND (`t2`.`countryregioncode` = 'US' AND `t2`.`name` = 'Northwest')\nRETURN CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`salesquota` > 300000 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of businesses in the Northwest US have forecasted annual sales of above 300,000?",
    "evidence": "Northwest refers to Name = 'Northwest'; US refers to CountryRegionCode = 'US'; forecasted annual sales of above 300,000 refers to SalesQuota >300000; Percentage = Divide(Count(TerritoryID(SalesQuota >300000)),Count(TerritoryID))*100",
    "idx": 5582
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)-[t2:supplied_by]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` =~ '(?i)(?s).*Crankarm.*')\nRETURN `t2`.`lastreceiptcost` - `t2`.`standardprice` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the Crankarm product's net profit?",
    "evidence": "net profit = Subtract(LastReceiptCost, StandardPrice);",
    "idx": 5583
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "CALL(*) {\nMATCH (`productreview_sub0`:`productreview`)\nRETURN `productreview_sub0`.`rating` AS `rating` ORDER BY `rating` IS NULL ASC, `rating` DESC \nLIMIT 1\n}\nMATCH (`t2`:`productreview`)-[review_for_0:review_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`rating` = `rating`)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the product with the almost highest review score?",
    "evidence": "highest review score refers to Rating = 5;",
    "idx": 5584
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employeepayhistory`:`employeepayhistory`)\nWHERE `employeepayhistory`.`payfrequency` = 1\nRETURN `employeepayhistory`.`rate` AS `rate` ORDER BY `rate` IS NULL ASC, `rate` DESC \nSKIP 1\nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the company's second highest salary per hour for employees who are paid monthly?",
    "evidence": "salary received monthly refers to PayFrequency = 1; highest salary per hour refers to Max(Rate);",
    "idx": 5585
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`creditcard`:`creditcard`)\nWHERE `creditcard`.`cardtype` = 'Vista' AND `creditcard`.`expyear` < 2007\nRETURN COUNT(`creditcard`.`creditcardid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Vista cards expired before the year 2007?",
    "evidence": "Vista Card refers to CardType = 'Vista'; expire before the year 2007 refers to ExpYear< = 2006;\n\n",
    "idx": 5586
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`shift`:`shift`)\nWHERE `shift`.`name` = 'Night'\nRETURN `shift`.`starttime` AS `starttime`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What time does the company's night shift begin? Indicate the answer in regular form.",
    "evidence": "Night shift refers to Name = 'Night';",
    "idx": 5587
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesterritory`:`salesterritory`)\nRETURN `salesterritory`.`saleslastyear` - `salesterritory`.`salesytd` AS `_col_0`, `salesterritory`.`name` AS `name`, `salesterritory`.`countryregioncode` AS `countryregioncode` ORDER BY `salesterritory`.`saleslastyear` - `salesterritory`.`salesytd` IS NULL ASC, `salesterritory`.`saleslastyear` - `salesterritory`.`salesytd` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which territory has the greatest difference in sales from previous year to this year? Indicate the difference, as well as the name and country of the region.",
    "evidence": "greatest difference in sales from previous year to this year refers to Max(Subtract(SalesLastYear,SalesYTD));",
    "idx": 5588
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`sizeunitmeasurecode` = 'CM'\nORDER BY `product`.`size` IS NULL ASC, `product`.`size` DESC \nRETURN `product`.`name` AS `name`, `product`.`reorderpoint` AS `reorderpoint`  LIMIT 6",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the top 6 products that has the biggest size in centimeter and what are its reorder point?",
    "evidence": "in centimeter refers to SizeUnitMeasureCode = 'CM';",
    "idx": 5589
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`purchaseorderheader`:`purchaseorderheader`)\nORDER BY `purchaseorderheader`.`freight` IS NULL ASC, `purchaseorderheader`.`freight` DESC \nRETURN `purchaseorderheader`.`totaldue` AS `totaldue` SKIP 2\nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the amount to be paid by the company for the purchase order with the third highest freight amount?",
    "evidence": "amount to be paid refers to TotalDue;",
    "idx": 5590
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE NOT `product`.`weight` IS NULL\nORDER BY `product`.`weight` IS NULL DESC, `product`.`weight`  \nRETURN 10 * (`product`.`listprice` - `product`.`standardcost`) AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What profit will the company gain if they sell 10 items of the product that has the lightest weight?",
    "evidence": "Lightest product refers to Min(Weight); profit if they sell 10 items refers to Subtract (ListPrice , StandardCost) *10;",
    "idx": 5591
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`purchaseorderheader`:`purchaseorderheader`)\nRETURN `purchaseorderheader`.`taxamt` AS `taxamt`, `purchaseorderheader`.`purchaseorderid` AS `purchaseorderid` ORDER BY `taxamt` IS NULL ASC, `taxamt` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the tax amount of the purchase order with the biggest tax amount? Indicate the purchase order ID.",
    "evidence": "tax amount refers to TaxAmt; biggest tax amount refers to MAX(TaxAmt);",
    "idx": 5592
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salespersonquotahistory`:`salespersonquotahistory`)\nWHERE `salespersonquotahistory`.`salesquota` < 500000\nRETURN COUNT(`salespersonquotahistory`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many person have a projected yearly sales of no more than 50,000?",
    "evidence": "projected yearly sales refers to SalesQuota; SalesQuota< = 50000;",
    "idx": 5593
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "CALL(*) {\nMATCH (`product_sub0`:`product`)\nRETURN `product_sub0`.`daystomanufacture` AS `daystomanufacture` ORDER BY `daystomanufacture` IS NULL DESC, `daystomanufacture`  \nLIMIT 1\n}\nMATCH (`t2`:`productreview`)-[review_for_0:review_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`daystomanufacture` = `daystomanufacture`)\nORDER BY `t1`.`listprice` - `t1`.`standardcost` IS NULL ASC, `t1`.`listprice` - `t1`.`standardcost` DESC \nRETURN `t1`.`name` AS `name`, `t2`.`rating` AS `rating`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which product allows the company to make the highest profit on a single item among those that are the fastest to manufacture? Indicate the rating of the product if there any.",
    "evidence": "profit on a single item = SUBTRACT(ListPrice, StandardCost); length of time to manufacture refers to DaysToManufacture; fastest to manucature refers to MIN(DaysToManufacture);",
    "idx": 5594
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`salesperson`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`bonus` < 1000)\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the full names of the sales person whose bonuses are less than 1,000?",
    "evidence": "full name = FirstName+MiddleName+LastName; Bonus<1000;",
    "idx": 5595
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`purchaseorderheader`)-[from_vendor_0:from_vendor]->(`t1`:`vendor`)\nWHERE `t1`.`businessentityid` = `t2`.`vendorid`\nAND (`t1`.`creditrating` = 4 AND `t1`.`preferredvendorstatus` = 0)\nRETURN sum(`t2`.`totaldue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the vendors with an average credit rating, what is the overall total due amount of purchases made by the company to the vendor that isn't preferrerd if another vendor is available?",
    "evidence": "average credit rating refers to CreditRating = 4;  vendor that isn't preferrerd if another vendor is available refers to PreferredVendorStatus = 0; SUM(TotalDue);",
    "idx": 5596
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)\nMATCH (`t2`:`productsubcategory`)\nWHERE `t1`.`productsubcategoryid` = `t2`.`productsubcategoryid`\nAND (`t1`.`class` = 'H' AND `t1`.`color` = 'Black' AND `t1`.`size` = '58' AND `t2`.`name` = 'Road Bikes')\nRETURN 2 * (`t1`.`listprice` - `t1`.`standardcost`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much profit can the company gained from selling two high class black Road Bikes with a size of 58?",
    "evidence": "high class refers to Class = 'H\"; road bikes is a name of product subcategory; profit = (MULTIPLY(SUBTRACT(ListPrice, StandardCost)), (2)));",
    "idx": 5597
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`jobtitle` =~ '(?i)(?s)Production Technician.*' AND `t1`.`gender` = 'M' AND `t1`.`maritalstatus` = 'M')\nORDER BY `t1`.`birthdate` IS NULL ASC, `t1`.`birthdate` DESC \nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the full names of the 10 youngest married male production technicians?",
    "evidence": "youngest refers to latest BirthDate; married refers to MaritalStatus = 'M'; production technician is a JobTitle; full name = FirstName+MiddleName+LastName;",
    "idx": 5598
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t1:supplied_by]->(`t2`:`vendor`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t1`.`maxorderqty` IS NULL DESC, `t1`.`maxorderqty`  \nRETURN `t2`.`name` AS `name` SKIP 1\nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the vendor with the second lowest minimum order quantity?",
    "evidence": "minimum order quantity refers to MinOrderQty;",
    "idx": 5601
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:supplied_by]->(`t1`:`vendor`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`activeflag` = 0)\nRETURN `t2`.`minorderqty` AS `minorderqty` ORDER BY `t2`.`minorderqty` IS NULL DESC, `t2`.`minorderqty`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much are the minimum orders of the vendors that are no longer used by the company?",
    "evidence": "vendors that are no longer used by the company refers to ActiveFlag = 0;",
    "idx": 5602
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`vacationhours` <= 10)\nRETURN toFloat(CASE WHEN `t1`.`hiredate` is not NULL THEN apoc.temporal.format(`t1`.`hiredate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) AS `_col_0`, `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname` ORDER BY toFloat(CASE WHEN `t1`.`hiredate` is not NULL THEN apoc.temporal.format(`t1`.`hiredate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) IS NULL ASC, toFloat(CASE WHEN `t1`.`hiredate` is not NULL THEN apoc.temporal.format(`t1`.`hiredate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Of the employees whose vacation hours are no more than 10, what is the age of the oldest employee at the time he/she was hired? Indicate his/her full name.",
    "evidence": "VacationHours<10; age at the time of being hired = SUBTRACT(year(HireDate), year(BirthDate)); full name = FirstName+MiddleName+LastName;",
    "idx": 5603
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productreview`)-[review_for_0:review_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`reviewername` = 'David')\nORDER BY `t1`.`rating` IS NULL ASC, `t1`.`rating` DESC \nRETURN `t2`.`listprice` - `t2`.`standardcost` AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the company's profit on the product that was rated second-highest by David?",
    "evidence": "profit on net on a single product = SUBTRACT(ListPrice, StandardCost); second highest rating refers to Rating = 4; David is the ReviewerName;",
    "idx": 5604
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)\nMATCH (`t2`:`productsubcategory`)\nWHERE `t1`.`productsubcategoryid` = `t2`.`productsubcategoryid`\nAND (`t1`.`class` = 'L' AND `t2`.`name` = 'Road Frames')\nWITH `t1`.`class` AS _groupby_col_0, `t1`.`color` AS _groupby_col_1, avg(`t1`.`listprice` - `t1`.`standardcost`) AS _groupby_col_2, COUNT(DISTINCT `t1`.`size`) AS _groupby_col_3, COUNT(DISTINCT `t1`.`style`) AS _groupby_col_4\nRETURN _groupby_col_2 AS `_col_0`, _groupby_col_3 AS `_col_1`, _groupby_col_4 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average profit of all the low class universal road frames? Indicate how many variety of sizes are there and the available colors.",
    "evidence": "low class refers to Class = 'L'; universal refers to Style = 'U'; road frame is a name of product subcategory; average profit = AVG(SUBTRACT(ListPrice, StandardCost);",
    "idx": 5605
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`specialoffer`:`specialoffer`)\nWHERE `specialoffer`.`description` = 'LL Road Frame Sale'\nRETURN `specialoffer`.`discountpct` AS `discountpct`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the discount percentage of \"LL Road Frame Sale\"?",
    "evidence": "discount percentage refers to DiscountPct; LL Road Frame Sale is a description of special offer;",
    "idx": 5606
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`specialoffer`:`specialoffer`)\nWHERE `specialoffer`.`type` = 'Excess Inventory'\nRETURN COUNT(`specialoffer`.`specialofferid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many discount are of the type \"Excess Inventory\"?",
    "evidence": "discount refers to DiscountPct; Excess Inventory is a type of special offer;",
    "idx": 5607
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`specialoffer`:`specialoffer`)\nWHERE `specialoffer`.`type` = 'Seasonal Discount'\nORDER BY `specialoffer`.`discountpct` IS NULL ASC, `specialoffer`.`discountpct` DESC \nRETURN `specialoffer`.`description` AS `description`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which seasonal discount had the highest discount percentage?",
    "evidence": "seasonal discount is a type of special offer; discount percentage refers to DiscountPct; highest discount percentage refers to MAX(DiscountPct);",
    "idx": 5608
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`specialoffer`:`specialoffer`)\nWHERE `specialoffer`.`category` = 'Reseller'\nRETURN `specialoffer`.`description` AS `description`, `specialoffer`.`discountpct` AS `discountpct` ORDER BY `discountpct` IS NULL ASC, `discountpct` DESC \nSKIP 0\nLIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the top 3 discounts with the highest discount percentage and fall under the reseller category.",
    "evidence": "discount percentage refers to DiscountPct; highest discount percentage refers to MAX(DiscountPct);",
    "idx": 5609
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`store`:`store`)\nWHERE `store`.`name` = 'Valley Bicycle Specialists'\nRETURN `store`.`demographics` AS `demographics`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where can I get the demographic information about the Valley Bicycle Specialists store?",
    "evidence": "Valley Bicycle Specialists is a name of a store;",
    "idx": 5610
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`makeflag` = 1\nRETURN sum(`product`.`finishedgoodsflag`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the products that are manufactured in-house, how many of them are salable?",
    "evidence": "product is mnanufactured in-house refers to MakeFlag = 1; salable product refers to FinishedGoodsFlag = 1;",
    "idx": 5611
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`name` = 'Chainring Bolts'\nRETURN `product`.`safetystocklevel` AS `safetystocklevel`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the minimum inventory quantity of Chainring Bolts?",
    "evidence": "minimum inventory quantity refers to SafetyStockLevel; chainring bolts is a name of product;",
    "idx": 5612
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nORDER BY `product`.`standardcost` IS NULL ASC, `product`.`standardcost` DESC \nRETURN `product`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which product has the highest standard cost?",
    "evidence": "",
    "idx": 5613
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`firstname` = 'David' AND `person`.`lastname` = 'Bradley'\nRETURN `person`.`persontype` AS `persontype`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What type of employee is David Bradley?",
    "evidence": "type of employee refers to PersonType;",
    "idx": 5614
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`persontype` = 'SC' AND `person`.`title` = 'Mr.'\nRETURN COUNT(`person`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees who are store contacts, how many of them have a title of \"Mr.\"?",
    "evidence": "store contact refers to PersonType = 'SC';",
    "idx": 5615
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`store`)\nMATCH ()-[t1:has_address]->(`t2`:`address`)\nWHERE `t1`.`addressid` = `t2`.`addressid`\nAND `t1`.`businessentityid` = `t3`.`businessentityid`\nAND (`t3`.`name` = 'Valley Bicycle Specialists')\nRETURN `t2`.`addressline1` AS `addressline1`, `t2`.`addressline2` AS `addressline2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where can I find the Valley Bicycle Specialists store?",
    "evidence": "Valley Bicycle Specialists is a name of store; full address = AddressLine1+AddressLine2;",
    "idx": 5616
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`emailaddress`)-[belongs_to_0:belongs_to]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`firstname` = 'David' AND `t1`.`lastname` = 'Bradley')\nRETURN `t2`.`emailaddress` AS `emailaddress`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "To which e-mail address should I write if I want to contact David Bradley?",
    "evidence": "",
    "idx": 5617
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`password`)-[belongs_to_0:belongs_to]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`firstname` = 'David' AND `t1`.`lastname` = 'Bradley')\nRETURN `t2`.`passwordhash` AS `passwordhash`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the hashed password of David Bradley?",
    "evidence": "hashed password refers to PasswordHash;",
    "idx": 5618
  }
]