[
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "MATCH ()-[t1:repairs_machine]->(`t2`:`machine`)\nMATCH (`t3`:`technician`)-[t1:assigned_to_repair]->()\nWHERE `t1`.`machine_id` = `t2`.`machine_id`\nAND `t1`.`technician_id` = `t3`.`technician_id`\nORDER BY `t2`.`quality_rank` IS NULL DESC, `t2`.`quality_rank`  \nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of technicians in ascending order of quality rank of the machine they are assigned.",
    "evidence": "",
    "idx": 3155
  },
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "MATCH ()-[t1:repairs_machine]->(`t2`:`machine`)\nMATCH (`t3`:`technician`)-[t1:assigned_to_repair]->()\nWHERE `t1`.`machine_id` = `t2`.`machine_id`\nAND `t1`.`technician_id` = `t3`.`technician_id`\nAND (`t2`.`value_points` > 70)\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of technicians who are assigned to repair machines with value point more than 70.",
    "evidence": "",
    "idx": 3157
  },
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "MATCH (`t2`:`technician`)-[t1:assigned_to_repair]->()\nWHERE `t1`.`technician_id` = `t2`.`technician_id`\nWITH `t2`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of technicians and the number of machines they are assigned to repair.",
    "evidence": "",
    "idx": 3159
  },
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[repair_assignment_sub0:assigned_to_repair]->()\nRETURN `repair_assignment_sub0`.`technician_id` AS `technician_id`   } AS in_collect_0\nMATCH (`technician`:`technician`)\nWHERE NOT `technician`.`technician_id` IN in_collect_0\nRETURN `technician`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of technicians who have not been assigned to repair machines.",
    "evidence": "",
    "idx": 3161
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`entrepreneur`:`entrepreneur`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of entrepreneurs.",
    "evidence": "",
    "idx": 3164
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`entrepreneur`:`entrepreneur`)\nORDER BY `entrepreneur`.`money_requested` IS NULL ASC, `entrepreneur`.`money_requested` DESC \nRETURN `entrepreneur`.`company` AS `company`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the companies of entrepreneurs in descending order of money requested.",
    "evidence": "",
    "idx": 3165
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`entrepreneur`:`entrepreneur`)\nRETURN `entrepreneur`.`company` AS `company`, `entrepreneur`.`investor` AS `investor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the companies and the investors of entrepreneurs.",
    "evidence": "",
    "idx": 3167
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`entrepreneur`:`entrepreneur`)\nRETURN avg(`entrepreneur`.`money_requested`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the average money requested across all entrepreneurs.",
    "evidence": "",
    "idx": 3170
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`people`:`people`)\nORDER BY `people`.`weight` IS NULL DESC, `people`.`weight`  \nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of people, ordered by weight ascending.",
    "evidence": "",
    "idx": 3172
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`t1`:`entrepreneur`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of entrepreneurs.",
    "evidence": "",
    "idx": 3174
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`t1`:`entrepreneur`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t1`.`investor` <> 'Rachel Elnaugh')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of entrepreneurs whose investor is not \"Rachel Elnaugh\"?",
    "evidence": "",
    "idx": 3175
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`t1`:`entrepreneur`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t1`.`investor` <> 'Rachel Elnaugh')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of entrepreneurs do no not have the investor Rachel Elnaugh.",
    "evidence": "",
    "idx": 3176
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`people`:`people`)\nORDER BY `people`.`height` IS NULL DESC, `people`.`height`  \nRETURN `people`.`weight` AS `weight`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the weight of the shortest person.",
    "evidence": "",
    "idx": 3178
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`t1`:`entrepreneur`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nORDER BY `t2`.`weight` IS NULL ASC, `t2`.`weight` DESC \nRETURN `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name of the heaviest entrepreneur.",
    "evidence": "",
    "idx": 3180
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`t1`:`entrepreneur`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t2`.`height` > 1.85)\nRETURN sum(`t1`.`money_requested`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total money requested by entrepreneurs with height more than 1.85?",
    "evidence": "",
    "idx": 3181
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`t1`:`entrepreneur`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t2`.`height` > 1.85)\nRETURN sum(`t1`.`money_requested`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the total money requested by entrepreneurs who are taller than 1.85.",
    "evidence": "",
    "idx": 3182
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`t1`:`entrepreneur`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t1`.`investor` = 'Simon Woodroffe' OR `t1`.`investor` = 'Peter Jones')\nRETURN `t2`.`date_of_birth` AS `date_of_birth`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the dates of birth of entrepreneurs with investor \"Simon Woodroffe\" or \"Peter Jones\"?",
    "evidence": "",
    "idx": 3183
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`t1`:`entrepreneur`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nORDER BY `t1`.`money_requested` IS NULL ASC, `t1`.`money_requested` DESC \nRETURN `t2`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the weights of entrepreneurs, ordered descending by amount of money requested.",
    "evidence": "",
    "idx": 3186
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`entrepreneur`:`entrepreneur`)\nWITH `entrepreneur`.`investor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `investor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the investors who have invested in two or more entrepreneurs.",
    "evidence": "",
    "idx": 3190
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "WITH *, COLLECT { MATCH (`entrepreneur_sub0`:`entrepreneur`)\nRETURN `entrepreneur_sub0`.`people_id` AS `people_id`   } AS in_collect_0\nMATCH (`people`:`people`)\nWHERE NOT `people`.`people_id` IN in_collect_0\nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of people that are not entrepreneurs.",
    "evidence": "",
    "idx": 3193
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`entrepreneur`:`entrepreneur`)\nRETURN COUNT(DISTINCT `entrepreneur`.`company`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different companies.",
    "evidence": "",
    "idx": 3196
  },
  {
    "filename": "train_spider.json",
    "db_id": "entrepreneur",
    "gql_statement": "MATCH (`t1`:`entrepreneur`)-[is_person_0:is_person]->(`t2`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nORDER BY `t2`.`height` IS NULL ASC, `t2`.`height` DESC \nRETURN `t1`.`company` AS `company`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the company of the tallest entrepreneur.",
    "evidence": "",
    "idx": 3197
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`perpetrator`:`perpetrator`)\nORDER BY `perpetrator`.`killed` IS NULL ASC, `perpetrator`.`killed` DESC \nRETURN `perpetrator`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the date of perpetrators in descending order of the number of people killed.",
    "evidence": "",
    "idx": 3200
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`perpetrator`:`perpetrator`)\nRETURN `perpetrator`.`injured` AS `injured` ORDER BY `injured` IS NULL DESC, `injured`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the number of people injured by perpetrators in ascending order.",
    "evidence": "",
    "idx": 3201
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`perpetrator`:`perpetrator`)\nORDER BY `perpetrator`.`killed` IS NULL ASC, `perpetrator`.`killed` DESC \nRETURN `perpetrator`.`location` AS `location`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the location of the perpetrator with the largest kills.",
    "evidence": "",
    "idx": 3203
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`t2`:`perpetrator`)-[perpetrated_by_0:perpetrated_by]->(`t1`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t2`.`country` <> 'China')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of perpetrators whose country is not \"China\"?",
    "evidence": "",
    "idx": 3206
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`t2`:`perpetrator`)-[perpetrated_by_0:perpetrated_by]->(`t1`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nORDER BY `t1`.`weight` IS NULL ASC, `t1`.`weight` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the perpetrator with the biggest weight.",
    "evidence": "",
    "idx": 3207
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`t2`:`perpetrator`)-[perpetrated_by_0:perpetrated_by]->(`t1`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t1`.`height` > 1.84)\nRETURN sum(`t2`.`killed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total kills of the perpetrators with height more than 1.84.",
    "evidence": "",
    "idx": 3208
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`t2`:`perpetrator`)-[perpetrated_by_0:perpetrated_by]->(`t1`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t2`.`country` = 'China' OR `t2`.`country` = 'Japan')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of perpetrators in country \"China\" or \"Japan\"?",
    "evidence": "",
    "idx": 3209
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`perpetrator`:`perpetrator`)\nWITH `perpetrator`.`country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the countries of perpetrators? Show each country and the corresponding number of perpetrators there.",
    "evidence": "",
    "idx": 3211
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`t2`:`perpetrator`)-[perpetrated_by_0:perpetrated_by]->(`t1`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nORDER BY `t2`.`year` IS NULL ASC, `t2`.`year` DESC \nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of perpetrators in descending order of the year.",
    "evidence": "",
    "idx": 3214
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "WITH *, COLLECT { MATCH (`perpetrator_sub0`:`perpetrator`)\nRETURN `perpetrator_sub0`.`people_id` AS `people_id`   } AS in_collect_0\nMATCH (`people`:`people`)\nWHERE NOT `people`.`people_id` IN in_collect_0\nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of people that are not perpetrators.",
    "evidence": "",
    "idx": 3215
  },
  {
    "filename": "train_spider.json",
    "db_id": "perpetrator",
    "gql_statement": "MATCH (`t2`:`perpetrator`)-[perpetrated_by_0:perpetrated_by]->(`t1`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nORDER BY `t1`.`height` IS NULL ASC, `t1`.`height` DESC \nRETURN `t2`.`date` AS `date`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the date of the tallest perpetrator.",
    "evidence": "",
    "idx": 3217
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`campuses`:`campuses`)\nWHERE `campuses`.`county` = 'Los Angeles'\nRETURN `campuses`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Report the name of all campuses in Los Angeles county.",
    "evidence": "",
    "idx": 3219
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`campuses`:`campuses`)\nWHERE `campuses`.`year` = 1958\nRETURN `campuses`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the campuses opened in 1958.",
    "evidence": "",
    "idx": 3223
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`campuses`:`campuses`)\nWHERE `campuses`.`year` < 1800\nRETURN `campuses`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the campuses opened before 1800.",
    "evidence": "",
    "idx": 3225
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`campuses`:`campuses`)\nWHERE `campuses`.`location` = 'Northridge' AND `campuses`.`county` = 'Los Angeles'\nRETURN `campuses`.`campus` AS `campus`   \nUNION DISTINCT\nMATCH (`campuses`:`campuses`)\nWHERE `campuses`.`location` = 'San Francisco' AND `campuses`.`county` = 'San Francisco'\nRETURN `campuses`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the campuses that is in Northridge, Los Angeles or in San Francisco, San Francisco.",
    "evidence": "",
    "idx": 3229
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t1`:`campuses`)-[has_fee_0:has_fee]->(`t2`:`csu_fees`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t1`.`campus` = 'San Jose State University' AND `t2`.`year` = 1996)\nRETURN `t2`.`campusfee` AS `campusfee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the campus fee of \"San Jose State University\" in year 1996?",
    "evidence": "",
    "idx": 3231
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t1`:`campuses`)-[has_fee_0:has_fee]->(`t2`:`csu_fees`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t1`.`campus` = 'San Francisco State University' AND `t2`.`year` = 1996)\nRETURN `t2`.`campusfee` AS `campusfee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the campus fee of \"San Francisco State University\" in year 1996?",
    "evidence": "",
    "idx": 3233
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "CALL(*) {\nMATCH (`csu_fees_sub0`:`csu_fees`)\nRETURN avg(`csu_fees_sub0`.`campusfee`) AS `_col_0_1`  \n}\nMATCH (`csu_fees`:`csu_fees`)\nWHERE `csu_fees`.`campusfee` > `_col_0_1`\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the count of universities whose campus fee is greater than the average campus fee.",
    "evidence": "",
    "idx": 3235
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`csu_fees`:`csu_fees`)\nWHERE `csu_fees`.`year` = 1996\nRETURN avg(`csu_fees`.`campusfee`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average fee on a CSU campus in 1996",
    "evidence": "",
    "idx": 3243
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`year` >= 1998 AND `t2`.`year` <= 2002)\nWITH `t1`.`campus` AS _groupby_col_0, sum(`t2`.`degrees`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `campus`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "report the total number of degrees granted between 1998 and 2002.",
    "evidence": "",
    "idx": 3247
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`year` >= 1998 AND `t2`.`year` <= 2002)\nWITH `t1`.`campus` AS _groupby_col_0, sum(`t2`.`degrees`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `campus`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many degrees were conferred between 1998 and 2002?",
    "evidence": "",
    "idx": 3248
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t1`.`county` = 'Orange' AND `t2`.`year` >= 2000)\nWITH `t1`.`campus` AS _groupby_col_0, sum(`t2`.`degrees`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `campus`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each Orange county campus, report the number of degrees granted after 2000.",
    "evidence": "",
    "idx": 3249
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t1`.`county` = 'Orange' AND `t2`.`year` >= 2000)\nWITH `t1`.`campus` AS _groupby_col_0, sum(`t2`.`degrees`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `campus`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of degrees granted after 2000 for each Orange county campus?",
    "evidence": "",
    "idx": 3250
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`campuses`)-[has_faculty_1:has_faculty]->(`t2`:`faculty`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`year` = 2002 AND `t1`.`county` = 'Orange')\nRETURN MAX(`t2`.`faculty`) AS `_col_0`  \n}\nMATCH (`t1`:`campuses`)-[has_faculty_0:has_faculty]->(`t2`:`faculty`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`year` = 2002 AND `t2`.`faculty` > `_col_0`)\nRETURN `t1`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the campus which has more faculties in 2002 than every campus in Orange county.",
    "evidence": "",
    "idx": 3251
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`campuses`)-[has_faculty_1:has_faculty]->(`t2`:`faculty`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`year` = 2002 AND `t1`.`county` = 'Orange')\nRETURN MAX(`t2`.`faculty`) AS `_col_0`  \n}\nMATCH (`t1`:`campuses`)-[has_faculty_0:has_faculty]->(`t2`:`faculty`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`year` = 2002 AND `t2`.`faculty` > `_col_0`)\nRETURN `t1`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the campus that have more faculties in 2002 than the maximum number in Orange county?",
    "evidence": "",
    "idx": 3252
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t1`:`campuses`)-[has_enrollment_0:has_enrollment]->(`t2`:`enrollments`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`year` = 1956 AND `t2`.`totalenrollment_ay` > 400 AND `t2`.`fte_ay` > 200)\nRETURN `t1`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What campus had more than 400 total enrollment but more than 200 full time enrollment in year 1956?",
    "evidence": "",
    "idx": 3253
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t1`:`campuses`)-[has_enrollment_0:has_enrollment]->(`t2`:`enrollments`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`year` = 1956 AND `t2`.`totalenrollment_ay` > 400 AND `t2`.`fte_ay` > 200)\nRETURN `t1`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What campus started in year 1956, has more than 200 full time students, and more than 400 students enrolled?",
    "evidence": "",
    "idx": 3254
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`campuses`:`campuses`)\nWHERE `campuses`.`county` = 'Los Angeles'\nRETURN `campuses`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the campuses in Los Angeles county.",
    "evidence": "",
    "idx": 3257
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t1`.`campus` = 'San Jose State University' AND `t2`.`year` = 2000)\nRETURN `t2`.`degrees` AS `degrees`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many degrees were conferred in \"San Jose State University\" in 2000?",
    "evidence": "",
    "idx": 3259
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t1`.`campus` = 'San Jose State University' AND `t2`.`year` = 2000)\nRETURN `t2`.`degrees` AS `degrees`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many degrees were conferred at San Jose State University in 2000?",
    "evidence": "",
    "idx": 3260
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t1`.`campus` = 'San Francisco State University' AND `t2`.`year` = 2001)\nRETURN `t2`.`degrees` AS `degrees`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the degrees conferred in \"San Francisco State University\" in 2001.",
    "evidence": "",
    "idx": 3261
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t1`.`campus` = 'San Francisco State University' AND `t2`.`year` = 2001)\nRETURN `t2`.`degrees` AS `degrees`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What degrees were conferred in San Francisco State University in the year 2001?",
    "evidence": "",
    "idx": 3262
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`campuses`)-[has_faculty_0:has_faculty]->(`t1`:`faculty`)\nWHERE `t1`.`campus` = `t2`.`id`\nAND (`t1`.`year` = 2002 AND `t2`.`campus` = 'Long Beach State University')\nRETURN `t1`.`faculty` AS `faculty`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of faculty lines in campus \"Long Beach State University\" in 2002?",
    "evidence": "",
    "idx": 3265
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`campuses`)-[has_faculty_0:has_faculty]->(`t1`:`faculty`)\nWHERE `t1`.`campus` = `t2`.`id`\nAND (`t1`.`year` = 2004 AND `t2`.`campus` = 'San Francisco State University')\nRETURN `t1`.`faculty` AS `faculty`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many faculty lines are there in \"San Francisco State University\" in year 2004?",
    "evidence": "",
    "idx": 3267
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t1`:`campuses`)-[has_faculty_0:has_faculty]->(`t2`:`faculty`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`faculty` >= 600 AND `t2`.`faculty` <= 1000 AND `t1`.`year` = 2004)\nRETURN `t1`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the campus that have between 600 and 1000 faculty lines in year 2004.",
    "evidence": "",
    "idx": 3269
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t1`:`campuses`)-[has_faculty_0:has_faculty]->(`t2`:`faculty`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND (`t2`.`faculty` >= 600 AND `t2`.`faculty` <= 1000 AND `t1`.`year` = 2004)\nRETURN `t1`.`campus` AS `campus`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the campuses that had between 600 and 1000 faculty members in 2004?",
    "evidence": "",
    "idx": 3270
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t3`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)-[has_faculty_0:has_faculty]->(`t2`:`faculty`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND `t1`.`id` = `t3`.`campus` AND `t2`.`year` = `t3`.`year`\nAND (`t2`.`year` = 2001)\nORDER BY `t3`.`degrees` IS NULL DESC, `t3`.`degrees`  \nRETURN `t2`.`faculty` AS `faculty`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many faculty lines are there in the university that conferred the least number of degrees in year 2001?",
    "evidence": "",
    "idx": 3273
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t3`:`degrees`)-[awarded_by_0:awarded_by]->(`t1`:`campuses`)-[has_faculty_0:has_faculty]->(`t2`:`faculty`)\nWHERE `t1`.`id` = `t2`.`campus`\nAND `t1`.`id` = `t3`.`campus` AND `t2`.`year` = `t3`.`year`\nAND (`t2`.`year` = 2001)\nORDER BY `t3`.`degrees` IS NULL DESC, `t3`.`degrees`  \nRETURN `t2`.`faculty` AS `faculty`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many faculty members are at the university that gave the least number of degrees in 2001?",
    "evidence": "",
    "idx": 3274
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`campuses`)-[has_enrollment_0:has_enrollment]->(`t1`:`discipline_enrollments`)\nWHERE `t1`.`campus` = `t2`.`id`\nAND (`t1`.`year` = 2004 AND `t2`.`campus` = 'San Jose State University')\nRETURN sum(`t1`.`undergraduate`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many undergraduates are there in \"San Jose State University\" in year 2004?",
    "evidence": "",
    "idx": 3275
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`campuses`)-[has_enrollment_0:has_enrollment]->(`t1`:`discipline_enrollments`)\nWHERE `t1`.`campus` = `t2`.`id`\nAND (`t1`.`year` = 2004 AND `t2`.`campus` = 'San Francisco State University')\nRETURN sum(`t1`.`graduate`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of graduates in \"San Francisco State University\" in year 2004?",
    "evidence": "",
    "idx": 3277
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`campuses`)-[has_enrollment_0:has_enrollment]->(`t1`:`discipline_enrollments`)\nWHERE `t1`.`campus` = `t2`.`id`\nAND (`t1`.`year` = 2004 AND `t2`.`campus` = 'San Francisco State University')\nRETURN sum(`t1`.`graduate`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many people graduated from San Francisco State University in 2004?",
    "evidence": "",
    "idx": 3278
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`campuses`)-[has_fee_0:has_fee]->(`t1`:`csu_fees`)\nWHERE `t1`.`campus` = `t2`.`id`\nAND (`t2`.`campus` = 'San Francisco State University' AND `t1`.`year` = 2000)\nRETURN `t1`.`campusfee` AS `campusfee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the campus fee of \"San Francisco State University\" in year 2000?",
    "evidence": "",
    "idx": 3279
  },
  {
    "filename": "train_spider.json",
    "db_id": "csu_1",
    "gql_statement": "MATCH (`t2`:`campuses`)-[has_fee_0:has_fee]->(`t1`:`csu_fees`)\nWHERE `t1`.`campus` = `t2`.`id`\nAND (`t2`.`campus` = 'San Jose State University' AND `t1`.`year` = 2000)\nRETURN `t1`.`campusfee` AS `campusfee`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the campus fee of \"San Jose State University\" in year 2000.",
    "evidence": "",
    "idx": 3281
  }
]