[
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`inspections`:`inspections`)\nWHERE CASE WHEN `inspections`.`date` is not NULL THEN apoc.temporal.format(`inspections`.`date`,'yyyy') ELSE NULL END = '2014' AND `inspections`.`type` = 'Foodborne Illness Investigation'\nRETURN COUNT(`inspections`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many foodborne illness investigations were done in 2014?",
    "evidence": "foodborne illness investigations refer to inspections where type = 'Foodborne Illness Investigation'; investigations in 2014 refers to date between '2014-01-01' and '2014-12-31';",
    "idx": 6731
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "CALL (*) {\nMATCH (`businesses_sub0`:`businesses`)\nWITH `businesses_sub0`.`owner_name` AS _groupby_col_0, COUNT(`businesses_sub0`.`owner_name`) AS _groupby_col_1\nWHERE _groupby_col_1 > 5\nRETURN _groupby_col_0 AS `owner_name`  \n}\nWITH *\nRETURN COUNT(`owner_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many owners have 5 or more establishments?",
    "evidence": "5 or more establishments COUNT(business_id) > = 5;",
    "idx": 6732
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END = '2013' AND `t1`.`score` = 100)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the establishments that met all of the required standards in 2013?",
    "evidence": "establishments have the same meaning as businesses; met all of the required standards refers to score = 100; year(date) = 2013",
    "idx": 6733
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`inspections`)-[conducted_at_1:conducted_at]->(`t2_sub0`:`businesses`)\nWHERE `t1_sub0`.`business_id` = `t2_sub0`.`business_id`\nAND (`t2_sub0`.`tax_code` = 'H24' AND `t1_sub0`.`type` = 'Complaint')\nWITH `t1_sub0`.`business_id` AS _groupby_col_0, COUNT(`t1_sub0`.`business_id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 5\nRETURN _groupby_col_0 AS `business_id`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many establishments with the tax code H24 have complaint inspections of 5 or more?",
    "evidence": "establishments with the tax code H24 refer to business_id where tax_code = 'H24'; complaint inspections of 5 or more refer to inspections where type = 'Complaint' and COUNT(business_id) ≥ 5;",
    "idx": 6736
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END = '2013' AND `t1`.`description` = 'Contaminated or adulterated food')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2013, what are the names of the establishments with contaminated or adulterated food?",
    "evidence": "establishments have the same meaning as businesses; contaminated or adulterated food refers to violations where description = 'Contaminated or adulterated food'; date = '2013';",
    "idx": 6737
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nMATCH (`t3`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND `t2`.`business_id` = `t3`.`business_id`\nAND (CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END = '2015' AND `t2`.`postal_code` = '94102' AND `t3`.`score` > 90)\nRETURN COUNT(DISTINCT `t2`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the establishments with a postal code of 94102, how many establishments have a score of 90 or more in 2015?",
    "evidence": "establishment has the same meaning as business; score of 90 or more refers to score ≥ 90; year(date) = 2015;",
    "idx": 6738
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END >= '2014' AND CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END <= '2016' AND `t2`.`owner_name` = 'Yiu Tim Chan' AND `t2`.`address` = '808 Pacific Ave' AND `t2`.`city` = 'San Francisco')\nRETURN avg(`t1`.`score`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Between 2014 to 2016, what is the average inpsection score of the establishment owned by Yiu Tim Chan in 808 Pacific Ave, San Francisco?",
    "evidence": "average inspection score refers to avg(score); establishment owned by Yiu Tim Chan refers to business_id where owner_name = 'Yiu Tim Chan'; Between 2014 to 2016 refers to year(date) between 2014 and 2016; address = '808 Pacific Ave'; city = 'San Francisco';",
    "idx": 6739
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "CALL(*) {\nMATCH (`inspections_sub0`:`inspections`)\nWHERE CASE WHEN `inspections_sub0`.`date` is not NULL THEN apoc.temporal.format(`inspections_sub0`.`date`,'yyyy') ELSE NULL END = '2013'\nRETURN MAX(`inspections_sub0`.`score`) AS `_col_0_1`  \n}\nMATCH (`inspections`:`inspections`)\nWHERE CASE WHEN `inspections`.`date` is not NULL THEN apoc.temporal.format(`inspections`.`date`,'yyyy') ELSE NULL END = '2013' AND `inspections`.`score` = `_col_0_1`\nRETURN COUNT(DISTINCT `inspections`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many eateries got highest inspection in 2013?",
    "evidence": "eateries got highest inspection score in 2013 refer to business_id from inspections where score = 100 and year(date) = 2013;",
    "idx": 6740
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`inspections`:`inspections`)\nWHERE `inspections`.`type` = 'Structural Inspection' AND toString(`inspections`.`date`) =~ '(?i)(?s)2016-02.*'\nRETURN `inspections`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the eateries' IDs with structural inspection type in February 2016.",
    "evidence": "eateries' IDs refer to business_id; structural inspection type refers to inspections WHERE type = 'Structural Inspection'; in February 2016 refers to year(date) = 2016 and month(date) = 2;",
    "idx": 6741
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`violations`:`violations`)\nWHERE `violations`.`violation_type_id` = '103101'\nRETURN `violations`.`business_id` AS `business_id`, `violations`.`risk_category` AS `risk_category`, `violations`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide eateries' IDs, risk categories and descriptions with violation ID of 103101.",
    "evidence": "eateries' IDs refer to business_id; violation ID of 103101 refers to violation_type_id = '103101';",
    "idx": 6743
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)\nMATCH (`t2`:`inspections`)-[conducted_at_0:conducted_at]->(`t3`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND `t2`.`business_id` = `t3`.`business_id`\nAND (`t3`.`name` = 'ART\\'S CAFÉ' AND `t1`.`risk_category` = 'Moderate Risk')\nRETURN DISTINCT `t2`.`type` AS `type`, `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the inspection types and violation descriptions under moderate risk category for ART's CAFÉ.",
    "evidence": "ART's CAFÉ is the name of the business; moderate risk category refers to risk_category = 'Moderate Risk';",
    "idx": 6745
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`name` = 'STARBUCKS' AND `t1`.`risk_category` = 'High Risk')\nRETURN DISTINCT `t1`.`violation_type_id` AS `violation_type_id`, `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the violation type ID and description of high risk category for STARBUCKS.",
    "evidence": "STARBUCKS is the name of the business; high risk category refers to risk_category = 'High Risk';",
    "idx": 6746
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`tax_code` = 'AA')\nRETURN `t1`.`date` AS `date`, `t1`.`score` AS `score`, `t1`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the inspection dates, scores and inspection types for the eateries with tax code AA.",
    "evidence": "eateries with tax code AA refer to business_id where tax_code = 'AA';",
    "idx": 6747
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`date` = localdatetime('2016-07-30T00:00:00'))\nRETURN DISTINCT `t2`.`business_id` AS `business_id`, `t2`.`name` AS `name`, `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide eateries' IDs, names and addresses which were inspected on 30th July, 2016.",
    "evidence": "eateries' IDs inspected on 30th July, 2016 refer to business_id where business_id is not null and date = '2016-07-30';",
    "idx": 6748
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`owner_name` = 'Jade Chocolates LLC')\nRETURN `t1`.`date` AS `date`, `t1`.`risk_category` AS `risk_category`, `t1`.`description` AS `description`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the violation dates, risk categories, descriptions and names of the eateries under Jade Chocolates LLC.",
    "evidence": "eateries under Jade Chocolates LLC refer to business_id where owner_name = 'Jade Chocolates LLC';",
    "idx": 6749
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`violation_type_id` = '103111')\nRETURN `t2`.`name` AS `name`, `t1`.`risk_category` AS `risk_category`, `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names, risk categories and descriptions for the eateries with violation type ID of 103111.",
    "evidence": "eateries refer to business_id;",
    "idx": 6750
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`risk_category` = 'High Risk' AND `t1`.`date` = localdatetime('2014-06-03T00:00:00'))\nRETURN DISTINCT `t2`.`name` AS `name`, `t2`.`city` AS `city`, `t2`.`tax_code` AS `tax_code`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among violations on 3rd June, 2014, describe any 5 names, located cities and tax codes of the eateries with high risk category.",
    "evidence": "eateries with high risk category refer to business_id where risk_category = 'High Risk'; 3rd June, 2014 refers to date = '2014-06-03';",
    "idx": 6751
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`date` = localdatetime('2015-02-02T00:00:00') AND `t1`.`type` = 'Reinspection/Followup')\nRETURN `t2`.`name` AS `name`, `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the eateries' names and addresses which had reinspection on 2nd February, 2015.",
    "evidence": "eateries which had reinspection on 2nd February, 2015 refer to business_id where date = '2015-02-02' and type = 'Reinspection/Followup';",
    "idx": 6754
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`score` < 50)\nRETURN `t2`.`name` AS `name`, `t2`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names and business certificates of the eateries which got inspection score under 50.",
    "evidence": "eateries which got inspection score under 50 refer to business_id where score < 50;",
    "idx": 6755
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`businesses`:`businesses`)\nWHERE `businesses`.`owner_zip` = '94104'\nRETURN DISTINCT `businesses`.`owner_name` AS `owner_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the owner's name with a zip code 94104.",
    "evidence": "zip code 94104 refers to owner_zip = '94104';",
    "idx": 6757
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`violations`:`violations`)\nWHERE CASE WHEN `violations`.`date` is not NULL THEN apoc.temporal.format(`violations`.`date`,'yyyy') ELSE NULL END = '2014' AND `violations`.`risk_category` = 'Low Risk'\nRETURN COUNT(`violations`.`risk_category`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the violations in 2014, how many of them have a low risk category?",
    "evidence": "in 2014 refers to year(date) = 2014; risk_category = 'Low Risk';",
    "idx": 6759
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`owner_name` = 'San Francisco Madeleine, Inc.')\nRETURN DISTINCT `t2`.`business_id` AS `business_id`, `t1`.`risk_category` AS `risk_category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the business ID and risk category of the business owned by San Francisco Madeleine, Inc.",
    "evidence": "business owned by San Francisco Madeleine, Inc. refers to business_id where owner_name = 'San Francisco Madeleine, Inc.';",
    "idx": 6760
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`score` = 100)\nRETURN DISTINCT `t2`.`owner_name` AS `owner_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List owner's name of businesses with a 100 score.",
    "evidence": "owner's name of businesses refers to owner_name;",
    "idx": 6761
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nMATCH (`t3`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND `t2`.`business_id` = `t3`.`business_id`\nAND (`t3`.`score` >= 70 AND `t3`.`score` <= 80)\nRETURN DISTINCT `t1`.`violation_type_id` AS `violation_type_id`, `t1`.`risk_category` AS `risk_category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the businesses with score that ranges from 70 to 80, list their violation type ID and risk category.",
    "evidence": "businesses with score that ranges from 70 to 80 refer to business_id where score between 80 and 90;",
    "idx": 6763
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)\nMATCH (`t2`:`inspections`)-[conducted_at_0:conducted_at]->(`t3`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND `t2`.`business_id` = `t3`.`business_id`\nAND (`t3`.`name` = 'Rue Lepic')\nRETURN DISTINCT `t3`.`tax_code` AS `tax_code`, `t2`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the tax code and inspection type of the business named \"Rue Lepic\".",
    "evidence": "\"Rue Lepic\" is the name of the business;",
    "idx": 6764
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`violations`)-[committed_by_0:committed_by]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`business_id` >= 30 AND `t2`.`business_id` <= 50 AND `t2`.`address` = '747 IRVING St' AND `t2`.`city` = 'San Francisco')\nRETURN DISTINCT `t1`.`violation_type_id` AS `violation_type_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the violation type ID of business with business ID from 30 to 50 and located at 747 IRVING St, San Francisco.",
    "evidence": "business ID from 30 to 50 refers to business_id between 30 and 50; address = '747 IRVING St'; city = 'San Francisco';",
    "idx": 6768
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t1`:`inspections`)-[conducted_at_0:conducted_at]->(`t2`:`businesses`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`owner_address` = '500 California St, 2nd Floor' AND `t2`.`owner_city` = 'SAN FRANCISCO')\nORDER BY `t1`.`score` IS NULL ASC, `t1`.`score` DESC \nRETURN `t1`.`type` AS `type`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In businesses with an owner address 500 California St, 2nd Floor of Silicon Valley, list the type of inspection of the business with the highest score.",
    "evidence": "the highest score MAX(score); Silicon Valley is located in 'SAN FRANCISCO';",
    "idx": 6770
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (`t2`:`inspections`)\nMATCH (`t1`:`violations`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END = '2016' AND `t2`.`type` = 'Routine - Unscheduled')\nRETURN COUNT(`t2`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the violations in 2016, how many of them have unscheduled inspections?",
    "evidence": "unscheduled inspections refer to type = 'Routine - Unschedule'; year(date) = 2016;",
    "idx": 6771
  },
  {
    "filename": "train.json",
    "db_id": "craftbeer",
    "gql_statement": "MATCH (`t1`:`beers`)\nMATCH (`t2`:`breweries`)\nWHERE `t1`.`brewery_id` = `t2`.`id`\nAND (`t2`.`state` = 'NY')\nORDER BY `t1`.`ibu` IS NULL ASC, `t1`.`ibu` DESC \nRETURN `t2`.`name` AS `name`, `t2`.`city` AS `city`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where in New York can you locate the brewery that makes the bitterest beer? List both the brewery's name and the name of the city.",
    "evidence": "The more IBU, the more bitter the beer is, bitterest means highest IBU.",
    "idx": 6773
  },
  {
    "filename": "train.json",
    "db_id": "craftbeer",
    "gql_statement": "MATCH (`t1`:`beers`)\nMATCH (`t2`:`breweries`)\nWHERE `t1`.`brewery_id` = `t2`.`id`\nAND (`t1`.`style` = 'American Blonde Ale')\nRETURN CASE WHEN COUNT(`t1`.`id`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`state` = 'WI' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When compared to the total number of breweries in the US producing American Blonde Ale, how many in the state of Wisconsin produces American Blonde Ale? Indicate your answer in percentage (%).",
    "evidence": "Percentage of the state of Wisconsin produces American Blonde Ale could be computed by count(breweries in Wisconsin producing American Blonde Ale) / count(all breweries)",
    "idx": 6776
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t1`.`title` = 'Raspberry Chiffon Pie')\nRETURN `t2`.`total_fat` - `t2`.`sat_fat` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the unsaturated fat content in the recipe \"Raspberry Chiffon Pie\"?",
    "evidence": "Raspberry Chiffon Pie refers to title; unsaturated fat refers to SUBTRACT(total_fat, sat_fat)",
    "idx": 6778
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t2`.`sodium` < 5)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of all the recipes that are salt/sodium-free.",
    "evidence": "salt/sodium-free refers to sodium < 5",
    "idx": 6779
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t2`.`iron` > 20)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of all the recipes that may lead to constipation, feeling sick or stomach pain.",
    "evidence": "may lead to constipation, feeling sick or stomach pain refers to iron > 20",
    "idx": 6780
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t2`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t1`:`nutrition`)\nWHERE `t2`.`recipe_id` = `t1`.`recipe_id`\nRETURN DISTINCT CASE  WHEN CASE  WHEN `t2`.`title` = 'Raspberry Chiffon Pie' THEN `t1`.`vitamin_c`  END > CASE  WHEN `t2`.`title` = 'Fresh Apricot Bavarian' THEN `t1`.`vitamin_c`  END THEN 'Raspberry Chiffon Pie' ELSE 'Fresh Apricot Bavarian' END AS `vitamin_c is higher`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which recipe is more beneficial in wound healing, \"Raspberry Chiffon Pie\" or \"Fresh Apricot Bavarian\"?",
    "evidence": "Raspberry Chiffon Pie and Fresh Apricot Bavarian are title; vitamin_c is higher refers to MAX(vitamin_c)",
    "idx": 6781
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t1`.`title` = 'Raspberry Chiffon Pie')\nRETURN `t2`.`calories` AS `calories`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many calories does the recipe \"Raspberry Chiffon Pie\" contain?",
    "evidence": "Raspberry Chiffon Pie refers to title",
    "idx": 6783
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nMATCH (`t3`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND `t3`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t1`.`title` = 'Raspberry Chiffon Pie' AND `t3`.`name` = 'graham cracker crumbs')\nRETURN `t2`.`optional` AS `optional`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Is the ingredient \"graham cracker crumbs\" optional in the recipe \"Raspberry Chiffon Pie\"?",
    "evidence": "'graham cracker crumbs' is a name of an ingredient; 'Raspberry Chiffon Pie' refers to title",
    "idx": 6784
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t1`.`title` = 'Raspberry Chiffon Pie' AND `t2`.`max_qty` = `t2`.`min_qty`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many ingredients must be rationed in the recipe \"Raspberry Chiffon Pie\"?",
    "evidence": "Raspberry Chiffon Pie refers to title; ingredient must be rationed refers to max_qty = min_qty",
    "idx": 6785
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nMATCH (`t3`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND `t3`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t1`.`title` = 'Raspberry Chiffon Pie' AND `t2`.`preparation` IS NULL)\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the ingredients needed for the recipe \"Raspberry Chiffon Pie\" that do not need preprocessing.",
    "evidence": "Raspberry Chiffon Pie refers to title; do not need preprocessing refers to preparation IS NULL",
    "idx": 6786
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t1`.`name` = 'graham cracker crumbs')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many recipes include the ingredient \"graham cracker crumbs\"?",
    "evidence": "'graham cracker crumbs' is a name of an ingredient",
    "idx": 6787
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nMATCH (`t3`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND `t3`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t1`.`title` = 'Raspberry Chiffon Pie' AND `t3`.`name` = 'graham cracker crumbs')\nRETURN `t2`.`min_qty` AS `min_qty`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "At least how many cups of graham cracker crumbs does the recipe \"Raspberry Chiffon Pie\" need?",
    "evidence": "'graham cracker crumbs' is a name of an ingredient; 'Raspberry Chiffon Pie' refers to title",
    "idx": 6788
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t1`.`title` = 'Raspberry Chiffon Pie')\nRETURN `t2`.`calories` * `t2`.`pcnt_cal_fat` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many calories from fat are there in the recipe \"Raspberry Chiffon Pie\"?",
    "evidence": "calories from fat refers to MULTIPLY(calories, pcnt_cal_fat)||'%; Raspberry Chiffon Pie refers to title",
    "idx": 6789
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t1`.`source` = 'Produce for Better Health Foundation and 5 a Day')\nRETURN avg(`t2`.`calories`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many calories on average does a recipe that comes from \"Produce for Better Health Foundation and 5 a Day\" contain?",
    "evidence": "Produce for Better Health Foundation and 5 a Day is a source of recipe; calculation = DIVIDE(SUM(calories), COUNT(recipe_id))",
    "idx": 6790
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nORDER BY `t2`.`total_fat` IS NULL ASC, `t2`.`total_fat` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which recipe in the database contains the most total fat? Give its title.",
    "evidence": "the most total fat refers to MAX(total_fat)",
    "idx": 6793
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t2`.`recipe_id` = 1397 AND `t2`.`optional` = 'TRUE')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of the optional ingredient of no.1397 recipe.",
    "evidence": "no.1397 recipe refers to recipe_id = 1397; optional ingredient refers to optional = 'TRUE'",
    "idx": 6795
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nMATCH (`t3`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND `t3`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t3`.`name` = 'frozen raspberries in light syrup' AND `t2`.`max_qty` = `t2`.`min_qty`)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which recipe needs the most frozen raspberries in light syrup? State its title.",
    "evidence": "frozen raspberries in light syrup is a name of an ingredient; max_qty = min_qty",
    "idx": 6796
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nORDER BY `t2`.`vitamin_c` IS NULL ASC, `t2`.`vitamin_c` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the recipe with the most Vitamin C.",
    "evidence": "the most Vitamin C refers to MAX(vitamin_c)",
    "idx": 6799
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nMATCH (`t3`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND `t3`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t1`.`title` = 'Strawberry Sorbet')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the ingredients for Strawberry Sorbet.",
    "evidence": "Strawberry Sorbet refers to title",
    "idx": 6809
  }
]