[
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`first` = 'Lennox' AND t1.`middle` = 'Oliver' AND t1.`last` = 'Drake' AND t1.`sex` = 'Male')\nRETURN DISTINCT t2.`sub-product` AS `sub-product`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which detailed product did Mr Lennox Oliver Drake complain about?",
    "evidence": "detailed product refers to \"Sub-product\"; Mr refers to sex = 'Male';",
    "idx": 74
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`first` = 'Gunner' AND t1.`middle` = 'Omer' AND t1.`last` = 'Fuller' AND t1.`sex` = 'Male')\nRETURN t2.`sub-issue` AS `sub-issue`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the detailed issue did Mr Gunner Omer Fuller complain about?",
    "evidence": "detailed issue refers to Sub-issue; Mr refers to sex = 'Male';",
    "idx": 75
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`first` = 'Lyric' AND t1.`middle` = 'Emely' AND t1.`last` = 'Taylor' AND t1.`sex` = 'Female' AND t2.`date received` = date('2016-05-20'))\nRETURN CASE  WHEN t2.`consumer consent provided?` IN [NULL, 'N/A', ''] THEN 'No' ELSE 'Yes' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Did Ms. Lyric Emely Taylor provide the consent for result of the complaint call on 2016/5/20?",
    "evidence": "Ms refers to sex = 'Female'; \"Consumer consent provided?\" in (null, 'N/A', 'Empty') means that the company didn't get the permission of consent; \"Consumer consent provided?\" not in (null, 'N/A', 'Empty') means the customers provide the consent; on 2016/5/20 refers to Date received = '2016-05-20';",
    "idx": 76
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`reviews`)-[from_district_0:`from_district`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`city` = 'Jacksonville' AND t1.`date` = date('2017-07-22'))\nRETURN t1.`reviews` AS `reviews`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the review context from Jacksonville on 2017/7/22?",
    "evidence": "Jacksonville refers to city = 'Jacksonville'; on 2017/7/22 refers to Date = '2017-07-22';",
    "idx": 78
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`reviews`)-[from_district_0:`from_district`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`city` = 'Indianapolis' AND t1.`date` = date('2016-10-07'))\nRETURN t1.`product` AS `product_`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which product received a review from Indianapolis on 2016/10/7?",
    "evidence": "Indianapolis refers to state = 'Indianapolis'; on 2016/10/7 refers to Date = '2013-04-04';",
    "idx": 79
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`reviews`)-[from_district_0:`from_district`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t1.`product` = 'Eagle Capital' AND t2.`city` = 'Little Rock' AND t1.`date` = date('2013-04-04'))\nRETURN COUNT(t1.`stars`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stars did \"Eagle Capital\" received from Little Rock on 2013/4/4?",
    "evidence": "Eagle Capital refers to Product = 'Eagle Capital'; Little Rock is a city; on 2013/4/4 refers to Date = '2013-04-04';",
    "idx": 80
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`complaint id` = 'CR0217298')\nRETURN t1.`month` AS `month`, t1.`day` AS `day`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the client who made the complaint call \"CR0217298\", what was his/her birthday？",
    "evidence": "complaint call refers to Complaint ID; birthday = year, month, day;",
    "idx": 81
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`date received` = date('2017-03-27'))\nRETURN cast (sum(CASE  WHEN t1.`sex` = 'Female' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`sex`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For all the complaint callers on 2017/3/27, what percentage of the clients are females?",
    "evidence": "on 2017/3/27 refers to \"Date received\" = '2017-03-27'; percentage = MULTIPLY(DIVIDE(SUM(sex = 'Female' ), COUNT(client_id)), 1.0); females refers to sex = 'Female';",
    "idx": 83
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`sex` = 'Male' AND t1.`first` = 'Mason' AND t1.`middle` = 'Javen' AND t1.`last` = 'Lopez')\nRETURN cast (sum(CASE  WHEN t2.`consumer consent provided?` = 'Consent provided' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`consumer consent provided?`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of the complaint calls from Mr Mason Javen Lopez has got the consent provided by the customer?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(\"Consumer consent provided?\" = 'Consent provided'), COUNT(client_id)), 1.0); Mr refers to sex = 'Male'; consent provided by the customer refers to \"Consumer consent provided?\" = 'Consent provided';",
    "idx": 84
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t1@`client`)\nWHERE t1.`client_id` = t2.`rand client`\nAND (t2.`outcome` = 'HANG')\nRETURN t1.`email` AS `email`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the email id of clients whose calls were hung?",
    "evidence": "email id refers to email; calls were hung refers to outcome = 'Hang';",
    "idx": 88
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[located_in_0:`located_in`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t1.`age` >= 12 AND t1.`age` <= 20 AND t2.`division` = 'Mountain')\nRETURN COUNT(t1.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the calls from the mountain division, how many are from teenage clients?",
    "evidence": "teenage refers to age BETWEEN 12 AND 20;",
    "idx": 92
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`sex` = 'Female' AND t2.`product` = 'Credit card')\nRETURN COUNT(t1.`sex`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of complaints related to Credit cards came from female clients?",
    "evidence": "Credit cards refers to Product = 'Credit card'; female refers to sex = 'female';",
    "idx": 93
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nRETURN cast (sum(CASE  WHEN t2.`consumer disputed?` = 'Yes' AND t1.`city` = 'Houston' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`client_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of consumers from Houston disputed complaints?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(\"Consumer disputed?\" = 'Yes' AND city = 'Houston'), COUNT(client_id)), 1.0); Houston refers to city = 'Houston';",
    "idx": 95
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t2@`client`)-[located_in_0:`located_in`]->(t3@`district`)-[in_state_0:`in_state`]->(t4@`state`)\nWHERE t1.`rand client` = t2.`client_id`\nAND t2.`district_id` = t3.`district_id`\nAND t3.`state_abbrev` = t4.`statecode`\nAND (t4.`state` = 'California')\nRETURN cast (sum(CASE  WHEN t1.`priority` = 1 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`priority`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the calls from California, what percentage are priority 1?",
    "evidence": "California refers to state = 'California'; percentage = MULTIPLY(DIVIDE(SUM(priority = 1), COUNT(\"Complaint ID\"), 1.0));",
    "idx": 97
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (client@`client`)\nWHERE NOT like(client.`email`,'%@gmail.com')\nRETURN COUNT(client.`email`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many clients have an email account other than gmail.com?",
    "evidence": "email account other than gmail.com refers to email not like '%@gmail.com';",
    "idx": 100
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (callcenterlogs@`callcenterlogs`)\nWHERE callcenterlogs.`outcome` <> 'AGENT'\nRETURN COUNT(callcenterlogs.`outcome`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many complaints are not in process with an agent?",
    "evidence": "not in process with an agent refers to outcome ! = 'AGENT';",
    "idx": 103
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH ()-[t2:`filed_complaint`]->(t1@`callcenterlogs`)\nWHERE t1.`complaint id` = t2.`complaint id`\nAND (t2.`product` = 'Credit card' AND t1.`server` = 'SHARON')\nRETURN COUNT(t1.`complaint id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Credit Card complaints did Sharon handle?",
    "evidence": "Credit Card refers to Product = 'Credit Card'; Sharon refers to server = 'SHARON';",
    "idx": 104
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`client`)-[t1:`filed_complaint`]->()\nMATCH (t2@`client`)-[located_in_0:`located_in`]->(t3@`district`)\nWHERE t1.`client_id` = t2.`client_id`\nAND t2.`district_id` = t3.`district_id`\nAND (t1.`issue` = 'Billing disputes' AND t3.`division` = 'Mountain')\nRETURN COUNT(t1.`issue`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cases of billing dispute issues occurred in the Mountain division?",
    "evidence": "billing dispute refers to issue = 'Billing disputes';",
    "idx": 105
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t3@`client`)-[located_in_0:`located_in`]->(t2@`district`)-[in_state_0:`in_state`]->(t1@`state`)\nWHERE t1.`statecode` = t2.`state_abbrev`\nAND t2.`district_id` = t3.`district_id`\nAND (t1.`state` = 'Massachusetts' AND t3.`sex` = 'Male')\nRETURN COUNT(t3.`sex`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many male clients are from the state of Massachusetts?",
    "evidence": "male refers to sex = 'Male';",
    "idx": 106
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`client`)\nMATCH (t1@`reviews`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t1.`product` = 'Eagle National Mortgage' AND t1.`stars` = 1 AND t2.`age` < 35)\nRETURN COUNT(t2.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many clients under the age of 35 gave Eagle National Mortgage 1 star?",
    "evidence": "age < 35; Eagle National Mortgage refers to Product = 'Eagle National Mortgage';",
    "idx": 108
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t1@`client`)\nWHERE t1.`client_id` = t2.`rand client`\nAND (t1.`sex` = 'Male' AND t2.`priority` = 0 AND t1.`year` = 1997)\nRETURN COUNT(t1.`sex`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many male clients born in the year 1977 were given priority 0 in their complaints?",
    "evidence": "male refers to sex = 'Male';",
    "idx": 109
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH ()-[t3:`filed_complaint`]->(t1@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t2@`client`)\nWHERE t1.`rand client` = t2.`client_id`\nAND t1.`complaint id` = t3.`complaint id`\nAND (t2.`sex` = 'Female' AND t1.`ser_start` >= '15:00:01' AND t1.`ser_start` <= '23:59:59' AND t3.`timely response?` = 'Yes')\nRETURN COUNT(t1.`complaint id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many complaints made by women and served after 3 pm received a timely response from the company?",
    "evidence": "women refers to sex = 'Female'; served after 3 pm refers to ser_time BETWEEN '15:00:01' AND '23:59:59'; received a timely response refers to \"Timely response?\" = 'Yes';",
    "idx": 111
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH ()-[t2:`filed_complaint`]->(t1@`callcenterlogs`)\nWHERE t1.`complaint id` = t2.`complaint id`\nAND (t1.`ser_time` < '00:05:00' AND t1.`server` = 'DORIT' AND t2.`submitted via` = 'Phone' AND t2.`company response to consumer` = 'Closed with explanation')\nRETURN COUNT(t1.`complaint id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many complaints were served in 5 minutes or less by DORIT and responded to the customer with an explanation, were made by phone?",
    "evidence": "served in 5 minutes or less refers to ser_time < '00:05:00'; DORIT refers to server = 'DORIT'; responded with an explanation refers to \"Company response to consumer\" = 'Closed with explanation'; made by refers to \"Submitted via\";",
    "idx": 112
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`client`)-[located_in_0:`located_in`]->(t1@`district`)-[in_state_0:`in_state`]->(t3@`state`)\nWHERE t1.`district_id` = t2.`district_id`\nAND t1.`state_abbrev` = t3.`statecode`\nAND (t2.`last` = 'Alvarado' AND t2.`state` = 'MD')\nRETURN COUNT(t2.`client_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many clients with the last name Alvarado are from Maryland?",
    "evidence": "The abbreviation of Maryland is 'MD';",
    "idx": 113
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`client`)\nMATCH (t1@`reviews`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`age` >= 30 AND t2.`age` <= 50 AND like(t1.`reviews`,'%great%'))\nRETURN COUNT(t1.`reviews`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many reviews by people between 30 and 50 years include the word 'great'?",
    "evidence": "between 30 and 50 years refers to age BETWEEN 30 AND 50; include the word great refers to Review like '%Great%';",
    "idx": 114
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`timely response?` = 'Yes' AND t2.`consumer disputed?` = 'Yes')\nRETURN t1.`address_1` AS `address_1`, t1.`address_2` AS `address_2`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full address of the customers who, having received a timely response from the company, have dispute about that response?",
    "evidence": "full address = address_1, address_2; received a timely response refers to Timely response? = 'Yes'; have dispute refers to \"Consumer disputed?\" = 'Yes';",
    "idx": 115
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`sex` = 'Female' AND t1.`year` = 2000 AND t2.`submitted via` <> 'Web')\nRETURN COUNT(t2.`submitted via`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many complaints from female clients born in the year 2000 were not sent through the web?",
    "evidence": "female refers to sex = 'Female'; sent through refers to \"Submitted via\"; not sent through web refers to \"Submitted via\" ! = 'Web';\n",
    "idx": 116
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t1@`client`)\nWHERE t1.`client_id` = t2.`rand client`\nAND ((like(cast (t2.`date received` as string),'2017-02%') OR like(cast (t2.`date received` as string),'2017-01%')) AND like(t1.`email`,'%@gmail.com'))\nRETURN COUNT(t1.`email`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many complaints from customers with a gmail.com email were received by the company in February 2017?",
    "evidence": "gmail.com email refers to email like '%gmail.com'; in February 2017 refers to \"Date received\" BETWEEN '2017-01-02' AND '2017-02-28';",
    "idx": 118
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t3@`reviews`)-[from_district_0:`from_district`]->(t2@`district`)-[in_state_0:`in_state`]->(t1@`state`)\nWHERE t1.`statecode` = t2.`state_abbrev`\nAND t2.`district_id` = t3.`district_id`\nAND (t1.`state` = 'Oregon')\nRETURN cast (sum(t3.`stars`) as float) / COUNT(t3.`stars`) AS `average`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of stars given by Oregon clients in their reviews?",
    "evidence": "average = DIVIDE(SUM(State = 'Oregon'), COUNT(district_id)); Oregon refers to state = 'Oregon';",
    "idx": 119
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`submitted via` = 'Postal mail')\nRETURN cast (sum(CASE  WHEN t1.`age` > 50 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`submitted via`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of clients who sent their complaints by postal mail are age 50 and older?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(\"Submitted via\" = 'Postal mail'), COUNT(client_id)), 1.0); sent their complaints by refers to \"Submitted via\"; age > 50;",
    "idx": 120
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[located_in_0:`located_in`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`city` = 'Norwalk')\nRETURN cast (sum(t1.`age`) as float) / COUNT(t1.`age`) AS `average`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average age of Norwalk clients?",
    "evidence": "average age = AVG(age); Norwalk refers to city = 'Norwalk';",
    "idx": 121
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`reviews`)-[from_district_0:`from_district`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t2.`city` = 'Kansas City' AND t1.`stars` = 1)\nRETURN COUNT(t1.`stars`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many clients who live in Kansas City provided a 1-star review?",
    "evidence": "1-star review refers stars = 1;",
    "idx": 122
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[located_in_0:`located_in`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t1.`first` = 'Noah' AND t1.`last` = 'Thompson')\nRETURN t2.`division` AS `division`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which region does Noah Thompson live in?",
    "evidence": "",
    "idx": 123
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`first` = 'Kyran' AND t1.`last` = 'Muller')\nRETURN DISTINCT t2.`submitted via` AS `submitted via`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How did Kyran Muller submit his complaint?",
    "evidence": "how it was submitted refers to \"Submitted via\";",
    "idx": 124
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`year` > 2005)\nRETURN DISTINCT t2.`product` AS `product_`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the products that people who were born after 2005 complain about?",
    "evidence": "year > 2005;",
    "idx": 125
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`client`)-[t1:`filed_complaint`]->(t3@`callcenterlogs`)\nWHERE t1.`client_id` = t2.`client_id`\nAND t1.`complaint id` = t3.`complaint id`\nAND (t2.`first` = 'Kendall' AND t2.`last` = 'Allen' AND t2.`sex` = 'Female' AND t1.`product` = 'Credit card')\nRETURN t3.`ser_time` AS `ser_time`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How long was Kendall Allen's complaint about her credit card?",
    "evidence": "how long refers to ser_time; credit card refers to Product = 'Credit Card';",
    "idx": 126
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`city` = 'New York City' AND t2.`submitted via` = 'Fax')\nRETURN COUNT(t1.`client_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many clients who live in New York City submitted their complaints via fax?",
    "evidence": "submitted complaints via fax refers to \"Submitted via\" = 'Fax';",
    "idx": 127
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`product` = 'Credit card')\nRETURN cast (sum(CASE  WHEN t1.`sex` = 'Male' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`sex`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of male clients complaining about their credit cards?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(sex = 'Male'), COUNT(client_id)), 1.0); male refers to sex = 'Male'; credit cards refers to Product = 'Credit card';",
    "idx": 128
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (client@`client`)\nORDER BY client.`year` DESC NULLS LAST,client.`month` DESC NULLS LAST,client.`day` DESC NULLS LAST \nRETURN client.`day` AS `day`, client.`month` AS `month`, client.`year` AS `year` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the birth date of the youngest client?",
    "evidence": "birth date refers to year, month, day; youngest client refers to max(year, month, day)",
    "idx": 130
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH ()-[events:`filed_complaint`]->()\nWHERE events.`timely response?` = 'No' AND events.`consumer disputed?` = 'No'\nRETURN COUNT(events.`timely response?`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times does the consumer have no dispute over a non-timely response from the company?",
    "evidence": "no dispute refers to Consumer disputed? = 'No'; non-timely response refers to Timely response? = 'No'",
    "idx": 131
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`date received` = date('2012-03-14') AND t2.`submitted via` = 'Postal mail')\nRETURN t1.`address_1` AS `address_1`, t1.`address_2` AS `address_2`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the address of the client who made a complaint via postal mail on March 14, 2012?",
    "evidence": "address refers to address_1, address_2; via postal mail refers to Submitted via = 'Postal mail'; March 14 2012 refers to Date received = '2012-03-14'",
    "idx": 133
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t1@`client`)\nWHERE t1.`client_id` = t2.`rand client`\nAND (t1.`sex` = 'Female' AND t2.`priority` = 1)\nRETURN COUNT(t1.`client_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the female clients, how many of them have a complaint with a priority of 1?",
    "evidence": "female refers to sex = 'Female'",
    "idx": 134
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nRETURN cast (sum(CASE  WHEN t1.`age` > 65 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of complaints are from the elderly?",
    "evidence": "elder refers to age < = 65; percentage refers to divide(sum(age < = 65) , count(client_id)) * 100%",
    "idx": 139
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (client@`client`)\nWHERE client.`age` >= 13 AND client.`age` <= 19\nRETURN CASE  WHEN sum(CASE  WHEN like(client.`email`,'%@gmail.com') THEN 1 ELSE 0 END) > sum(CASE  WHEN like(client.`email`,'%@outlook.com') THEN 1 ELSE 0 END) THEN 'Google account' ELSE 'Microsoft account' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the teenager clients who use Google account and Microsoft account, which group of client is more than the other?",
    "evidence": "teenager refers to 13 < age < = 19; Google account refers to email like '%@gmail.com'; Microsoft account refers to email like '%@outlook.com'",
    "idx": 141
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (client@`client`)\nWHERE client.`email` = 'emily.garcia43@outlook.com'\nRETURN client.`first` AS `first`, client.`middle` AS `middle`, client.`last` AS `last`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of client whose email address is emily.garcia43@outlook.com?",
    "evidence": "full name refers to first middle last",
    "idx": 142
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "CALL {\nMATCH (callcenterlogs_sub0@`callcenterlogs`)\nRETURN MAX(callcenterlogs_sub0.`priority`) AS `_col_0` \n}\nMATCH (t2@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t1@`client`)\nWHERE t1.`client_id` = t2.`rand client`\nAND (t2.`priority` = _col_0)\nRETURN t1.`first` AS `first`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the first name of clients who have the highest priority?",
    "evidence": "first name refers to first; highest priority refers to priority = 2",
    "idx": 143
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t1@`client`)\nWHERE t1.`client_id` = t2.`rand client`\nAND (t1.`age` > 65 AND t2.`server` = 'YIFAT')\nRETURN t1.`last` AS `last`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the elderlies, state the last name of whose complaint is handled in server YIFAT?",
    "evidence": "elder refers to age < = 65; last name refers to last",
    "idx": 145
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t1@`client`)\nWHERE t1.`client_id` = t2.`rand client`\nAND (t1.`year` = 1931)\nRETURN t2.`complaint id` AS `complaint id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the complaint id of client who were born in 1931?",
    "evidence": "in 1931 refers to year = 1931",
    "idx": 148
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`first` = 'Alexander' AND t1.`middle` = 'Bronx' AND t1.`last` = 'Lewis')\nRETURN DISTINCT t2.`product` AS `product_`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the product complained by Alexander Bronx Lewis?",
    "evidence": "",
    "idx": 152
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`age` > 65)\nORDER BY t1.`client_id` DESC NULLS LAST \nRETURN t2.`product` AS `product_` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which product received the most complaints from elder clients?",
    "evidence": "most complaints refers to max(client_id); elder client refers to age > 65",
    "idx": 154
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`product` = 'Credit card')\nRETURN sum(CASE  WHEN t1.`age` > 13 AND t1.`age` <= 19 THEN 1 ELSE 0 END) AS `_col_0`, sum(CASE  WHEN t1.`age` > 19 AND t1.`age` <= 65 THEN 1 ELSE 0 END) AS `adult`, sum(CASE  WHEN t1.`age` > 65 THEN 1 ELSE 0 END) AS `elder`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Complaint about Credit Card mostly came from clients of which age group?",
    "evidence": "about Credit Card refers to Product = 'Credit Card'; teenager refers to 13 < age < = 19; adult refers to 19 < age < = 65; elder refers to age < = 65",
    "idx": 155
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`issue` = 'Balance transfer')\nRETURN t1.`first` AS `first`, t1.`middle` AS `middle`, t1.`last` AS `last`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of clients who have issue about balance transfer?",
    "evidence": "full name refers to first, middle, last; issue about balance transfer refers to Issue = 'Balance transfer'",
    "idx": 157
  }
]