[
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advises`]->(t2@`student`)\nWHERE t1.`student_id` = t2.`student_id`\nAND (t2.`email` = 'grosellg@hku.hk')\nRETURN t1.`salary` AS `salary`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the salary range of the student with an email of grosellg@hku.hk?",
    "evidence": "salary range refers to salary;",
    "idx": 626
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`takes`]->(t3@`course`)\nWHERE t1.`student_id` = t2.`student_id`\nAND t2.`course_id` = t3.`course_id`\nAND (t3.`name` = 'Statistical learning' AND t2.`sat` = 4 AND t1.`gpa` = 3.8)\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among students that gave satisfaction of value 4 for the course named \"Statistical Learning\", how many of them have a gpa of 3.8?",
    "evidence": "satisfaction refers to sat;\n\nsat = 4; gpa = 3.8 ",
    "idx": 627
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`takes`]->(t3@`course`)\nWHERE t1.`student_id` = t2.`student_id`\nAND t2.`course_id` = t3.`course_id`\nAND (t3.`diff` = 3 AND t1.`intelligence` = 2)\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among courses with difficulty of 3, how many students have intellegence level of 2?",
    "evidence": "difficulty of 3 refers to diff = 3; intelligence = 2",
    "idx": 628
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advises`]->(t2@`student`)\nWHERE t1.`student_id` = t2.`student_id`\nAND (t1.`capability` < 3)\nRETURN sum(CASE  WHEN t2.`type` = 'UG' THEN 1 ELSE 0 END) - sum(CASE  WHEN t2.`type` = 'RPG' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students with a capability below 3, what is the difference of undergraduate students from research postgraduate students?",
    "evidence": "capability < 3; difference = subtract(count(type = 'UG')), (count(type = 'RPG')); undergraduate students refers to type = 'UG'; research postgraduate students refers to type = 'RPG';",
    "idx": 631
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH ()-[taughtby:`taught_by`]->()\nWHERE taughtby.`course_id` = 18\nRETURN COUNT(DISTINCT taughtby.`p_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many professors are teaching course ID 18?",
    "evidence": "professors refers to taughtBy.p_id; course ID 18 refers to taughtBy.course_id",
    "idx": 632
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (course@`course`)\nWHERE course.`courselevel` = 'Level_300'\nRETURN COUNT(course.`course_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many courses are there for basic or medium undergraduate courses?",
    "evidence": "basic or medium undergraduate courses refers to courseLevel = 'Level_300'; courses refers to course.course_id",
    "idx": 634
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t1@`advisedby`)\nMATCH ()-[t3:`taught_by`]->(t2@`person`)\nWHERE t1.`p_id` = t2.`p_id`\nAND t2.`p_id` = t3.`p_id`\nAND (t1.`p_id` = 141)\nRETURN t3.`course_id` AS `course_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the courses taught by the advisors who gave advice to student with ID 376?",
    "evidence": "courses refers to course_id; advisors refers to p_id_dummy and taughtBy.p_id; student with ID 376 refers to advisedBy.p_id = 376",
    "idx": 637
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t1@`course`)-[t2:`taught_by`]->()\nWHERE t1.`course_id` = t2.`course_id`\nAND (t2.`p_id` = 297)\nRETURN t1.`courselevel` AS `courselevel`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which level of courses is taught by professor ID 297?",
    "evidence": "professor ID 297 refers to taughtBy.p_id = 297",
    "idx": 639
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t2@`person`)\nMATCH (t1@`advisedby`)\nWHERE t1.`p_id` = t2.`p_id`\nAND (t2.`yearsinprogram` = 'Year_12')\nRETURN t1.`p_id_dummy` AS `p_id_dummy`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who are the professors who gave advice to students in the 12th years of program?",
    "evidence": "professors refers to p_id_dummy; 12th years of program refers to yearsInProgram = 'Year_12'",
    "idx": 645
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (course@`course`)\nWHERE course.`courselevel` = 'Level_300'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many basic and medium undergraduate courses are there?",
    "evidence": "basic and medium undergraduate courses refers to courseLevel = 'Level_300' and courses refers to course.course_id",
    "idx": 646
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH ()-[taughtby:`taught_by`]->()\nWHERE taughtby.`course_id` = 11\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many people teaches course no.11?",
    "evidence": "people refers to taughtBy.p_id; course no.11 refers to course_id = 11",
    "idx": 647
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (person@`person`)\nWHERE person.`hasposition` = 'Faculty_eme'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many teachers are faculty employees?",
    "evidence": "teachers refers to professor = 1; faculty employees refers to hasPosition = 'Faculty_eme'",
    "idx": 648
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t1@`course`)-[t2:`taught_by`]->(t3@`person`)\nWHERE t1.`course_id` = t2.`course_id`\nAND t3.`p_id` = t2.`p_id`\nAND (t1.`courselevel` = 'Level_300' AND t3.`professor` = 1)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many basic or medium undergraduate courses are taught by a professor?",
    "evidence": "basic or medium undergraduate courses refers to courseLevel = 'Level_300'; professor refers to professor = 1",
    "idx": 649
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH ()-[t1:`taught_by`]->(t2@`person`)\nWHERE t1.`p_id` = t2.`p_id`\nAND (t1.`course_id` = 9)\nRETURN t2.`hasposition` AS `hasposition`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Is the teacher who teaches course no.9 a faculty member?",
    "evidence": "teacher refers to taughtBy.p_id; course no.9 refers to taughtBy.course_id = 9; faculty member refers to hasPosition ! = 0",
    "idx": 651
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t4@`advisedby`)\nMATCH (t3@`course`)-[t2:`taught_by`]->(t1@`person`)\nWHERE t1.`p_id` = t2.`p_id`\nAND t3.`course_id` = t2.`course_id`\nAND t4.`p_id` = t1.`p_id`\nAND (t1.`professor` = 1 AND t3.`courselevel` = 'Level_300')\nRETURN COUNT(DISTINCT t4.`p_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are advised to teach by a professor teaching basic or medium undergraduate courses?",
    "evidence": "students refers to advisedBy.p_id; professor refers to p_id_dummy and taughtBy.p_id and professor = 1; basic or medium undergraduate courses refers to courseLevel = 'Level_300'",
    "idx": 654
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t1@`course`)-[t2:`taught_by`]->(t3@`person`)\nWHERE t1.`course_id` = t2.`course_id`\nAND t2.`p_id` = t3.`p_id`\nAND (t3.`professor` = 1 AND t1.`courselevel` = 'Level_300')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the courses that are basic or medium undergraduate courses, how many of them are taught by a faculty member?",
    "evidence": "courses that are basic or medium undergraduate courses refers to courseLevel = 'Level_300'; faculty member refers to hasPosition ! = 0",
    "idx": 655
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t2@`person`)\nMATCH (t1@`advisedby`)\nWHERE t1.`p_id` = t2.`p_id`\nAND (t2.`yearsinprogram` = 'Year_3')\nRETURN COUNT(DISTINCT t1.`p_id_dummy`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In total, all the students in the 3rd year of their program are advised by how many professors?",
    "evidence": "3rd year of their program refers to yearsInProgram = 'Year_3'; professors refers to p_id_dummy",
    "idx": 657
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH ()-[t1:`taught_by`]->(t2@`person`)\nWHERE t1.`p_id` = t2.`p_id`\nAND (t2.`professor` = 1)\nRETURN cast (COUNT(t1.`course_id`) as float) / COUNT(DISTINCT t2.`p_id`) AS `num`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of courses taught by a professor?",
    "evidence": "professor refers to professor = 1; average number of courses = divide(count(taughtBy.course_id), count(taughtBy.p_id) where professor = 1 )",
    "idx": 658
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (person@`person`)\nRETURN cast (sum(CASE  WHEN person.`professor` = 1 THEN 1 ELSE 0 END) as float) * 100 / sum(CASE  WHEN person.`student` = 1 THEN 1 ELSE 0 END) AS `per`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio of professors and students?",
    "evidence": "professors refers to professor = 1; students refers to student = 1; ratio = divide(count(person.p_id) when professor = 1, count(person.p_id) when student = 1)",
    "idx": 659
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (advisedby@`advisedby`)\nWHERE advisedby.`p_id_dummy` = 415\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are under advisor 415?",
    "evidence": "advisor 415 refers to p_id_dummy = 415",
    "idx": 672
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (course@`course`)\nWHERE course.`courselevel` = 'Level_500'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many professional or master/graduate courses are there?",
    "evidence": "professional or master/graduate courses refers to courseLevel = 'Level_500'",
    "idx": 673
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (person@`person`)\nWHERE person.`hasposition` = '0' AND person.`inphase` = '0'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many non-faculty members are not undergoing the phase of qualifications?",
    "evidence": "non-faculty members refers to hasPosition = 0; are not undergoing the phase of qualifications refers to inPhase = 0",
    "idx": 674
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t2@`person`)\nMATCH (t1@`advisedby`)\nWHERE t1.`p_id` = t2.`p_id`\nAND (t1.`p_id_dummy` = 5 AND t2.`student` = 1 AND t2.`yearsinprogram` = 'Year_5')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students being advised by Advisor 5, how many students are in the 5th year?",
    "evidence": "Advisor 5 refers to p_id_dummy = 5; are in the 5th year refers to yearsInProgram = 'Year_5'",
    "idx": 675
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t3@`course`)-[t2:`taught_by`]->(t1@`person`)\nWHERE t1.`p_id` = t2.`p_id`\nAND t3.`course_id` = t2.`course_id`\nAND (t1.`hasposition` = 'Faculty_aff' AND t1.`professor` = 1 AND t3.`courselevel` = 'Level_500')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the faculty affiliated professor, how many professors teaches professional or master/undergraduate courses?",
    "evidence": "faculty affiliated professor refers to professor = 1 and hasPosition = 'Faculty_aff'; professional or master/undergraduate courses refers to courseLevel = 'Level_500'",
    "idx": 676
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t2@`person`)\nMATCH (t1@`advisedby`)\nWHERE t1.`p_id` = t2.`p_id`\nAND (t2.`yearsinprogram` = 'Year_1' AND t2.`student` = 1)\nRETURN COUNT(t1.`p_id_dummy`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many advisors are in charge of advising all the students in 1st year?",
    "evidence": "advisors refers to p_id_dummy; students in 1st year refers to student = 1 and yearsInProgram = 'Year_1'",
    "idx": 677
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t1@`course`)-[t2:`taught_by`]->()\nWHERE t1.`course_id` = t2.`course_id`\nAND (t1.`courselevel` = 'Level_300')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many professors teaches basic or medium undergraduate courses?",
    "evidence": "professors refers to taughtBy.p_id; basic or medium undergraduate courses refers to couresLevel = 'Level_300'",
    "idx": 679
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t2@`person`)\nMATCH (t1@`advisedby`)\nWHERE t1.`p_id` = t2.`p_id`\nAND (t2.`inphase` = 'Pre_Quals' AND t2.`student` = 1)\nRETURN COUNT(t1.`p_id_dummy`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students that are undergoing the pre-phase of qualification have advisors?",
    "evidence": "students refers to student = 1 and ; undergoing the phase of pre-qualification refers to inPhase = 'Pre-Quals'; have advisors refers to advisedBy.p_id",
    "idx": 680
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (t1@`course`)-[t2:`taught_by`]->()\nWHERE t1.`course_id` = t2.`course_id`\nAND (t1.`courselevel` = 'Level_500')\nRETURN cast (COUNT(t1.`course_id`) as float) / COUNT(DISTINCT t2.`p_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of professional or master/undergraduate courses being taught by each professor?",
    "evidence": "professional or master/undergraduate courses refers to courseLevel = 'Level_500'; average number = divide(count(taughtBy.course_id), count(taughtBy.p_id))",
    "idx": 681
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (person@`person`)\nWHERE person.`yearsinprogram` = 'Year_1' OR person.`yearsinprogram` = 'Year_2'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the sum of year 1 and year 2 students?",
    "evidence": "year 1 and year 2 students refers to yearsInProgram = 'Year_1' and yearsInProgram = 'Year_2' and student = 1",
    "idx": 683
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH ()-[t2:`taught_by`]->(t1@`person`)\nWHERE t1.`p_id` = t2.`p_id`\nAND (t1.`professor` = 1 AND t1.`hasposition` <> '0')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many courses were taught by a professor who is currently the member of faculty?",
    "evidence": "professor refers to professor = 1;  member of faculty refers to hasPosition <> 0",
    "idx": 684
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH ()-[t2:`taught_by`]->(t1@`person`)\nWHERE t1.`p_id` = t2.`p_id`\nAND (t1.`professor` = 1 AND t1.`hasposition` = '0')\nRETURN DISTINCT t2.`course_id` AS `course_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which courses were taught by a professor who is not a faculty member?",
    "evidence": "courses refers to taughtBy.course_id; professor refers to professor = 1; is not a faculty member refers to hasPosition = 0",
    "idx": 685
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`episode`)-[has_keyword_0:`has_keyword`]->(t2@`keyword`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t1.`season` = 9 AND t1.`episode` = 23)\nRETURN COUNT(t2.`keyword`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many keywords are there for season 9, episode 23 of law_and_order?",
    "evidence": "",
    "idx": 687
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`episode`)-[has_vote_0:`has_vote`]->(t2@`vote`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t2.`stars` = 10)\nORDER BY t2.`votes` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the episode that got the most 10-star votes?",
    "evidence": "the most refers to max(votes); 10-star refers to stars = 10",
    "idx": 692
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t2:`worked_on`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t1.`title` = 'Cherished' AND t2.`credited` = 'false')\nRETURN COUNT(t1.`episode_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many people had filled a role in the episode titled \"Cherished\", but did not show up in the on-screen credits?",
    "evidence": "titled \"Cherished\" refers to title = 'Cherished'; did not show up in the on-screen credits refers to credited = ''",
    "idx": 694
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t3@`person`)-[t2:`worked_on`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND t3.`person_id` = t2.`person_id`\nAND (t2.`credited` = 'true' AND t3.`name` = 'Park Dietz')\nRETURN COUNT(t3.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For how many times was Park Dietz credited?",
    "evidence": "credited refers to credited = 'true'",
    "idx": 696
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t2.`name` = 'Anthony Azzara' AND t1.`episode_id` = 'tt0629204')\nRETURN t1.`credited` AS `credited`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Was Anthony Azzara's role in episode tt0629204 displayed in the credits at the end of the episode?",
    "evidence": "episode tt0629204 refers to episode_id = 'tt0629204'; credited refers to credited = 'true'; not credited refers to credited = ''",
    "idx": 698
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`episode`)-[has_keyword_0:`has_keyword`]->(t2@`keyword`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t1.`title` = 'Disciple')\nRETURN COUNT(t2.`keyword`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many keywords are there in the episode Disciple?",
    "evidence": "episode Disciple refers to title = 'Disciple'",
    "idx": 699
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t2:`nominated_for`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t2.`series` = 'Law and Order' AND t1.`season` = 9 AND t1.`episode` = 20)\nRETURN COUNT(t2.`award_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many nominations did Law and Order season 9, episode 20 get?",
    "evidence": "Law and Order refers to series = 'Law and Order'",
    "idx": 701
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t2:`worked_on`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t1.`series` = 'Law and Order' AND t1.`season` = 9 AND t1.`episode` = 17 AND t2.`credited` = 'true')\nRETURN COUNT(t2.`role`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For season 9, episode 17 of the show Law and Order, how many roles have been included in the credit?",
    "evidence": "Law and Order refers to series = 'Law and Order'; included in the credit refers to credited = 'true'",
    "idx": 702
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t2.`name` = 'Joseph Blair')\nRETURN t1.`role` AS `role`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which role did Joseph Blair play in the show?",
    "evidence": "",
    "idx": 704
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`person`)-[t2:`nominated_for`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`name` = 'Rene Balcer')\nRETURN COUNT(t2.`award_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many awards has Rene Balcer been nominated for?",
    "evidence": "",
    "idx": 705
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t2.`name` = 'J.K. Simmons')\nRETURN COUNT(t1.`role`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many episodes did J.K. Simmons' role appear on the show?",
    "evidence": "",
    "idx": 707
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t1.`credited` = 'false' AND t1.`episode_id` = 'tt0629391')\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the person that were not credited at the end of episode tt0629391?",
    "evidence": "not credited refers to credited = ''; episode tt0629391 refers to episode_id = 'tt0629391'",
    "idx": 711
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t1.`episode_id` = 'tt0629204' AND t1.`role` = 'script supervisor')\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the script supervisor of the series in episode tt0629204?",
    "evidence": "who refers to name; script supervisor refers to role = 'script supervisor'; episode tt0629204 refers to episode_id = 'tt0629204'",
    "idx": 712
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`person`)-[t2:`nominated_for`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t1.`name` = 'Julia Roberts' AND t2.`result` = 'Nominee')\nRETURN COUNT(t2.`award_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many awards has Julia Roberts been nominated for?",
    "evidence": "been nominated refers to result = 'Nominee'",
    "idx": 713
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t1.`role` = 'camera operator')\nORDER BY t2.`height_meters` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the tallest camera operator?",
    "evidence": "who refers to name; the tallest refers to max(height_meters); camera operator refers to role = 'camera operator'",
    "idx": 714
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`person`)-[t2:`nominated_for`]->()\nWHERE t1.`person_id` = t2.`person_id`\nAND (t2.`year` = 1999 AND t1.`birth_country` = 'Canada')\nRETURN COUNT(t1.`person_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many people, who were born in Canada, won an award in 1999?",
    "evidence": "born in Canada refers to birth_country = 'Canada'; in 1999 refers to year = 1999",
    "idx": 715
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`episode`)-[has_vote_0:`has_vote`]->(t2@`vote`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t2.`stars` = 10)\nRETURN COUNT(t1.`episode_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many people gave the most enjoyed episode a 10-star rating?",
    "evidence": "the most enjoyed refers max(rating); 10-star refers to stars = 10",
    "idx": 716
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`episode`)-[has_vote_0:`has_vote`]->(t2@`vote`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t1.`title` = 'True North' AND t1.`episode_id` = 'tt0629477')\nRETURN cast (sum(CASE  WHEN t2.`stars` = 1 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`episode_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of people who gave the \"True North\" episode a 1-star rating?",
    "evidence": "the \"True North\" episode refers to title = 'True North'; 1-star refers to stars = 1; percentage = divide(count(episode_id where stars = 1), count(episode_id)) * 100% where title = 'True North'",
    "idx": 718
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t3@`person`)-[t2:`worked_on`]->(t1@`episode`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND t3.`person_id` = t2.`person_id`\nAND (t1.`episode` = 3 AND t2.`role` = 'stunt coordinator')\nRETURN t3.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the stunt coordinator in episode 3?",
    "evidence": "who refers to name; stunt coordinator refers to role = 'stunt coordinator'",
    "idx": 723
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t2.`name` = 'Julia Roberts')\nRETURN COUNT(t1.`role`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many roles did Julia Roberts play in the series?",
    "evidence": "",
    "idx": 725
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`episode`)-[has_vote_0:`has_vote`]->(t1@`vote`)\nWHERE t2.`episode_id` = t1.`episode_id`\nAND (t1.`votes` >= 30 AND t1.`stars` = 10)\nORDER BY t1.`votes` DESC NULLS LAST \nRETURN t2.`title` AS `title` \nLIMIT 3",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the titles of the top 3 episodes that received no less than 30 votes in its 10-star rating?",
    "evidence": "no less than 30 votes refers to votes > = 30; 10-star rating refers to stars = 10",
    "idx": 726
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t2@`person`)-[t1:`worked_on`]->()\nWHERE t2.`person_id` = t1.`person_id`\nAND (t1.`role` = 'Clerk' AND NOT t2.`birthdate` IS NULL)\nORDER BY t2.`birthdate`  NULLS FIRST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the youngest person to ever play a \"clerk\" role in the series?",
    "evidence": "who refers to name; the youngest person refers to max(birthdate); a \"clerk\" role refers to role = 'Clerk'",
    "idx": 727
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (t1@`episode`)-[has_vote_0:`has_vote`]->(t2@`vote`)\nWHERE t1.`episode_id` = t2.`episode_id`\nAND (t1.`episode` = 24 AND t2.`stars` = 1)\nRETURN COUNT(t1.`episode_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many people did not enjoy the finale episode?",
    "evidence": "did not enjoy refers to stars = 1; the finale episode refers to episode = 24",
    "idx": 728
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[award:`nominated_for`]->()\nWHERE award.`award_category` = 'Primetime Emmy'\nRETURN DISTINCT award.`episode_id` AS `episode_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which episodes of the Law & Order have been nominated for the Primetime Emmy Awards?",
    "evidence": "episode refers to award; the Primetime Emmy Awards refers to award_category like 'Primetime Emmy'",
    "idx": 730
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[award:`nominated_for`]->()\nWHERE award.`result` = 'Nominee'\nRETURN COUNT(award.`award_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many episodes have not won any Law & Order series awards?",
    "evidence": "have not won any award refers to Result = 'Nominee'",
    "idx": 731
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[credit:`worked_on`]->()\nWHERE credit.`credited` = 'false'\nRETURN DISTINCT credit.`role` AS `role`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What roles have not been credited at the end of the episodes?",
    "evidence": "have not been credited refers to credited = ''",
    "idx": 732
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (episode@`episode`)\nORDER BY episode.`rating`  NULLS FIRST \nRETURN episode.`title` AS `title` \nLIMIT 3",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the 3 worst rated episodes?",
    "evidence": "worst rated refers to min(rating)",
    "idx": 733
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (person@`person`)\nWHERE person.`birth_name` = 'Rene Chenevert Balcer'\nRETURN person.`birth_place` AS `birth_place`, person.`birth_region` AS `birth_region`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full place of birth of Rene Chenevert Balcer?",
    "evidence": "full place of birth refers to birth_place, birth_region; Rene Chenevert Balcer refers to birth_name = 'Rene Chenevert Balcer'",
    "idx": 734
  }
]