[
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t2.`genre_name` = 'Shooter')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many shooter games are there?",
    "evidence": "shooter games refers to game_name WHERE genre_name = 'shooter';",
    "idx": 1798
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)-[available_on_0:`available_on`]->(t2@`platform`)\nMATCH ()-[t3:`published_by`]->()\nWHERE t1.`platform_id` = t2.`id`\nAND t1.`game_publisher_id` = t3.`id`\nAND (t1.`release_year` = 2014)\nRETURN cast (COUNT(CASE  WHEN t2.`platform_name` = 'PS4' THEN t3.`game_id` ELSE NULL END) as float) * 100 / COUNT(t3.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of games that were released on PS4 in 2014 among all platforms?",
    "evidence": "percentage - MULTIPLY(DIVIDE(SUM(platform_name = 'PS4'), COUNT(game_id)), 100); in 2014 refers to release_year = 2014;",
    "idx": 1799
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`region_sales`)\nWHERE t.`region_id` = 4\nRETURN sum(t.`num_sales`) * 100000 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much are the sales of the games in region ID 4?",
    "evidence": "how much are the sales = SUM(num_sales);",
    "idx": 1800
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`region_sales`)-[sold_in_0:`sold_in`]->(t2@`region`)\nWHERE t1.`region_id` = t2.`id`\nRETURN sum(CASE  WHEN t2.`region_name` = 'Japan' THEN t1.`num_sales` ELSE 0 END) AS `nums`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the sales made by the games in Japan region?",
    "evidence": "sales = SUM(num_sales); Japan region refers to region_name = 'Japan';",
    "idx": 1807
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)-[available_on_0:`available_on`]->(t2@`platform`)\nWHERE t1.`platform_id` = t2.`id`\nAND (t2.`platform_name` = 'X360')\nRETURN COUNT(t1.`game_publisher_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many game publisher IDs have published games on the X360 platform?",
    "evidence": "X360 refers to platform_name = 'X360';",
    "idx": 1808
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH ()-[t1:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`id`\nAND (t2.`publisher_name` = 'Bethesda Softworks')\nRETURN t1.`game_id` AS `game_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the game IDs of the games published by Bethesda Softworks?",
    "evidence": "Bethesda Softworks refers to publisher_name = 'Bethesda Softworks';",
    "idx": 1811
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nMATCH (t1@`game`)-[t3:`published_by`]->()\nWHERE t1.`genre_id` = t2.`id`\nAND t1.`id` = t3.`game_id`\nAND (t3.`publisher_id` = 464)\nRETURN DISTINCT t2.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the genres of games published by the publisher with an ID of 464?",
    "evidence": "genres of games refers to genre_name; publisher with an ID of 464 refers to publisher_id = 464;",
    "idx": 1816
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game_platform`)\nWHERE t.`release_year` = 2006\nRETURN DISTINCT t.`platform_id` AS `platform_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the platform IDs of records released in 2006?",
    "evidence": "released in 1990 refers to release_year = 1990; 2000 refers to release_year = 2000;",
    "idx": 1820
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game_platform`)\nWHERE t.`game_publisher_id` = 6657 AND t.`id` = 19\nRETURN t.`release_year` AS `release_year`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which year did the record ID 19 with game publisher ID 6657 released?",
    "evidence": "which year refers to release_year; record ID 19 refers to game platform.id; id = 19",
    "idx": 1822
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)\nMATCH ()-[t2:`publishes`]->(t3@`game`)-[belongs_to_0:`belongs_to`]->(t4@`genre`)\nWHERE t1.`game_publisher_id` = t2.`id`\nAND t2.`game_id` = t3.`id`\nAND t3.`genre_id` = t4.`id`\nAND (t4.`genre_name` = 'Adventure' AND t1.`release_year` = 2005)\nRETURN COUNT(DISTINCT t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of adventure games released in 2005?",
    "evidence": "adventure games refers to game_name WHERE genre_name = 'Adventure'; released in 2005 refers to release_year = 2005;",
    "idx": 1827
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[t2:`published_by`]->(t3@`publisher`)\nWHERE t1.`id` = t2.`game_id`\nAND t2.`publisher_id` = t3.`id`\nAND (t1.`game_name` = 'Adventure Time: Explore the Dungeon Because I Don\\'t Know!')\nRETURN t3.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the company that produced the game titled Adventure Time: Explore the Dungeon Because I Don't Know!?",
    "evidence": "name of the company that produced the game refers to publisher_name; Adventure Time: Explore the Dungeon Because I Don't Know! Refers to game_name = 'Adventure Time: Explore the Dungeon Because I Don''t Know!';",
    "idx": 1828
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t1.`id` = 119)\nRETURN t2.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre of the game ID 119?",
    "evidence": "genre of the game refers to genre_name; game ID 119 refers to game.id = 119;",
    "idx": 1830
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`region_sales`)-[sold_in_0:`sold_in`]->(t1@`region`)\nWHERE t1.`id` = t2.`region_id`\nORDER BY t2.`num_sales`  NULLS FIRST \nRETURN DISTINCT t1.`region_name` AS `region_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which region where a game had the lowest number of sales?",
    "evidence": "which region refers to region_name; lowest number of sales refers to MIN(num_sales);",
    "idx": 1832
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH ()-[t1:`published_by`]->()\nMATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t3@`platform`)\nWHERE t1.`id` = t2.`game_publisher_id`\nAND t2.`platform_id` = t3.`id`\nAND (t1.`game_id` = 178)\nRETURN t3.`platform_name` AS `platform_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In what platform does the game ID 178 available?",
    "evidence": "platform refers to platform_name;",
    "idx": 1834
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t1@`platform`)\nMATCH ()-[t3:`published_by`]->()\nWHERE t1.`id` = t2.`platform_id`\nAND t2.`game_publisher_id` = t3.`id`\nAND (t1.`platform_name` = 'PSP' AND t2.`release_year` = 2004)\nRETURN COUNT(t3.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games available on PSP were released in 2004?",
    "evidence": "PSP refers to platform_name = 'PSP'; released in 2004 refers to release_year = 2004;",
    "idx": 1838
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t1.`game_name` = '999: Nine Hours, Nine Persons, Nine Doors')\nRETURN t2.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre of the game titled '999: Nine Hours, Nine Persons, Nine Doors' ?",
    "evidence": "genre of the game refers to genre_name; '999: Nine Hours, Nine Persons, Nine Doors' refers to game_name = '999: Nine Hours, Nine Persons, Nine Doors';",
    "idx": 1839
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)\nMATCH ()-[t2:`published_by`]->()\nWHERE t1.`game_publisher_id` = t2.`id`\nAND (t2.`game_id` = 156)\nRETURN t1.`release_year` AS `release_year`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When was the game ID 156 released?",
    "evidence": "when the game was released refers to release_year;",
    "idx": 1840
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH ()-[t3:`published_by`]->(t4@`publisher`)\nMATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t1@`platform`)\nWHERE t1.`id` = t2.`platform_id`\nAND t2.`game_publisher_id` = t3.`id`\nAND t3.`publisher_id` = t4.`id`\nAND (t4.`publisher_name` = 'Culture Brain')\nRETURN COUNT(CASE  WHEN t1.`platform_name` = 'SNES' THEN t3.`game_id` ELSE NULL END) - COUNT(CASE  WHEN t1.`platform_name` = 'DS' THEN t3.`game_id` ELSE NULL END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the diffrence between the number of games produced by Culture Brain that can be played on SNES and DS?",
    "evidence": "difference = SUBTRACT(SUM(platform_name = 'SNES'), SUM(platform_name = 'DS')); SNES refers to platform_name = SNES ; DS refers to platform_name = 'DS' ;",
    "idx": 1841
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t1@`platform`)\nMATCH ()-[t3:`published_by`]->()\nWHERE t1.`id` = t2.`platform_id`\nAND t2.`game_publisher_id` = t3.`id`\nAND (t1.`platform_name` = 'Wii')\nRETURN cast (COUNT(CASE  WHEN t2.`release_year` = 2007 THEN t3.`game_id` ELSE NULL END) as float) * 100 / COUNT(t3.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In games that can be played on Wii, what is the percentage of games released in 2007?",
    "evidence": "Wii refers to platform_name = 'Wii'; percentage = MULTIPLY(DIVIDE(SUM(release_year = 2007), COUNT(release_year)), 100.0); released in 2007 refers to release_year = 2007;",
    "idx": 1842
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (author@`author`)\nWHERE author.`affiliation` = 'University of California Berkeley'\nRETURN COUNT(author.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many authors are affiliated with University of California Berkeley?",
    "evidence": "affiliated refers to Affiliation; 'University of California Berkeley' is the Affiliation",
    "idx": 1844
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t2@`paper`)-[published_in_0:`published_in`]->(t1@`journal`)\nWHERE t1.`id` = t2.`journalid`\nAND (t2.`year` = 2011 AND t1.`fullname` = 'Molecular Brain')\nRETURN COUNT(t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the papers published in the journal \"Molecular Brain\", how many of them were published in the year 2011?",
    "evidence": "\"Molecular Brain\" is the FullName of journal",
    "idx": 1849
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored`]->(t2@`paper`)\nWHERE t1.`paperid` = t2.`id`\nAND (t1.`affiliation` = 'University of Tokyo' AND t2.`title` = 'FIBER: A Generalized Framework for Auto-tuning Software')\nRETURN COUNT(t1.`authorid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the authors of the paper \"Stitching videos streamed by mobile phones in real-time\", how many of them are affiliated with Cairo Microsoft Innovation Lab?",
    "evidence": "\"FIBER: A Generalized Framework for Auto-tuning Software\" is the Title of paper; affiliated refers to Affiliation;  University of Tokyo is the affiliation organization",
    "idx": 1853
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored`]->(t2@`paper`)\nWHERE t1.`paperid` = t2.`id`\nAND (t2.`title` = 'Incremental Extraction of Keyterms for Classifying Multilingual Documents in the Web' AND t1.`affiliation` = 'National Taiwan University Department of Computer Science and Information Engineering Taiwan')\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which author of the paper \"Incremental Extraction of Keyterms for Classifying Multilingual Documents in the Web\" is affiliated with National Taiwan University Department of Computer Science and Information Engineering Taiwan?",
    "evidence": "\"Incremental Extraction of Keyterms for Classifying Multilingual Documents in the Web\" is the title of paper; affiliated with refers to Affiliation; \"National Taiwan University Department of Computer Science and Information Engineering Taiwan\" is the Affiliation organization",
    "idx": 1855
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored`]->(t2@`paper`)\nWHERE t1.`paperid` = t2.`id`\nAND (t1.`name` = 'Thomas Wiegand' AND t2.`year` = 1995)\nRETURN t2.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the paper published in 1995 and whose author included Thomas Wiegand?",
    "evidence": "published in 1995 refers to Year = 1995; 'Thomas Wiegand' is the name of author",
    "idx": 1856
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored`]->(t2@`paper`)\nWHERE t1.`paperid` = t2.`id`\nAND (t1.`name` = 'Thomas Wiegand' AND t2.`year` = 1995)\nRETURN COUNT(t2.`title`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many papers whose authors include Thomas Wiegand were published in 1995?",
    "evidence": "published in 1995 refers to Year = 1995; 'Thomas Wiegand' is the name of author",
    "idx": 1857
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t2@`paper`)-[published_in_0:`published_in`]->(t1@`journal`)\nWHERE t1.`id` = t2.`journalid`\nAND (t1.`fullname` = 'Molecular Brain' AND t2.`year` >= 2008 AND t2.`year` <= 2011)\nRETURN cast (COUNT(t2.`id`) as float) / COUNT(DISTINCT t2.`year`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of papers published in the journal \"Molecular Brain\" every year from 2008 to 2011?",
    "evidence": "\"Molecular Brain\" is the FullName of journal; year from 2008 to 2011 refers to Year BETWEEN 2008 AND 2011; average = Divide (Count(Id),4)",
    "idx": 1858
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[published_in_0:`published_in`]->(t2@`journal`)\nWHERE t1.`journalid` = t2.`id`\nORDER BY t1.`year` DESC NULLS LAST \nRETURN t1.`title` AS `title`, t2.`homepage` AS `homepage` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title and journal homepage of the latest published paper?",
    "evidence": "latest published paper refers to Max(Year)",
    "idx": 1865
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t2@`paper`)-[presented_at_0:`presented_at`]->(t1@`conference`)\nWHERE t1.`id` = t2.`conferenceid`\nAND (t2.`year` >= 1990 AND t2.`year` <= 2000 AND t2.`conferenceid` = 187)\nRETURN COUNT(t2.`conferenceid`) AS `_col_0`, t1.`homepage` AS `homepage`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number and conference's homepage of papers held in a conference with an ID of 187 during 1990 to 2000?",
    "evidence": "Id of 187 refers to ConferenceId = 187; during 1990 to 2000 refers to Year BETWEEN 1990 and 2000; total number of conference refers to Count(ConferenceId = 187)",
    "idx": 1867
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored`]->(t2@`paper`)\nWHERE t1.`paperid` = t2.`id`\nAND (t1.`affiliation` = 'Department of Network Science, Graduate School of Information Systems, The University of Electro-Communications' AND t2.`year` = 2003)\nRETURN DISTINCT t2.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the paper published in 2003 by an author with affiliation with Department of Network Science, Graduate School of Information Systems, The University of Electro-Communications?",
    "evidence": "published in 2003 refers to Year = 2003; 'Department of Network Science, Graduate School of Information Systems, The University of Electro-Communications' is the Affiliation organization",
    "idx": 1868
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[t2:`authored_by`]->()\nWHERE t1.`id` = t2.`paperid`\nAND (t1.`year` = 2006 AND t1.`conferenceid` < 100)\nRETURN DISTINCT t1.`title` AS `title`, t2.`authorid` AS `authorid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title and author ID of paper with conference ID less than 100 in year 2006?",
    "evidence": "conference ID less than 100 refers to ConferenceId < 100; in year 2006 refers to Year = 2006",
    "idx": 1871
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[published_in_0:`published_in`]->(t2@`journal`)\nWHERE t1.`journalid` = t2.`id`\nAND (t1.`journalid` >= 200 AND t1.`journalid` <= 300 AND like(t2.`shortname`,'A%'))\nRETURN cast (sum(CASE  WHEN t1.`conferenceid` = 0 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`conferenceid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In papers with journal IDs from 200 to 300 and with its short name starts with A, what is the percentage of papers with conference ID of 0?",
    "evidence": "journal ID of 200 to 300 refers to JournalId BETWEEN 200 AND 300; short name starts with A refers to ShortName LIKE 'A%'; Percentage = Divide (Count(ConferenceId = 0), Count(ConferenceId)) * 100",
    "idx": 1875
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (author@`author`)\nRETURN cast (sum(CASE  WHEN author.`affiliation` IS NULL THEN 1 ELSE 0 END) as float) / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio of author with affiliation and without affiliation?",
    "evidence": "with affiliation refers to Affiliation is not Null; without affiliation refers to Affiliation IS NULL; Ration = Count(Id(Affiliation is NOT NULL)) : Count (Id (Affiliation IS NULL))",
    "idx": 1878
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (paper@`paper`)\nWHERE paper.`year` = 0\nRETURN COUNT(paper.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the papers are preprinted or not published?",
    "evidence": "preprinted or not published refers to Year = 0",
    "idx": 1889
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[t2:`authored_by`]->()\nWHERE t1.`id` = t2.`paperid`\nAND (t2.`name` = 'Jei Keon Chae')\nRETURN t2.`authorid` AS `authorid`, t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who are the co-authors for Jei Keon Chae and what is the title of paper written by them?",
    "evidence": "'Jei Keon Chee' is the name of author;",
    "idx": 1898
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (journal@`journal`)\nWHERE journal.`homepage` = ''\nRETURN COUNT(journal.`homepage`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many journals do not have a website?",
    "evidence": "do not have a website refers to HomePage = ''",
    "idx": 1901
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored`]->(t2@`paper`)\nWHERE t1.`paperid` = t2.`id`\nAND (t2.`title` = 'A combined search for the standard model Higgs boson at s = 1.96 Â TeV')\nRETURN t1.`affiliation` AS `affiliation`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the affiliation of the author writing in the journal 'A combined search for the standard model Higgs boson at s = 1.96 Â TeV'?",
    "evidence": "journal 'A combined search for the standard model Higgs boson at s = 1.96 Â TeV' refers to Title = 'A combined search for the standard model Higgs boson at s = 1.96 Â TeV'",
    "idx": 1907
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored`]->(t2@`paper`)\nWHERE t1.`paperid` = t2.`id`\nAND (t2.`title` = 'Particle identification using the time-over-threshold method in the ATLAS Transition Radiation Tracker')\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the co-authors of the paper titled 'Particle identification using the time-over-threshold method in the ATLAS Transition Radiation Tracker'?",
    "evidence": "paper titled 'Particle identification using the time-over-threshold method in the ATLAS Transition Radiation Tracker' refers to Title = 'Particle identification using the time-over-threshold method in the ATLAS Transition Radiation Tracker'",
    "idx": 1909
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[presented_at_0:`presented_at`]->(t2@`conference`)\nWHERE t1.`conferenceid` = t2.`id`\nAND (t1.`year` <> 0 AND t2.`fullname` = 'International Conference on Database Theory')\nRETURN COUNT(t1.`id`) AS `paper`, COUNT(DISTINCT t1.`year`) AS `years`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In how many papers and in what years was the International Conference on Database Theory published?",
    "evidence": "the International Conference on Database Theory refers to FullName = 'International Conference on Database Theory'; published refers to year ! = 0",
    "idx": 1910
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[published_in_0:`published_in`]->(t2@`journal`)\nWHERE t1.`journalid` = t2.`id`\nAND (t1.`keyword` = 'Sustainability')\nRETURN t2.`fullname` AS `fullname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the journals that are published in the database papers whose topic is Sustainability?",
    "evidence": "topic is Sustainability refers to Keyword = 'Sustainability'",
    "idx": 1911
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[t2:`authored_by`]->()\nMATCH (t1@`paper`)-[presented_at_0:`presented_at`]->(t3@`conference`)\nWHERE t1.`id` = t2.`paperid`\nAND t1.`conferenceid` = t3.`id`\nAND (like(t3.`fullname`,'%Workshop%'))\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the authors of papers in which conferences have been published whose full name includes the word Workshop?",
    "evidence": "full name includes the word Workshop refers to FullName LIKE '%Workshop%'",
    "idx": 1912
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[t1:`authored`]->(t2@`paper`)\nWHERE t1.`paperid` = t2.`id`\nAND (like(t2.`title`,'%Charged particle multiplicity%'))\nRETURN cast ((sum(CASE  WHEN like(t1.`affiliation`,'%INFN%') THEN 1 ELSE 0 END)) as float) * 100 / COUNT(t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of authors of the paper about Charged particle multiplicity are affiliated with INFN?",
    "evidence": "about Charged particle multiplicity refers to Title which contains 'Charged particle multiplicity'; affiliated with INFN refers to Affiliation LIKE '%INFN%' ; percentage refers to DIVIDE(COUNT(Affiliation LIKE '%INFN%' ), COUNT(AuthorId)) * 100%",
    "idx": 1913
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t2@`paper`)-[published_in_0:`published_in`]->(t1@`journal`)\nWHERE t1.`id` = t2.`journalid`\nAND (t2.`year` = 1989)\nRETURN cast ((sum(CASE  WHEN like(t1.`shortname`,'ANN%') THEN 1 ELSE 0 END)) as float) * 100 / COUNT(t1.`shortname`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of journals whose short name begins with ANN were published in the paper database in 1989?",
    "evidence": "short name begins with ANN refers to ShortName like 'ANN%' ; percentage refers to DIVIDE(COUNT(ShortName like 'ANN%' ), COUNT(id)) * 100%;  in 1989 refers to Year = 1989",
    "idx": 1914
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH ()-[paperauthor:`authored_by`]->()\nWHERE like(paperauthor.`affiliation`,'%Microsoft Research%')\nRETURN COUNT(paperauthor.`paperid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many authors were associated with the Microsoft Research when paper number 1 was written?",
    "evidence": "associated with the Microsoft Research refers to Affiliation contains 'Microsoft Research'; paper number 1 refers to PaperId = 1",
    "idx": 1915
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (paper@`paper`)\nWHERE paper.`title` = 'A Formal Approach to Service Component Architecture'\nRETURN paper.`keyword` AS `keyword`, paper.`year` AS `year`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the topic of the article \"A Formal Approach to Service Component Architecture\" and when was it published?",
    "evidence": "article \"A Formal Approach to Service Component Architecture\" refers to Title = 'A Formal Approach to Service Component Architecture'; topic of the article refers to Keyword",
    "idx": 1916
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (paper@`paper`)\nRETURN cast (sum(CASE  WHEN paper.`year` > 2000 THEN 1 ELSE 0 END) as float) * 100 / COUNT(paper.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of papers were preprinted after the year 2000?",
    "evidence": "after the year 2000 refers to Year > 2000; preprinted refers to ConferenceId = 0 AND JournalId = 0; percentage refers to DIVIDE(COUNT(ConferenceId = 0 AND JournalId = 0 AND Year > 2000), COUNT(Id))",
    "idx": 1917
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[presented_at_0:`presented_at`]->(t2@`conference`)\nWHERE t1.`conferenceid` = t2.`id`\nAND (t1.`id` = 5)\nRETURN t2.`fullname` AS `fullname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the conference where paper number 5 was published?",
    "evidence": "paper number 5 refers to Id = 5",
    "idx": 1921
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[t2:`authored_by`]->()\nWHERE t1.`id` = t2.`paperid`\nAND (t2.`name` = 'Cheng Huang' AND t2.`affiliation` = 'Microsoft')\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the paper that was written by Cheng Huang and affiliated with Microsoft?",
    "evidence": "paper that was written by Cheng Huang refers to Name = 'Cheng Huang'; affiliated with Microsoft refers to Affiliation LIKE 'Microsoft %'",
    "idx": 1923
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[t2:`authored_by`]->()\nWHERE t1.`id` = t2.`paperid`\nAND (t2.`name` = 'Zvezdan Protić' AND t1.`conferenceid` = 0 AND t1.`journalid` = 0)\nRETURN CASE  WHEN t1.`year` = 0 THEN 'TRUE' ELSE 'FALSE' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the paper which was presented by \"Zvezdan Protić\", was it preprinted?",
    "evidence": "Year = 0 means this paper is preprint, or not published",
    "idx": 1957
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[presented_at_0:`presented_at`]->(t2@`conference`)\nWHERE t1.`conferenceid` = t2.`id`\nRETURN cast (sum(CASE  WHEN t2.`fullname` = 'International Conference on Thermoelectrics' THEN 1 ELSE 0 END) as float) / sum(CASE  WHEN t2.`fullname` = 'International Conference on Wireless Networks, Communications and Mobile Computing' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times more for the papers that were presented at the \"International Conference on Thermoelectrics\" conference than \"International Conference on Wireless Networks, Communications and Mobile Computing“ conference?",
    "evidence": "'International Conference on Thermoelectrics' AND 'International Conference on Wireless Networks, Communications and Mobile Computing' are the FullName of the conference; Papers refers to Paper.Id; Calculation = SUBTRACT(SUM(Paper.Id where FullName = 'International Conference on Thermoelectrics'), SUM(Paper.Id where FullName = 'International Conference on Wireless Networks, Communications and Mobile Computing'))",
    "idx": 1963
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (t1@`paper`)-[t2:`authored_by`]->()\nWHERE t1.`id` = t2.`paperid`\nAND (t2.`name` = 'John Van Reenen')\nRETURN cast (sum(CASE  WHEN t1.`conferenceid` = 0 AND t1.`journalid` = 0 THEN 1 ELSE 0 END) as float) / COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of preprints of John Van Reenen's papers?",
    "evidence": "year = 0 means this paper is preprint; John Van Reenen is the author's name; papers refers to paper.Id; calculation = DIVIDE(SUM(paper.Id where Name = 'John Van Reenen' AND ConferenceID = 0 AND  JournalId = 0), SUM(paper.Id where Name = 'John Van Reenen'))",
    "idx": 1964
  },
  {
    "filename": "train.json",
    "db_id": "authors",
    "gql_statement": "MATCH (paper@`paper`)\nWHERE paper.`year` > 0\nORDER BY paper.`year`  NULLS FIRST \nRETURN paper.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the oldest published book?",
    "evidence": "published book refers to Title; the oldest book refers to MIN(Year)",
    "idx": 1965
  }
]