[
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`market`:`market`)\nRETURN MAX(`market`.`number_cities`) AS `_col_0`, min(`market`.`number_cities`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the maximum and minimum number of cities across all markets.",
    "evidence": "",
    "idx": 4630
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`market`:`market`)\nWHERE `market`.`number_cities` < 300\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of markets that have a number of cities lower than 300.",
    "evidence": "",
    "idx": 4632
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`market`:`market`)\nRETURN `market`.`country` AS `country` ORDER BY `country` IS NULL DESC, `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all countries of markets in ascending alphabetical order.",
    "evidence": "",
    "idx": 4633
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`market`:`market`)\nORDER BY `market`.`number_cities` IS NULL ASC, `market`.`number_cities` DESC \nRETURN `market`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all countries of markets in descending order of number of cities.",
    "evidence": "",
    "idx": 4635
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`t1`:`film`)-[t2:has_estimation_in]->()\nWHERE `t1`.`film_id` = `t2`.`film_id`\nRETURN `t1`.`title` AS `title`, `t2`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the titles of films and the types of market estimations.",
    "evidence": "",
    "idx": 4637
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`t1`:`film`)-[t2:has_estimation_in]->()\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t2`.`year` = 1995)\nRETURN DISTINCT `t1`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the distinct director of films with market estimation in the year of 1995.",
    "evidence": "",
    "idx": 4639
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH ()-[t1:has_estimation_in]->(`t2`:`market`)\nWHERE `t1`.`market_id` = `t2`.`market_id`\nAND (`t1`.`low_estimate` > 10000)\nRETURN avg(`t2`.`number_cities`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average number of cities of markets with low film market estimate bigger than 10000?",
    "evidence": "",
    "idx": 4641
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH ()-[t1:has_estimation_in]->(`t2`:`market`)\nWHERE `t1`.`market_id` = `t2`.`market_id`\nAND (`t1`.`low_estimate` > 10000)\nRETURN avg(`t2`.`number_cities`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the average number of cities within markets that had a low market estimation larger than 10000?",
    "evidence": "",
    "idx": 4642
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`film`:`film`)\nWITH `film`.`studio` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `studio`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the studios of each film and the number of films produced by that studio.",
    "evidence": "",
    "idx": 4647
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`film`:`film`)\nWITH `film`.`studio` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `studio`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of studios that have at least two films.",
    "evidence": "",
    "idx": 4649
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[film_market_estimation_sub0:has_estimation_in]->()\nRETURN `film_market_estimation_sub0`.`film_id` AS `film_id`   } AS in_collect_0\nMATCH (`film`:`film`)\nWHERE NOT `film`.`film_id` IN in_collect_0\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the title of films that do not have any market estimation.",
    "evidence": "",
    "idx": 4651
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`studio` =~ '(?i)(?s).*Universal.*'\nRETURN `film`.`title` AS `title`, `film`.`studio` AS `studio`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the titles and studios of the films that are produced by some film studios that contained the word \"Universal\".",
    "evidence": "",
    "idx": 4653
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`studio` =~ '(?i)(?s).*Universal.*'\nRETURN `film`.`title` AS `title`, `film`.`studio` AS `studio`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles and studios of films that have been produced by a studio whose name contains \"Universal\"?",
    "evidence": "",
    "idx": 4654
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`film`:`film`)\nWITH `film`.`studio` AS _groupby_col_0, avg(`film`.`gross_in_dollar`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 4500000\nRETURN _groupby_col_0 AS `studio`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the studios which average gross is above 4500000.",
    "evidence": "",
    "idx": 4655
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`t1`:`film`)-[t2:has_estimation_in]->()\nWHERE `t1`.`film_id` = `t2`.`film_id`\nORDER BY `t2`.`high_estimate` IS NULL ASC, `t2`.`high_estimate` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the title of the film that has the highest high market estimation.",
    "evidence": "",
    "idx": 4657
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`t1`:`film`)-[t2:has_estimation_in]->()\nWHERE `t1`.`film_id` = `t2`.`film_id`\nORDER BY `t2`.`high_estimate` IS NULL ASC, `t2`.`high_estimate` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the title of the film with the highest high estimate?",
    "evidence": "",
    "idx": 4658
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1_sub0:has_estimation_in]->(`t2_sub0`:`market`)\nWHERE `t1_sub0`.`market_id` = `t2_sub0`.`market_id`\nAND (`t2_sub0`.`country` = 'China')\nRETURN `t1_sub0`.`film_id` AS `film_id`   } AS in_collect_0\nMATCH (`film`:`film`)\nWHERE NOT `film`.`film_id` IN in_collect_0\nRETURN `film`.`title` AS `title`, `film`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles and directors of the films were never presented in China?",
    "evidence": "",
    "idx": 4659
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1_sub0:has_estimation_in]->(`t2_sub0`:`market`)\nWHERE `t1_sub0`.`market_id` = `t2_sub0`.`market_id`\nAND (`t2_sub0`.`country` = 'China')\nRETURN `t1_sub0`.`film_id` AS `film_id`   } AS in_collect_0\nMATCH (`film`:`film`)\nWHERE NOT `film`.`film_id` IN in_collect_0\nRETURN `film`.`title` AS `title`, `film`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the titles and directors of films that were never in the market of China.",
    "evidence": "",
    "idx": 4660
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_calendar`:`ref_calendar`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of all the calendar items.",
    "evidence": "",
    "idx": 4662
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_calendar`:`ref_calendar`)\nRETURN `ref_calendar`.`calendar_date` AS `calendar_date`, `ref_calendar`.`day_number` AS `day_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all calendar dates and day Numbers.",
    "evidence": "",
    "idx": 4663
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_document_types`:`ref_document_types`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of document types.",
    "evidence": "",
    "idx": 4665
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_document_types`:`ref_document_types`)\nRETURN `ref_document_types`.`document_type_code` AS `document_type_code`, `ref_document_types`.`document_type_name` AS `document_type_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all document type codes and document type names.",
    "evidence": "",
    "idx": 4667
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_document_types`:`ref_document_types`)\nWHERE `ref_document_types`.`document_type_code` = 'RV'\nRETURN `ref_document_types`.`document_type_name` AS `document_type_name`, `ref_document_types`.`document_type_description` AS `document_type_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the name and description of the document type code RV.",
    "evidence": "",
    "idx": 4670
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_document_types`:`ref_document_types`)\nWHERE `ref_document_types`.`document_type_name` = 'Paper'\nRETURN `ref_document_types`.`document_type_code` AS `document_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the document type code for document type \"Paper\"?",
    "evidence": "",
    "idx": 4671
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`all_documents`:`all_documents`)\nWHERE `all_documents`.`document_type_code` = 'CV' OR `all_documents`.`document_type_code` = 'BK'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of documents with document type code CV or BK.",
    "evidence": "",
    "idx": 4673
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`all_documents`:`all_documents`)\nWHERE `all_documents`.`document_name` = 'Marry CV'\nRETURN `all_documents`.`date_stored` AS `date_stored`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the date when the document \"Marry CV\" was stored?",
    "evidence": "",
    "idx": 4675
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`all_documents`:`all_documents`)\nWHERE `all_documents`.`document_name` = 'Marry CV'\nRETURN `all_documents`.`date_stored` AS `date_stored`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When was the document named \"Marry CV\" stored? Give me the date.",
    "evidence": "",
    "idx": 4676
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`t1`:`all_documents`)-[stored_on_0:stored_on]->(`t2`:`ref_calendar`)\nWHERE `t1`.`date_stored` = `t2`.`calendar_date`\nRETURN `t2`.`day_number` AS `day_number`, `t1`.`date_stored` AS `date_stored`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the day Number and stored date for all the documents.",
    "evidence": "",
    "idx": 4678
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`t1`:`all_documents`)-[has_type_0:has_type]->(`t2`:`ref_document_types`)\nWHERE `t1`.`document_type_code` = `t2`.`document_type_code`\nAND (`t1`.`document_name` = 'How to read a book')\nRETURN `t2`.`document_type_name` AS `document_type_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the document type name for the document with name \"How to read a book\"?",
    "evidence": "",
    "idx": 4679
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_locations`:`ref_locations`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of locations.",
    "evidence": "",
    "idx": 4681
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_locations`:`ref_locations`)\nRETURN `ref_locations`.`location_code` AS `location_code`, `ref_locations`.`location_name` AS `location_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all location codes and location names.",
    "evidence": "",
    "idx": 4683
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_locations`:`ref_locations`)\nWHERE `ref_locations`.`location_code` = 'x'\nRETURN `ref_locations`.`location_name` AS `location_name`, `ref_locations`.`location_description` AS `location_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the name and description of the location with code x.",
    "evidence": "",
    "idx": 4686
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_locations`:`ref_locations`)\nWHERE `ref_locations`.`location_name` = 'Canada'\nRETURN `ref_locations`.`location_code` AS `location_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the location code for the country \"Canada\"?",
    "evidence": "",
    "idx": 4687
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`ref_locations`:`ref_locations`)\nWHERE `ref_locations`.`location_name` = 'Canada'\nRETURN `ref_locations`.`location_code` AS `location_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the location code of the country \"Canada\".",
    "evidence": "",
    "idx": 4688
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`roles`:`roles`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the total number of roles listed.",
    "evidence": "",
    "idx": 4690
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`roles`:`roles`)\nRETURN `roles`.`role_code` AS `role_code`, `roles`.`role_name` AS `role_name`, `roles`.`role_description` AS `role_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all role codes, role names, and role descriptions.",
    "evidence": "",
    "idx": 4691
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`roles`:`roles`)\nWHERE `roles`.`role_code` = 'MG'\nRETURN `roles`.`role_name` AS `role_name`, `roles`.`role_description` AS `role_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the name and description for role code \"MG\"?",
    "evidence": "",
    "idx": 4693
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`roles`:`roles`)\nWHERE `roles`.`role_code` = 'MG'\nRETURN `roles`.`role_name` AS `role_name`, `roles`.`role_description` AS `role_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and description of the role with code \"MG\".",
    "evidence": "",
    "idx": 4694
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`roles`:`roles`)\nWHERE `roles`.`role_name` = 'Proof Reader'\nRETURN `roles`.`role_description` AS `role_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the description for role name \"Proof Reader\".",
    "evidence": "",
    "idx": 4695
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`roles`:`roles`)\nWHERE `roles`.`role_name` = 'Proof Reader'\nRETURN `roles`.`role_description` AS `role_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the description of the role named \"Proof Reader\"?",
    "evidence": "",
    "idx": 4696
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`employees`:`employees`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of employees we have.",
    "evidence": "",
    "idx": 4698
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`employee_name` = 'Armani'\nRETURN `employees`.`employee_name` AS `employee_name`, `employees`.`role_code` AS `role_code`, `employees`.`date_of_birth` AS `date_of_birth`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name, role code, and date of birth for the employee with name 'Armani'.",
    "evidence": "",
    "idx": 4699
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`employee_name` = 'Ebba'\nRETURN `employees`.`employee_id` AS `employee_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the id of the employee named Ebba.",
    "evidence": "",
    "idx": 4702
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`role_code` = 'HR'\nRETURN `employees`.`employee_name` AS `employee_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of all the employees with role \"HR\".",
    "evidence": "",
    "idx": 4703
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`role_code` = 'HR'\nRETURN `employees`.`employee_name` AS `employee_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which employees have the role with code \"HR\"? Find their names.",
    "evidence": "",
    "idx": 4704
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`employees`:`employees`)\nWITH `employees`.`role_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `role_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all role codes and the number of employees in each role.",
    "evidence": "",
    "idx": 4705
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`employees`:`employees`)\nWITH `employees`.`role_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 3\nRETURN _groupby_col_0 AS `role_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all role codes with at least 3 employees.",
    "evidence": "",
    "idx": 4707
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`employees`:`employees`)\nWITH `employees`.`role_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 3\nRETURN _groupby_col_0 AS `role_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the roles with three or more employees? Give me the role codes.",
    "evidence": "",
    "idx": 4708
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`t1`:`employees`)-[has_role_0:has_role]->(`t2`:`roles`)\nWHERE `t1`.`role_code` = `t2`.`role_code`\nAND (`t1`.`employee_name` = 'Ebba')\nRETURN `t2`.`role_name` AS `role_name`, `t2`.`role_description` AS `role_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and description of the role played by the employee named Ebba.",
    "evidence": "",
    "idx": 4710
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`t1`:`employees`)-[has_role_0:has_role]->(`t2`:`roles`)\nWHERE `t1`.`role_code` = `t2`.`role_code`\nAND (`t2`.`role_name` = 'Editor')\nRETURN `t1`.`employee_name` AS `employee_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of employees with role name Editor.",
    "evidence": "",
    "idx": 4711
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`t1`:`employees`)-[has_role_0:has_role]->(`t2`:`roles`)\nWHERE `t1`.`role_code` = `t2`.`role_code`\nAND (`t2`.`role_name` = 'Editor')\nRETURN `t1`.`employee_name` AS `employee_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all the employees whose the role name is \"Editor\".",
    "evidence": "",
    "idx": 4712
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`t1`:`employees`)-[has_role_0:has_role]->(`t2`:`roles`)\nWHERE `t1`.`role_code` = `t2`.`role_code`\nAND (`t2`.`role_name` = 'Human Resource' OR `t2`.`role_name` = 'Manager')\nRETURN `t1`.`employee_id` AS `employee_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the employee ids for all employees with role name \"Human Resource\" or \"Manager\".",
    "evidence": "",
    "idx": 4713
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`t1`:`all_documents`)-[t2:stored_at]->(`t3`:`ref_locations`)\nWHERE `t1`.`document_id` = `t2`.`document_id`\nAND `t2`.`location_code` = `t3`.`location_code`\nAND (`t1`.`document_name` = 'Robin CV')\nRETURN `t3`.`location_name` AS `location_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the location name for document \"Robin CV\".",
    "evidence": "",
    "idx": 4717
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`t1`:`documents_to_be_destroyed`)-[destruction_role_0:destruction_role]->(`t2`:`employees`)\nMATCH (`t1`:`documents_to_be_destroyed`)-[destruction_role_1:destruction_role]->(`t3`:`employees`)\nWHERE `t1`.`destruction_authorised_by_employee_id` = `t2`.`employee_id`\nAND `t1`.`destroyed_by_employee_id` = `t3`.`employee_id`\nRETURN `t2`.`employee_name` AS `employee_name`, `t3`.`employee_name` AS `employee_name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the employees who authorised the destruction and the employees who destroyed the corresponding documents?",
    "evidence": "",
    "idx": 4727
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`documents_to_be_destroyed`:`documents_to_be_destroyed`)\nWITH `documents_to_be_destroyed`.`destruction_authorised_by_employee_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `destruction_authorised_by_employee_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the id of each employee and the number of document destruction authorised by that employee.",
    "evidence": "",
    "idx": 4729
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`documents_to_be_destroyed`:`documents_to_be_destroyed`)\nWITH `documents_to_be_destroyed`.`destroyed_by_employee_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `destroyed_by_employee_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the employee ids and the number of documents destroyed by each employee.",
    "evidence": "",
    "idx": 4731
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`documents_to_be_destroyed`:`documents_to_be_destroyed`)\nRETURN DISTINCT `documents_to_be_destroyed`.`destruction_authorised_by_employee_id` AS `destruction_authorised_by_employee_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ids of all employees who have authorized destruction.",
    "evidence": "",
    "idx": 4733
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`documents_to_be_destroyed`:`documents_to_be_destroyed`)\nRETURN DISTINCT `documents_to_be_destroyed`.`destroyed_by_employee_id` AS `destroyed_by_employee_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ids of all employees who have destroyed a document.",
    "evidence": "",
    "idx": 4735
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Tracking_DB",
    "gql_statement": "MATCH (`documents_to_be_destroyed`:`documents_to_be_destroyed`)\nRETURN `documents_to_be_destroyed`.`destroyed_by_employee_id` AS `destroyed_by_employee_id`   \nUNION DISTINCT\nMATCH (`documents_to_be_destroyed`:`documents_to_be_destroyed`)\nRETURN `documents_to_be_destroyed`.`destruction_authorised_by_employee_id` AS `destroyed_by_employee_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ids of all employees who have either destroyed a document or made an authorization to do this.",
    "evidence": "",
    "idx": 4737
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the total number of clubs.",
    "evidence": "",
    "idx": 4740
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nRETURN `club`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the name of each club.",
    "evidence": "",
    "idx": 4742
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the total number of students.",
    "evidence": "",
    "idx": 4744
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN DISTINCT `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find each student's first name.",
    "evidence": "",
    "idx": 4746
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Bootup Baltimore')\nRETURN `t3`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of the members of the club \"Bootup Baltimore\".",
    "evidence": "",
    "idx": 4747
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Bootup Baltimore')\nRETURN `t3`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who are the members of the club named \"Bootup Baltimore\"? Give me their last names.",
    "evidence": "",
    "idx": 4748
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Hopkins Student Enterprises')\nRETURN `t3`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who are the members of the club named \"Hopkins Student Enterprises\"? Show the last name.",
    "evidence": "",
    "idx": 4749
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Tennis Club')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many members does the club \"Tennis Club\" has?",
    "evidence": "",
    "idx": 4751
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Tennis Club')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the members of the club \"Tennis Club\".",
    "evidence": "",
    "idx": 4752
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Pen and Paper Gaming')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of members of club \"Pen and Paper Gaming\".",
    "evidence": "",
    "idx": 4753
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Pen and Paper Gaming')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many people have membership in the club \"Pen and Paper Gaming\"?",
    "evidence": "",
    "idx": 4754
  }
]