[
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`movie`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`mid` = `t3`.`msid`\nAND (`t1`.`name` = 'Rowan Atkinson' AND `t3`.`role` = 'Mr. Bean')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find all films in which \" Rowan Atkinson \" acted as \" Mr. Bean \"",
    "evidence": "",
    "idx": 1283
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t3`.`title` = 'The Past')\nRETURN `t2`.`birth_city` AS `birth_city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the director of \" The Past \" from",
    "evidence": "",
    "idx": 1284
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->()\nWHERE `t2`.`aid` = `t1`.`aid`\nAND (`t2`.`role` = 'Mr. Bean')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who acted the role of \" Mr. Bean \"",
    "evidence": "",
    "idx": 1285
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t5`:`director`)-[t2:directed]->(`t4`:`movie`)-[t1:has_genre]->(`t3`:`genre`)\nWHERE `t5`.`did` = `t2`.`did`\nAND `t4`.`mid` = `t2`.`msid`\nAND `t4`.`mid` = `t1`.`msid`\nAND `t3`.`gid` = `t1`.`gid`\nAND (`t5`.`name` = 'Asghar Farhadi')\nRETURN `t3`.`genre` AS `genre`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the genres of movies directed by \" Asghar Farhadi \"",
    "evidence": "",
    "idx": 1286
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->(`t3`:`movie`)\nWHERE `t2`.`aid` = `t1`.`aid`\nAND `t3`.`mid` = `t2`.`msid`\nAND (`t3`.`title` = 'Daddy Long Legs')\nRETURN `t2`.`role` AS `role`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the major roles in the movie \" Daddy Long Legs \"",
    "evidence": "",
    "idx": 1288
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`keyword`)\nMATCH (`t3`:`director`)-[t2:directed]->(`t4`:`movie`)-[t5:has_keyword]->()\nWHERE `t3`.`did` = `t2`.`did`\nAND `t4`.`mid` = `t2`.`msid`\nAND `t5`.`msid` = `t4`.`mid`\nAND `t5`.`kid` = `t1`.`id`\nAND (`t1`.`keyword` = 'nuclear weapons')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the directors of movies about nuclear weapons",
    "evidence": "",
    "idx": 1289
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`movie`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`mid` = `t3`.`msid`\nAND (`t1`.`name` = 'Jennifer Aniston' AND `t2`.`release_year` > 2010)\nRETURN COUNT(DISTINCT `t2`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of movies in which \" Jennifer Aniston \" acted after 2010 ?",
    "evidence": "",
    "idx": 1290
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->(`t3`:`movie`)\nWHERE `t2`.`aid` = `t1`.`aid`\nAND `t3`.`mid` = `t2`.`msid`\nAND (`t3`.`title` = 'Saving Private Ryan')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of actors in the movie \" Saving Private Ryan \" ?",
    "evidence": "",
    "idx": 1291
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->(`t3`:`movie`)\nWHERE `t2`.`aid` = `t1`.`aid`\nAND `t3`.`mid` = `t2`.`msid`\nAND (`t3`.`title` = 'Saving Private Ryan')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many actors are in the movie \" Saving Private Ryan \" ?",
    "evidence": "",
    "idx": 1292
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t2`.`name` = 'Steven Spielberg')\nRETURN COUNT(DISTINCT `t3`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many movies did \" Steven Spielberg \" direct ?",
    "evidence": "",
    "idx": 1293
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t2`.`name` = 'Woody Allen')\nWITH `t3`.`release_year` AS _groupby_col_0, COUNT(DISTINCT `t3`.`title`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `release_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of movies directed by \" Woody Allen \" per year ?",
    "evidence": "",
    "idx": 1296
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`movie`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`mid` = `t3`.`msid`\nAND (`t1`.`name` = 'Shahab Hosseini')\nRETURN COUNT(DISTINCT `t2`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many movies did \" Shahab Hosseini \" act in ?",
    "evidence": "",
    "idx": 1297
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`movie`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`mid` = `t3`.`msid`\nAND (`t1`.`name` = 'Shahab Hosseini')\nRETURN COUNT(DISTINCT `t2`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of movies in which \" Shahab Hosseini \" acted ?",
    "evidence": "",
    "idx": 1298
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'Los Angeles' AND `actor`.`birth_year` > 2000\nRETURN COUNT(DISTINCT `actor`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many actors were born in \" Los Angeles \" after 2000 ?",
    "evidence": "",
    "idx": 1301
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`movie`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`mid` = `t3`.`msid`\nAND (`t1`.`name` = 'Humphrey Bogart' AND `t2`.`release_year` < 1942)\nRETURN COUNT(DISTINCT `t2`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many movies did \" Humphrey Bogart \" act in before 1942 ?",
    "evidence": "",
    "idx": 1302
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`movie`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`mid` = `t3`.`msid`\nAND (`t1`.`name` = 'Brad Pitt')\nWITH `t2`.`release_year` AS _groupby_col_0, COUNT(DISTINCT `t2`.`title`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `release_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of movies that \" Brad Pitt \" acts in per year ?",
    "evidence": "",
    "idx": 1303
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'New York City' AND `actor`.`birth_year` > 1980 AND `actor`.`gender` = 'female'\nRETURN COUNT(DISTINCT `actor`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many female actors were born in \" New York City \" after 1980 ?",
    "evidence": "",
    "idx": 1309
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t4:acted_in]->(`t5`:`movie`)\nMATCH (`t3`:`director`)-[t2:directed]->(`t5`:`movie`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t5`.`mid` = `t4`.`msid`\nAND `t5`.`mid` = `t2`.`msid`\nAND `t3`.`did` = `t2`.`did`\nAND (`t1`.`nationality` = 'Iran' AND `t3`.`name` = 'Jim Jarmusch')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the number of actors from Iran who played in \" Jim Jarmusch \" movies",
    "evidence": "",
    "idx": 1310
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->(`t3`:`movie`)\nWHERE `t2`.`aid` = `t1`.`aid`\nAND `t3`.`mid` = `t2`.`msid`\nAND (`t1`.`nationality` = 'China' AND `t3`.`title` = 'Rush Hour 3')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many actors from China have acted in \" Rush Hour 3 \"",
    "evidence": "",
    "idx": 1311
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t5:acted_in]->(`t4`:`movie`)\nMATCH (`t2`:`actor`)-[t3:acted_in]->(`t4`:`movie`)\nWHERE `t5`.`aid` = `t1`.`aid`\nAND `t4`.`mid` = `t5`.`msid`\nAND `t4`.`mid` = `t3`.`msid`\nAND `t3`.`aid` = `t2`.`aid`\nAND (`t1`.`name` = 'Woody Strode' AND `t2`.`name` = 'Jason Robards')\nRETURN `t4`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies that star both \" Woody Strode \" and \" Jason Robards \"",
    "evidence": "",
    "idx": 1312
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t4:acted_in]->(`t5`:`movie`)\nMATCH (`t2`:`actor`)-[t3:acted_in]->(`t5`:`movie`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t5`.`mid` = `t4`.`msid`\nAND `t5`.`mid` = `t3`.`msid`\nAND `t3`.`aid` = `t2`.`aid`\nAND (`t2`.`name` = 'Tom Hanks')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors who acted in the same movie as \" Tom Hanks \"",
    "evidence": "",
    "idx": 1316
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t5`:`director`)-[t2:directed]->(`t4`:`movie`)\nMATCH (`t5`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t5`.`did` = `t2`.`did`\nAND `t5`.`did` = `t1`.`did`\nAND `t4`.`mid` = `t2`.`msid`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t4`.`title` = 'Revolutionary Road')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What movies have the same director as the movie \" Revolutionary Road \" ?",
    "evidence": "",
    "idx": 1317
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t4:acted_in]->(`t5`:`movie`)\nMATCH (`t3`:`director`)-[t2:directed]->(`t5`:`movie`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t5`.`mid` = `t4`.`msid`\nAND `t5`.`mid` = `t2`.`msid`\nAND `t3`.`did` = `t2`.`did`\nAND (`t3`.`name` = 'Quentin Tarantino')\nORDER BY `t5`.`release_year` IS NULL ASC, `t5`.`release_year` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the actors who played in the latest movie by \" Quentin Tarantino \"",
    "evidence": "",
    "idx": 1318
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t2`.`name` = 'Quentin Tarantino')\nORDER BY `t3`.`release_year` IS NULL ASC, `t3`.`release_year` DESC \nRETURN `t3`.`budget` AS `budget`, `t3`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and budget of the latest movie by \" Quentin Tarantino \"",
    "evidence": "",
    "idx": 1319
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t2`.`name` = 'Jim Jarmusch')\nORDER BY `t3`.`release_year` IS NULL ASC, `t3`.`release_year` DESC \nRETURN `t3`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the latest movie by \" Jim Jarmusch \"",
    "evidence": "",
    "idx": 1320
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->(`t3`:`movie`)\nWHERE `t2`.`aid` = `t1`.`aid`\nAND `t3`.`mid` = `t2`.`msid`\nAND (`t1`.`name` = 'Gabriele Ferzetti')\nORDER BY `t3`.`release_year` IS NULL ASC, `t3`.`release_year` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the latest movie which \" Gabriele Ferzetti \" acted in",
    "evidence": "",
    "idx": 1321
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the best french restaurant in san francisco ?",
    "evidence": "",
    "idx": 1329
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the best french in san francisco ?",
    "evidence": "",
    "idx": 1330
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the best place in san francisco for french food ?",
    "evidence": "",
    "idx": 1331
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the best place in san francisco for french food ?",
    "evidence": "",
    "idx": 1332
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where is the best french in san francisco ?",
    "evidence": "",
    "idx": 1333
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the best french in san francisco ?",
    "evidence": "",
    "idx": 1334
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where is the best french restaurant in san francisco ?",
    "evidence": "",
    "idx": 1335
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the best restaurant in san francisco for french food ?",
    "evidence": "",
    "idx": 1336
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the best french restaurant in san francisco ?",
    "evidence": "",
    "idx": 1337
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the best restaurant in san francisco for french food ?",
    "evidence": "",
    "idx": 1338
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t2`:`location`)-[belongs_to_1:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t2`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)\nWHERE `t1`.`id` = `t2`.`restaurant_id`\nAND (`t2`.`city_name` = 'san francisco' AND `t1`.`food_type` = 'french' AND `t1`.`rating` = `_col_0`)\nRETURN `t2`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where is the best restaurant in san francisco for french food ?",
    "evidence": "",
    "idx": 1339
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the best restaurant in the bay area for american food ?",
    "evidence": "",
    "idx": 1390
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the best restaurant in bay area for american food ?",
    "evidence": "",
    "idx": 1391
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the best restaurant in bay area for american food ?",
    "evidence": "",
    "idx": 1392
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the best american restaurant in the bay area ?",
    "evidence": "",
    "idx": 1393
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the best american restaurant in the bay area ?",
    "evidence": "",
    "idx": 1394
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the best american in the bay area ?",
    "evidence": "",
    "idx": 1395
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the best restaurant in the bay area for american food ?",
    "evidence": "",
    "idx": 1396
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the best restaurant in bay area for american food ?",
    "evidence": "",
    "idx": 1397
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the best restaurant in the bay area for american food ?",
    "evidence": "",
    "idx": 1398
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the best american in the bay area ?",
    "evidence": "",
    "idx": 1399
  },
  {
    "filename": "train_others.json",
    "db_id": "restaurants",
    "gql_statement": "CALL(*) {\nMATCH (`t1`:`restaurant`)-[located_in_1:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american')\nRETURN MAX(`t1`.`rating`) AS `_col_0`  \n}\nMATCH (`t3`:`location`)-[belongs_to_0:belongs_to]->(`t1`:`restaurant`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city_name` = `t2`.`city_name`\nAND `t1`.`id` = `t3`.`restaurant_id`\nAND (`t2`.`region` = 'bay area' AND `t1`.`food_type` = 'american' AND `t1`.`rating` = `_col_0`)\nRETURN `t3`.`house_number` AS `house_number`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the best american in the bay area ?",
    "evidence": "",
    "idx": 1400
  }
]