[
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2010-03' AND `t2`.`results` = 'Pass' AND `t1`.`facility_type` = 'School')\nRETURN DISTINCT `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the address of the schools that passed the inspection in March 2010.",
    "evidence": "school refers to facility_type = 'School'; pass refers to results = 'Pass'; in March 2010 refers to inspection_date like '2010-03%'",
    "idx": 4794
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`dba_name` = 'PIZZA RUSTICA, INC')\nRETURN DISTINCT `t2`.`inspection_id` AS `inspection_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the inspection ID of the establishment named \"PIZZA RUSTICA, INC.\"",
    "evidence": "\"PIZZA RUSTICA, INC.\" refers to dba_name = 'PIZZA RUSTICA, INC'",
    "idx": 4796
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[t3:has_violation]->(`t4`:`inspection_point`)\nMATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND `t2`.`inspection_id` = `t3`.`inspection_id`\nAND `t3`.`point_id` = `t4`.`point_id`\nAND (`t4`.`category` = 'Display of Inspection Report Summary')\nRETURN DISTINCT `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of employees involved in an inspection with the Display of Inspection Report Summary category.",
    "evidence": "name refers to first_name, last_name; Display of Inspection Report Summary category refers to category = 'Display of Inspection Report Summary'",
    "idx": 4798
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`risk_level` = '1' AND `t2`.`inspection_type` = 'Complaint' AND `t1`.`facility_type` = 'Restaurant' AND `t2`.`results` = 'Fail')\nRETURN COUNT(DISTINCT `t1`.`license_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the restaurants with the lowest risk level failed the complaint inspection type?",
    "evidence": "restaurant refers to facility_type = 'Restaurant'; the lowest risk level refers to min(risk_level); failed refers to results = 'Fail'; the complaint inspection type refers to inspection_type = 'Complaint'",
    "idx": 4800
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nMATCH (`t2`:`inspection`)-[t3:has_violation]->()\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND `t2`.`inspection_id` = `t3`.`inspection_id`\nAND (`t2`.`inspection_id` = 48216)\nRETURN DISTINCT `t3`.`fine` AS `fine`, `t1`.`state` AS `state`, `t1`.`city` AS `city`, `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the fine paid and the complete address of the establishment with inspection ID 48216.",
    "evidence": "complete address refers to state, city, address",
    "idx": 4801
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`inspection`:`inspection`)\nWHERE CASE WHEN `inspection`.`inspection_date` is not NULL THEN apoc.temporal.format(`inspection`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2011-01'\nRETURN COUNT(`inspection`.`inspection_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many inspections were done in January 2011?",
    "evidence": "in January 2011 refers to inspection_date like '2011-01%'",
    "idx": 4807
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`inspection`:`inspection`)\nWHERE CASE WHEN `inspection`.`inspection_date` is not NULL THEN apoc.temporal.format(`inspection`.`inspection_date`,'yyyy') ELSE NULL END = '2014' AND `inspection`.`results` = 'Fail'\nRETURN COUNT(`inspection`.`inspection_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many inspections failed in 2014?",
    "evidence": "failed refers to results = 'Fail'; in 2014 refers to inspection_date like '2014%'",
    "idx": 4808
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[t2:has_violation]->()\nWHERE `t1`.`inspection_id` = `t2`.`inspection_id`\nAND (`t1`.`inspection_date` = localdatetime('2010-08-07T00:00:00'))\nRETURN `t2`.`point_id` AS `point_id`, `t2`.`fine` AS `fine`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the point IDs and fines of the inspections done on 7th August 2010.",
    "evidence": "on 7th August 2010 refers to inspection_date = '2010-08-07'",
    "idx": 4810
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`city` = 'BURNHAM')\nRETURN DISTINCT `t1`.`dba_name` AS `dba_name`, `t2`.`results` AS `results`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names and inspection results of the facilities located in Burnham.",
    "evidence": "names refers to dba_name; inspection result refers to results; in Burnham refers to city = 'BURNHAM'",
    "idx": 4812
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[t3:has_violation]->(`t4`:`inspection_point`)\nMATCH (`t1`:`inspection`)-[conducted_by_0:conducted_by]->(`t2`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND `t1`.`inspection_id` = `t3`.`inspection_id`\nAND `t3`.`point_id` = `t4`.`point_id`\nAND (`t2`.`first_name` = 'Lisa' AND `t2`.`last_name` = 'Tillman' AND CASE WHEN `t1`.`inspection_date` is not NULL THEN apoc.temporal.format(`t1`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2014-01')\nRETURN DISTINCT `t4`.`category` AS `category`, `t3`.`fine` AS `fine`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the categories and fines for the inspections done by Lisa Tillman in January 2014.",
    "evidence": "in January 2014 refers to inspection_date like '2014-01%'",
    "idx": 4815
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`facility_type` = 'RIVERWALK CAFE')\nRETURN `t2`.`inspection_type` AS `inspection_type`, `t2`.`results` AS `results`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the types and results of the inspections done on Riverwalk café.",
    "evidence": "type refers to inspection_type; Riverwalk café refers to facility_type = 'RIVERWALK CAFE'",
    "idx": 4817
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[performed_at_0:performed_at]->(`t2`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`inspection_date` = localdatetime('2013-07-29T00:00:00') AND `t1`.`results` = 'Fail')\nRETURN `t2`.`dba_name` AS `dba_name`, `t2`.`longitude` AS `longitude`, `t2`.`latitude` AS `latitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names and locations of the facilities that failed inspections on 29th July 2013.",
    "evidence": "name refers to dba_name; location refers to latitude, longitude; failed inspections refers to results = 'Fail'; on 29th July 2013 refers to inspection_date = '2013-07-29'",
    "idx": 4821
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`inspection_date` = localdatetime('2010-11-05T00:00:00'))\nRETURN DISTINCT `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the address of employees who did inspection dated 11/5/2010.",
    "evidence": "dated 11/5/2010 refers to inspection_date = '2010-11-05'",
    "idx": 4828
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`inspection_type` = 'Canvass')\nRETURN DISTINCT `t1`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the phone numbers of employees who did Canvass inspection.",
    "evidence": "phone number refers to phone; Canvass inspection refers to inspection_type = 'Canvass'",
    "idx": 4829
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t2`.`inspection_type` = 'License')\nRETURN `t1`.`dba_name` AS `dba_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the dba name of restaurants that were inspected due to license.",
    "evidence": "inspected due to license refers to inspection_type = 'License'",
    "idx": 4833
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy') ELSE NULL END = '2010' AND `t1`.`risk_level` = 3)\nRETURN COUNT(`t2`.`inspection_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many inspections done in 2010 had serious food safety issue?",
    "evidence": "in 2010 refers to inspection_date like '2010%'; had serious food safety issue refers to risk_level = 3",
    "idx": 4834
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t2`.`results` =~ '(?i)(?s).*Pass.*')\nRETURN DISTINCT `t1`.`dba_name` AS `dba_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of dbas with verified quality.",
    "evidence": "name of dba refers to dba_name; with verified quality refers to results = 'Pass' or results = 'Pass w/Conditions'",
    "idx": 4835
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[conducted_by_0:conducted_by]->(`t2`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t1`.`inspection_id` >= 52270 AND `t1`.`inspection_id` <= 52272)\nRETURN sum(`t2`.`salary`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total salary for employees who did inspection from ID 52270 to 52272.",
    "evidence": "inspection from ID 52270 to 52272 refers to inspection_id between 52270 and 52272",
    "idx": 4836
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[conducted_by_0:conducted_by]->(`t2`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t1`.`inspection_type` = 'License Re-Inspection')\nRETURN avg(`t2`.`salary`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average salary for employees who did inspection on License Re-Inspection.",
    "evidence": "inspection on License Re-Inspection refers to inspection_type = 'License Re-Inspection'; average salary = avg(salary)",
    "idx": 4837
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`dba_name` = 'JOHN SCHALLER' AND CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy') ELSE NULL END = '2010')\nRETURN min(`t2`.`inspection_date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did restaurant John Schaller has its first inspection in 2010?",
    "evidence": "John Schaller refers to dba_name = 'JOHN SCHALLER'; first inspection refers to min(inspection_date); in 2010 refers to inspection_date like '2010%'",
    "idx": 4839
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2010-07' AND `t2`.`results` = 'Fail' AND `t1`.`facility_type` = 'Restaurant')\nRETURN COUNT(DISTINCT `t1`.`license_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many taverns failed in July 2010?",
    "evidence": "tavern refers to facility_type = 'Tavern'; failed refers to results = 'Fail'; in July 2010 refers to inspection_date like '2010-07%'",
    "idx": 4845
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nMATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t3`:`establishment`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND `t2`.`license_no` = `t3`.`license_no`\nAND (`t1`.`first_name` = 'Bob' AND `t1`.`last_name` = 'Benson' AND CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy') ELSE NULL END = '2010')\nRETURN DISTINCT `t3`.`dba_name` AS `dba_name`, `t2`.`results` AS `results`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which establishments did Bob Benson inspect in 2010 and what was the results?",
    "evidence": "establishment name refers to dba_name; in 2010 refers to inspection_date like '2010%'",
    "idx": 4847
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`first_name` = 'Standard' AND `employee`.`last_name` = 'Murray'\nRETURN `employee`.`address` AS `address`, `employee`.`city` AS `city`, `employee`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where does the employee named \"Standard Murray\" live?",
    "evidence": "address refers to address, city, state",
    "idx": 4852
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`establishment`:`establishment`)\nWHERE `establishment`.`dba_name` = 'Kinetic Playground'\nRETURN `establishment`.`facility_type` AS `facility_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the facility type of the establishment named \"Kinetic Playground\"?",
    "evidence": "the establishment named \"Kinetic Playground\" refers to dba_name = 'Kinetic Playground'",
    "idx": 4853
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`establishment`:`establishment`)\nWHERE `establishment`.`latitude` = 41.9532864854 AND `establishment`.`longitude` = -87.7673790701422 AND `establishment`.`facility_type` = 'Restaurant'\nRETURN `establishment`.`dba_name` AS `dba_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the restaurant's name at \"41.9532864854\" latitude and \"-87.7673790701422\" longitude?",
    "evidence": "restaurant refers to facility_type = 'Restaurant'; name refers to dba_name; \"41.9532864854\" latitude and \"-87.7673790701422\" longitude refers to latitude = 41.9532864854 and longitude = -87.7673790701422",
    "idx": 4855
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`establishment`:`establishment`)\nWHERE `establishment`.`city` = 'CHICAGO' AND `establishment`.`dba_name` = 'OLD TIMERS REST & LOUNGE' AND `establishment`.`facility_type` = 'Restaurant'\nRETURN `establishment`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where in Chicago does the restaurant named \"Old Timers Rest & Lounge\" located?",
    "evidence": "in Chicago refers to city = 'CHICAGO'; restaurant refers to facility_type = 'Restaurant'; \"Old Timers Rest & Lounge\" refers to dba_name = 'OLD TIMERS REST & LOUNGE'; location refers to address",
    "idx": 4857
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`inspection_id` = 52256)\nRETURN DISTINCT `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the last name of the employee involved in the inspection ID 52256.",
    "evidence": "",
    "idx": 4861
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nMATCH (`t2`:`inspection`)-[t3:has_violation]->()\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND `t2`.`inspection_id` = `t3`.`inspection_id`\nAND (`t1`.`facility_type` = 'Tavern' AND `t3`.`fine` = 100)\nRETURN DISTINCT `t1`.`dba_name` AS `dba_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of taverns that paid a $100 fine upon inspection.",
    "evidence": "name refers to dba_name; tavern refers to facility_type = 'Tavern'; a $100 fine refers to fine = 100",
    "idx": 4862
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`risk_level` = 1 AND `t2`.`results` = 'Fail')\nRETURN DISTINCT `t1`.`facility_type` AS `facility_type`, `t1`.`license_no` AS `license_no`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the facility type and license number of establishments with the lowest risk level but failed the inspection.",
    "evidence": "license number refers to license_no; the lowest risk level refers to min(risk_level); failed the inspection refers to results = 'Fail'",
    "idx": 4864
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`inspection_date` = localdatetime('2010-02-24T00:00:00') AND `t1`.`first_name` = 'Arnold' AND `t1`.`last_name` = 'Holder')\nRETURN DISTINCT `t2`.`results` AS `results`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the result of the February 24, 2010 inspection involving the employee named \"Arnold Holder\"?",
    "evidence": "February 24, 2010 refers to inspection_date = '2010-02-24'",
    "idx": 4865
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2010-04' AND `t1`.`facility_type` = 'Restaurant' AND `t2`.`results` = 'Fail')\nRETURN COUNT(DISTINCT `t1`.`license_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many restaurants failed the inspection in April 2010?",
    "evidence": "restaurant refers to facility_type = 'Restaurant'; failed the inspection refers to results = 'Fail'; in April 2010 refers to inspection_date like '2010-04%'",
    "idx": 4866
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t1`.`first_name` = 'Rosemary' AND `t1`.`last_name` = 'Kennedy')\nRETURN DISTINCT `t2`.`inspection_id` AS `inspection_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all inspection IDs where the employee named \"Rosemary Kennedy\" was involved.",
    "evidence": "",
    "idx": 4867
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t1`.`first_name` = 'Lisa' AND `t1`.`last_name` = 'Tillman' AND `t2`.`inspection_date` = localdatetime('2010-07-07T00:00:00'))\nRETURN DISTINCT `t2`.`inspection_type` AS `inspection_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What type of inspection was done on July 07, 2010, involving the employee named \"Lisa Tillman\"?",
    "evidence": "type of inspection refers to inspection_type; on July 07, 2010 refers to inspection_date = '2010-07-07'",
    "idx": 4868
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`risk_level` = 3 AND `t2`.`results` = 'Fail')\nRETURN DISTINCT `t1`.`dba_name` AS `dba_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the names of the establishments with the highest risk level and failed the inspection.",
    "evidence": "name of establishment refers to dba_name; the highest risk level refers to max(risk_level); failed the inspection refers to results = 'Fail'",
    "idx": 4870
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nMATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t3`:`employee`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND `t2`.`employee_id` = `t3`.`employee_id`\nAND (`t3`.`first_name` = 'David' AND `t3`.`last_name` = 'Hodges' AND `t1`.`dba_name` = 'KAMAYAN EXPRESS')\nRETURN `t2`.`inspection_id` AS `inspection_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the inspection ID where the employee named \"David Hodges\" is currently employed in the \"Kamayan Express\" establishment?",
    "evidence": "the \"Kamayan Express\" establishment refers to dba_name = 'KAMAYAN EXPRESS'",
    "idx": 4871
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t3`:`employee`)\nMATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`inspection_id` = 58424)\nRETURN `t1`.`salary` AS `salary`, `t3`.`salary` AS `salary_1` ORDER BY `t1`.`salary` IS NULL DESC, `t1`.`salary` , `t3`.`salary` IS NULL ASC, `t3`.`salary` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the salary range of the employee involved in the inspection ID 58424.",
    "evidence": "",
    "idx": 4872
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[t3:has_violation]->(`t4`:`inspection_point`)\nMATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND `t2`.`inspection_id` = `t3`.`inspection_id`\nAND `t3`.`point_id` = `t4`.`point_id`\nAND (`t1`.`dba_name` = 'J & J FOOD')\nRETURN DISTINCT `t4`.`category` AS `category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the category of the inspection of the establishment named \"J & J FOOD\"?",
    "evidence": "the establishment named \"J & J FOOD\" refers to dba_name = 'J & J FOOD'",
    "idx": 4875
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL(*) {\nMATCH (`employee_sub0`:`employee`)\nRETURN avg(`employee_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`results` = 'Fail' AND CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2010-02' AND `t1`.`salary` > 0.7 * `_col_0`)\nRETURN DISTINCT `t1`.`employee_id` AS `employee_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the establishments that failed the inspection in February 2010, list the names of the employees with a salary greater than 70% of the average salary of all employees.",
    "evidence": "failed the inspection refers to results = 'Fail'; in January 2010 refers to inspection_date like '2010-01%'; name of employee refers to first_name, last_name; a salary greater than 70% of the average salary refers to salary > multiply(avg(salary), 0.7)",
    "idx": 4880
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t1`.`name` = 'Argentum' AND `t2`.`date` = localdatetime('2016-10-11T00:00:00'))\nRETURN `t2`.`volume_24h` AS `volume_24h`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total value of Argentum coined traded in the past 24 hours on 2016/10/11.",
    "evidence": "total value in the past 24 hours refers to volume_24h; on 11/10/16 refers to date = '2016-11-10'",
    "idx": 4882
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t1`.`name` = 'WARP' AND CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy-MM') ELSE NULL END = '2016-08')\nRETURN `t2`.`time_high` AS `time_high`, `t2`.`time_low` AS `time_low`, `t2`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all transactions for WRAP in August 2016, list the time to achieve highest price and the time to achieve the lowest price.",
    "evidence": "in May 2013 refers to month(date) = 5 AND year(date) = 2013; time to achieve the highest price refers to time_high; time to achieve the lowest price refers to time_low; WRAP refers to name = 'WARP'",
    "idx": 4883
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t1`.`name` = 'DigixDAO')\nORDER BY `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t2`.`date` AS `date`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the transaction date whereby DigixDAO was transacted at the hightest price.",
    "evidence": "the highest price refers to max(price); DigixDAO refers to name = 'DigixDAO'",
    "idx": 4884
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t1`.`name` = 'Frozen' AND CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy') ELSE NULL END = '2014')\nRETURN CASE WHEN 12=0 THEN NULL ELSE toFloat(sum(`t2`.`circulating_supply`)) / 12 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average monthly circulating supply for Frozen in 2014.",
    "evidence": "average monthly circulating supply = AVG(circulating_supply); in 2017 refers to date BETWEEN '2017-01-01' AND '2017-12-31'",
    "idx": 4885
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t1`.`status` = 'inactive')\nORDER BY `t2`.`date` IS NULL ASC, `t2`.`date` DESC \nRETURN `t1`.`name` AS `name`, MAX(`t2`.`date`) AS `_col_1`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the inactive coins and state the last date of its transaction?",
    "evidence": "the last date refers to max(date); inactive coins refers to status = 'inactive'",
    "idx": 4886
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t1`.`name` = 'Bitcoin' AND CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy') ELSE NULL END = '2016')\nRETURN avg(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the price of 1 Bitcoin in 2016?",
    "evidence": "2016 refers to historical date where year(date) = 2016",
    "idx": 4887
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t1`.`category` = 'token')\nORDER BY `t2`.`high` - `t2`.`low` IS NULL ASC, `t2`.`high` - `t2`.`low` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the coin under the token category that gives the highest max profit.",
    "evidence": "the highest max profit refers to max(subtract(high, low))",
    "idx": 4888
  },
  {
    "filename": "train.json",
    "db_id": "coinmarketcap",
    "gql_statement": "MATCH (`t1`:`coins`)\nMATCH (`t2`:`historical`)\nWHERE `t1`.`id` = `t2`.`coin_id`\nAND (`t2`.`date` = localdatetime('2020-06-22T00:00:00'))\nWITH `t1`.`name` AS _groupby_col_0, avg(`t2`.`percent_change_24h`) AS _groupby_col_1, `t2`.`price` AS _groupby_col_2\nWHERE _groupby_col_1 > _groupby_col_2\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the coin that have higher than average percentage price changed from the previous 24 hours for transaction on 2013/6/22.",
    "evidence": "average percentage price changed from the previous 24 hours refers to AVG(percent_change_24h); on 15/5/2013 refers to DATE = '2013-04-15'",
    "idx": 4889
  }
]