[
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_login` = 1\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of users that are logged in.",
    "evidence": "",
    "idx": 4966
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "CALL(*) {\nMATCH (`users_sub0`:`users`)\nWHERE `users_sub0`.`user_login` = 1\nWITH `users_sub0`.`role_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `role_code`  LIMIT 1\n}\nMATCH (`roles`:`roles`)\nWHERE `roles`.`role_code` = `role_code`\nRETURN `roles`.`role_description` AS `role_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the description of the most popular role among the users that have logged in.",
    "evidence": "",
    "idx": 4967
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "CALL(*) {\nMATCH (`users_sub0`:`users`)\nWHERE `users_sub0`.`user_login` = 1\nWITH `users_sub0`.`role_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `role_code`  LIMIT 1\n}\nMATCH (`roles`:`roles`)\nWHERE `roles`.`role_code` = `role_code`\nRETURN `roles`.`role_description` AS `role_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the description of the most popular role among users that have logged in?",
    "evidence": "",
    "idx": 4968
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`images`:`images`)\nRETURN `images`.`image_name` AS `image_name`, `images`.`image_url` AS `image_url` ORDER BY `image_name` IS NULL DESC, `image_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the image name and URLs in the order of their names.",
    "evidence": "",
    "idx": 4969
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`users`:`users`)\nWITH `users`.`role_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `role_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of users in each role.",
    "evidence": "",
    "idx": 4971
  },
  {
    "filename": "train_spider.json",
    "db_id": "document_management",
    "gql_statement": "MATCH (`documents`:`documents`)\nWITH `documents`.`document_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `document_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the codes of document types that have more than 2 corresponding documents.",
    "evidence": "",
    "idx": 4974
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of companies.",
    "evidence": "",
    "idx": 4976
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nORDER BY `companies`.`market_value_billion` IS NULL ASC, `companies`.`market_value_billion` DESC \nRETURN `companies`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of companies in descending order of market value.",
    "evidence": "",
    "idx": 4977
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nWHERE `companies`.`headquarters` <> 'USA'\nRETURN `companies`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of companies whose headquarters are not \"USA\"?",
    "evidence": "",
    "idx": 4979
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nWHERE `companies`.`headquarters` <> 'USA'\nRETURN `companies`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the companies whose headquarters are not located in \"USA\".",
    "evidence": "",
    "idx": 4980
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nRETURN `companies`.`name` AS `name`, `companies`.`assets_billion` AS `assets_billion` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name and assets of each company in ascending order of company name.",
    "evidence": "",
    "idx": 4982
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nRETURN avg(`companies`.`profits_billion`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the average profits companies make.",
    "evidence": "",
    "idx": 4984
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nWHERE `companies`.`industry` <> 'Banking'\nRETURN MAX(`companies`.`sales_billion`) AS `_col_0`, min(`companies`.`sales_billion`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum and minimum sales of the companies whose industries are not \"Banking\".",
    "evidence": "",
    "idx": 4985
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nWHERE `companies`.`industry` <> 'Banking'\nRETURN MAX(`companies`.`sales_billion`) AS `_col_0`, min(`companies`.`sales_billion`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the maximum and minimum sales of the companies that are not in the \"Banking\" industry.",
    "evidence": "",
    "idx": 4986
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nRETURN COUNT(DISTINCT `companies`.`industry`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of distinct company industries.",
    "evidence": "",
    "idx": 4988
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`buildings`:`buildings`)\nORDER BY `buildings`.`height` IS NULL ASC, `buildings`.`height` DESC \nRETURN `buildings`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of buildings in descending order of building height.",
    "evidence": "",
    "idx": 4989
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`buildings`:`buildings`)\nORDER BY `buildings`.`height` IS NULL ASC, `buildings`.`height` DESC \nRETURN `buildings`.`stories` AS `stories`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the stories of the building with the largest height.",
    "evidence": "",
    "idx": 4991
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`buildings`:`buildings`)\nWHERE `buildings`.`status` = 'on-hold'\nORDER BY `buildings`.`stories` IS NULL DESC, `buildings`.`stories`  \nRETURN `buildings`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the names of the buildings whose status is \"on-hold\", in ascending order of stories.",
    "evidence": "",
    "idx": 4995
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nWITH `companies`.`industry` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `industry`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show each industry and the corresponding number of companies in that industry.",
    "evidence": "",
    "idx": 4997
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[office_locations_sub0:has_office_in]->()\nRETURN `office_locations_sub0`.`building_id` AS `building_id`   } AS in_collect_0\nMATCH (`buildings`:`buildings`)\nWHERE NOT `buildings`.`id` IN in_collect_0\nRETURN `buildings`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of buildings that have no company office.",
    "evidence": "",
    "idx": 4999
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[office_locations_sub0:has_office_in]->()\nRETURN `office_locations_sub0`.`building_id` AS `building_id`   } AS in_collect_0\nMATCH (`buildings`:`buildings`)\nWHERE NOT `buildings`.`id` IN in_collect_0\nRETURN `buildings`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which buildings do not have any company office? Give me the building names.",
    "evidence": "",
    "idx": 5000
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nWHERE `companies`.`industry` = 'Banking' OR `companies`.`industry` = 'Conglomerate'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of companies whose industry is \"Banking\" or \"Conglomerate\",",
    "evidence": "",
    "idx": 5001
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nWHERE `companies`.`industry` = 'Banking' OR `companies`.`industry` = 'Conglomerate'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many companies are in either \"Banking\" industry or \"Conglomerate\" industry?",
    "evidence": "",
    "idx": 5002
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_office",
    "gql_statement": "MATCH (`companies`:`companies`)\nWITH `companies`.`headquarters` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `headquarters`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the headquarters shared by more than two companies.",
    "evidence": "",
    "idx": 5003
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "MATCH (`products`:`products`)\nORDER BY `products`.`product_price` IS NULL DESC, `products`.`product_price`  \nRETURN `products`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of products in ascending order of price.",
    "evidence": "",
    "idx": 5006
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_name` = 'Dining' OR `products`.`product_name` = 'Trading Policy'\nRETURN `products`.`product_price` AS `product_price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the prices of the products named \"Dining\" or \"Trading Policy\".",
    "evidence": "",
    "idx": 5008
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN avg(`products`.`product_price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average price for products?",
    "evidence": "",
    "idx": 5009
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "MATCH (`products`:`products`)\nWITH `products`.`product_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `product_type_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different type codes of products and the number of products with each type code.",
    "evidence": "",
    "idx": 5011
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "MATCH (`products`:`products`)\nWITH `products`.`product_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `product_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the product type codes that have at least two products.",
    "evidence": "",
    "idx": 5012
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:included_in]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nWITH `t1`.`product_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `product_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of products and the number of events they are in.",
    "evidence": "",
    "idx": 5013
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:included_in]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nWITH `t1`.`product_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `product_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of products and the number of events they are in, sorted by the number of events in descending order.",
    "evidence": "",
    "idx": 5014
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:included_in]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nWITH `t1`.`product_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of products that are in at least two events.",
    "evidence": "",
    "idx": 5015
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:included_in]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nWITH `t1`.`product_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `product_name` ORDER BY `product_name` IS NULL DESC, `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of products that are in at least two events in ascending alphabetical order of product name.",
    "evidence": "",
    "idx": 5016
  },
  {
    "filename": "train_spider.json",
    "db_id": "solvency_ii",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[products_in_events_sub0:included_in]->()\nRETURN `products_in_events_sub0`.`product_id` AS `product_id`   } AS in_collect_0\nMATCH (`products`:`products`)\nWHERE NOT `products`.`product_id` IN in_collect_0\nRETURN `products`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of products that are not in any event.",
    "evidence": "",
    "idx": 5017
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`artwork`:`artwork`)\nRETURN `artwork`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of artworks in ascending alphabetical order.",
    "evidence": "",
    "idx": 5019
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`artwork`:`artwork`)\nWHERE `artwork`.`type` <> 'Program Talent Show'\nRETURN `artwork`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of artworks whose type is not \"Program Talent Show\".",
    "evidence": "",
    "idx": 5020
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`festival_detail`:`festival_detail`)\nORDER BY `festival_detail`.`year` IS NULL ASC, `festival_detail`.`year` DESC \nRETURN `festival_detail`.`festival_name` AS `festival_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of the three most recent festivals.",
    "evidence": "",
    "idx": 5026
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`t2`:`artwork`)-[t1:nominated_at]->(`t3`:`festival_detail`)\nWHERE `t1`.`artwork_id` = `t2`.`artwork_id`\nAND `t1`.`festival_id` = `t3`.`festival_id`\nRETURN `t2`.`name` AS `name`, `t3`.`festival_name` AS `festival_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each nomination, show the name of the artwork and name of the festival where it is nominated.",
    "evidence": "",
    "idx": 5027
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`t2`:`artwork`)-[t1:nominated_at]->(`t3`:`festival_detail`)\nWHERE `t1`.`artwork_id` = `t2`.`artwork_id`\nAND `t1`.`festival_id` = `t3`.`festival_id`\nAND (`t3`.`year` = 2007)\nRETURN DISTINCT `t2`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show distinct types of artworks that are nominated in festivals in 2007.",
    "evidence": "",
    "idx": 5028
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`t2`:`artwork`)-[t1:nominated_at]->(`t3`:`festival_detail`)\nWHERE `t1`.`artwork_id` = `t2`.`artwork_id`\nAND `t1`.`festival_id` = `t3`.`festival_id`\nORDER BY `t3`.`year` IS NULL DESC, `t3`.`year`  \nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of artworks in ascending order of the year they are nominated in.",
    "evidence": "",
    "idx": 5029
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`t2`:`artwork`)-[t1:nominated_at]->(`t3`:`festival_detail`)\nWHERE `t1`.`artwork_id` = `t2`.`artwork_id`\nAND `t1`.`festival_id` = `t3`.`festival_id`\nAND (`t2`.`type` = 'Program Talent Show')\nRETURN `t3`.`festival_name` AS `festival_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of festivals that have nominated artworks of type \"Program Talent Show\".",
    "evidence": "",
    "idx": 5030
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`artwork`:`artwork`)\nWITH `artwork`.`type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show different types of artworks with the corresponding number of artworks of each type.",
    "evidence": "",
    "idx": 5031
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`festival_detail`:`festival_detail`)\nWITH `festival_detail`.`year` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the year in which there are more than one festivals.",
    "evidence": "",
    "idx": 5032
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[nomination_sub0:nominated_at]->()\nRETURN `nomination_sub0`.`artwork_id` AS `artwork_id`   } AS in_collect_0\nMATCH (`artwork`:`artwork`)\nWHERE NOT `artwork`.`artwork_id` IN in_collect_0\nRETURN `artwork`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of artworks that are not nominated.",
    "evidence": "",
    "idx": 5033
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`festival_detail`:`festival_detail`)\nWHERE `festival_detail`.`year` = 2008 OR `festival_detail`.`year` = 2010\nRETURN `festival_detail`.`num_of_audience` AS `num_of_audience`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of audience in year 2008 or 2010.",
    "evidence": "",
    "idx": 5034
  },
  {
    "filename": "train_spider.json",
    "db_id": "entertainment_awards",
    "gql_statement": "MATCH (`festival_detail`:`festival_detail`)\nRETURN sum(`festival_detail`.`num_of_audience`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total number of the audiences who visited any of the festivals?",
    "evidence": "",
    "idx": 5035
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_campaigns_ecommerce",
    "gql_statement": "MATCH (`premises`:`premises`)\nRETURN `premises`.`premises_type` AS `premises_type`, `premises`.`premise_details` AS `premise_details` ORDER BY `premises_type` IS NULL DESC, `premises_type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the types and details for all premises and order by the premise type.",
    "evidence": "",
    "idx": 5038
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_campaigns_ecommerce",
    "gql_statement": "MATCH (`premises`:`premises`)\nWITH `premises`.`premises_type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `premises_type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show each premise type and the number of premises in that type.",
    "evidence": "",
    "idx": 5039
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_campaigns_ecommerce",
    "gql_statement": "MATCH (`mailshot_campaigns`:`mailshot_campaigns`)\nWITH `mailshot_campaigns`.`product_category` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `product_category`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all distinct product categories along with the number of mailshots in each category.",
    "evidence": "",
    "idx": 5040
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_campaigns_ecommerce",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[mailshot_customers_sub0:targets_customer]->()\nRETURN `mailshot_customers_sub0`.`customer_id` AS `customer_id`   } AS in_collect_0\nMATCH (`customers`:`customers`)\nWHERE NOT `customers`.`customer_id` IN in_collect_0\nRETURN `customers`.`customer_name` AS `customer_name`, `customers`.`customer_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and phone of the customer without any mailshot.",
    "evidence": "",
    "idx": 5041
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_campaigns_ecommerce",
    "gql_statement": "MATCH (`customer_orders`:`customer_orders`)\nWHERE `customer_orders`.`order_status_code` = 'Cancelled' OR `customer_orders`.`order_status_code` = 'Paid'\nRETURN `customer_orders`.`order_shipping_charges` AS `order_shipping_charges`, `customer_orders`.`customer_id` AS `customer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the shipping charge and customer id for customer orders with order status Cancelled or Paid.",
    "evidence": "",
    "idx": 5046
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_campaigns_ecommerce",
    "gql_statement": "MATCH (`t2`:`customer_orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`shipping_method_code` = 'FedEx' AND `t2`.`order_status_code` = 'Paid')\nRETURN `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of customers having an order with shipping method FedEx and order status Paid.",
    "evidence": "",
    "idx": 5047
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`course`:`course`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of courses.",
    "evidence": "",
    "idx": 5049
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`course`:`course`)\nWHERE `course`.`credits` > 2\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of courses with more than 2 credits.",
    "evidence": "",
    "idx": 5051
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`department`:`department`)\nWHERE `department`.`division` = 'AS'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of departments in Division \"AS\"?",
    "evidence": "",
    "idx": 5056
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`department`:`department`)\nWHERE `department`.`room` = 268\nRETURN `department`.`dphone` AS `dphone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the phones for departments in room 268.",
    "evidence": "",
    "idx": 5059
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`gradeconversion`:`gradeconversion`)\nRETURN MAX(`gradeconversion`.`gradepoint`) AS `_col_0`, min(`gradeconversion`.`gradepoint`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the max and min grade point for all letter grade.",
    "evidence": "",
    "idx": 5062
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`fname` =~ '(?i)(?s).*a.*'\nRETURN DISTINCT `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of students whose first names contain letter \"a\".",
    "evidence": "",
    "idx": 5064
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`sex` = 'M' AND `faculty`.`building` = 'NEB'\nRETURN `faculty`.`fname` AS `fname`, `faculty`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names and last names of male (sex is M) faculties who live in building NEB.",
    "evidence": "",
    "idx": 5066
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`rank` = 'Professor' AND `faculty`.`building` = 'NEB'\nRETURN `faculty`.`room` AS `room`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the rooms of faculties with rank professor who live in building NEB.",
    "evidence": "",
    "idx": 5068
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`department`:`department`)\nWHERE `department`.`building` = 'Mergenthaler'\nRETURN `department`.`dname` AS `dname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the department name that is in Building \"Mergenthaler\".",
    "evidence": "",
    "idx": 5070
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`course`:`course`)\nRETURN `course`.`cid` AS `cid`, `course`.`cname` AS `cname`, `course`.`credits` AS `credits`, `course`.`instructor` AS `instructor`, `course`.`days` AS `days`, `course`.`hours` AS `hours`, `course`.`dno` AS `dno` ORDER BY `course`.`credits` IS NULL DESC, `course`.`credits`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all information about courses sorted by credits in the ascending order.",
    "evidence": "",
    "idx": 5072
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`course`:`course`)\nRETURN `course`.`cid` AS `cid`, `course`.`cname` AS `cname`, `course`.`credits` AS `credits`, `course`.`instructor` AS `instructor`, `course`.`days` AS `days`, `course`.`hours` AS `hours`, `course`.`dno` AS `dno` ORDER BY `course`.`credits` IS NULL DESC, `course`.`credits`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information about courses, ordered by credits ascending?",
    "evidence": "",
    "idx": 5073
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`course`:`course`)\nORDER BY `course`.`credits` IS NULL DESC, `course`.`credits`  \nRETURN `course`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the course name of courses sorted by credits.",
    "evidence": "",
    "idx": 5074
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`student`:`student`)\nORDER BY `student`.`age` IS NULL ASC, `student`.`age` DESC \nRETURN `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name of students in the descending order of age.",
    "evidence": "",
    "idx": 5076
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`sex` = 'F'\nORDER BY `student`.`age` IS NULL ASC, `student`.`age` DESC \nRETURN `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last name of female (sex is F) students in the descending order of age.",
    "evidence": "",
    "idx": 5078
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`building` = 'Barton'\nRETURN `faculty`.`lname` AS `lname` ORDER BY `lname` IS NULL DESC, `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of faculties in building Barton in alphabetic order.",
    "evidence": "",
    "idx": 5080
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`faculty`:`faculty`)\nWHERE `faculty`.`rank` = 'Professor'\nRETURN `faculty`.`fname` AS `fname` ORDER BY `fname` IS NULL DESC, `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of faculties of rank Professor in alphabetic order.",
    "evidence": "",
    "idx": 5082
  }
]