[
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN `employee`.`name` AS `name`, `employee`.`salary` AS `salary` ORDER BY `salary` IS NULL DESC, `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show name and salary for all employees sorted by salary.",
    "evidence": "",
    "idx": 1664
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`salary` > 100000\nRETURN `employee`.`eid` AS `eid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show ids for all employees with at least 100000 salary.",
    "evidence": "",
    "idx": 1666
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN avg(`employee`.`salary`) AS `_col_0`, MAX(`employee`.`salary`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is average and maximum salary of all employees.",
    "evidence": "",
    "idx": 1672
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN avg(`employee`.`salary`) AS `_col_0`, MAX(`employee`.`salary`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average and largest salary of all employees?",
    "evidence": "",
    "idx": 1673
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nORDER BY `employee`.`salary` IS NULL ASC, `employee`.`salary` DESC \nRETURN `employee`.`eid` AS `eid`, `employee`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the id and name of the employee with maximum salary.",
    "evidence": "",
    "idx": 1674
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nORDER BY `employee`.`salary` IS NULL DESC, `employee`.`salary`  \nRETURN `employee`.`name` AS `name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of employees with three lowest salaries.",
    "evidence": "",
    "idx": 1676
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "CALL(*) {\nMATCH (`employee_sub0`:`employee`)\nRETURN avg(`employee_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`employee`:`employee`)\nWHERE `employee`.`salary` > `_col_0`\nRETURN `employee`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names for all employees with salary more than the average.",
    "evidence": "",
    "idx": 1678
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`name` = 'Mark Young'\nRETURN `employee`.`eid` AS `eid`, `employee`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the id and salary of Mark Young.",
    "evidence": "",
    "idx": 1680
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nRETURN `flight`.`flno` AS `flno`, `flight`.`origin` AS `origin`, `flight`.`destination` AS `destination` ORDER BY `origin` IS NULL DESC, `origin`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show flight number, origin, destination of all flights in the alphabetical order of the departure cities.",
    "evidence": "",
    "idx": 1684
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWHERE `flight`.`origin` = 'Los Angeles'\nRETURN `flight`.`flno` AS `flno`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all flight number from Los Angeles.",
    "evidence": "",
    "idx": 1686
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWHERE `flight`.`destination` = 'Honolulu'\nRETURN `flight`.`origin` AS `origin`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show origins of all flights with destination Honolulu.",
    "evidence": "",
    "idx": 1688
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWHERE `flight`.`origin` = 'Los Angeles' AND `flight`.`destination` = 'Honolulu'\nRETURN `flight`.`departure_date` AS `departure_date`, `flight`.`arrival_date` AS `arrival_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show me the departure date and arrival date for all flights from Los Angeles to Honolulu.",
    "evidence": "",
    "idx": 1690
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWHERE `flight`.`distance` > 2000\nRETURN `flight`.`flno` AS `flno`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show flight number for all flights with more than 2000 distance.",
    "evidence": "",
    "idx": 1692
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWHERE `flight`.`origin` = 'Los Angeles' AND `flight`.`destination` = 'Honolulu'\nRETURN avg(`flight`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average price for flights from Los Angeles to Honolulu.",
    "evidence": "",
    "idx": 1694
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWHERE `flight`.`price` > 300\nRETURN `flight`.`origin` AS `origin`, `flight`.`destination` AS `destination`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show origin and destination for flights with price higher than 300.",
    "evidence": "",
    "idx": 1696
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nORDER BY `flight`.`price` IS NULL ASC, `flight`.`price` DESC \nRETURN `flight`.`flno` AS `flno`, `flight`.`distance` AS `distance`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the flight number and distance of the flight with maximum price.",
    "evidence": "",
    "idx": 1698
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nORDER BY `flight`.`distance` IS NULL DESC, `flight`.`distance`  \nRETURN `flight`.`flno` AS `flno`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the flight number of flights with three lowest distances.",
    "evidence": "",
    "idx": 1700
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWHERE `flight`.`origin` = 'Los Angeles'\nRETURN avg(`flight`.`distance`) AS `_col_0`, avg(`flight`.`price`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average distance and average price for flights from Los Angeles.",
    "evidence": "",
    "idx": 1702
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWHERE `flight`.`origin` = 'Los Angeles'\nRETURN avg(`flight`.`distance`) AS `_col_0`, avg(`flight`.`price`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average distance and price for all flights from LA?",
    "evidence": "",
    "idx": 1703
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWITH `flight`.`origin` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `origin`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all origins and the number of flights from each origin.",
    "evidence": "",
    "idx": 1704
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`flight`:`flight`)\nWITH `flight`.`destination` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `destination`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all destinations and the number of flights to each destination.",
    "evidence": "",
    "idx": 1706
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`t1`:`flight`)-[operated_by_0:operated_by]->(`t2`:`aircraft`)\nWHERE `t1`.`aid` = `t2`.`aid`\nAND (`t1`.`flno` = 99)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the aircraft name for the flight with number 99",
    "evidence": "",
    "idx": 1708
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`t1`:`flight`)-[operated_by_0:operated_by]->(`t2`:`aircraft`)\nWHERE `t1`.`aid` = `t2`.`aid`\nAND (`t2`.`name` = 'Airbus A340-300')\nRETURN `t1`.`flno` AS `flno`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all flight numbers with aircraft Airbus A340-300.",
    "evidence": "",
    "idx": 1710
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`t1`:`employee`)-[t2:certified_to_fly]->(`t3`:`aircraft`)\nWHERE `t1`.`eid` = `t2`.`eid`\nAND `t3`.`aid` = `t2`.`aid`\nAND (`t1`.`name` = 'John Williams')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names for all aircrafts of which John Williams has certificates.",
    "evidence": "",
    "idx": 1714
  },
  {
    "filename": "train_spider.json",
    "db_id": "flight_1",
    "gql_statement": "MATCH (`t1`:`employee`)-[t2:certified_to_fly]->(`t3`:`aircraft`)\nWHERE `t1`.`eid` = `t2`.`eid`\nAND `t3`.`aid` = `t2`.`aid`\nAND (`t3`.`name` = 'Boeing 737-800')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names for all employees who have certificate of Boeing 737-800.",
    "evidence": "",
    "idx": 1716
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`allergy_type`:`allergy_type`)\nRETURN DISTINCT `allergy_type`.`allergytype` AS `allergytype`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all allergy types.",
    "evidence": "",
    "idx": 1722
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`allergy_type`:`allergy_type`)\nRETURN `allergy_type`.`allergy` AS `allergy`, `allergy_type`.`allergytype` AS `allergytype`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all allergies and their types.",
    "evidence": "",
    "idx": 1724
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`allergy_type`:`allergy_type`)\nWHERE `allergy_type`.`allergytype` = 'food'\nRETURN DISTINCT `allergy_type`.`allergy` AS `allergy`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all allergies with type food.",
    "evidence": "",
    "idx": 1726
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`allergy_type`:`allergy_type`)\nWITH `allergy_type`.`allergytype` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `allergytype`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all allergy types and the number of allergies in each type.",
    "evidence": "",
    "idx": 1732
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show first name and last name for all students.",
    "evidence": "",
    "idx": 1736
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full names of all students",
    "evidence": "",
    "idx": 1737
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN DISTINCT `student`.`major` AS `major`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all majors.",
    "evidence": "",
    "idx": 1740
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN DISTINCT `student`.`city_code` AS `city_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all cities where students live.",
    "evidence": "",
    "idx": 1742
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`sex` = 'F'\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`, `student`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show first name, last name, age for all female students. Their sex is F.",
    "evidence": "",
    "idx": 1744
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`sex` = 'M'\nRETURN `student`.`stuid` AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show student ids for all male students.",
    "evidence": "",
    "idx": 1746
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`age` > 20\nRETURN `student`.`stuid` AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all student ids who are older than 20.",
    "evidence": "",
    "idx": 1750
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`lname` = 'Kim'\nRETURN `student`.`city_code` AS `city_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which city does the student whose last name is \"Kim\" live in?",
    "evidence": "",
    "idx": 1752
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`lname` = 'Kim'\nRETURN `student`.`city_code` AS `city_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the city that the student whose family name is Kim lives in.",
    "evidence": "",
    "idx": 1753
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`city_code` = 'HKG' OR `student`.`city_code` = 'CHI'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the number of students living in either HKG or CHI.",
    "evidence": "",
    "idx": 1757
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN min(`student`.`age`) AS `_col_0`, avg(`student`.`age`) AS `_col_1`, MAX(`student`.`age`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the minimum, average, and maximum age of all students.",
    "evidence": "",
    "idx": 1758
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN min(`student`.`age`) AS `_col_0`, avg(`student`.`age`) AS `_col_1`, MAX(`student`.`age`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the minimum, mean, and maximum age across all students?",
    "evidence": "",
    "idx": 1759
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "CALL(*) {\nMATCH (`student_sub0`:`student`)\nRETURN min(`student_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`student`:`student`)\nWHERE `student`.`age` = `_col_0`\nRETURN `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Provide the last name of the youngest student.",
    "evidence": "",
    "idx": 1761
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "CALL(*) {\nMATCH (`student_sub0`:`student`)\nRETURN MAX(`student_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`student`:`student`)\nWHERE `student`.`age` = `_col_0`\nRETURN `student`.`stuid` AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the student id of the oldest student.",
    "evidence": "",
    "idx": 1762
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`major` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `major`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all majors and corresponding number of students.",
    "evidence": "",
    "idx": 1764
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`age` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `age`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all ages and corresponding number of students.",
    "evidence": "",
    "idx": 1766
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`sex` AS _groupby_col_0, avg(`student`.`age`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `sex`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average age for male and female students.",
    "evidence": "",
    "idx": 1768
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`sex` AS _groupby_col_0, avg(`student`.`age`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `sex`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average ages for male and female students?",
    "evidence": "",
    "idx": 1769
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`city_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `city_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all cities and corresponding number of students.",
    "evidence": "",
    "idx": 1770
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`advisor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `advisor`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all advisors and corresponding number of students.",
    "evidence": "",
    "idx": 1772
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH ()-[has_allergy:has_allergy]->()\nWHERE `has_allergy`.`allergy` = 'Cat'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students have cat allergies?",
    "evidence": "",
    "idx": 1774
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH ()-[has_allergy:has_allergy]->()\nWHERE `has_allergy`.`allergy` = 'Cat'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students are affected by cat allergies?",
    "evidence": "",
    "idx": 1775
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH ()-[has_allergy:has_allergy]->()\nWITH `has_allergy`.`stuid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the students ids of students who have more than one allergy?",
    "evidence": "",
    "idx": 1777
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`t2`:`student`)-[t1:has_allergy]->()\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t2`.`sex` = 'F' AND `t1`.`allergy` = 'Milk' OR `t1`.`allergy` = 'Eggs')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many female students have milk or egg allergies?",
    "evidence": "",
    "idx": 1778
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`t2`:`student`)-[t1:has_allergy]->()\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t2`.`sex` = 'F' AND `t1`.`allergy` = 'Milk' OR `t1`.`allergy` = 'Eggs')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students who are female are allergic to milk or eggs?",
    "evidence": "",
    "idx": 1779
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH ()-[has_allergy:has_allergy]->()\nWITH `has_allergy`.`allergy` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `allergy`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students have each different allergy?",
    "evidence": "",
    "idx": 1783
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH ()-[t1:has_allergy]->(`t2`:`allergy_type`)\nWHERE `t1`.`allergy` = `t2`.`allergy`\nWITH `t2`.`allergytype` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `allergytype`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students are affected by each allergy type?",
    "evidence": "",
    "idx": 1785
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:has_allergy]->(`t1`:`allergy_type`)\nWHERE `t1`.`allergy` = `t2`.`allergy`\nAND `t3`.`stuid` = `t2`.`stuid`\nAND (`t3`.`fname` = 'Lisa')\nRETURN `t1`.`allergy` AS `allergy`, `t1`.`allergytype` AS `allergytype` ORDER BY `t1`.`allergy` IS NULL DESC, `t1`.`allergy`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the allergies and their types that the student with first name Lisa has? And order the result by name of allergies.",
    "evidence": "",
    "idx": 1786
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1:has_allergy]->(`t2`:`allergy_type`)\nWHERE `t1`.`allergy` = `t2`.`allergy`\nAND (`t2`.`allergytype` = 'food')\nRETURN `t1`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE NOT `student`.`stuid` IN in_collect_0\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the first and last name of the students who do not have any food type allergy.",
    "evidence": "",
    "idx": 1788
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1:has_allergy]->(`t2`:`allergy_type`)\nWHERE `t1`.`allergy` = `t2`.`allergy`\nAND (`t2`.`allergytype` = 'food')\nRETURN `t1`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE NOT `student`.`stuid` IN in_collect_0\nRETURN `student`.`fname` AS `fname`, `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the full name of each student who is not allergic to any type of food.",
    "evidence": "",
    "idx": 1789
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1:has_allergy]->(`t2`:`allergy_type`)\nWHERE `t1`.`allergy` = `t2`.`allergy`\nAND (`t2`.`allergytype` = 'food')\nRETURN `t1`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE `student`.`sex` = 'M' AND `student`.`stuid` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of male (sex is 'M') students who have some food type allery.",
    "evidence": "",
    "idx": 1790
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1:has_allergy]->(`t2`:`allergy_type`)\nWHERE `t1`.`allergy` = `t2`.`allergy`\nAND (`t2`.`allergytype` = 'food')\nRETURN `t1`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE `student`.`sex` = 'M' AND `student`.`stuid` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many male students (sex is 'M') are allergic to any type of food?",
    "evidence": "",
    "idx": 1791
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:has_allergy]->()\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t2`.`allergy` = 'Milk' OR `t2`.`allergy` = 'Cat')\nRETURN DISTINCT `t1`.`fname` AS `fname`, `t1`.`city_code` AS `city_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the different first names and cities of the students who have allergy to milk or cat.",
    "evidence": "",
    "idx": 1792
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1:has_allergy]->(`t2`:`allergy_type`)\nWHERE `t1`.`allergy` = `t2`.`allergy`\nAND (`t2`.`allergytype` = 'food' OR `t2`.`allergytype` = 'animal')\nRETURN `t1`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE `student`.`age` > 18 AND NOT `student`.`stuid` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students who are older than 18 and do not have allergy to either food or animal.",
    "evidence": "",
    "idx": 1794
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1:has_allergy]->(`t2`:`allergy_type`)\nWHERE `t1`.`allergy` = `t2`.`allergy`\nAND (`t2`.`allergytype` = 'food' OR `t2`.`allergytype` = 'animal')\nRETURN `t1`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE `student`.`age` > 18 AND NOT `student`.`stuid` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students are over 18 and do not have allergy to food type or animal type?",
    "evidence": "",
    "idx": 1795
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[has_allergy:has_allergy]->()\nWHERE `has_allergy`.`allergy` = 'Soy'\nRETURN `has_allergy`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE NOT `student`.`stuid` IN in_collect_0\nRETURN `student`.`fname` AS `fname`, `student`.`major` AS `major`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name and major of the students who are not allegry to soy.",
    "evidence": "",
    "idx": 1796
  },
  {
    "filename": "train_spider.json",
    "db_id": "allergy_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[has_allergy:has_allergy]->()\nWHERE `has_allergy`.`allergy` = 'Soy'\nRETURN `has_allergy`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE NOT `student`.`stuid` IN in_collect_0\nRETURN `student`.`fname` AS `fname`, `student`.`major` AS `major`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first name and major of the students who are able to consume soy?",
    "evidence": "",
    "idx": 1797
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWITH `invoices`.`billing_country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_country`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "A list of the top 5 countries by number of invoices. List country name and number of invoices.",
    "evidence": "",
    "idx": 1798
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWITH `invoices`.`billing_country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_country`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the top 5 countries by number of invoices and how many do they have?",
    "evidence": "",
    "idx": 1799
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWITH `invoices`.`billing_country` AS _groupby_col_0, sum(`invoices`.`total`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_country`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 8",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "A list of the top 8 countries by gross/total invoice size. List country name and gross invoice size.",
    "evidence": "",
    "idx": 1800
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWITH `invoices`.`billing_country` AS _groupby_col_0, sum(`invoices`.`total`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_country`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 8",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the top 8 countries by total invoice size and what are those sizes?",
    "evidence": "",
    "idx": 1801
  },
  {
    "filename": "train_spider.json",
    "db_id": "store_1",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWITH `invoices`.`billing_country` AS _groupby_col_0, avg(`invoices`.`total`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `billing_country`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 10",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "A list of the top 10 countries by average invoice size. List country name and average invoice size.",
    "evidence": "",
    "idx": 1802
  }
]