[
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`name` =~ '(?i)(?s).*accessories .*' OR `product`.`name` =~ '(?i)(?s).*components.*'\nRETURN COUNT(`product`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the number of products if we add the products of the accessories and components categories.",
    "evidence": "",
    "idx": 5353
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeedepartmenthistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`departmentid` = 12)\nORDER BY `t2`.`startdate` IS NULL ASC, `t2`.`startdate` DESC \nRETURN `t1`.`jobtitle` AS `jobtitle`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the job title of the newest employee in department 12?",
    "evidence": "newest employee refers to MAX(StartDate)",
    "idx": 5354
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`maritalstatus` = 'S' AND `t1`.`gender` = 'M' AND `t1`.`jobtitle` =~ '(?i)(?s)Production Supervisor.*')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the first and last name of all unmarried male Production Supervisors.",
    "evidence": "unmarried refers to MaritalStatus = 'S', male refers to Gender = 'M', Production Supervisors is a job title",
    "idx": 5355
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:stored_at]->(`t1`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t1`.`name` = 'Subassembly')\nRETURN COUNT(`t1`.`locationid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products are there if we add all those located in the Subassembly category?",
    "evidence": "located in the Subassembly category refers to Name = 'Subassembly'",
    "idx": 5356
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`workorder`)-[has_scrap_reason_0:has_scrap_reason]->(`t1`:`scrapreason`)\nWHERE `t1`.`scrapreasonid` = `t2`.`scrapreasonid`\nAND (`t1`.`name` = 'Trim length too long')\nRETURN sum(`t2`.`scrappedqty`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Sum the total number of products rejected for having a trim length that is too long.",
    "evidence": "number of product rejected refers to ScrapedQty; trim length that is too long refers to scrap reason where Name = 'Trim length too long'",
    "idx": 5357
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`purchaseorderheader`)-[t2:contains]->()\nWHERE `t1`.`purchaseorderid` = `t2`.`purchaseorderid`\nAND (`t1`.`status` = 1)\nRETURN sum(`t2`.`orderqty`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total quantity of purchased product that has been prepared by employee number 257 and is in pending shipment status.",
    "evidence": "employee number 257 refers to EmployeeID = 257; pending shipment status refers to Status = 3",
    "idx": 5358
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`salesorderdetail`)\nMATCH (`t3`:`specialoffer`)-[t2:applies_to]->()\nWHERE `t1`.`specialofferid` = `t2`.`specialofferid`\nAND `t2`.`specialofferid` = `t3`.`specialofferid`\nAND (`t1`.`orderqty` > 2 AND `t1`.`unitpricediscount` = 0)\nRETURN COUNT(DISTINCT `t1`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "If we discount the products that do not have any type of offer, how many different products have been sold in an amount greater than 2 units per order?",
    "evidence": "do not have any type of offer refers to Description = 'No Discount'; sold in an amount greater than 2 refers to OrderQty>2",
    "idx": 5359
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`transactionhistory`)-[transaction_for_0:transaction_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`size` = '62' AND `t1`.`color` = 'Yellow' AND `t1`.`safetystocklevel` = 500)\nRETURN DISTINCT `t2`.`transactiontype` AS `transactiontype`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What type of transaction was made with the only yellow product, size 62 and with a minimum inventory stock of 500 units?",
    "evidence": "yellow product refers to Color = 'Yellow'; minimum inventory stock of 500 units refers to SafetyStockLevel = 500",
    "idx": 5360
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)\nMATCH (`t1`:`productsubcategory`)\nWHERE `t1`.`productsubcategoryid` = `t2`.`productsubcategoryid`\nAND (`t2`.`color` = 'Grey')\nWITH `t1`.`name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the subcategory to which the gray product with the lowest safety stock level belongs?",
    "evidence": "gray is color of product",
    "idx": 5361
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productcosthistory`)-[cost_history_for_0:cost_history_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`weightunitmeasurecode` = 'G')\nORDER BY `t1`.`weight` IS NULL ASC, `t1`.`weight` DESC \nRETURN `t2`.`enddate` AS `enddate`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the product cost end date with the highest weight in grams?",
    "evidence": "in grams refers to WeightUnitMeasureCode = 'G'",
    "idx": 5362
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`currentflag` = 1 AND `t2`.`sickleavehours` > 10)\nRETURN CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`vacationhours` > 20 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of the total products ordered were not rejected by Drill size?",
    "evidence": "rejected quantity refers to ScrappedQty; rejected by Drill size refers to Name in ('Drill size too small','Drill size too large'); percentage = DIVIDE(SUM(ScrappedQty) where Name in('Drill size too small','Drill size too large'), OrderQty)",
    "idx": 5363
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`purchaseorderheader`)-[uses_ship_method_0:uses_ship_method]->(`t1`:`shipmethod`)\nMATCH (`t2`:`purchaseorderheader`)-[t3:contains]->()\nWHERE `t1`.`shipmethodid` = `t2`.`shipmethodid`\nAND `t2`.`purchaseorderid` = `t3`.`purchaseorderid`\nRETURN CASE WHEN COUNT(`t3`.`productid`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t1`.`shipmethodid` = 5 THEN `t3`.`orderqty` ELSE 0 END)) / COUNT(`t3`.`productid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average of the total ordered quantity of products purchased whose shipping method was Cargo Transport 5.",
    "evidence": "shipping method was Cargo Transport 5 refers to Name = 'Cargo Transport 5'; average = DIVIDE(SUM(OrderQty where Name = 'Cargo Transport 5'), COUNT(ShipMethodID))",
    "idx": 5364
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`salesterritory`)\nMATCH (`t3`:`salestaxrate`)-[applies_to_0:applies_to]->(`t2`:`stateprovince`)\nWHERE `t1`.`countryregioncode` = `t2`.`countryregioncode`\nAND `t2`.`stateprovinceid` = `t3`.`stateprovinceid`\nORDER BY CASE WHEN `t1`.`saleslastyear`=0 THEN NULL ELSE (`t1`.`salesytd` - `t1`.`saleslastyear`) / `t1`.`saleslastyear` END IS NULL ASC, CASE WHEN `t1`.`saleslastyear`=0 THEN NULL ELSE (`t1`.`salesytd` - `t1`.`saleslastyear`) / `t1`.`saleslastyear` END DESC \nRETURN `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of the rates that apply to the provinces that are in the territory that obtained the greatest increase in sales with respect to the previous year.",
    "evidence": "sales of previous year refers to SalesLastYear; SalesYTD refers to year to date sales; increase in sales = DIVIDE(SUBTRACT(SalesYTD, SalesLastYear), SalesLastYear)*100",
    "idx": 5365
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employeepayhistory`:`employeepayhistory`)\nWHERE `employeepayhistory`.`rate` * `employeepayhistory`.`payfrequency` > 50\nRETURN COUNT(`employeepayhistory`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees earn their salaries on a monthly basis at an hourly rate of more than 50?",
    "evidence": "employee refers to BusinessEntityID; salaries on a monthly basis refers to PayFrequency = 1; hourly rate more than 50 refers to Rate > 50",
    "idx": 5366
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`businessentityid` = 1 AND `person`.`persontype` = 'EM'\nRETURN `person`.`firstname` AS `firstname`, `person`.`middlename` AS `middlename`, `person`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the employee of company number 1's full name?",
    "evidence": "company number 1 refers to BusinessEntityId = 1; employee refers to PersonType = 'EM'; full name refers to FirstName + MiddleName + LastName",
    "idx": 5367
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`vendor`:`vendor`)\nWHERE `vendor`.`businessentityid` = 1492\nRETURN `vendor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the supplier number 1492?",
    "evidence": "supplier number 1492 refers to BusinessEntityId = 1492; name of the supplier = name from vendor",
    "idx": 5368
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[productvendor:supplied_by]->()\nWHERE `productvendor`.`minorderqty` > 500 AND `productvendor`.`maxorderqty` < 15000\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many vendors only consented to move on with the 500 to 15000 piece order in terms of quality?",
    "evidence": "Vendor refers to BusinessEntityId; 500 to 15000 piece order refers to MinOrderQty > 500 and MaxOrderQty < 15000",
    "idx": 5369
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`department`:`department`)\nWHERE `department`.`groupname` = 'Executive General and Administration'\nRETURN `department`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the departments that are part of the Executive General and Administration group.",
    "evidence": "Department refers to Name where GroupName = 'Executive General and Administration'",
    "idx": 5370
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`persontype` = 'EM' AND `person`.`middlename` =~ '(?i)(?s)C.*'\nRETURN `person`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the family names of any employees whose middle names begin with C.",
    "evidence": "family names refers to Last name; employee refers to PersonType = 'EM'; MiddleName starts with 'C'",
    "idx": 5371
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[productvendor:supplied_by]->()\nWHERE `productvendor`.`averageleadtime` = 25\nRETURN COUNT(DISTINCT `productvendor`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many vendors are having their products ordered with an average delivery time of 25 days?",
    "evidence": "vendors refers to distinct BusinessEntityID; average delivery time of 25 days refers to AverageLeadTime = 25 and onOrderQty > 0",
    "idx": 5372
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`productcosthistory`:`productcosthistory`)\nORDER BY `productcosthistory`.`standardcost` IS NULL DESC, `productcosthistory`.`standardcost`  \nRETURN `productcosthistory`.`productid` AS `productid`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any 3 product numbers with the lowest standard cost.",
    "evidence": "product number = productID",
    "idx": 5373
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`finishedgoodsflag` = 0 AND `product`.`color` = 'Black'\nRETURN COUNT(`product`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many black-colored products are there that cannot be sold?",
    "evidence": "cannot be sold means product is not a salable item which refers to FinishedGoodsFlag = 0",
    "idx": 5374
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employee`:`employee`)\nORDER BY `employee`.`sickleavehours` IS NULL ASC, `employee`.`sickleavehours` DESC \nRETURN `employee`.`jobtitle` AS `jobtitle`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the top three employees with the most unused sick leave along with their position titles.",
    "evidence": "employees refers to BusinessEntityID; most unused sick leave refers to MAX(SickLeaveHours); position title refers to JobTitle",
    "idx": 5375
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`addressid` = 11906\nRETURN `address`.`addressline1` AS `addressline1`, `address`.`addressline2` AS `addressline2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full address of address number 11906?",
    "evidence": "address number refers to AddressID; full address refers to AddressLine1 + AddressLine2",
    "idx": 5376
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[productvendor:supplied_by]->()\nWHERE `productvendor`.`businessentityid` = 1580\nRETURN `productvendor`.`lastreceiptcost` - `productvendor`.`standardprice` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is business number 1580's net profit?",
    "evidence": "business number 1580 refers to BusinessEntityID = 1580; Net profit = SUBTRACT(LastReceiptCost,StandardPrice)",
    "idx": 5377
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`productid` = 740\nRETURN `product`.`listprice` - `product`.`standardcost` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the sales revenue for item number 740?",
    "evidence": "business number 1580 refers to BusinessEntityID = 1580; Net profit = SUBTRACT(LastReceiptCost,StandardPrice)",
    "idx": 5378
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`productreview`:`productreview`)\nWHERE `productreview`.`rating` = 5\nRETURN `productreview`.`reviewername` AS `reviewername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many customers gave a product the best possible rating? Please list their names.",
    "evidence": "customers' name refers to ReviewerName; best possible ratings means the highest rating = 5",
    "idx": 5379
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "CALL(*) {\nMATCH (`vendor_sub0`:`vendor`)\nRETURN `vendor_sub0`.`creditrating` AS `creditrating` ORDER BY `creditrating` IS NULL ASC, `creditrating` DESC \nLIMIT 1\n}\nMATCH (`vendor`:`vendor`)\nWHERE `vendor`.`creditrating` = `creditrating`\nRETURN `vendor`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the company that Adventure Works deal with that have poor credit rating? Please provide their business number.",
    "evidence": "poor credit rating means bad credit; CreditRating = 5; Business number refers to BusinessEntityID",
    "idx": 5380
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`businessentityid` = 18)\nRETURN `t1`.`firstname` AS `firstname`, `t2`.`birthdate` AS `birthdate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the forename and birthdate of person number 18?",
    "evidence": "person number 18 refers to BusinessEntityID = 18; forename refers to FirstName",
    "idx": 5381
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`contacttype`)\nMATCH ()-[t2:has_contact]->()\nWHERE `t1`.`contacttypeid` = `t2`.`contacttypeid`\nAND (`t2`.`businessentityid` = 332)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What job is person number 322 currently holding?",
    "evidence": "person number 322 refers to PersonID = 18; job is the name of contacttype",
    "idx": 5382
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`countryregion`)-[t2:has_currency]->(`t1`:`currency`)\nWHERE `t1`.`currencycode` = `t2`.`currencycode`\nAND `t2`.`countryregioncode` = `t3`.`countryregioncode`\nAND (`t3`.`name` = 'Brazil')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the currency of Brazil?",
    "evidence": "",
    "idx": 5383
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`department`)\nMATCH (`t2`:`employeedepartmenthistory`)\nWHERE `t1`.`departmentid` = `t2`.`departmentid`\nAND (`t1`.`name` = 'Finance')\nRETURN COUNT(`t2`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many people work in the finance department?",
    "evidence": "",
    "idx": 5384
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t1:supplied_by]->(`t2`:`vendor`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`businessentityid` = 1496)\nWITH `t1`.`averageleadtime` AS _groupby_col_0, `t2`.`name` AS _groupby_col_1\nRETURN _groupby_col_0 AS `averageleadtime`, _groupby_col_1 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How long does it take for the business to receive the item it has purchased? Who is the vendor for business number 1496?",
    "evidence": "business number refers to BusinessEntityID where BusinessEntityID = 1496; how long does it take refers to AverageLeadTime",
    "idx": 5385
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`stateprovince`)\nMATCH (`t1`:`address`)\nWHERE `t1`.`stateprovinceid` = `t2`.`stateprovinceid`\nWITH `t2`.`stateprovincecode` AS _groupby_col_0, sum(CASE WHEN `t1`.`city` = 'Bothell' THEN 1 ELSE 0 END) - sum(CASE WHEN `t1`.`city` = 'Kenmore' THEN 1 ELSE 0 END) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `stateprovincecode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many accounts are in Bothell as opposed to Kenmore? What is the name of the State that comprises these two cities?",
    "evidence": "SUBTRACT(count(city = 'Bothell'), count(city = 'Kenmore'))",
    "idx": 5386
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`culture`)\nMATCH ()-[t1:has_description_in_culture]->(`t3`:`productdescription`)\nWHERE `t1`.`cultureid` = `t2`.`cultureid`\nAND `t1`.`productdescriptionid` = `t3`.`productdescriptionid`\nAND (`t3`.`description` =~ '(?i)(?s)Chromoly steel.*' AND `t2`.`name` = 'English')\nRETURN `t1`.`productmodelid` AS `productmodelid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which chromoly steel product model has AdventureWorks saved in English?",
    "evidence": "Saved in English refers to product description written in English where Culture.name = 'English'",
    "idx": 5387
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`emailaddress`)-[belongs_to_0:belongs_to]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`persontype` = 'SP')\nRETURN `t2`.`emailaddress` AS `emailaddress`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the salespeople's email addresses?",
    "evidence": "Salespeople refers to PersonType = 'SP'",
    "idx": 5388
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`firstname` = 'Suchitra')\nRETURN `t2`.`jobtitle` AS `jobtitle`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which position does Suchitra hold?",
    "evidence": "position refers to JobTitle",
    "idx": 5389
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`persontype` = 'EM' AND `t2`.`maritalstatus` = 'S')\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees work for AdvertureWorks that is single?",
    "evidence": "Employees refer to PersonType = 'EM'; Single refers to MaritalStatus = 's'",
    "idx": 5390
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`culture`)\nMATCH ()-[t2:has_description_in_culture]->()\nWHERE `t1`.`cultureid` = `t2`.`cultureid`\nAND (`t1`.`name` = 'English' OR `t1`.`name` = 'Arabic')\nRETURN sum(CASE  WHEN `t1`.`name` = 'English' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t1`.`name` = 'Arabic' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much do the works data saved in English and Arabic differ from one another?",
    "evidence": "Data saved in English refers to the name of the language where Culture.Name = 'English'; data saved in Arabic refers to the name of the language where Culture.Name = 'Arabic';   SUBTRACT(count(Name = 'English'), count(Name = 'Bothell'))",
    "idx": 5391
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:has_address]->(`t1`:`address`)\nWHERE `t1`.`addressid` = `t2`.`addressid`\nAND (`t2`.`businessentityid` = 1)\nRETURN `t1`.`addressline1` AS `addressline1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the location of business number 1?",
    "evidence": "Location refers to AddressLine1; business number refers to the BusinessEntityID where BusinessEntityID = 1",
    "idx": 5392
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`culture`)\nMATCH ()-[t2:has_description_in_culture]->()\nWHERE `t1`.`cultureid` = `t2`.`cultureid`\nRETURN CASE WHEN COUNT(`t1`.`cultureid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`name` = 'Thai' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`cultureid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of the AdventureWorks data is in Thai?",
    "evidence": "percentage = DIVIDE(Culture.Name = 'Thai', count(ALL Culture.Name))*100%",
    "idx": 5394
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`persontype` = 'EM')\nRETURN CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`gender` = 'M' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of AdventureWorks employees are men?",
    "evidence": "male refers to Gender = 'M'; employee refers to PersonType = 'EM'; percentage = DIVIDE(COUNT(Gender = 'M'), COUNT(PersonType = 'MY'))*100%;",
    "idx": 5395
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`address`)\nMATCH (`t1`:`stateprovince`)\nWHERE `t1`.`stateprovinceid` = `t2`.`stateprovinceid`\nAND (`t2`.`addressid` = 15873)\nRETURN `t2`.`city` AS `city`, `t1`.`name` AS `name`, `t1`.`isonlystateprovinceflag` AS `isonlystateprovinceflag`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where is the address 15873 located, in what city and state? Does that city belong to a province where the code exists?",
    "evidence": "Address number 15873 refers to AddressID = '15873'; IsOnlyStateProvinceCode = '0' refers to StateProvinceCode exists; IsOnlyStateProvinceCode = '1' refers to StateProvinceCode unavailable;",
    "idx": 5396
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:has_address]->(`t1`:`address`)\nWHERE `t1`.`addressid` = `t2`.`addressid`\nAND (`t2`.`businessentityid` = 24)\nRETURN `t1`.`addressline1` AS `addressline1`, `t1`.`addressline2` AS `addressline2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full address of business number 24?",
    "evidence": "Full address refers to AddressLine1+AddressLine2; business number 24 refers to BusinessEntityID = '24'",
    "idx": 5397
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`creditcard`:`creditcard`)\nWHERE `creditcard`.`creditcardid` = 9648\nRETURN `creditcard`.`expyear` AS `expyear`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which year is credit card No.9648's Expiration Year?",
    "evidence": "Expiration year refers to ExpYear",
    "idx": 5398
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`firstname` = 'Emma' AND `person`.`lastname` = 'Harris'\nRETURN `person`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's Emma H Harris's Business Entity ID number?",
    "evidence": "",
    "idx": 5399
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE `location`.`name` = 'Debur and Polish'\nRETURN `location`.`locationid` AS `locationid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the location id for Debur and Polish?",
    "evidence": "Debur and Polish is name of manufacturing location",
    "idx": 5400
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`department`:`department`)\nWHERE `department`.`groupname` = 'Sales and Marketing'\nRETURN `department`.`departmentid` AS `departmentid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the Department ids under the Sales and Marketing Group?",
    "evidence": "Sales and Marketing is group name of a department",
    "idx": 5401
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesperson`:`salesperson`)\nWHERE `salesperson`.`saleslastyear` = '1635823.3967'\nRETURN `salesperson`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which sales person made the sale of 1635823.3967 last year? Give the Business Entity ID.",
    "evidence": "",
    "idx": 5402
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`shift`:`shift`)\nWHERE `shift`.`shiftid` = '2'\nRETURN `shift`.`starttime` AS `starttime`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the Shift start time for Shift ID No.2?",
    "evidence": "",
    "idx": 5403
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`contacttype`:`contacttype`)\nWHERE `contacttype`.`contacttypeid` = '16'\nRETURN `contacttype`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is contact Type ID No.16 represent for?",
    "evidence": "",
    "idx": 5404
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`shipmethod`:`shipmethod`)\nWHERE `shipmethod`.`name` = 'OVERSEAS - DELUXE'\nRETURN `shipmethod`.`shipbase` AS `shipbase`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the minimum shipping charge for \"OVERSEAS - DELUXE\"?",
    "evidence": "Minimum shipping charge refers to ShipBase; OVERSEAS - DELUXE is name of shipping company",
    "idx": 5405
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`culture`:`culture`)\nWHERE `culture`.`cultureid` = 'fr'\nRETURN `culture`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please tell the meaning of CultureID \"fr\".",
    "evidence": "tell the meaning is to find the name of culture",
    "idx": 5406
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`currency`:`currency`)\nWHERE `currency`.`name` = 'Mauritius Rupee'\nRETURN `currency`.`currencycode` AS `currencycode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the Mauritius Rupee's currency code.",
    "evidence": "Mauritius Rupee is name of currency",
    "idx": 5407
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`phonenumbertype`:`phonenumbertype`)\nWHERE `phonenumbertype`.`name` = 'Cell'\nRETURN `phonenumbertype`.`phonenumbertypeid` AS `phonenumbertypeid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name cellphone number's Type ID?",
    "evidence": "Cellphone refers to Name = 'Cell'",
    "idx": 5408
  }
]