[
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "MATCH (t1@`countrylanguage`)-[spoken_in_0:`spoken_in`]->(t2@`country`)\nWHERE t1.`countrycode` = t2.`code`\nAND (t1.`language` = 'Italian')\nRETURN cast (sum(CASE  WHEN t2.`governmentform` = 'Republic' THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the countries that use Italian as their language, what is the percentage of republic countries?",
    "evidence": "use Italian as their language refers to `Language` = 'Italian'; percentage = MULTIPLY(DIVIDE(SUM(`Language` = 'Italian' WHERE GovernmentForm = 'Republic'), COUNT(`Language` = 'Italian')), 100); use Italian as their language refers to `Language` = 'Italian'; republic countries refers to GovernmentForm = 'Republic';",
    "idx": 3787
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (t1@`categories`)\nMATCH (t2@`podcasts`)\nWHERE t2.`podcast_id` = t1.`podcast_id`\nAND (t2.`title` = 'SciFi Tech Talk')\nRETURN t1.`category` AS `category`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which category does the podcast titled 'SciFi Tech Talk' belong to?",
    "evidence": "podcast titled 'SciFi Tech Talk' refers to title = 'SciFi Tech Talk'",
    "idx": 3797
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (t1@`podcasts`)\nMATCH (t2@`reviews`)\nWHERE t2.`podcast_id` = t1.`podcast_id`\nAND (t1.`title` = 'LifeAfter/The Message' AND t2.`rating` <= 3)\nRETURN COUNT(t2.`rating`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many reviews does 'LifeAfter/The Message' have which were rated below 3?",
    "evidence": "LifeAfter/The Message' is the title of podcast; rated below 3 refers to rating < 3",
    "idx": 3802
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (runs@`runs`)\nWHERE like(runs.`run_at`,'2022-06-%')\nRETURN sum(runs.`reviews_added`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many total reviews runned at in June 2022 were added to the podcasts?",
    "evidence": "run at in June 2022 refers to run_at BETWEEN '2022-06-01 00:00:00' and '2022-06-30 23:59:59'; reviews refers to review_added",
    "idx": 3803
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`rating` = 3 AND reviews.`created_at` >= '2015-01-01T00:00:00-07:00' AND reviews.`created_at` <= '2015-03-31T23:59:59-07:00'\nRETURN COUNT(reviews.`podcast_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many podcast reviews with a rating of 3 were created during the first quarter of 2015?",
    "evidence": "rating of 3 refers to rating = 3; created during the first quarter of 2015 refers to created_at BETWEEN'2015-01-01T00:00:00-07:00' and '2015-03-31T23:59:59-07:00'",
    "idx": 3804
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`created_at` >= '2019-01-01T00:00:00-07:00' AND reviews.`created_at` <= '2019-12-31T23:59:59-07:00'\nRETURN avg(reviews.`rating`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average rating of all the podcasts with reviews created in 2019?",
    "evidence": "created in 2019 refers to created_at BETWEEN '2019-01-01T00:00:00' and '2019-12-31T23:59:59'; average rating  = Divide (Sum(rating), Count(podcast_id))",
    "idx": 3806
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (runs@`runs`)\nRETURN cast ((sum(CASE  WHEN like(runs.`run_at`,'2022-%') THEN runs.`reviews_added` ELSE 0 END) - sum(CASE  WHEN like(runs.`run_at`,'2021-%') THEN runs.`reviews_added` ELSE 0 END)) as float) * 100 / sum(runs.`reviews_added`) <> 0 OR False AS `percentage`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of reviews added each year of the total reviews added?",
    "evidence": "review added each year refers to runs_at like '2021%' and runs_at like '2022%'; percentage for 2021 = Divide (Sum(reviews_added(runs_at like '2021%)), Sum(reviews_added)) * 100; percentage of 2022 = Divide (Sum(reviews_added(runs_at like '2022%')), Sum(reviews_added)) * 100",
    "idx": 3807
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (t1@`podcasts`)\nMATCH (t2@`reviews`)\nWHERE t2.`podcast_id` = t1.`podcast_id`\nAND (t2.`created_at` >= '2018-08-22T11:53:16-07:00' AND t2.`created_at` <= '2018-11-20T11:14:20-07:00')\nRETURN DISTINCT t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the titles of the podcasts whose reviews were created between 2018-08-22T11:53:16-07:00 and 2018-11-20T11:14:20-07:00?",
    "evidence": "created between 2018-08-22T11:53:16-07:00 and 2018-11-20T11:14:20-07:00 refers to created at BETWEEN '2018-08-22T11:53:16-07:00' and '2018-11-20T11:14:20-07:00'",
    "idx": 3810
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (t1@`categories`)\nMATCH (t2@`reviews`)\nWHERE t2.`podcast_id` = t1.`podcast_id`\nAND (t2.`author_id` = 'EFB34EAC8E9397C')\nRETURN DISTINCT t1.`category` AS `category`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "To which categories do the podcasts of the reviewer whose id is EFB34EAC8E9397C belong?",
    "evidence": "reviewer whose id is EFB34EAC8E9397C refers to author_id = 'EFB34EAC8E9397C'",
    "idx": 3811
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "CALL {\nMATCH (podcasts_sub0@`podcasts`)\nWHERE podcasts_sub0.`title` = 'Don\\'t Lie To Your Life Coach'\nRETURN podcasts_sub0.`podcast_id` AS `podcast_id` \n}\nMATCH (reviews@`reviews`)\nWHERE reviews.`podcast_id` = podcast_id\nRETURN reviews.`created_at` AS `created_at`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What dates were the Don't Lie To Your Life Coach podcast reviews created?",
    "evidence": "\"Don't Lie To Your Life Coach\" refers to title of podcast; date refers to created_at",
    "idx": 3813
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (t1@`categories`)\nMATCH (t2@`reviews`)\nWHERE t2.`podcast_id` = t1.`podcast_id`\nAND (t1.`category` = 'arts')\nRETURN avg(t2.`rating`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average rating of all the podcasts in category art?",
    "evidence": "category art refers to category = 'arts'; average rating = Divide (Sum (rating), Count (podcast_id))",
    "idx": 3817
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (t1@`categories`)\nMATCH (t2@`reviews`)\nWHERE t2.`podcast_id` = t1.`podcast_id`\nAND (t1.`category` = 'comedy')\nRETURN avg(t2.`rating`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average rating of podcasts in comedy category?",
    "evidence": "comedy category refers to category = 'comedy'; average rating = Divide (Sum(rating), Count(podcast_id))",
    "idx": 3822
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (reviews@`reviews`)\nORDER BY char_length(reviews.`content`) DESC NULLS LAST \nRETURN reviews.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the longest review?",
    "evidence": "review refers to content; longest review refers to Max(content)",
    "idx": 3823
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (t1@`categories`)\nMATCH (t2@`podcasts`)\nWHERE t2.`podcast_id` = t1.`podcast_id`\nAND (t1.`category` = 'music')\nORDER BY char_length(t2.`title`) DESC NULLS LAST \nRETURN t2.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which \"music\" podcast has the longest title?",
    "evidence": "music podcasts refers to category = 'music'; longest title refers to title = Max(length(title))",
    "idx": 3825
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`title` = 'really interesting!' AND reviews.`created_at` = '2018-04-24T12:05:16-07:00'\nRETURN reviews.`content` AS `content`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the content of the review under the title \"really interesting!\" and is created on 2018-04-24 at 12:05:16?",
    "evidence": "\"really interesting\" is the title of review;  created on 2018-04-24 at 12:05:16 refers to created_at = '2018-04-24T12:05:16-07:00'",
    "idx": 3834
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (t1@`podcasts`)\nMATCH (t2@`reviews`)\nWHERE t2.`podcast_id` = t1.`podcast_id`\nAND (t1.`title` = 'Please Excuse My Dead Aunt Sally' AND like(t2.`created_at`,'2019-%'))\nRETURN COUNT(t2.`created_at`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the reviews for the podcast \"Please Excuse My Dead Aunt Sally\", how many of them are made in the year 2019?",
    "evidence": "\"Please Excuse My Dead Aunt Sally\" is the title of podcast; made in the year 2019 refers to created_at like '2019%'",
    "idx": 3838
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`num_students` > 80000 AND university_year.`year` = 2011\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many universities have at least 80,000 students in the year 2011?",
    "evidence": "have at least 80,000 students refers to num_students > 8000; year = 2011",
    "idx": 3842
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (ranking_criteria@`ranking_criteria`)\nWHERE ranking_criteria.`criteria_name` = 'Award'\nRETURN ranking_criteria.`ranking_system_id` AS `ranking_system_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ranking system ID of the award criteria?",
    "evidence": "award criteria refers to criteria_name = 'Award';",
    "idx": 3843
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university@`university`)\nWHERE like(university.`university_name`,'%State%')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many state universities are there?",
    "evidence": "state universities refers to university_name LIKE '%State%';",
    "idx": 3844
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "CALL {\nMATCH (university_year_sub0@`university_year`)\nRETURN MAX(university_year_sub0.`student_staff_ratio`) AS `_col_0_1` \n}\nMATCH (university_year@`university_year`)\nWHERE university_year.`student_staff_ratio` = _col_0_1\nRETURN MAX(university_year.`student_staff_ratio`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the student staff ratio of the university with the highest student staff ratio of all time?",
    "evidence": "highest student staff ratio refers to max(student_staff_ratio)",
    "idx": 3845
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (ranking_criteria@`ranking_criteria`)\nWHERE ranking_criteria.`ranking_system_id` = 3\nRETURN COUNT(ranking_criteria.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many criteria belong to ranking system ID 3?",
    "evidence": "",
    "idx": 3846
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`pct_international_students` = 1 AND university_year.`year` >= 2011 AND university_year.`year` <= 2015\nRETURN university_year.`university_id` AS `university_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ID of the university that has only 1% of international students between 2011 to 2015?",
    "evidence": "has only 1% of international students refers to pct_international_students = 1; between 2011 to 2015 refers to year BETWEEN 2011 AND 2015; ID of university refers to university_id",
    "idx": 3847
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nORDER BY t1.`pct_international_students` DESC NULLS LAST \nRETURN t2.`university_name` AS `university_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the university that had the highest number of international students for 6 consecutive years?",
    "evidence": "had the highest number of international students refers to max(pct_international_students); for 6 consecutive years refers to count(SUBTRACT(year, rm)) > = 6; name of university refers to university_name;",
    "idx": 3848
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nMATCH (t3@`university`)-[t2:`has_ranking_1`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND t3.`id` = t2.`university_id`\nAND (t1.`criteria_name` = 'Publications Rank' AND t2.`year` = 2014 AND t1.`id` = 17)\nORDER BY t2.`score` DESC NULLS LAST \nRETURN t3.`university_name` AS `university_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In 2014, what is the name of the university which was considered a leader in the publications rank?",
    "evidence": "In 2014 refers to year = 2014; leader refers to MAX(score); in the publications rank refers to criteria_name = 'Publications Rank'; name of university refers to university_name;",
    "idx": 3849
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nORDER BY t1.`num_students`  NULLS FIRST \nRETURN t2.`university_name` AS `university_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the university that has the lowest number of students of all time?",
    "evidence": "has the lowest number of students refers to min(num_students); name of the university refers to university_name",
    "idx": 3850
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`country_id` = t2.`id`\nAND (t2.`country_name` = 'United States of America')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many universities are there in the United States of America?",
    "evidence": "in the United States of America refers to country_name = 'United States of America';",
    "idx": 3851
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND (t1.`criteria_name` = 'Award' AND t2.`year` >= 2005 AND t2.`year` <= 2015 AND t2.`score` = 0)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many universities scored 0 in Awards between 2005 to 2015?",
    "evidence": "between 2005 to 2015 refers to year BETWEEN 2005 AND 2015; scored 0 refers to score = 0; in Awards refers to criteria_name = 'Award'",
    "idx": 3852
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`country_id` = t2.`id`\nAND (t1.`university_name` = 'University of Oxford')\nRETURN t2.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country is the University of Oxford located?",
    "evidence": "University of Oxford refers to university_name = 'University of Oxford'; which country refers to country_name",
    "idx": 3853
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nMATCH (t3@`university`)-[t2:`has_ranking_1`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND t3.`id` = t2.`university_id`\nAND (t3.`university_name` = 'Yale University' AND t2.`score` >= 10 AND t1.`criteria_name` = 'Quality of Education Rank')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times did the Yale University achieve a score of no less than 10 in the Quality of Education Rank?",
    "evidence": "Yale University refers to university_name = 'Yale University'; a score of no less than 10 refers to score > = 10; in the Quality of Education Rank refers to criteria_name = 'Quality of Education Rank'",
    "idx": 3854
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`ranking_criteria`)-[belongs_to_system_0:`belongs_to_system`]->(t1@`ranking_system`)\nWHERE t1.`id` = t2.`ranking_system_id`\nAND (t1.`system_name` = 'Center for World University Rankings')\nRETURN t2.`criteria_name` AS `criteria_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the criteria under Center for World University Rankings?",
    "evidence": "names of the criteria refers to criteria_name; under Center for World University Rankings refers to system_name = 'Center for World University Rankings';",
    "idx": 3855
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`university_year`)-[for_university_0:`for_university`]->(t1@`university`)-[located_in_0:`located_in`]->(t3@`country`)\nWHERE t1.`id` = t2.`university_id`\nAND t3.`id` = t1.`country_id`\nAND (t2.`pct_international_students` > 50 AND t2.`year` >= 2011 AND t2.`year` <= 2016)\nRETURN DISTINCT t3.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Between 2011 to 2016, in which countries can you find the universities where at least 50% of its students are international students?",
    "evidence": "Between 2011 to 2016 refers to year BETWEEN 2011 AND 2016; at least 50% of its students are international students refers to pct_international_students > 50; which country refers to country_name",
    "idx": 3857
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nORDER BY (cast (t1.`num_students` * t1.`pct_international_students` as float) / 100) DESC NULLS LAST \nRETURN DISTINCT t2.`university_name` AS `university_name` \nLIMIT 5",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the top 5 universities with the highest number of international students?",
    "evidence": "highest number of international students refers to MAX(DIVIDE(MULTIPLY(num_students, pct_international_students), 100)); name of university refers to university_name;",
    "idx": 3859
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nORDER BY university_year.`student_staff_ratio` DESC NULLS LAST \nRETURN university_year.`university_id` AS `university_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the university ID of the university with the largest student staff ratio?",
    "evidence": "the largest student staff ratio refers to max(student_staff_ratio)",
    "idx": 3860
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university@`university`)\nWHERE university.`university_name` = 'Harvard University'\nRETURN university.`id` AS `id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the university ID of Harvard University?",
    "evidence": "of Harvard University refers to university_name = 'Harvard University';",
    "idx": 3864
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t2.`university_name` = 'Harvard University' AND t1.`year` = 2012)\nRETURN t1.`student_staff_ratio` AS `student_staff_ratio`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the student staff ratio of Harvard University in 2012?",
    "evidence": "Harvard University refers to university_name = 'Harvard University'; in 2012 refers to year = 2012",
    "idx": 3867
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH ()-[t1:`has_ranking_2`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t2.`university_name` = 'Brown University' AND t1.`year` = 2014)\nRETURN t1.`ranking_criteria_id` AS `ranking_criteria_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ranking criteria ID of Brown University in 2014?",
    "evidence": "Brown University refers to university_name = 'Brown University'; in 2014 refers to year = 2014",
    "idx": 3870
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND (t2.`university_id` = 32 AND t2.`year` = 2015)\nRETURN t1.`criteria_name` AS `criteria_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the criteria name of the university ID 32 in 2015?",
    "evidence": "in 2015 refers to year = 2015",
    "idx": 3872
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2014)\nORDER BY t1.`num_students` DESC NULLS LAST \nRETURN t2.`country_id` AS `country_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which country does the most populated university in 2014 located ?",
    "evidence": "the most populated university refers to max(num_students); in 2014 refers to year = 2014",
    "idx": 3874
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)\nMATCH ()-[t2:`has_ranking_1`]->()\nWHERE t1.`university_id` = t2.`university_id`\nAND (t2.`score` = 98 AND t1.`year` = 2013)\nRETURN sum(t1.`num_students`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the student population of the university that scored 98 in 2013?",
    "evidence": "student population refers to num_students; in 2013 refers to year = 2013",
    "idx": 3876
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)\nMATCH ()-[t2:`has_ranking_1`]->()\nWHERE t1.`university_id` = t2.`university_id`\nAND (t2.`score` < 80 AND t1.`year` = 2015)\nRETURN sum(cast (t1.`num_students` * t1.`pct_international_students` as float) / 100) / COUNT(*) * 100 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among universities that score below 80 in 2015, what is the percentage of international students?",
    "evidence": "score below 80 refers to score < 80; in 2015 refers to year 2015; percentage of international students refers to DIVIDE(SUM(DIVIDE(MULTIPLY(num_students, pct_international_students), 100)), SUM(num_students))",
    "idx": 3879
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`year` = 2011\nRETURN sum(university_year.`num_students`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students attended universities were there in 2011?",
    "evidence": "in 2011 refers to year = 2011;",
    "idx": 3880
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`year` = 2011\nRETURN sum(cast (university_year.`num_students` * university_year.`pct_female_students` as float) / 100) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all universities, how many female students were there in 2011?",
    "evidence": "in 2011 refers to year = 2011; female students refers to SUM(DIVIDE(MULTIPLY(num_students, pct_female_students), 100))",
    "idx": 3881
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nORDER BY university_year.`student_staff_ratio` DESC NULLS LAST \nRETURN MAX(university_year.`student_staff_ratio`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the student staff ratio at the university with the greatest student staff ratio of all time?",
    "evidence": "greatest student staff ratio of all time refers to max(student_staff_ratio)",
    "idx": 3882
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`year` = 2011\nORDER BY university_year.`num_students` DESC NULLS LAST \nRETURN university_year.`university_id` AS `university_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the university ID with the most students in 2011?",
    "evidence": "most students refers to MAX(num_students), in 2011 refers to year = 2011",
    "idx": 3883
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`year` = 2011 AND university_year.`num_students` > 50000 AND university_year.`pct_international_students` > 10\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many institutions with over 50,000 students in 2011 had a percentage of oversea students of more than 10%?",
    "evidence": "institutions with over 50,000 students refers to num_students > 50000; in 2011 refers to year = 2011; percentage of oversea students of more than 10% refers to pct_international_students > 10;",
    "idx": 3884
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH ()-[t1:`has_ranking_2`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2012)\nORDER BY t1.`score` DESC NULLS LAST \nRETURN t2.`university_name` AS `university_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which university had the highest reputation in 2012?",
    "evidence": "had the highest reputation refers to MAX(score), in 2012 refers to year = 2012; which university refers to university_name;",
    "idx": 3886
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2011 AND t2.`university_name` = 'Harvard University')\nRETURN t1.`pct_international_students` AS `pct_international_students`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of Harvard university's international students in 2011?",
    "evidence": "Harvard university's refers to university_name = 'Harvard University'; in 2011 refers to year = 2011; percentage of Harvard university's international students refers to pct_international_students",
    "idx": 3889
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2011 AND t2.`university_name` = 'Stanford University')\nRETURN cast (t1.`num_students` * t1.`pct_female_students` as float) / 100 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female students were there at Stanford University in 2011?",
    "evidence": "in 2011 refers to year 2011; female students refers to DIVIDE(MULTIPLY(pct_female_students, num_students), 100); Stanford University refers to university_name = 'Stanford University';",
    "idx": 3890
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`country_id` = t2.`id`\nAND (t1.`university_name` = 'Harvard University')\nRETURN t2.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which nation is Harvard University located?",
    "evidence": "Harvard University refers to university_name = 'Harvard University'; nation refers to country_name",
    "idx": 3891
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`ranking_criteria`)-[belongs_to_system_0:`belongs_to_system`]->(t1@`ranking_system`)\nWHERE t1.`id` = t2.`ranking_system_id`\nAND (t2.`criteria_name` = 'Teaching')\nRETURN t1.`system_name` AS `system_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the ranking system for Teaching criteria?",
    "evidence": "Teaching criteria refers to criteria_name = 'Teaching'; name of the ranking system refers to system_name",
    "idx": 3892
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`country_id` = t2.`id`\nAND (t2.`country_name` = 'Argentina')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In Argentina, how many universities are there?",
    "evidence": "In Argentina refers to country_name = 'Argentina';",
    "idx": 3893
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2011 AND t1.`num_students` > 100000)\nRETURN t2.`university_name` AS `university_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which universities have more than 100,000 students in 2011?",
    "evidence": "in 2011 refers to year 2011; more than 100,000 students refers to num_students > 100000; which university refers to university_name;",
    "idx": 3894
  }
]