[
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`playerinfo`)-[has_height_0:`has_height`]->(t1@`height_info`)\nWHERE t1.`height_id` = t2.`height`\nAND (t2.`overallby` = 'Arizona Coyotes' AND t1.`height_in_cm` = 195)\nRETURN COUNT(t2.`eliteid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many players were drafted by Arizona Coyotes whose height reaches 195 centimeters?",
    "evidence": "drafted by Arizona Coyotes refers to overallby = 'Arizona Coyotes'; height reaches 195 centimeters refers to height_in_cm = 195;",
    "idx": 3561
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`season` = '2000-2001' AND t1.`league` = 'International')\nORDER BY t1.`p` DESC NULLS LAST \nRETURN DISTINCT t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the most valuable player who played in the 2000-2001 season of the International league?",
    "evidence": "most valuable player refers to MAX(P); 2000-2001 season refers to SEASON = '2000-2001'; International league refers to LEAGUE = 'International';",
    "idx": 3563
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`season` = '2000-2001' AND t1.`league` = 'International')\nORDER BY t1.`gp` DESC NULLS LAST \nRETURN DISTINCT t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who has played the most game plays in the 2000-2001 season of the International league?",
    "evidence": "played the most game plays refers to MAX(GP); 2000-2001 season refers to SEASON = '2000-2001'; International league refers to LEAGUE = 'International';",
    "idx": 3564
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`season` = '2000-2001' AND t1.`gametype` = 'Regular Season' AND t1.`team` = 'Avangard Omsk')\nORDER BY t2.`birthdate`  NULLS FIRST \nRETURN t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the oldest player who played for Avangard Omsk during the regular season in 2000-2001?",
    "evidence": "oldest player refers to MIN(birthdate); Avangard Omsk refers to TEAM = 'Avangard Omsk'; regular season refers to GAMETYPE = 'Regular Season'; 2000-2001 season refers to SEASON = '2000-2001';\n",
    "idx": 3566
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t2@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`season` = '2007-2008' AND t1.`league` = 'OHL' AND t1.`gametype` = 'Regular Season')\nORDER BY t1.`a` DESC NULLS LAST \nRETURN t2.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players who played in OHL league during the regular season in 2007-2008, who is the player that attained the most number of assist?",
    "evidence": "OHL league refers to LEAGUE = 'OHL'; who refers to PlayerName; regular season refers to GAMETYPE = 'Regular Season'; most number of assist refers to MAX(A); 2007-2008 season refers to SEASON = '2007-2008';",
    "idx": 3567
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t3@`weight_info`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND t1.`weight` = t3.`weight_id`\nAND (t1.`overallby` = 'Arizona Coyotes')\nORDER BY t3.`weight_in_lbs` DESC NULLS LAST \nRETURN COUNT(t2.`team`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many teams did the heaviest player drafted by Arizona Coyotes have played for?",
    "evidence": "heaviest player refers to MAX(weight_in_lb); drafted by Arizona Coyotes refers to overallby = 'Arizona Coyotes';",
    "idx": 3568
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t1@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t2.`season` = '1997-1998' AND t1.`playername` = 'Pavel Patera')\nRETURN t2.`gp` AS `gp`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games did Per Mars play in the 1997-1998 season?",
    "evidence": "1997-1998 season refers to SEASON = '1997-1998';",
    "idx": 3571
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t1@`playerinfo`)-[has_weight_0:`has_weight`]->(t2@`weight_info`)\nWHERE t1.`weight` = t2.`weight_id`\nAND (t1.`playername` = 'Pavel Patera')\nRETURN t2.`weight_in_kg` AS `weight_in_kg`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How heavy is Matthias Trattnig in kilograms?",
    "evidence": "how heavy in kilograms refers to weight_in_kg;",
    "idx": 3572
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t1@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t2.`season` = '1997-1998' AND t1.`playername` = 'Niko Kapanen')\nRETURN t2.`team` AS `team`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What team did Niklas Eckerblom play in the 1997-1998 season?",
    "evidence": "1997-1998 season refers to SEASON = '1997-1998';",
    "idx": 3574
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t1@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t1.`playername` = 'Per Mars' AND t2.`gametype` = 'Playoffs')\nRETURN sum(t2.`gp`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many playoffs did Per Mars participate in?",
    "evidence": "playoffs refers to GAMETYPE = 'Playoffs';",
    "idx": 3575
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t1@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t2.`team` = 'Plymouth Whalers' AND t2.`season` = '1999-2000')\nORDER BY t2.`a` DESC NULLS LAST \nRETURN t1.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who had the most assists of team Plymouth Whalers in the 1999-2000 season?",
    "evidence": "who refers to PlayerName; most assists refers to MAX(A); team Plymouth Whalers refers to TEAM = 'Plymouth Whalers'; 1999-2000 season refers to SEASON = '1999-2000';",
    "idx": 3577
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (t2@`seasonstatus`)-[belongs_to_player_0:`belongs_to_player`]->(t1@`playerinfo`)\nWHERE t1.`eliteid` = t2.`eliteid`\nAND (t2.`league` = 'OHL' AND t2.`season` = '1999-2000')\nORDER BY t1.`birthdate`  NULLS FIRST \nRETURN t1.`playername` AS `playername` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the oldest player that participated in OHL league in the 1997 - 2000 season?",
    "evidence": "oldest player refers to MIN(birthdate); OHL league refers to LEAGUE = 'OHL'; 1997-2000 season refers to SEASON = '1997-2000';",
    "idx": 3579
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (img_obj@`img_obj`)\nWHERE img_obj.`img_id` = 1\nRETURN COUNT(img_obj.`obj_sample_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many object samples are there in image no.1?",
    "evidence": "object samples refers to OBJ_SAMPLE_ID; image no.1 refers to IMG_ID = 1",
    "idx": 3581
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[img_rel:`has_relationship`]->()\nWHERE img_rel.`obj1_sample_id` = img_rel.`obj2_sample_id`\nRETURN sum(CASE  WHEN img_rel.`img_id` = 5 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many self-relations are there between the object samples in image no.5?",
    "evidence": "self-relations refers to OBJ1_SAMPLE_ID = OBJ2_SAMPLE_ID; image no.5 refers to IMG_ID = 5",
    "idx": 3583
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`img_obj`)\nMATCH ()-[t1:`has_relationship`]->()\nWHERE t1.`img_id` = t2.`img_id`\nAND (t1.`img_id` = 5 AND t1.`obj1_sample_id` = t1.`obj2_sample_id`)\nRETURN t2.`x` AS `x`, t2.`y` AS `y`, t2.`w` AS `w`, t2.`h` AS `h`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the bounding box of the object sample in image no.5 that has a self-relation?",
    "evidence": "bounding box of the object sample refers to (x, y, W, H); image no.5 refers to IMG_ID = 5; has a self-relation refers to OBJ1_SAMPLE_ID = OBJ2_SAMPLE_ID",
    "idx": 3584
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`pred_classes`)\nMATCH ()-[t2:`has_relationship`]->()\nWHERE t1.`pred_class_id` = t2.`pred_class_id`\nAND (t2.`img_id` = 1 AND t2.`obj1_sample_id` = 8 AND t2.`obj2_sample_id` = 4)\nRETURN t1.`pred_class` AS `pred_class`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the relation between object sample no.8 and object sample no.4 in image no.1?",
    "evidence": "relation refers to PRED_CLASS; object sample no.8 and object sample no.4 refers to OBJ1_SAMPLE_ID = 8 AND OBJ2_SAMPLE_ID = 4; image no.1 refers to IMG_ID = 1",
    "idx": 3586
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`pred_classes`)\nMATCH ()-[t2:`has_relationship`]->()\nWHERE t1.`pred_class_id` = t2.`pred_class_id`\nAND (t2.`img_id` = 5 AND t2.`obj1_sample_id` = t2.`obj2_sample_id`)\nRETURN t1.`pred_class` AS `pred_class`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "To which predicted relation class does the self-relation of the object sample in image no.5 belong?",
    "evidence": "predicted relation class refers to PRED_CLASS; self-relations refers to OBJ1_SAMPLE_ID = OBJ2_SAMPLE_ID; image no.5 refers to IMG_ID = 5",
    "idx": 3590
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (obj_classes@`obj_classes`)\nRETURN COUNT(obj_classes.`obj_class_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many object classes are there in the database?",
    "evidence": "object classes refers to OBJ_CLASS",
    "idx": 3593
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t1:`has_attribute`]->(t2@`att_classes`)\nWHERE t1.`att_class_id` = t2.`att_class_id`\nAND (t1.`img_id` = 2347915)\nRETURN sum(CASE  WHEN t2.`att_class` = 'white' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many white objects are there in image no.2347915?",
    "evidence": "white objects refers to ATT_CLASS = 'white'; image no.2347915 refers to IMG_ID = 2347915",
    "idx": 3596
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`pred_classes`)\nMATCH ()-[t2:`has_relationship`]->()\nWHERE t1.`pred_class_id` = t2.`pred_class_id`\nAND (t2.`img_id` = 2345511 AND t2.`obj1_sample_id` = 12 AND t2.`obj2_sample_id` = 8)\nRETURN t1.`pred_class` AS `pred_class`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the relationship between object sample no.12 and no.8 of image no.2345511?",
    "evidence": "relationship refers to PRED_CLASS; object sample no.12 and no.8 of image no.2345511 refers to IMG_ID = 2345511 AND OBJ1_SAMPLE_ID = 12 AND OBJ2_SAMPLE_ID = 8",
    "idx": 3598
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`img_obj`)-[has_object_class_0:`has_object_class`]->(t1@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`img_id` = 6 AND t1.`obj_class` = 'food')\nRETURN COUNT(t2.`obj_sample_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many samples of food object are there in image no.6?",
    "evidence": "samples of food object refers to OBJ_CLASS = 'food'; image no.6 refers to IMG_ID = 6",
    "idx": 3600
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`img_obj`)-[has_object_class_0:`has_object_class`]->(t1@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`img_id` = 2353079)\nRETURN sum(CASE  WHEN t1.`obj_class` = 'wall' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many samples of \"wall\" are there in image no.2353079?",
    "evidence": "samples of \"wall\" refers to OBJ_SAMPLE_ID and OBJ_CLASS = 'wall' ; image no.2353079 refers to IMG_ID = 2353079",
    "idx": 3603
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (obj_classes@`obj_classes`)\nWHERE obj_classes.`obj_class` IN ['bus', 'train', 'aeroplane', 'car', 'etc']\nRETURN obj_classes.`obj_class_id` AS `obj_class_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the id of all the objects belonging to the transportation class?",
    "evidence": "id of all the objects belonging to the transportation class refers to OBJ_CLASS_ID and OBJ_CLASS IN ('bus', 'train', 'aeroplane', 'car', 'etc.')",
    "idx": 3607
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (obj_classes@`obj_classes`)\nWHERE obj_classes.`obj_class` = 'onion'\nRETURN obj_classes.`obj_class_id` AS `obj_class_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the unique id number identifying the onion object class?",
    "evidence": "unique id number identifying refers to OBJ_CLASS_ID; onion object class refers to OBJ_CLASS = 'onion'",
    "idx": 3609
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`img_obj`)\nMATCH ()-[t1:`has_relationship`]->()\nWHERE t1.`img_id` = t2.`img_id`\nAND (t1.`pred_class_id` = 144 AND t1.`img_id` = 3)\nRETURN t2.`x` AS `x`, t2.`y` AS `y`, t2.`w` AS `w`, t2.`h` AS `h`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the bounding box of the object with image id 4 and a prediction relationship class id of 144?",
    "evidence": "bounding box of the object refers to (x, y, W, H); image id refers to IMG_ID; prediction relationship class id of 144 refers to PRED_CLASS_ID = 144",
    "idx": 3611
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`img_obj`)\nMATCH ()-[t1:`has_relationship`]->()\nWHERE t1.`img_id` = t2.`img_id`\nORDER BY t2.`h` DESC NULLS LAST \nRETURN t1.`pred_class_id` AS `pred_class_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the prediction relationship class id of the tallest image?",
    "evidence": "prediction relationship class id refers to PRED_CLASS_ID; tallest image refers to max(H)",
    "idx": 3612
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`img_obj`)\nMATCH ()-[t1:`has_relationship`]->()\nWHERE t1.`img_id` = t2.`img_id`\nAND (t1.`pred_class_id` = 98)\nRETURN t2.`x` AS `x`, t2.`y` AS `y`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the x and y coordinates of all the images with a prediction relationship class id of 98?",
    "evidence": "prediction relationship class id of 98 refers to PRED_CLASS_ID = 98",
    "idx": 3613
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`pred_classes`)\nMATCH ()-[t1:`has_relationship`]->()\nWHERE t1.`pred_class_id` = t2.`pred_class_id`\nAND (t1.`img_id` = 3050 AND t2.`pred_class` = 'has')\nRETURN COUNT(t2.`pred_class_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many prediction classes with \"has\" captions are there for image id 3050?",
    "evidence": "prediction classes with \"has\" captions refers to PRED_CLASS = 'has'; image id 3050 refers to IMG_ID = 3050",
    "idx": 3614
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`img_obj`)-[has_object_class_0:`has_object_class`]->(t1@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`x` = 0 AND t2.`y` = 0 AND t2.`w` = 135 AND t2.`h` = 212)\nRETURN t1.`obj_class` AS `obj_class`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the object class of the image with a bounding box of 0, 0, 135, 212?",
    "evidence": "object class of the image refers to OBJ_CLASS; bounding box of 0, 0, 135, 212 refers to X = 0 AND Y = 0 AND W = 135 AND H = 212",
    "idx": 3617
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nRETURN sum(CASE WHEN t1.`img_id` = 1 THEN 1 ELSE 0 END) AS `_col_0`, sum(CASE WHEN t1.`x` = 341 AND t1.`y` = 27 AND t1.`w` = 42 AND t1.`h` = 51 THEN 1 ELSE 0 END) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many objects can you spot in image no. 72? What objects may be identified on the same image and within the bounding box represented as (341, 27, 42, 51)?",
    "evidence": "How many objects refers to OBJ_CLASS_ID; image no. 72 refers to IMG_ID = 72; What objects refers to OBJ_CLASS; bounding box represented as (341, 27, 42, 51) refers to X = 341 and Y = 27 and W = 42 and H = 51",
    "idx": 3621
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`obj_class` = 'bridge')\nRETURN COUNT(DISTINCT t1.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many images contain 'bridge' as an object element?",
    "evidence": "images refers to IMG_ID; 'bridge' as an object element refers to OBJ_CLASS = 'bridge'",
    "idx": 3622
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (img_obj@`img_obj`)\nRETURN cast (COUNT(img_obj.`obj_class_id`) as float) / COUNT(DISTINCT img_obj.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many object elements are there on average in each image?",
    "evidence": "object elements refers to OBJ_CLASS_ID; average = divide(count(OBJ_CLASS_ID), count(IMG_ID))",
    "idx": 3623
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`pred_classes`)\nMATCH ()-[t1:`has_relationship`]->()\nWHERE t1.`pred_class_id` = t2.`pred_class_id`\nAND (t1.`img_id` = 1 AND t1.`obj1_sample_id` = 25 AND t1.`obj2_sample_id` = 2)\nRETURN t2.`pred_class` AS `pred_class`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the relationship between object sample no. 25 and object sample no. 2 on image no. 1?",
    "evidence": "relationship refers to PRED_CLASS; object sample no. 25 and object sample no. 2 refers to OBJ1_SAMPLE_ID = 25 and OBJ2_SAMPLE_ID = 2; image no. 1 refers to IMG_ID = 1",
    "idx": 3624
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[img_obj_att:`has_attribute`]->()\nWHERE img_obj_att.`img_id` = 4 AND img_obj_att.`obj_sample_id` = 7\nRETURN COUNT(img_obj_att.`att_class_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many attributes are related to the object sample no. 7 on image no. 4?",
    "evidence": "How many attributes refers to ATT_CLASS_ID; object sample no. 7 on image no. 4 refers to IMG_ID = 4 and OBJ_SAMPLE_ID = 7",
    "idx": 3625
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (img_obj@`img_obj`)\nWHERE img_obj.`img_id` = 31\nRETURN COUNT(img_obj.`obj_class_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many object elements can be detected on image no. 31?",
    "evidence": "How many object elements refers to OBJ_CLASS_ID; image no. 31 refers to IMG_ID = 31",
    "idx": 3626
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[img_obj_att:`has_attribute`]->()\nWHERE img_obj_att.`img_id` = 5\nRETURN COUNT(img_obj_att.`att_class_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many attribute classes are there for image id 5?",
    "evidence": "attribute classes refer to ATT_CLASS_ID; image id 5 refers to IMG_ID = 5;",
    "idx": 3629
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (pred_classes@`pred_classes`)\nWHERE pred_classes.`pred_class_id` = 12\nRETURN pred_classes.`pred_class` AS `pred_class`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the caption for the prediction class id 12?",
    "evidence": "caption for the prediction class id 12 refers to PRED_CLASS where PRED_CLASS_ID = 12;",
    "idx": 3632
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t1.`img_id` = 908)\nRETURN sum(CASE  WHEN t2.`obj_class` = 'tip' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many object samples in image no.908 are in the class of tip?",
    "evidence": "object samples in the class of \"tip\" refer to OBJ_CLASS_ID where OBJ_CLASS = 'tip'; image no.5 refers to IMG_ID = 5;",
    "idx": 3634
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`obj_class` = 'clouds')\nRETURN sum(CASE  WHEN t1.`img_id` = 2315533 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many samples of clouds are there in the image no.2315533?",
    "evidence": "samples of clouds refer to IMG_ID where OBJ_CLASS = 'cloud'; image no.2315533 refers to IMG_ID = 2315533;",
    "idx": 3637
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (obj_classes@`obj_classes`)\nWHERE obj_classes.`obj_class` = 'onion'\nRETURN obj_classes.`obj_class_id` AS `obj_class_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which object classes belong to the onion category?",
    "evidence": "onion category refers to OBJ_CLASS = 'onion';",
    "idx": 3638
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t1.`img_id` = 2654)\nRETURN cast (sum(CASE  WHEN t2.`obj_class` = 'surface' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`obj_class_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of \"surface\" object samples in image No.2654?",
    "evidence": "DIVIDE(SUM(OBJ_CLASS_ID where OBJ_CLASS = 'surface'), COUNT(OBJ_CLASS_ID)) as percentage where IMG_ID = 2654;",
    "idx": 3640
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`obj_class` = 'animal' AND t1.`img_id` = 660)\nRETURN COUNT(t1.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many samples of animal objects are there in image no.660?",
    "evidence": "samples of animal objects refer to OBJ_SAMPLE_ID where OBJ_CLASS = 'animal'; image no.660 refers to IMG_ID = 660;",
    "idx": 3644
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t1.`img_id` = 1098)\nRETURN sum(CASE  WHEN t2.`obj_class` = 'bed' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Name number of samples of \"bed\" object are there in the image No.1098?",
    "evidence": "samples of \"bed\" object refer to OBJ_SAMPLE_ID where OBJ_CLASS = 'bed'; image No.1098 refers to IMG_ID = 1098;",
    "idx": 3645
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (img_obj@`img_obj`)\nRETURN cast (sum(CASE  WHEN img_obj.`img_id` = 1 THEN 1 ELSE 0 END) as float) / sum(CASE  WHEN img_obj.`img_id` = 6 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio between the number of object samples in image 1 and the number of object samples in image 6?",
    "evidence": "DIVIDE(SUM(OBJ_SAMPLE_ID where IMG_ID = 1), SUM(OBJ_SAMPLE_ID where IMG_ID = 6));",
    "idx": 3650
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t2@`pred_classes`)\nMATCH ()-[t1:`has_relationship`]->(t3@`img_obj`)-[has_object_class_0:`has_object_class`]->(t4@`obj_classes`)\nWHERE t2.`pred_class_id` = t1.`pred_class_id`\nAND t1.`img_id` = t3.`img_id` AND t1.`obj1_sample_id` = t3.`obj_sample_id`\nAND t3.`obj_class_id` = t4.`obj_class_id`\nAND (t1.`img_id` = 2360078 AND t1.`obj1_sample_id` = 15 OR t1.`obj2_sample_id` = 18)\nRETURN DISTINCT t2.`pred_class` AS `pred_class`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the prediction class between object class 'chain' and 'label' in image 2360078?",
    "evidence": "prediction class refers to PRED_CLASS; object class 'chain' refers to OBJ_CLASS = 'chain'; object class 'label' refers to OBJ_CLASS = 'label'; image 2360078 refers to IMG_ID = 2360078;",
    "idx": 3655
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t2:`has_attribute`]->(t1@`att_classes`)\nWHERE t1.`att_class_id` = t2.`att_class_id`\nAND (t1.`att_class` = 'polka dot')\nRETURN COUNT(t2.`obj_sample_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many images have objects with the attributes of polka dot?",
    "evidence": "attributes of polka dot refer to ATT_CLASS = 'polka dot'; images refer to IMG_ID;",
    "idx": 3656
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t3@`img_obj`)\nMATCH ()-[t2:`has_attribute`]->(t1@`att_classes`)\nWHERE t1.`att_class_id` = t2.`att_class_id`\nAND t2.`img_id` = t3.`img_id`\nAND (t2.`img_id` = 400)\nORDER BY t3.`w` DESC NULLS LAST \nRETURN t1.`att_class` AS `att_class` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the attributes of the widest object in image 400?",
    "evidence": "attributes refer to ATT_CLASS; the widest relates to the width of the bounding\nbox of the object which refers to MAX(W); image 400 refers to IMG_ID = 400;",
    "idx": 3657
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`obj_class` = 'windows')\nRETURN cast (COUNT(t1.`obj_sample_id`) as float) * 100 / COUNT(CASE  WHEN t1.`img_id` = 5 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Based on image 5, what is the percentage of images that belong windows object class?",
    "evidence": "DIVIDE(COUNT(OBJ_SAMPLE_ID where OBJ_CLASS = 'windows' and IMG_ID = 5), COUNT(OBJ_SAMPLE_ID where IMG_ID = 5)) as percentage;",
    "idx": 3661
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (img_obj@`img_obj`)\nWHERE img_obj.`x` = 5 AND img_obj.`y` = 5\nRETURN COUNT(img_obj.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many images have an x-coordinate of 5 and y-coordinate of 5?",
    "evidence": "X and Y refer to coordinates of the bounding box where X = 5 and Y = 5; images refer to IMG_ID;",
    "idx": 3662
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (img_obj@`img_obj`)\nWHERE img_obj.`obj_sample_id` < 15\nRETURN COUNT(img_obj.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many images have less than 15 object samples?",
    "evidence": "images refer to IMG_ID; less than 15 object samples refer to COUNT(OBJ_SAMPLE_ID) < 15;",
    "idx": 3663
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (img_obj@`img_obj`)\nWHERE img_obj.`obj_class_id` = 10\nRETURN COUNT(img_obj.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many images have a total of 10 attribute classes?",
    "evidence": "images refer to IMG_ID; total of 10 attribute classes refers to COUNT(OBJ_CLASS_ID) = 10;",
    "idx": 3664
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (t1@`img_obj`)-[has_object_class_0:`has_object_class`]->(t2@`obj_classes`)\nWHERE t1.`obj_class_id` = t2.`obj_class_id`\nAND (t2.`obj_class` = 'vegetables' OR t2.`obj_class` = 'fruits')\nRETURN COUNT(t1.`img_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many images have \"vegetable\" and \"fruits\" as their object classes?",
    "evidence": "images refer to IMG_ID; \"vegetables\" and \"fruits\" as object classes refer to OBJ_CLASS = 'vegetables' and OBJ_CLASS = 'fruits';",
    "idx": 3665
  }
]