[
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`emailaddress`)-[belongs_to_0:belongs_to]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`emailpromotion` = 2)\nRETURN `t2`.`emailaddress` AS `emailaddress`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the e-mail addresses of all the employees who wish to receive e-mail promotions from Adventureworks and selected partners.",
    "evidence": "employees who wish to receive e-mail promotions from AdventureWorks and selected partners refers to EmailPromotion = 2;",
    "idx": 5619
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:has_credit_card]->(`t3`:`creditcard`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`creditcardid` = `t3`.`creditcardid`\nAND (`t1`.`firstname` = 'David' AND `t1`.`lastname` = 'Bradley')\nRETURN `t3`.`cardnumber` AS `cardnumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please show the credit card number of David Bradley.",
    "evidence": "credit card number refers to CardNumber;",
    "idx": 5620
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:has_credit_card]->(`t3`:`creditcard`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`creditcardid` = `t3`.`creditcardid`\nAND (`t1`.`firstname` = 'David' AND `t1`.`lastname` = 'Bradley')\nRETURN `t3`.`expyear` AS `expyear`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which year will the David Bradley's credit card expire?",
    "evidence": "year of credit card expiration refers to ExpYear;",
    "idx": 5621
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:has_credit_card]->(`t3`:`creditcard`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`creditcardid` = `t3`.`creditcardid`\nAND (`t3`.`expyear` = 2007 AND `t1`.`persontype` = 'SC')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the store contact employees whose credit cards expired in 2007.",
    "evidence": "year of credit card expiration refers to ExpYear; ExpYear = 2007; store contact refers to PersonType = 'SC';",
    "idx": 5622
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:has_credit_card]->(`t3`:`creditcard`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`creditcardid` = `t3`.`creditcardid`\nAND (`t3`.`cardtype` = 'Vista' AND `t1`.`persontype` = 'SC')\nRETURN COUNT(`t1`.`firstname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the store contact employees, how many of them have a Vista credit card?",
    "evidence": "store contact refers to PersonType = 'SC'; type of credit card refers to CardType; CardType = 'vista';",
    "idx": 5623
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employeedepartmenthistory`)\nMATCH (`t2`:`department`)\nWHERE `t1`.`departmentid` = `t2`.`departmentid`\nAND (`t2`.`groupname` = 'Quality Assurance' AND CASE WHEN `t1`.`startdate` is not NULL THEN apoc.temporal.format(`t1`.`startdate`,'yyyy') ELSE NULL END = '2007')\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees came into the Quality Assurance Group in the year 2007?",
    "evidence": "Quality Assurance Group is a group name of department; came in 2007 refers to year(StartDate) = 2007;",
    "idx": 5624
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`specialoffer`)-[t2:applies_to]->(`t3`:`product`)\nWHERE `t1`.`specialofferid` = `t2`.`specialofferid`\nAND `t2`.`productid` = `t3`.`productid`\nAND (`t1`.`description` = 'LL Road Frame Sale')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the product names of all the products on the LL Road Frame Sale.",
    "evidence": "LL Road Frame Sale is a description of special offer",
    "idx": 5625
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`specialoffer`)-[t2:applies_to]->()\nWHERE `t1`.`specialofferid` = `t2`.`specialofferid`\nAND (`t1`.`description` = 'LL Road Frame Sale')\nRETURN COUNT(DISTINCT `t2`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products were on the LL Road Frame Sale?",
    "evidence": "LL Road Frame Sale is a description of special offer",
    "idx": 5626
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`specialoffer`)-[t2:applies_to]->(`t3`:`product`)\nWHERE `t1`.`specialofferid` = `t2`.`specialofferid`\nAND `t2`.`productid` = `t3`.`productid`\nAND (`t3`.`name` = 'Chainring Bolts')\nRETURN CASE  WHEN COUNT(`t1`.`description`) >= 1 THEN 'Yes' ELSE 'No' END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Has the product Chainring Bolts been on any of the sales?",
    "evidence": "a product that's been on sale refers to SellStartDate NOT null and vice versa;",
    "idx": 5627
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`specialoffer`)-[t2:applies_to]->(`t3`:`product`)\nMATCH (`t4`:`productsubcategory`)-[subcategory_of_0:subcategory_of]->(`t5`:`productcategory`)\nWHERE `t1`.`specialofferid` = `t2`.`specialofferid`\nAND `t2`.`productid` = `t3`.`productid`\nAND `t3`.`productsubcategoryid` = `t4`.`productsubcategoryid`\nAND `t4`.`productcategoryid` = `t5`.`productcategoryid`\nAND (`t1`.`description` = 'LL Road Frame Sale' AND `t4`.`name` = 'Clothing')\nRETURN COUNT(`t2`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products from the Clothing category were on the LL Road Frame Sale?",
    "evidence": "LL Road Frame Sale is a description of special offer",
    "idx": 5628
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)\nMATCH (`t2`:`productsubcategory`)-[subcategory_of_0:subcategory_of]->(`t3`:`productcategory`)\nWHERE `t1`.`productsubcategoryid` = `t2`.`productsubcategoryid`\nAND `t2`.`productcategoryid` = `t3`.`productcategoryid`\nAND (`t2`.`productsubcategoryid` = 3)\nRETURN CASE  WHEN `t1`.`makeflag` = 1 THEN `t1`.`name`  END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the products that are under the Clothing category that are manufactured in-house and salable.",
    "evidence": "product is manufactured in-house refers to MakeFlag = 1; salable product refers to FinishedGoodsFlag = 1;",
    "idx": 5629
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employeedepartmenthistory`)\nMATCH (`t2`:`department`)\nWHERE `t1`.`departmentid` = `t2`.`departmentid`\nAND (`t2`.`name` = 'Engineering' AND NOT `t1`.`enddate` IS NULL)\nRETURN CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(365 * toFloat((toFloat(CASE WHEN `t1`.`enddate` is not NULL THEN apoc.temporal.format(`t1`.`enddate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t1`.`startdate` is not NULL THEN apoc.temporal.format(`t1`.`startdate`,'yyyy') ELSE NULL END))) + 30 * toFloat((toFloat(CASE WHEN `t1`.`enddate` is not NULL THEN apoc.temporal.format(`t1`.`enddate`,'MM') ELSE NULL END) - toFloat(CASE WHEN `t1`.`startdate` is not NULL THEN apoc.temporal.format(`t1`.`startdate`,'MM') ELSE NULL END))) + toFloat(CASE WHEN `t1`.`enddate` is not NULL THEN apoc.temporal.format(`t1`.`enddate`,'dd') ELSE NULL END) - toFloat(CASE WHEN `t1`.`startdate` is not NULL THEN apoc.temporal.format(`t1`.`startdate`,'dd') ELSE NULL END))) / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all the employees that have left the Engineering Department, what is the average time of their stay?",
    "evidence": "employees who left a department refers to EndDate NOT null; average stay = AVG(SUBTRACT(year(EndDate)), (year(T1.StartDate)));",
    "idx": 5630
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)\nMATCH (`t2`:`productsubcategory`)-[subcategory_of_0:subcategory_of]->(`t3`:`productcategory`)\nWHERE `t1`.`productsubcategoryid` = `t2`.`productsubcategoryid`\nAND `t2`.`productcategoryid` = `t3`.`productcategoryid`\nAND (`t3`.`name` = 'Clothing')\nRETURN CASE WHEN min(`t1`.`listprice`)=0 THEN NULL ELSE (MAX(`t1`.`listprice`) - min(`t1`.`listprice`)) * 100 / min(`t1`.`listprice`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much more expensive in percentage is the product with the highest selling price from the product with the lowest selling price in the Clothing category?",
    "evidence": "selling price refers to ListPrice; highest selling price refers to MAX(ListPrice); lowest selling price refers to MIN(ListPrice);",
    "idx": 5631
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)\nMATCH (`t2`:`productsubcategory`)-[subcategory_of_0:subcategory_of]->(`t3`:`productcategory`)\nWHERE `t1`.`productsubcategoryid` = `t2`.`productsubcategoryid`\nAND `t2`.`productcategoryid` = `t3`.`productcategoryid`\nAND (`t3`.`name` = 'Clothing')\nRETURN CASE WHEN COUNT(`t1`.`productid`)=0 THEN NULL ELSE sum(`t1`.`listprice` - `t1`.`standardcost`) / COUNT(`t1`.`productid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average profit of all the products from the Clothing category?",
    "evidence": "average profit = DIVIDE(SUM(SUBTRACT(ListPrice, StandardCost))), (COUNT(ProductSubcategoryID))));",
    "idx": 5632
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`productcosthistory`:`productcosthistory`)\nWHERE toString(`productcosthistory`.`startdate`) =~ '(?i)(?s)2013.*'\nORDER BY `productcosthistory`.`standardcost` IS NULL DESC, `productcosthistory`.`standardcost`  \nRETURN `productcosthistory`.`productid` AS `productid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which product cost the least in 2013?",
    "evidence": "cost refers to StandardCost; cost the least refers to MIN(StandardCost);",
    "idx": 5633
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`color` = 'Yellow'\nRETURN `product`.`productid` AS `productid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all products with the color yellow.",
    "evidence": "",
    "idx": 5634
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`title` = 'Mr.' AND `person`.`firstname` = 'Hung-Fu' AND `person`.`lastname` = 'Ting'\nRETURN `person`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the bussiness id for Mr. Hung-Fu Ting?",
    "evidence": "business id refers to BusinessEntityID;",
    "idx": 5635
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`productlistpricehistory`:`productlistpricehistory`)\nWHERE `productlistpricehistory`.`productid` = 912\nRETURN `productlistpricehistory`.`listprice` AS `listprice`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the price for the product with the id \"912\"?",
    "evidence": "price refers to ListPrice;",
    "idx": 5636
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[workorderrouting:processed_at]->()\nRETURN CASE  WHEN `workorderrouting`.`actualcost` = `workorderrouting`.`plannedcost` THEN 'No' ELSE 'Yes' END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Is there a work order where the planned cost is different from the actual cost?",
    "evidence": "planned cost is different from actual cost refers to ActualCost ! = PlannedCost;",
    "idx": 5637
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productlistpricehistory`)-[price_history_for_0:price_history_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`listprice` > 1000)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the names of the products with the price of more than 1000$.",
    "evidence": "ListPrice>1000;",
    "idx": 5639
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productcosthistory`)\nMATCH (`t1`:`productlistpricehistory`)\nWHERE `t1`.`productid` = `t2`.`productid`\nORDER BY `t1`.`listprice` - `t2`.`standardcost` IS NULL ASC, `t1`.`listprice` - `t2`.`standardcost` DESC \nRETURN `t1`.`productid` AS `productid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the product with the most profit?",
    "evidence": "profit = SUBTRACT(ListPrice, StandardCost);",
    "idx": 5640
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:stored_at]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`locationid` = 1 AND `t1`.`shelf` = 'L' AND `t1`.`bin` = 6)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the product stored in location 1 compartment L container 6?",
    "evidence": "compartment refers to Shelf;",
    "idx": 5641
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:has_photo]->(`t1`:`productphoto`)\nWHERE `t1`.`productphotoid` = `t2`.`productphotoid`\nAND (`t1`.`largephotofilename` =~ '(?i)(?s).*large.gif')\nRETURN `t2`.`productid` AS `productid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the products with a large photo?",
    "evidence": "product with large photo refers to LargePhoto NOT null;",
    "idx": 5643
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)\nMATCH (`t1`:`productsubcategory`)\nWHERE `t1`.`productsubcategoryid` = `t2`.`productsubcategoryid`\nAND (`t1`.`name` = 'Socks')\nRETURN `t2`.`productid` AS `productid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the socks products.",
    "evidence": "Socks is a name of product subcategory",
    "idx": 5644
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productlistpricehistory`)-[price_history_for_0:price_history_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'Cable Lock')\nRETURN CASE WHEN `t2`.`listprice`=0 THEN NULL ELSE 100 / `t2`.`listprice` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "With 100$, how many Cable Lock can you buy?",
    "evidence": "number of products a $100 can buy = DIVIDE(100, ListPrice);",
    "idx": 5645
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`workorder`)-[has_scrap_reason_0:has_scrap_reason]->(`t2`:`scrapreason`)\nWHERE `t1`.`scrapreasonid` = `t2`.`scrapreasonid`\nAND (`t1`.`workorderid` = 57788)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the scrap reason for work order \"57788\"?",
    "evidence": "",
    "idx": 5646
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productcosthistory`)-[cost_history_for_0:cost_history_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` =~ '(?i)(?s).*Sport.*')\nRETURN `t2`.`standardcost` AS `standardcost`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the cost for the sports?",
    "evidence": "cost refers to StandardCost;",
    "idx": 5647
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:stored_at]->(`t1`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t2`.`productid` = 476 AND `t1`.`name` = 'Metal Storage')\nRETURN `t2`.`quantity` AS `quantity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products with the id \"476\" are stored in Metal Storage?",
    "evidence": "Metal Storage is name of location",
    "idx": 5648
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "CALL(*) {\nMATCH (`product_sub0`:`product`)\nRETURN CASE WHEN COUNT(`product_sub0`.`productid`)=0 THEN NULL ELSE sum(`product_sub0`.`standardcost`) / COUNT(`product_sub0`.`productid`) END AS `_col_0`  \n}\nMATCH (`t1`:`productcosthistory`)-[cost_history_for_0:cost_history_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`standardcost` < `_col_0`)\nRETURN DISTINCT `t2`.`productid` AS `productid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the products with lower than average cost.",
    "evidence": "cost refers to StandardCost; lower than average cost = StandardCost<(AVG(StandardCost));",
    "idx": 5649
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productcosthistory`)\nMATCH (`t1`:`productlistpricehistory`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`productid` = 858)\nRETURN CASE WHEN `t2`.`standardcost`=0 THEN NULL ELSE (`t1`.`listprice` - `t2`.`standardcost`) * 100 / `t2`.`standardcost` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the the percentage of profit for the product \"858\"?",
    "evidence": "percentage of profit = DIVIDE(SUBTRACT(ListPrice, StandardCost), (StandardCost)) as percentage;",
    "idx": 5650
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[productproductphoto:has_photo]->()\nWHERE `productproductphoto`.`productphotoid` <> 1\nRETURN COUNT(`productproductphoto`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products with a thumpnail photo?",
    "evidence": "products with a thumbnail photo refers to ProductPhotoID ! = 1 ;",
    "idx": 5651
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`productlistpricehistory`:`productlistpricehistory`)\nWHERE toString(`productlistpricehistory`.`startdate`) =~ '(?i)(?s)2012.*'\nORDER BY `productlistpricehistory`.`listprice` IS NULL ASC, `productlistpricehistory`.`listprice` DESC \nRETURN `productlistpricehistory`.`productid` AS `productid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which product has the highest price in 2012?",
    "evidence": "price refers to ListPrice; highest price refers to MAX(ListPrice);",
    "idx": 5653
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`productcosthistory`:`productcosthistory`)\nWHERE `productcosthistory`.`productid` = 847\nRETURN `productcosthistory`.`standardcost` AS `standardcost`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the cost for the product \"847\"?",
    "evidence": "cost refers to StandardCost;",
    "idx": 5654
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`jobtitle` = 'Human Resources Manager'\nRETURN `employee`.`organizationlevel` AS `organizationlevel`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the organization level for Human Resources Manager?",
    "evidence": "Human Resources Manager is a job title",
    "idx": 5655
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`workorder`:`workorder`)\nWHERE `workorder`.`enddate` > `workorder`.`duedate`\nRETURN COUNT(`workorder`.`workorderid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the work orders didn’t meet the due date?",
    "evidence": "workers who did not meet the due date refers to EndDate>DueDate;",
    "idx": 5656
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productcosthistory`)-[cost_history_for_0:cost_history_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`productid` = 888)\nRETURN `t2`.`standardcost` AS `standardcost`, `t2`.`productnumber` AS `productnumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the cost and the product number of product with the id \"888\"?",
    "evidence": "cost refers to StandardCost;",
    "idx": 5657
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:has_photo]->(`t1`:`productphoto`)\nWHERE `t1`.`productphotoid` = `t2`.`productphotoid`\nAND (`t1`.`largephotofilename` = 'roadster_black_large.gif')\nRETURN COUNT(DISTINCT `t2`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products using \"roadster_black_small.gif\" as the thumbnail photo?",
    "evidence": "products using roadster_black_small.gif as the thumbnail photo refers to ThumbnailPhotoFileName = 'roadster_black_small.gif';",
    "idx": 5658
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)-[t2:stored_at]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` =~ '(?i)(?s)Lock Ring')\nRETURN `t2`.`locationid` AS `locationid`, `t2`.`shelf` AS `shelf`, `t2`.`bin` AS `bin`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the locations ids, compartments and containers for the Lock Ring",
    "evidence": "compartment refers to Shelf; container refers to Bin; Lock Ring is a name of product",
    "idx": 5659
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productsubcategory`)-[subcategory_of_0:subcategory_of]->(`t2`:`productcategory`)\nWHERE `t1`.`productcategoryid` = `t2`.`productcategoryid`\nAND (`t1`.`name` = 'Road Frames')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What category do Road Frames fall into?",
    "evidence": "Road Frames is a name of product subcategory",
    "idx": 5660
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`workorder`)-[has_scrap_reason_0:has_scrap_reason]->(`t1`:`scrapreason`)\nWHERE `t1`.`scrapreasonid` = `t2`.`scrapreasonid`\nAND (`t1`.`name` = 'Handling damage')\nRETURN `t2`.`workorderid` AS `workorderid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the scraped work orders for handling damage reason.",
    "evidence": "handling damage is descrription of manufacturing failure which refers to ScrapReason.Name",
    "idx": 5661
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productcosthistory`)\nMATCH (`t1`:`productlistpricehistory`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`productid` = 792)\nRETURN `t1`.`listprice` - `t2`.`standardcost` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the profit for the product \"792\"?",
    "evidence": "profit = SUBTRACT(ListPrice, StandardCost);",
    "idx": 5662
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`emailaddress`)-[belongs_to_0:belongs_to]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`emailaddress` = 'regina7@adventure-works.com')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who owns the email address \"regina7@adventure-works.com\"?",
    "evidence": "",
    "idx": 5663
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`workorder`)-[for_product_0:for_product]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`workorderid` = 2540)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the product the work order \"2540\" was making?",
    "evidence": "",
    "idx": 5665
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productlistpricehistory`)-[price_history_for_0:price_history_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'AWC Logo Cap')\nRETURN `t2`.`listprice` AS `listprice`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the price for the AWC Logo Cap?",
    "evidence": "price refers to ListPrice; price of 3 products = MULTIPLY(ListPrice, 3); Lock Washer 6 is a name of a product;",
    "idx": 5666
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`workorder`)-[for_product_0:for_product]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'Down Tube')\nRETURN `t2`.`workorderid` AS `workorderid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the work orders that is related to the Down Tube.",
    "evidence": "Down Tube is a name of a product;",
    "idx": 5667
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productcosthistory`)\nMATCH (`t1`:`productlistpricehistory`)\nWHERE `t1`.`productid` = `t2`.`productid`\nRETURN avg(CASE WHEN `t2`.`standardcost`=0 THEN NULL ELSE (`t1`.`listprice` - `t2`.`standardcost`) * 100 / `t2`.`standardcost` END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the the average percentage of profit for the all the product?",
    "evidence": "average profit percentage = DIVIDE(SUBTRACT(ListPrice, StandardCost)), (StandardCost)));",
    "idx": 5668
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:processed_at]->(`t1`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nRETURN CASE WHEN COUNT(`t2`.`workorderid`)=0 THEN NULL ELSE 100.0 * sum(CASE  WHEN `t1`.`name` = 'Subassembly' THEN 1 ELSE 0 END) / COUNT(`t2`.`workorderid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What proportion of work order is in Subassembly?",
    "evidence": "proportion = DIVIDE(SUM(Name = 'Subassembly'). (COUNT(WorkOrderID)));",
    "idx": 5669
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "CALL (*) {\nMATCH (`img_obj_sub0`:`img_obj`)\nWITH `img_obj_sub0`.`img_id` AS _groupby_col_0, COUNT(`img_obj_sub0`.`obj_sample_id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 20\nRETURN _groupby_col_0 AS `img_id`  \n}\nWITH *\nRETURN COUNT(`img_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many images have over 20 object samples?",
    "evidence": "over 20 object samples refers to COUNT(OBJ_SAMPLE_ID) > 20",
    "idx": 5671
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`img_obj`:`img_obj`)\nWHERE `img_obj`.`img_id` = 1 AND `img_obj`.`obj_class_id` = 297\nRETURN `img_obj`.`obj_sample_id` AS `obj_sample_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the object samples in class no. 297 in image no.1.",
    "evidence": "IDs of the object samples refers to OBJ_SAMPLE_ID; class no. 297 in image no.1 refers to IMG_ID = 1 and OBJ_CLASS_ID = 297",
    "idx": 5672
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`img_obj`)-[has_object_class_0:has_object_class]->(`t1`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`img_id` = 1)\nRETURN sum(CASE  WHEN `t1`.`obj_class` = 'man' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many object samples in image no.1 are in the class of \"man\"?",
    "evidence": "object samples refers to OBJ_CLASS_ID; image no.1 refers to IMG_ID = 1; in the class of \"man\" refers to OBJ_CLASS = 'man'",
    "idx": 5675
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`img_obj`)-[has_object_class_1:has_object_class]->(`t1_sub0`:`obj_classes`)\nWHERE `t1_sub0`.`obj_class_id` = `t2_sub0`.`obj_class_id`\nAND (`t1_sub0`.`obj_class` = 'man')\nWITH `t2_sub0`.`img_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `img_id`  \n}\nWITH *\nRETURN COUNT(`img_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many images have at least one object sample in the class of \"man\"?",
    "evidence": "have at least one object sample in the class of \"man\" refers to count(IMG_ID where OBJ_CLASS = 'man') > = 1",
    "idx": 5676
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`img_obj`)-[has_object_class_0:has_object_class]->(`t1`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`img_id` = 1)\nWITH `t1`.`obj_class` AS _groupby_col_0\nRETURN _groupby_col_0 AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the classes of all the object samples in image no.1.",
    "evidence": "classes of all the object samples refers to OBJ_CLASS; image no.1 refers to IMG_ID = 1",
    "idx": 5677
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`pred_classes`)\nMATCH ()-[t2:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t2`.`img_id` = 1 AND `t2`.`obj1_sample_id` <> `t2`.`obj2_sample_id`)\nRETURN sum(CASE  WHEN `t1`.`pred_class` = 'parked on' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many pairs of object samples in image no.1 have the relation of \"parked on\"?",
    "evidence": "pairs of object samples refers to OBJ1_SAMPLE_ID and OBJ2_SAMPLE_ID; image no.1 refers to IMG_ID = 1; relation of \"parked on\" refers to PRED_CLASS = 'parked on'",
    "idx": 5679
  }
]