[
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`teamsplits`:`teamsplits`)\nWHERE `teamsplits`.`year` = '2006'\nRETURN `teamsplits`.`octl` AS `octl`, `teamsplits`.`tmid` AS `tmid` ORDER BY `octl` IS NULL ASC, `octl` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2006, what is the overall number of october defeats for the team with the most October defeats? Indicate the team ID.",
    "evidence": "team ID refers to tmID; 'defeats' and 'loses' are synonyms; most October defeats refers to max(OctL)",
    "idx": 5888
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`shootcatch` IS NULL AND `master`.`firstnhl` = '2011'\nRETURN COUNT(`master`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players, whose shooting/catching hand is both left and right, debuted their first NHL in 2011?",
    "evidence": "shooting/catching hand is both left and right refers to shootCatch is NULL, debuted their first NHL in 2011 refers to firstNHL = 2011",
    "idx": 5889
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`awardsplayers`)-[received_by_0:received_by]->(`t2`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (NOT `t2`.`height` IS NULL AND (`t2`.`pos` = 'LW' OR `t2`.`pos` = 'L/C'))\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(`t2`.`height`)) / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average height of all the goalies born in the 70s who's a left shooting/catching dominant and to which team do the tallest player/s play for most recently?",
    "evidence": "goalies refers to pos = 'G'; born in the 70s refers to birthYear between '1970' and '1979'; left shooting/catching dominant refers to shootCatch = 'L'; tallest refers to max(height); average height = avg(height(pos = 'G' & birthYear between '1970' and '1979' & shootCatch = 'L')); most recently refers to max(Teams.year)",
    "idx": 5890
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`scoring`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`lgid` = 'NHL')\nWITH `t2`.`firstname` AS _groupby_col_0, `t2`.`lastname` AS _groupby_col_1, sum(`t1`.`a`) AS _groupby_col_2\nRETURN _groupby_col_2 AS `_col_0`, _groupby_col_0 AS `firstname`, _groupby_col_1 AS `lastname` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total amount of assists of the NHL player with the most assists in history? Please indicate his/her full name.",
    "evidence": "NHL refers to lgID = 'NHL'; most assists refers to max(A); full name = nameGiven + lastName; total amount of assists = sum(A(playerID(max(A))))",
    "idx": 5891
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)\nMATCH ()-[t1:competed_against]->()\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmidloser` = `t2`.`tmid`\nAND (`t1`.`note` = 'EX' AND `t2`.`year` = '1912')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the losing team during an exhibition game in 1912?",
    "evidence": "exhibition game refers to note = 'EX'; team of losing team refers to tmIDLoser",
    "idx": 5893
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "CALL (*) {\nMATCH (`awardscoaches_sub0`:`awardscoaches`)\nWHERE `awardscoaches_sub0`.`award` = 'Second Team All-Star'\nRETURN `awardscoaches_sub0`.`coachid` AS `coachid`, `awardscoaches_sub0`.`year` AS `year` ORDER BY `year` IS NULL DESC, `year`  \nLIMIT 1\n}\nMATCH (`t1`:`coaches`)\nWHERE `t1`.`coachid` = `coachid` AND `t1`.`year` < `year`\nRETURN sum(`t1`.`g`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many games did the coach who received the first-ever Second Team All-Star award play before receiving such award?",
    "evidence": "first-ever Second Team All-Star award refers to min(year(award = 'Second Team All-Star')); How many games before receiving such award = sum(g(coachID(min(year(award = 'Second Team All-Star')))): g(min(year)))",
    "idx": 5894
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`scoring`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`shg` >= '1' AND `t1`.`shg` <= '5')\nORDER BY `t1`.`gwg` IS NULL ASC, `t1`.`gwg` DESC \nRETURN `t2`.`namegiven` AS `namegiven`, `t2`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the teams whose shorthanded goals are between 1 to 5, which player is the most trustworthy in the critical moment?",
    "evidence": "shorthanded goals refers to SHG; SHG BETWEEN 1 AND 5; most trustworthy in the critical moment refers to max(GWG)",
    "idx": 5895
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`notes` = 'interim' AND `t1`.`year` = '1997' AND `t2`.`name` = 'Tampa Bay Lightning')\nWITH `t1`.`coachid` AS _groupby_col_0, sum(`t1`.`l`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 1997, how many loss did the coach have who temporary coached Tampa Bay Lightning? Indicate his/her coach ID.",
    "evidence": "temporary coached refers to notes = 'interim'; number of loss refers to L (to add)",
    "idx": 5896
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`scoring`)-[played_for_0:played_for]->(`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`sha` >= '7')\nORDER BY `t1`.`a` IS NULL ASC, `t1`.`a` DESC \nRETURN `t2`.`rank` AS `rank`, `t2`.`year` AS `year`, `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players whose short handed assists are greater or equal to 7, what is the final standing of the team with the most number of assists? Indicate the year to which the most number of assists was achieved and the name of the team.",
    "evidence": "short handed assists refers to SHA; SHA> = 7; final standing refers to rank; the final standing of the team with the most number of assists refers to max(A)\n",
    "idx": 5897
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` = 1969 AND `t2`.`rank` = 4)\nRETURN `t1`.`coachid` AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the coach whose team placed 4th in the 1969 game? Indicate their coachID.",
    "evidence": "name of coach refers to coachID; placed 4th refers to rank = 4; 1969 game refers to year = 1969",
    "idx": 5898
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`teamshalf`)-[half_season_stats_0:half_season_stats]->(`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`half` = 1 AND `t1`.`rank` = 1 AND `t1`.`year` >= 1917 AND `t1`.`year` <= 1920)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Between 1917 to 1920, what are the names of the team who ranked first in the first half of the season each year?",
    "evidence": "year BETWEEN 1917 AND 1920; first half of season refers to half = 1",
    "idx": 5899
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t3`:`teams`)\nMATCH (`t1`:`scoring`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t2`.`playerid` = `t1`.`playerid`\nAND `t3`.`tmid` = `t1`.`tmid`\nAND ((toFloat(`t2`.`firstnhl`) - toFloat(`t2`.`birthyear`)) >= '18' AND (toFloat(`t2`.`firstnhl`) - toFloat(`t2`.`birthyear`)) <= '24' AND `t3`.`g` < 5)\nRETURN `t2`.`namegiven` AS `namegiven`, `t2`.`lastname` AS `lastname`, `t2`.`birthyear` AS `birthyear`, `t2`.`birthmon` AS `birthmon`, `t2`.`birthday` AS `birthday`, `t3`.`tmid` AS `tmid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Canadian players, between the ages of 18 and 24 when they initially played their first NHL, had a cumulative goal total of no more than 5? Indicate their complete names, the year, and the team for which they scored the specified amount of goals.",
    "evidence": "Canadian players mean player whose birthCountry = Canada; ages of 18 and 24 refers to SUBTRACT(firstNHL, birthYear) BETWEEN 18 AND 24; cumulative goal total of no more than 5 refers to G < 5; complete name = nameGiven + lastName",
    "idx": 5900
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`teams`:`teams`)\nWHERE `teams`.`year` = 2009 AND `teams`.`name` = 'New York Rangers'\nRETURN CASE WHEN toFloat(toFloat(`teams`.`ppc`))=0 THEN NULL ELSE toFloat(toFloat(`teams`.`ppg`)) / toFloat(toFloat(`teams`.`ppc`)) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the power play chances of New York Rangers in 2009?",
    "evidence": "power play chanses = DIVIDE (PPG, PPC); name = New York Rangers; year = 2009",
    "idx": 5901
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`teams`:`teams`)\nWITH `teams`.`year` AS _groupby_col_0, `teams`.`tmid` AS _groupby_col_1, sum(`teams`.`pts`) AS _groupby_col_2\nRETURN _groupby_col_2 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest total points a team got in a year?",
    "evidence": "the highest total points = MAX(Pts)",
    "idx": 5902
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`teams`:`teams`)\nWHERE `teams`.`year` = 2006 AND `teams`.`w` > `teams`.`l` AND `teams`.`pts` > 100\nRETURN COUNT(`teams`.`tmid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the teams that had more wins than loses in the year 2006, how many of them have over 100 points?",
    "evidence": "more wins than loses refers to W > L; over 100 points refers to Pts > 100",
    "idx": 5903
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`teams`:`teams`)\nWHERE `teams`.`year` = 1995 AND `teams`.`name` IN ['Florida Panthers', 'Edmonton Oilers', 'Los Angeles Kings']\nORDER BY `teams`.`pkc` IS NULL ASC, `teams`.`pkc` DESC \nRETURN `teams`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team had the highest penalty kill chances in 1995, Florida Panthers, Edmonton Oilers or Los Angeles Kings?",
    "evidence": "the highest penalty kill chances refer to MAX(PKC); year = 1995;",
    "idx": 5904
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[stanley_cup_stats_0:stanley_cup_stats]->(`t1`:`teamssc`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` = '1917' AND `t1`.`w` > `t1`.`l`)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the team that got more wins than loses in the Stanley Cup finals in 1917?",
    "evidence": "more wins than loses refers to W>L; year = 1917;",
    "idx": 5905
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[stanley_cup_stats_0:stanley_cup_stats]->(`t1`:`teamssc`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` = '1922')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the teams that have played in 1922's Stanley Cup finals.",
    "evidence": "teams refer to tmID; year = 1922;",
    "idx": 5906
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[stanley_cup_stats_0:stanley_cup_stats]->(`t1`:`teamssc`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` = '1922' AND `t2`.`pts` > 20)\nRETURN COUNT(`t1`.`tmid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the teams that played in 1922's Stanley Cup finals, how many of them had over 20 points in that year?",
    "evidence": "how many teams refer to COUNT(tmID); over 20 points refer to Pts>20; year = 1922;",
    "idx": 5907
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[stanley_cup_stats_0:stanley_cup_stats]->(`t1`:`teamssc`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` = '1923' AND `t2`.`rank` = 2)\nRETURN `t1`.`pim` AS `pim`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What were the penalty minutes in 1923's Stanley Cup finals of the team that ranked second in that year?",
    "evidence": "teams refer to tmID; year = 1922; ranked second refers to rank = 2; penalty minutes refer to PIM;",
    "idx": 5908
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`name` = 'Montreal Canadiens')\nRETURN DISTINCT `t3`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the first names of the coaches who have taught the Montreal Canadiens.",
    "evidence": "Montreal Canadiens is the name of team.",
    "idx": 5909
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`name` = 'Montreal Canadiens')\nRETURN COUNT(DISTINCT `t3`.`hofid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many coaches of the Montreal Canadiens have gotten in the Hall of Fame?",
    "evidence": "have gotten in the Hall of Fame means hofID is not NULL;\n\nMontreal Canadiens is the name of team.",
    "idx": 5910
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`name` = 'Montreal Canadiens' AND NOT `t3`.`coachid` IS NULL)\nRETURN `t3`.`height` AS `height` ORDER BY `t3`.`height` IS NULL ASC, `t3`.`height` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the height of the tallest coach of the Montreal Canadiens.",
    "evidence": "the tallest refers to MAX(height); Montreal Canadiens is the name of team;",
    "idx": 5911
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teamssc`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`year` = 1922)\nRETURN `t3`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the first names of the coaches whose team played in 1922's Stanley Cup finals.",
    "evidence": "teams refer to tmID; year = 1922;",
    "idx": 5912
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`name` = 'Philadelphia Flyers' AND `t3`.`birthmon` = '3')\nRETURN COUNT(DISTINCT `t3`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who have taught the Philadelphia Flyers, how many of them are born in March?",
    "evidence": "born in March refers to birthMon = 3; Philadelphia Flyers is the name of team;",
    "idx": 5913
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`name` = 'Philadelphia Flyers' AND `t3`.`birthcountry` = 'USA')\nRETURN COUNT(DISTINCT `t3`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who are born in the USA, how many of them used to train the Philadelphia Flyers?",
    "evidence": "born in the USA refers to birthCountry = 'USA'; Philadelphia Flyers is the name of team;",
    "idx": 5914
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`name` = 'Buffalo Sabres' AND NOT `t3`.`deathyear` IS NULL)\nRETURN COUNT(DISTINCT `t3`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many coaches who have taught the Buffalo Sabres have died?",
    "evidence": "have died means deathYear is not NULL; Buffalo Sabres is the name of team;",
    "idx": 5915
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`name` = 'Buffalo Sabres' AND `t3`.`birthcountry` = 'USA')\nRETURN DISTINCT `t3`.`namenick` AS `namenick`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the nick names of the coaches who are from the USA and have taught the Buffalo Sabres.",
    "evidence": "from the USA refers to birthCountry = 'USA'; nick names of the coaches refer to nameNick where coachID is not NULL ; Buffalo Sabres is the name of team;",
    "idx": 5916
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teamssc`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`year` = 1922 AND `t3`.`birthcountry` = 'USA')\nRETURN COUNT(DISTINCT `t3`.`coachid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who taught the teams in 1922's Stanley Cup finals, how many of them are from the USA?",
    "evidence": "from the USA refers to birthCountry = 'USA'; year = 1922;",
    "idx": 5917
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`teams`)-[stanley_cup_stats_0:stanley_cup_stats]->(`t2`:`teamssc`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`name` = 'Montreal Canadiens' AND `t1`.`year` = 1918)\nRETURN `t2`.`pim` AS `pim`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many penalty minutes did the Montreal Canadiens have in the 1918's Stanley Cup Finals?",
    "evidence": "penalty minutes refer to PIM; year = 1918; Montreal Canadiens is name of team;",
    "idx": 5918
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`teams`)-[stanley_cup_stats_0:stanley_cup_stats]->(`t2`:`teamssc`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`name` = 'Montreal Canadiens' AND `t2`.`pim` = '24')\nRETURN `t2`.`w` AS `w`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the year that the Montreal Canadiens had 24 penalty minutes in the Stanley Cup finals, how many wins did the team had in total?",
    "evidence": "penalty minutes refer to PIM = 24; wins refer to W;",
    "idx": 5919
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`teams`)-[stanley_cup_stats_0:stanley_cup_stats]->(`t2`:`teamssc`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`name` = 'Montreal Canadiens' AND `t2`.`pim` = '49')\nRETURN `t1`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which year did the Montreal Canadiens have 49 penalty minutes in the Stanley Cup finals? Was it 1924, 1923 or 1918?",
    "evidence": "penalty minutes refer to PIM = 49;",
    "idx": 5920
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t2`.`name` = 'Montreal Canadiens')\nORDER BY `t1`.`year` IS NULL DESC, `t1`.`year`  \nRETURN `t3`.`firstname` AS `firstname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which coach was the first one to teach the Montreal Canadiens, please give his first name.",
    "evidence": "the first one refers to MIN(year);",
    "idx": 5921
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)\nMATCH ()-[t1:competed_against]->()\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND (`t2`.`name` = 'Buffalo Sabres' AND `t1`.`year` = 2000)\nRETURN CASE WHEN COUNT(`t1`.`oppid`)=0 THEN NULL ELSE sum(CASE WHEN `t2`.`g`=0 THEN NULL ELSE toFloat(`t2`.`w`) / `t2`.`g` END) / COUNT(`t1`.`oppid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average winning rate of the Buffalo Sabres in 2000?",
    "evidence": "DIVIDE(SUM(DIVIDE(W,G), COUNT(oppID) where year = 2000; Montreal Canadiens is name of team;",
    "idx": 5922
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`teams`)-[stanley_cup_stats_0:stanley_cup_stats]->(`t2`:`teamssc`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`name` = 'Montreal Canadiens')\nRETURN CASE WHEN sum(`t2`.`g` + `t2`.`w`)=0 THEN NULL ELSE sum(CASE WHEN `t2`.`g`=0 THEN NULL ELSE `t2`.`w` / `t2`.`g` END) / sum(`t2`.`g` + `t2`.`w`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average winning rate of the Montreal Canadiens in the Stanley Cup finals?",
    "evidence": "DIVIDE(SUM(DIVIDE(W,G), COUNT(oppID);",
    "idx": 5923
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`teams`)-[stanley_cup_stats_0:stanley_cup_stats]->(`t2`:`teamssc`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`name` = 'Montreal Canadiens')\nRETURN CASE WHEN sum(`t2`.`g` + `t2`.`w`)=0 THEN NULL ELSE sum(CASE WHEN `t2`.`g`=0 THEN NULL ELSE toFloat(`t2`.`w`) / `t2`.`g` END) / sum(`t2`.`g` + `t2`.`w`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of American coaches among all the coaches who taught the Montreal Canadiens?",
    "evidence": "American refers to birthCountry = 'USA'; DIVIDE(COUNT(coachID where birthCountry = 'USA', name` = 'Montreal Canadiens'), COUNT(coachID where name` = 'Montreal Canadiens')) as percentage;",
    "idx": 5924
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`hof`:`hof`)\nWHERE `hof`.`category` IN ['Player', 'Builder']\nORDER BY `hof`.`year` IS NULL ASC, `hof`.`year` DESC \nRETURN `hof`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who was the latest non player/builder to become the hall of famer? Give the full name.",
    "evidence": "latest refers to MAX(year); non player/builder refers to category = NOT IN ('player', 'builder');",
    "idx": 5925
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`hof`:`hof`)\nWHERE `hof`.`category` = 'Builder' AND `hof`.`year` >= 1970 AND `hof`.`year` <= 1979\nRETURN `hof`.`name` AS `name`, `hof`.`hofid` AS `hofid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all the referees, who became a hall of famer in the 1970s? What's his hofID?",
    "evidence": "1970s refers to year between 1970 and 1979; referees stand for category;",
    "idx": 5926
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`hof`:`hof`)\nWHERE `hof`.`category` = 'Player' AND `hof`.`year` = 1958\nRETURN COUNT(`hof`.`hofid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the year 1958, what is the total number of players that became hall of famers?",
    "evidence": "hall of famers refers to hofID; players stand for category;",
    "idx": 5927
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE NOT `master`.`hofid` IS NULL AND NOT `master`.`playerid` IS NULL AND NOT `master`.`coachid` IS NULL\nRETURN COUNT(`master`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many hall of famers both played and coached in the league?",
    "evidence": "hall of famers refers to hofID; both played and coached means playerID is not NULL and coachID is not NULL;",
    "idx": 5928
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`master`:`master`)\nWHERE `master`.`lastname` = 'Green' AND `master`.`coachid` IS NULL\nRETURN COUNT(`master`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the number of players whose last name is Green that played in the league but not coached?",
    "evidence": "played in the league but not coached means playerID is not NULL and coachID is NULL;",
    "idx": 5929
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t2`:`teams`)-[coached_by_0:coached_by]->(`t1`:`coaches`)\nMATCH (`t3`:`master`)-[coach_profile_0:coach_profile]->(`t1`:`coaches`)\nWHERE `t1`.`year` = `t2`.`year` AND `t1`.`tmid` = `t2`.`tmid`\nAND `t1`.`coachid` = `t3`.`coachid`\nAND (`t3`.`firstname` = 'Scotty' AND `t3`.`lastname` = 'Bowman' AND `t1`.`year` = 1982)\nRETURN `t2`.`benchminor` AS `benchminor`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the team that Scotty Bowman coached in 1982, how many bench minor penalties did they have that year?",
    "evidence": "bench minor penalties refer to BenchMinor; Scotty Bowman is a coach; year = 1982;",
    "idx": 5930
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`goalies`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`eng` = '10')\nORDER BY `t2`.`height` IS NULL ASC, `t2`.`height` DESC \nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players who had 10 empty net goals in their career, who is the tallest? Show his full name.",
    "evidence": "10 empty net goals refer to ENG = 10; tallest refers to MAX(height);",
    "idx": 5931
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`goalies`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid` AND `t1`.`year` = 1973\nAND (`t1`.`tmid` = 'QUN' AND `t1`.`gp` = '32')\nRETURN `t2`.`shootcatch` AS `shootcatch`, `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which was the dominant hand for the goaltender who played 32 games for QUN in 1973? Give the full name.",
    "evidence": "the dominant hand refers to shootCatch; year = 1973; tmID = 'QUN'; played 32 games refers to GP = 32;",
    "idx": 5932
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`goalies`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`lastname` = 'Young')\nRETURN COUNT(DISTINCT `t1`.`tmid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the goalie whose last name is \"Young\", how many teams did he play in?",
    "evidence": "goalie is a players; teams refer to tmID;",
    "idx": 5933
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`goalies`)-[player_profile_0:player_profile]->(`t2`:`master`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`year` = 1972 AND `t1`.`tmid` = 'BOS' AND NOT `t2`.`coachid` IS NULL AND `t2`.`hofid` IS NULL)\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`, CASE WHEN `t1`.`tmid` = 'BOS' THEN 'YES' ELSE 'NO' END AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the goalkeeper that became a coach than a Hall of Famer, who played for BOS in 1972?",
    "evidence": "BOS refers to tmID = 'BOS'; year = 1972; became a coach than a Hall of Famer means coachID is not NULL and hofID is NULL;",
    "idx": 5934
  },
  {
    "filename": "train.json",
    "db_id": "hockey",
    "gql_statement": "MATCH (`t1`:`goalies`)-[played_for_0:played_for]->(`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t2`.`name` = 'Calgary Flames')\nRETURN COUNT(DISTINCT `t1`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many goalies played for Calgary Flames?",
    "evidence": "Calgary Flames is the name of team;",
    "idx": 5935
  }
]