[
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`physician`)-[t2:prescribes]->(`t3`:`medication`)\nWHERE `t1`.`employeeid` = `t2`.`physician`\nAND `t3`.`code` = `t2`.`medication`\nAND (`t3`.`brand` = 'X')\nRETURN DISTINCT `t1`.`name` AS `name`, `t1`.`position` AS `position`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which physicians prescribe a medication of brand X? Tell me the name and position of those physicians.",
    "evidence": "",
    "idx": 4472
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`physician`:`physician`)\nWHERE `physician`.`position` =~ '(?i)(?s).*senior.*'\nRETURN `physician`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of physicians whose position title contains the word 'senior'.",
    "evidence": "",
    "idx": 4473
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`physician`:`physician`)\nWHERE `physician`.`position` =~ '(?i)(?s).*senior.*'\nRETURN `physician`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the physicians who have 'senior' in their titles.",
    "evidence": "",
    "idx": 4474
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t2`:`patient`)-[t1:undergoes]->(`t3`:`stay`)\nWHERE `t1`.`patient` = `t2`.`ssn`\nAND `t1`.`stay` = `t3`.`stayid`\nAND (`t3`.`room` = 111)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all patients who have an undergoing treatment and are staying in room 111.",
    "evidence": "",
    "idx": 4477
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t2`:`nurse`)-[t1:undergoes]->()\nWHERE `t1`.`assistingnurse` = `t2`.`employeeid`\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of nurses who are nursing an undergoing treatment.",
    "evidence": "",
    "idx": 4481
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`medication`:`medication`)\nRETURN DISTINCT `medication`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all distinct medications, ordered in an alphabetical order.",
    "evidence": "",
    "idx": 4483
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`procedures`:`procedures`)\nRETURN MAX(`procedures`.`cost`) AS `_col_0`, min(`procedures`.`cost`) AS `_col_1`, avg(`procedures`.`cost`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Tell me the highest, lowest, and average cost of procedures.",
    "evidence": "",
    "idx": 4494
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`procedures`:`procedures`)\nRETURN `procedures`.`name` AS `name`, `procedures`.`cost` AS `cost` ORDER BY `cost` IS NULL ASC, `cost` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name and cost of all procedures sorted by the cost from the highest to the lowest.",
    "evidence": "",
    "idx": 4495
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`procedures`:`procedures`)\nRETURN `procedures`.`name` AS `name`, `procedures`.`cost` AS `cost` ORDER BY `cost` IS NULL ASC, `cost` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort the list of names and costs of all procedures in the descending order of cost.",
    "evidence": "",
    "idx": 4496
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`procedures`:`procedures`)\nORDER BY `procedures`.`cost` IS NULL DESC, `procedures`.`cost`  \nRETURN `procedures`.`name` AS `name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the three most expensive procedures.",
    "evidence": "",
    "idx": 4497
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`physician`)-[t2:involved_in]->(`t3`:`procedures`)\nWHERE `t1`.`employeeid` = `t2`.`physician`\nAND `t3`.`code` = `t2`.`treatment`\nAND (`t3`.`cost` > 5000)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the physicians who are trained in a procedure that costs more than 5000.",
    "evidence": "",
    "idx": 4499
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`physician`)-[t2:involved_in]->(`t3`:`procedures`)\nWHERE `t1`.`employeeid` = `t2`.`physician`\nAND `t3`.`code` = `t2`.`treatment`\nORDER BY `t3`.`cost` IS NULL ASC, `t3`.`cost` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which physician was trained in the procedure that costs the most.",
    "evidence": "",
    "idx": 4502
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`physician`)-[t2:involved_in]->(`t3`:`procedures`)\nWHERE `t1`.`employeeid` = `t2`.`physician`\nAND `t3`.`code` = `t2`.`treatment`\nAND (`t1`.`name` = 'John Wen')\nRETURN avg(`t3`.`cost`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the mean price of procedures physician John Wen was trained in.",
    "evidence": "",
    "idx": 4504
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`physician`)-[t2:involved_in]->(`t3`:`procedures`)\nWHERE `t1`.`employeeid` = `t2`.`physician`\nAND `t3`.`code` = `t2`.`treatment`\nAND (`t1`.`name` = 'John Wen')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of procedures which physician John Wen was trained in.",
    "evidence": "",
    "idx": 4505
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`physician`)-[t2:affiliated_with]->(`t3`:`department`)\nWHERE `t1`.`employeeid` = `t2`.`physician`\nAND `t2`.`department` = `t3`.`departmentid`\nAND (`t3`.`name` = 'Surgery' OR `t3`.`name` = 'Psychiatry')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of physicians who are affiliated with Surgery or Psychiatry department.",
    "evidence": "",
    "idx": 4509
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t1_sub0:prescribes]->(`t2_sub0`:`medication`)\nWHERE `t1_sub0`.`medication` = `t2_sub0`.`code`\nAND (`t2_sub0`.`name` = 'Procrastin-X')\nRETURN `t1_sub0`.`patient` AS `patient`   } AS in_collect_0\nMATCH (`patient`:`patient`)\nWHERE NOT `patient`.`ssn` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of patients who are not using the medication of Procrastin-X.",
    "evidence": "",
    "idx": 4511
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`appointment`:`appointment`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count how many appointments have been made in total.",
    "evidence": "",
    "idx": 4514
  },
  {
    "filename": "train_spider.json",
    "db_id": "hospital_1",
    "gql_statement": "MATCH (`t1`:`nurse`)-[t2:on_call]->()\nWHERE `t1`.`employeeid` = `t2`.`nurse`\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of nurses who are on call.",
    "evidence": "",
    "idx": 4515
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "MATCH (`ship`:`ship`)\nORDER BY `ship`.`tonnage` IS NULL DESC, `ship`.`tonnage`  \nRETURN `ship`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of ships in ascending order of tonnage.",
    "evidence": "",
    "idx": 4519
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "MATCH (`ship`:`ship`)\nWHERE `ship`.`nationality` <> 'United States'\nRETURN `ship`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of ships whose nationality is not \"United States\".",
    "evidence": "",
    "idx": 4523
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "MATCH (`ship`:`ship`)\nWHERE `ship`.`nationality` = 'United States' OR `ship`.`nationality` = 'United Kingdom'\nRETURN `ship`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of ships whose nationality is either United States or United Kingdom.",
    "evidence": "",
    "idx": 4525
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "MATCH (`ship`:`ship`)\nWITH `ship`.`type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different types of ships and the number of ships of each type.",
    "evidence": "",
    "idx": 4529
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "MATCH (`ship`:`ship`)\nWITH `ship`.`nationality` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `nationality`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the nations that have more than two ships.",
    "evidence": "",
    "idx": 4531
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "MATCH (`ship`:`ship`)\nWITH `ship`.`type` AS _groupby_col_0, avg(`ship`.`tonnage`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different types of ships and the average tonnage of ships of each type.",
    "evidence": "",
    "idx": 4533
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "MATCH (`t1`:`mission`)-[belongs_to_0:belongs_to]->(`t2`:`ship`)\nWHERE `t1`.`ship_id` = `t2`.`ship_id`\nRETURN `t1`.`code` AS `code`, `t1`.`fate` AS `fate`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show codes and fates of missions, and names of ships involved.",
    "evidence": "",
    "idx": 4535
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "MATCH (`t1`:`mission`)-[belongs_to_0:belongs_to]->(`t2`:`ship`)\nWHERE `t1`.`ship_id` = `t2`.`ship_id`\nAND (`t1`.`launched_year` > 1928)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of ships involved in a mission launched after 1928.",
    "evidence": "",
    "idx": 4537
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "MATCH (`t1`:`mission`)-[belongs_to_0:belongs_to]->(`t2`:`ship`)\nWHERE `t1`.`ship_id` = `t2`.`ship_id`\nAND (`t2`.`nationality` = 'United States')\nRETURN DISTINCT `t1`.`fate` AS `fate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the distinct fate of missions that involve ships with nationality \"United States\"",
    "evidence": "",
    "idx": 4539
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_mission",
    "gql_statement": "WITH *, COLLECT { MATCH (`mission_sub0`:`mission`)\nRETURN `mission_sub0`.`ship_id` AS `ship_id`   } AS in_collect_0\nMATCH (`ship`:`ship`)\nWHERE NOT `ship`.`ship_id` IN in_collect_0\nRETURN `ship`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of ships that are not involved in any mission",
    "evidence": "",
    "idx": 4541
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students in total.",
    "evidence": "",
    "idx": 4543
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWHERE `list`.`classroom` = 111\nRETURN `list`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of students studying in room 111.",
    "evidence": "",
    "idx": 4545
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWHERE `list`.`classroom` = 108\nRETURN `list`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of students studying in room 108.",
    "evidence": "",
    "idx": 4547
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWHERE `list`.`classroom` = 107\nRETURN DISTINCT `list`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the first names of all the students in room 107.",
    "evidence": "",
    "idx": 4550
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nRETURN DISTINCT `list`.`classroom` AS `classroom`, `list`.`grade` AS `grade`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each classroom report the grade that is taught in it. Report just the classroom number and the grade number.",
    "evidence": "",
    "idx": 4551
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWHERE `list`.`classroom` = 103\nRETURN DISTINCT `list`.`grade` AS `grade`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the grade taught in classroom 103.",
    "evidence": "",
    "idx": 4554
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWHERE `list`.`classroom` = 105\nRETURN DISTINCT `list`.`grade` AS `grade`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the grade studying in room 105.",
    "evidence": "",
    "idx": 4555
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWHERE `list`.`grade` = 4\nRETURN DISTINCT `list`.`classroom` AS `classroom`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the classrooms in which grade 4 is studying.",
    "evidence": "",
    "idx": 4558
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWHERE `list`.`grade` = 5\nRETURN DISTINCT `list`.`classroom` AS `classroom`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show me the classrooms grade 5 is using.",
    "evidence": "",
    "idx": 4560
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t1`.`grade` = 5)\nRETURN DISTINCT `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of the teachers that teach fifth grade.",
    "evidence": "",
    "idx": 4561
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t1`.`grade` = 5)\nRETURN DISTINCT `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the last names of the teachers who teach grade 5?",
    "evidence": "",
    "idx": 4562
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t1`.`grade` = 1)\nRETURN DISTINCT `t2`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of the teachers that teach first grade.",
    "evidence": "",
    "idx": 4563
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t1`.`grade` = 1)\nRETURN DISTINCT `t2`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names of the teachers who teach grade 1?",
    "evidence": "",
    "idx": 4564
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`teachers`:`teachers`)\nWHERE `teachers`.`classroom` = 110\nRETURN `teachers`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of all the teachers that teach in classroom 110.",
    "evidence": "",
    "idx": 4565
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`teachers`:`teachers`)\nWHERE `teachers`.`classroom` = 110\nRETURN `teachers`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which teachers teach in classroom 110? Give me their first names.",
    "evidence": "",
    "idx": 4566
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`teachers`:`teachers`)\nWHERE `teachers`.`classroom` = 109\nRETURN `teachers`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of teachers teaching in classroom 109.",
    "evidence": "",
    "idx": 4567
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`teachers`:`teachers`)\nWHERE `teachers`.`classroom` = 109\nRETURN `teachers`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which teachers teach in classroom 109? Give me their last names.",
    "evidence": "",
    "idx": 4568
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`teachers`:`teachers`)\nRETURN DISTINCT `teachers`.`firstname` AS `firstname`, `teachers`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Report the first name and last name of all the teachers.",
    "evidence": "",
    "idx": 4569
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nRETURN DISTINCT `list`.`firstname` AS `firstname`, `list`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Report the first name and last name of all the students.",
    "evidence": "",
    "idx": 4571
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nRETURN DISTINCT `list`.`firstname` AS `firstname`, `list`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show each student's first name and last name.",
    "evidence": "",
    "idx": 4572
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t2`.`firstname` = 'OTHA' AND `t2`.`lastname` = 'MOYER')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all students taught by OTHA MOYER. Output the first and last names of the students.",
    "evidence": "",
    "idx": 4573
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t2`.`firstname` = 'MARROTTE' AND `t2`.`lastname` = 'KIRK')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all students taught by MARROTTE KIRK. Output first and last names of students.",
    "evidence": "",
    "idx": 4575
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t1`.`firstname` = 'EVELINA' AND `t1`.`lastname` = 'BROMLEY')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first and last name of all the teachers that teach EVELINA BROMLEY.",
    "evidence": "",
    "idx": 4577
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t1`.`firstname` = 'GELL' AND `t1`.`lastname` = 'TAMI')\nRETURN `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of all the teachers that teach GELL TAMI.",
    "evidence": "",
    "idx": 4579
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t2`.`firstname` = 'LORIA' AND `t2`.`lastname` = 'ONDERSMA')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of students the teacher LORIA ONDERSMA teaches.",
    "evidence": "",
    "idx": 4582
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t2`.`firstname` = 'KAWA' AND `t2`.`lastname` = 'GORDON')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students taught by the teacher KAWA GORDON.",
    "evidence": "",
    "idx": 4584
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t2`.`firstname` = 'TARRING' AND `t2`.`lastname` = 'LEIA')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students taught by TARRING LEIA.",
    "evidence": "",
    "idx": 4585
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t1`.`firstname` = 'CHRISSY' AND `t1`.`lastname` = 'NABOZNY')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of teachers who teach the student called CHRISSY NABOZNY.",
    "evidence": "",
    "idx": 4588
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t1`.`firstname` = 'MADLOCK' AND `t1`.`lastname` = 'RAY')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of teachers who teach the student called MADLOCK RAY.",
    "evidence": "",
    "idx": 4590
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`t2`:`teachers`)\nMATCH (`t1`:`list`)\nWHERE `t1`.`classroom` = `t2`.`classroom`\nAND (`t1`.`grade` = 3 AND `t2`.`firstname` <> 'COVIN' AND `t2`.`lastname` <> 'JEROME')\nRETURN DISTINCT `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of the students in third grade that are not taught by COVIN JEROME.",
    "evidence": "",
    "idx": 4591
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWITH `list`.`grade` AS _groupby_col_0, COUNT(DISTINCT `list`.`classroom`) AS _groupby_col_1, COUNT(*) AS _groupby_col_2\nRETURN _groupby_col_0 AS `grade`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each grade, report the grade, the number of classrooms in which it is taught and the total number of students in the grade.",
    "evidence": "",
    "idx": 4593
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWITH `list`.`classroom` AS _groupby_col_0, COUNT(DISTINCT `list`.`grade`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `classroom`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each classroom, report the classroom number and the number of grades using it.",
    "evidence": "",
    "idx": 4595
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWITH `list`.`classroom` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `classroom`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Report the number of students in each classroom.",
    "evidence": "",
    "idx": 4597
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWITH `list`.`classroom` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `classroom`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each classroom, show the classroom number and find how many students are using it.",
    "evidence": "",
    "idx": 4598
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWHERE `list`.`grade` = '0'\nWITH `list`.`classroom` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `classroom`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each grade 0 classroom, report the total number of students.",
    "evidence": "",
    "idx": 4599
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWHERE `list`.`grade` = '4'\nWITH `list`.`classroom` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `classroom`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Report the total number of students for each fourth-grade classroom.",
    "evidence": "",
    "idx": 4601
  },
  {
    "filename": "train_spider.json",
    "db_id": "student_1",
    "gql_statement": "MATCH (`list`:`list`)\nWITH `list`.`classroom` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `classroom`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students in one classroom.",
    "evidence": "",
    "idx": 4603
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_employee",
    "gql_statement": "MATCH (`company`:`company`)\nORDER BY `company`.`sales_in_billion` IS NULL DESC, `company`.`sales_in_billion`  \nRETURN `company`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of companies by ascending number of sales.",
    "evidence": "",
    "idx": 4606
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_employee",
    "gql_statement": "MATCH (`company`:`company`)\nWITH `company`.`headquarters` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `headquarters`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the headquarters that have at least two companies.",
    "evidence": "",
    "idx": 4612
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_employee",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[employment_sub0:works_for]->()\nRETURN `employment_sub0`.`people_id` AS `people_id`   } AS in_collect_0\nMATCH (`people`:`people`)\nWHERE NOT `people`.`people_id` IN in_collect_0\nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of people that are not employed by any company",
    "evidence": "",
    "idx": 4617
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_employee",
    "gql_statement": "MATCH (`company`:`company`)\nWHERE `company`.`sales_in_billion` > 200\nORDER BY `company`.`sales_in_billion` IS NULL DESC, `company`.`sales_in_billion` , `company`.`profits_in_billion` IS NULL ASC, `company`.`profits_in_billion` DESC \nRETURN `company`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list the names of the companies with more than 200 sales in the descending order of sales and profits.",
    "evidence": "",
    "idx": 4618
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of films.",
    "evidence": "",
    "idx": 4620
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN DISTINCT `film`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the distinct director of all films.",
    "evidence": "",
    "idx": 4621
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN avg(`film`.`gross_in_dollar`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the average gross sales in dollars across all films.",
    "evidence": "",
    "idx": 4624
  },
  {
    "filename": "train_spider.json",
    "db_id": "film_rank",
    "gql_statement": "MATCH (`market`:`market`)\nRETURN MAX(`market`.`number_cities`) AS `_col_0`, min(`market`.`number_cities`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum and minimum number of cities in all markets.",
    "evidence": "",
    "idx": 4629
  }
]