[
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`nationalaccountsbaseyear` < '1980' AND `country`.`nationalaccountsbaseyear` <> ''\nRETURN `country`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the countries' long name with national accounts base year prior to 1980.",
    "evidence": "national accounts base year prior to 1980 means before 1980 and refers to NationalAccountsBaseYear<1980;",
    "idx": 1549
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`incomegroup` = 'Low income' AND `t2`.`seriescode` = 'DT.DOD.DECT.CD')\nRETURN `t1`.`countrycode` AS `countrycode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which low income country has a series code of DT.DOD.DECT.CD? Name the country code of it.",
    "evidence": "IncomeGroup = 'Low income';",
    "idx": 1550
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Covers mainland Tanzania only.')\nRETURN DISTINCT `t1`.`tablename` AS `tablename`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the table name of country with description of \"Covers mainland Tanzania only\".",
    "evidence": "",
    "idx": 1551
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`tablename` = 'Benin' AND `t2`.`year` = 'YR2005')\nRETURN `t2`.`description` AS `description`, `t2`.`seriescode` AS `seriescode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the description and series code of Benin in year 2005.",
    "evidence": "Benin is the short name of the country; year 2005 refers to Year = 'YR2005';",
    "idx": 1552
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`tablename` = 'Finland' AND `t2`.`year` = 'YR2000')\nRETURN DISTINCT `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the footnote description of Finland in year 2000?",
    "evidence": "Finland is the short name of the country; year 2000 refers to Year = 'YR2000';",
    "idx": 1553
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`indicatorname` = 'Air transport, passengers carried')\nRETURN DISTINCT `t2`.`year` AS `year`, `t1`.`tablename` AS `tablename`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the years when countries have indicator name of \"Air transport, passengers carried\"? List the table name of these countries.",
    "evidence": "",
    "idx": 1554
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`year` = 1980 AND NOT `t2`.`indicatorname` IS NULL)\nRETURN DISTINCT `t1`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the long name of countries with indicator name in 1980.",
    "evidence": "with any indicator name implies IndicatorName is not NULL; Year = '1980';",
    "idx": 1555
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`tablename` = 'Malaysia' AND `t2`.`year` = 1970)\nRETURN `t1`.`currencyunit` AS `currencyunit`, `t2`.`indicatorcode` AS `indicatorcode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the currency of Malaysia and what are the indicator code used by this country in 1970?",
    "evidence": "Malaysia is the name of the country; currency refers to CurrencyUnit; Year = '1970';",
    "idx": 1556
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nORDER BY `t2`.`value` IS NULL ASC, `t2`.`value` DESC \nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`, `t1`.`region` AS `region`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name 5 country codes of country with highest value and state the region of these countries.",
    "evidence": "with highest value refers to MAX(Value);",
    "idx": 1557
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Sources: UN Energy Statistics (2014)')\nRETURN COUNT(DISTINCT `t1`.`countrycode`) AS `_col_0`   \nUNION DISTINCT\nMATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Sources: UN Energy Statistics (2014)')\nRETURN DISTINCT `t1`.`currencyunit` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries have country note description as \"Sources: UN Energy Statistics (2014)\"? List the currency of these countries.",
    "evidence": "countries refer to CountryCode; currency refers to CurrencyUnit;",
    "idx": 1558
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`year` = 'YR1980')\nRETURN COUNT(`t2`.`description`) AS `_col_0`   \nUNION ALL\nMATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`year` = 'YR1980')\nRETURN DISTINCT `t1`.`tablename` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many footnotes have been made in year 1980 and what are the table names of these countries that made the footnotes?",
    "evidence": "year 1980 refers to Year = 'YR1980';",
    "idx": 1559
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Data sources : Eurostat')\nRETURN `t2`.`seriescode` AS `seriescode`, `t1`.`wb2code` AS `wb2code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the series code of country with country notes description as \"Data sources : Eurostat\" and state the Wb2Code of these countries.",
    "evidence": "",
    "idx": 1560
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`incomegroup` = 'Low income' AND `t2`.`indicatorname` = 'Adolescent fertility rate (births per 1,000 women ages 15-19)')\nORDER BY `t2`.`value` IS NULL DESC, `t2`.`value`  \nRETURN `t2`.`countryname` AS `countryname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the low income countries, which country has the lowest fertility rate?",
    "evidence": "fertility rate refers to IndicatorName = 'Adolescent fertility rate (births per 1,000 women ages 15-19)'; lowest refers to MIN(Value); IncomeGroup = 'Low income';",
    "idx": 1561
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`incomegroup` =~ '(?i)(?s).*middle income' AND `t2`.`year` = 1960 AND `t2`.`indicatorname` = 'Urban population')\nRETURN sum(`t2`.`value`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the total urban population of middle income countries in 1960?",
    "evidence": "IncomeGroup = 'Middle income'; Year = 1960; urban population refers to IndicatorName;",
    "idx": 1562
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`indicatorname` = 'Adjusted net national income (annual % growth)' AND `t2`.`year` = 1980 AND `t1`.`currencyunit` <> '')\nORDER BY `t2`.`value` IS NULL ASC, `t2`.`value` DESC \nRETURN `t2`.`countryname` AS `countryname`, `t1`.`currencyunit` AS `currencyunit`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the country with fastest growth in adjusted net national income in 1980 and state the currency used by this country.",
    "evidence": "fastest growth refers to MAX(Value); IndicatorName = 'Adjusted net national income (annual % growth)'; Year = '1980'; currency refers to CurrencyUnit;",
    "idx": 1563
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`systemofnationalaccounts` = 'Country uses the 1993 System of National Accounts methodology.'\nRETURN COUNT(`country`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries using the 1993 System of National Accounts methodology?",
    "evidence": "use the 1993 System of National Accounts methodology refers to SystemOfNationalAccounts = '1993 System of National Accounts methodology.'",
    "idx": 1564
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`vitalregistrationcomplete` = 'Yes'\nRETURN `country`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country have completed vital registration? List all the countries.",
    "evidence": "have completed vital registration refers to VitalRegistrationComplete = Yes; country name refers to ShortName",
    "idx": 1565
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`latestpopulationcensus` >= '2010' AND `country`.`latestpopulationcensus` < '2013' AND `country`.`vitalregistrationcomplete` = 'Yes'\nRETURN `country`.`shortname` AS `shortname`, `country`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country have conducted population census from 2010 until 2012 and have completed vital registration?",
    "evidence": "from 2010 until 2012 refers to LatestPopulationCensus between '2010' and '2012'; have completed vital registration refers to VitalRegistrationComplete = 'Yes'; CountryName = ShortName + LongName",
    "idx": 1566
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`year` = 1960 AND `indicators`.`indicatorname` = 'CO2 emissions (metric tons per capita)'\nORDER BY `indicators`.`value` IS NULL ASC, `indicators`.`value` DESC \nRETURN `indicators`.`countryname` AS `countryname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country have the highest CO2 emissions in 1960?",
    "evidence": "which country refers to countryname; the highest CO2 emissions refers to max(value where indicatorname = 'CO2 emissions (metric tons per capita)'); in 1960 refers to year = '1970'",
    "idx": 1567
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`seriescode` = 'SP.DYN.CBRT.IN')\nRETURN `t1`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What country have the series code of SP.DYN.CBRT.IN?",
    "evidence": "what country refers to ShortName",
    "idx": 1568
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Data are classified as official aid.')\nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country have data classified as official aid?",
    "evidence": "which country refers to ShortName; have data classified as official aid refers to description = 'Data are classified as official aid.'",
    "idx": 1569
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Estimates are based on regression.')\nRETURN DISTINCT `t1`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What country have its data estimated based on regression?",
    "evidence": "what country refers to LongName; have its data estimated based on regression refers to description = 'Estimates are based on regression.'",
    "idx": 1570
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`year` = 1970 AND `t1`.`region` = 'East Asia & Pacific' AND `t2`.`value` > 2000000 AND `t2`.`indicatorname` = 'Urban population')\nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the country in East Asia & Pacific region that have more than 2000000 urban population in 1970.",
    "evidence": "country refers to LongName; have more than 2000000 urban population refers to value where indicatorname = 'Urban population'>2000000; in 1970 refers to year = '1970'",
    "idx": 1571
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`incomegroup` = 'Upper middle income' AND `t2`.`year` = 1960 AND `t2`.`indicatorname` = 'Population, total')\nRETURN MAX(`t2`.`value`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 1960, what is largest population for country with upper middle income?",
    "evidence": "in 1960 refers to year = '1960'; the largest population refers to max(value where IndicatorName = 'Population, total'); country with upper middle income refers to incomegroup = 'Upper middle income'",
    "idx": 1572
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`systemofnationalaccounts` = 'Country uses the 1968 System of National Accounts methodology.'\nRETURN COUNT(`country`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries uses the 1968 System of National Accounts methodology?",
    "evidence": "uses the 1968 System of National Accounts methodology refers to SystemOfNationalAccounts = '1968 System of National Accounts methodology'",
    "idx": 1573
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->(`t3`:`series`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND `t2`.`seriescode` = `t3`.`seriescode`\nAND (`t1`.`incomegroup` = 'Upper middle income' AND `t1`.`region` = 'East Asia & Pacific' AND `t3`.`topic` = 'Social Protection & Labor: Migration')\nRETURN DISTINCT `t1`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What upper middle income country under East Asia & Pacific region which covers the topic about Social Protection & Labor: Migration\n? Indicate the short name of the said country.",
    "evidence": "upper middle income country refers to incomegroup = 'Upper middle income'",
    "idx": 1574
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->(`t3`:`series`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND `t2`.`seriescode` = `t3`.`seriescode`\nAND (`t3`.`topic` = 'Poverty: Shared prosperity')\nRETURN DISTINCT `t1`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the country in which the topic is about Poverty: Shared Prosperity. Indicate the long name of the country.",
    "evidence": "",
    "idx": 1575
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`latesttradedata` = 2013 AND `t2`.`indicatorcode` = 'SP.DYN.CDRT.IN')\nRETURN DISTINCT `t1`.`tablename` AS `tablename`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What country has the latest trade data with a series code of \"SP.DYN.CDRT.IN\n\"? List the table name of the country.",
    "evidence": "the latest trade data refers to LatestTradeData = '2013'; with a series code of \"SP.DYN.CDRT.IN\n\" refers to indicatorcode = 'SP.DYN.CDRT.IN'",
    "idx": 1576
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`seriesnotes`)\nMATCH ()-[t2:note]->(`t3`:`country`)\nWHERE `t1`.`seriescode` = `t2`.`seriescode`\nAND `t2`.`countrycode` = `t3`.`countrycode`\nAND (`t3`.`region` = 'Sub-Saharan Africa' AND `t1`.`seriescode` = 'SP.DYN.AMRT.FE')\nRETURN DISTINCT `t3`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What country in the region of Sub-Saharan Africa has a series code of \"SP.DYN.AMRT.FE\"? Indicate the long name of the country",
    "evidence": "",
    "idx": 1577
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`currencyunit` = 'U.S. dollar'\nRETURN `country`.`shortname` AS `shortname`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries are using the same type of currency? Please list the short names of any 3 countries.",
    "evidence": "any 3 countries refers to count(shortname)>3",
    "idx": 1578
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`incomegroup` = 'Low income' AND `country`.`region` = 'South Asia'\nRETURN `country`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What South Asian nations have low incomes? Please include the entire names of the nations in your answer.",
    "evidence": "South Asian nations refers to region = 'South Asia'; have low incomes refers to incomegroup = 'Low income'; the entire names refers to longname",
    "idx": 1579
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`systemoftrade` = 'Special trade system'\nRETURN `country`.`longname` AS `longname`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide full name of any two countries using special trade system.",
    "evidence": "full name refers to longname; using special trade system refers to systemoftrade = 'Special trade system'",
    "idx": 1580
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`indicatorname` =~ '(?i)(?s)CO2 emissions FROM transport.*'\nORDER BY `indicators`.`value` IS NULL ASC, `indicators`.`value` DESC \nRETURN `indicators`.`countryname` AS `countryname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country has had the highest proportion of CO2 emissions from transport?",
    "evidence": "the highest proportion of CO2 emissions from transport refers to max(value where indicatorname = 'CO2 emissions from transport (% of total fuel combustion)')",
    "idx": 1581
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`indicatorname` =~ '(?i)(?s)Arable land (.* of land area)'\nORDER BY `indicators`.`value` IS NULL ASC, `indicators`.`value` DESC \nRETURN `indicators`.`countryname` AS `countryname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country has the lowest percentage of arable land?",
    "evidence": "which country refers to countryname; the lowest percentage of arable land refers to min(value where indicatorname = 'Arable land (% of land area)')",
    "idx": 1582
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`series`:`series`)\nWHERE `series`.`licensetype` = 'Restricted'\nRETURN DISTINCT `series`.`topic` AS `topic`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the subjects of series that have a restricted type of license?",
    "evidence": "subjects refers to topic; a restricted type of license refers to  licenseType = 'Restricted'",
    "idx": 1583
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`incomegroup` = 'Upper middle income' AND `country`.`externaldebtreportingstatus` = 'Preliminary'\nRETURN `country`.`countrycode` AS `countrycode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which countries in the upper middle income category still have unfinished external debt reporting? Please provide the country codes in your answer.",
    "evidence": "in the upper middle income category refers to incomegroup = 'Upper middle income'; still have unfinished external debt reporting refers to ExternalDebtReportingStatus = 'Preliminary'",
    "idx": 1584
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`region` = 'Middle East & North Africa'\nRETURN CASE WHEN COUNT(`country`.`countrycode`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `country`.`externaldebtreportingstatus` = 'Actual' THEN 1 ELSE 0 END)) * 100 / COUNT(`country`.`countrycode`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of countries in the Middle East and North Africa that have finished reporting on their real external debt?",
    "evidence": "percentage = divide(count(countrycode where  ExternalDebtReportingStatus = 'Actual' ), count(countrycode))*100%; in the Middle East and North Africa refers to region = 'Middle East & North Africa'; have finished reporting on their real external debt refers to ExternalDebtReportingStatus = 'Actual'",
    "idx": 1585
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`externaldebtreportingstatus` = 'Actual'\nRETURN sum(CASE  WHEN `country`.`governmentaccountingconcept` = 'Budgetary central government' THEN 1 ELSE 0 END) AS `_col_0`, sum(CASE  WHEN `country`.`governmentaccountingconcept` = 'Consolidated central government' THEN 1 ELSE 0 END) AS `central_nums`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which form of government has more countries that have completed the actual external debt reporting between the two types of government accounting concepts, budgetary central government vs. consolidated central government?",
    "evidence": "have completed the actual external debt reporting refers to ExternalDebtReportingStatus = 'Actual'",
    "idx": 1586
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`region` = 'East Asia & Pacific' AND `country`.`externaldebtreportingstatus` = 'Estimate'\nRETURN COUNT(`country`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many nations in East Asia and the Pacific have completed their external debt reporting on time?",
    "evidence": "in East Asia and the Pacific refers to region = 'East Asia & Pacific'; have completed their external debt reporting on time refers to ExternalDebtReportingStatus = 'Estimate'",
    "idx": 1587
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`region` = 'Sub-Saharan Africa'\nRETURN CASE WHEN COUNT(`country`.`countrycode`)=0 THEN NULL ELSE sum(CASE  WHEN `country`.`incomegroup` = 'Lower middle income' THEN 1 ELSE 0 END) * 100.0 / COUNT(`country`.`countrycode`) END AS `persentage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What proportion of Sub-Saharan Africa's countries have lower middle incomes?",
    "evidence": "proportion = divide(count(countrycode where incomegroup = 'Low income'), count(countrycode))*100%; Sub-Saharan Africa's countries refers to region = 'Sub-Saharan Africa'; have lower middle incomes refers to incomegroup = 'Low income'",
    "idx": 1588
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`year` >= 1961 AND `t1`.`year` < 1981 AND `t1`.`indicatorname` =~ '(?i)(?s)Agricultural land (.* of land area)' AND `t2`.`longname` = 'Republic of Benin')\nRETURN MAX(`t1`.`value`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 1961 to 1980, what was the highest percentage of land used for agriculture in the Republic of Benin?",
    "evidence": "from 1961 to 1980 refers to year between '1961' and '1980'; the highest percentage of land used for agriculture refers to max(value where IndicatorName = 'Agricultural land (% of land area)'); in the Republic of Benin refers to longname = 'Republic of Benin'",
    "idx": 1589
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`longname` = 'Commonwealth of Australia' AND `t1`.`indicatorname` = 'Deposit interest rate (%)' AND `t1`.`year` = 1979)\nRETURN `t1`.`value` AS `value`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the deposit interest rate in the Commonwealth of Australia in 1979 in percentage?",
    "evidence": "deposit interest rate refers to value where IndicatorName = 'Deposit interest rate (%)'; in the Commonwealth of Australia refers to  LongName = 'Commonwealth of Australia'; in 1979 refers to Year = '1979'",
    "idx": 1591
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH ()-[t1:note]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`shortname` = 'Germany')\nRETURN `t1`.`seriescode` AS `seriescode`, `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the series code for Germany and what is its description?",
    "evidence": "Germany refers to shortname = 'Germany'",
    "idx": 1592
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`series`)-[has_note_0:has_note]->(`t2`:`seriesnotes`)\nWHERE `t1`.`seriescode` = `t2`.`seriescode`\nAND (`t1`.`seriescode` = 'SP.DYN.AMRT.MA')\nRETURN DISTINCT `t1`.`topic` AS `topic`, `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the subject of the series SP.DYN.AMRT.MA and what does it pertain to?",
    "evidence": "subject refers to topic; pertain to refers to Description",
    "idx": 1594
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Unspecified' OR `t2`.`description` = 'Not specified')\nRETURN COUNT(DISTINCT `t1`.`countrycode`) AS `_col_0`   \nUNION DISTINCT\nMATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`description` = 'Unspecified' OR `t2`.`description` = 'Not specified')\nRETURN `t1`.`longname` AS `_col_0`   \nLIMIT 4",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries are having their country's footnotes described as \"unspecified\"? Please provide the full names of any three of those countries.",
    "evidence": "described as \"unspecified\" refers to Description = 'Not specified'; full names refers to LongName",
    "idx": 1595
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`indicatorname` =~ '(?i)(?s)Land under cereal production.*' AND `t1`.`value` = 3018500 AND `t1`.`year` = 1980 AND `t2`.`externaldebtreportingstatus` = 'Actual')\nRETURN `t2`.`countrycode` AS `countrycode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which nation completed its external debt reporting in 1980 and had a Land under cereal production value of 3018500?",
    "evidence": "completed its external debt reporting refers to ExternalDebtReportingStatus = 'Actual'; in 1980 refers to year = 1980; Land under cereal production value of 3018500 refers to value = 3018500",
    "idx": 1596
  }
]