[
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH ()-[t1:includes]->(`t2`:`products`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t2`.`product_name` = 'photo')\nRETURN sum(`t1`.`order_quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total order quantities of photo products?",
    "evidence": "",
    "idx": 5454
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH ()-[t1:includes]->(`t2`:`products`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t2`.`product_price` > 2000)\nRETURN `t1`.`other_item_details` AS `other_item_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the order details of the products with price higher than 2000?",
    "evidence": "",
    "idx": 5456
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t1`:`customer_orders`)-[t2:includes]->()\nWHERE `t1`.`order_id` = `t2`.`order_id`\nAND (`t2`.`order_quantity` = 1)\nRETURN `t1`.`actual_delivery_date` AS `actual_delivery_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the actual delivery dates of orders with quantity 1?",
    "evidence": "",
    "idx": 5458
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t1`:`customer_orders`)-[t2:includes]->()\nWHERE `t1`.`order_id` = `t2`.`order_id`\nAND (`t2`.`order_quantity` = 1)\nRETURN `t1`.`actual_delivery_date` AS `actual_delivery_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the actual delivery date for all the orders with quantity 1",
    "evidence": "",
    "idx": 5459
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t1`:`customer_orders`)-[t2:includes]->(`t3`:`products`)\nWHERE `t1`.`order_id` = `t2`.`order_id`\nAND `t2`.`product_id` = `t3`.`product_id`\nAND (`t3`.`product_price` > 1000)\nRETURN `t1`.`order_date` AS `order_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the order dates of orders with price higher than 1000?",
    "evidence": "",
    "idx": 5460
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`drama_workshop_groups`:`drama_workshop_groups`)\nRETURN COUNT(DISTINCT `drama_workshop_groups`.`currency_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of distinct currency codes used in drama workshop groups.",
    "evidence": "",
    "idx": 5463
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t2`:`drama_workshop_groups`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`city_town` = 'Feliciaberg')\nRETURN `t2`.`store_name` AS `store_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the drama workshop groups with address in Feliciaberg city?",
    "evidence": "",
    "idx": 5464
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t2`:`drama_workshop_groups`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`state_county` = 'Alaska')\nRETURN `t2`.`store_email_address` AS `store_email_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the email addresses of the drama workshop groups with address in Alaska state?",
    "evidence": "",
    "idx": 5466
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t2`:`drama_workshop_groups`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nWITH `t1`.`city_town` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `city_town`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all cities along with the number of drama workshop groups in each city.",
    "evidence": "",
    "idx": 5468
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t1`:`bookings`)-[booked_for_0:booked_for]->(`t2`:`drama_workshop_groups`)\nWHERE `t1`.`workshop_group_id` = `t2`.`workshop_group_id`\nAND (`t1`.`status_code` = 'stop')\nRETURN `t2`.`store_name` AS `store_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the workshop groups that have bookings with status code \"stop\"?",
    "evidence": "",
    "idx": 5470
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`band`:`band`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many bands are there?",
    "evidence": "",
    "idx": 5472
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`band`:`band`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of bands.",
    "evidence": "",
    "idx": 5473
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`albums`:`albums`)\nRETURN DISTINCT `albums`.`label` AS `label`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the labels?",
    "evidence": "",
    "idx": 5474
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`albums`:`albums`)\nRETURN DISTINCT `albums`.`label` AS `label`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different album labels listed?",
    "evidence": "",
    "idx": 5475
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`albums`:`albums`)\nWHERE `albums`.`year` = 2012\nRETURN `albums`.`aid` AS `aid`, `albums`.`title` AS `title`, `albums`.`year` AS `year`, `albums`.`label` AS `label`, `albums`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the albums in 2012.",
    "evidence": "",
    "idx": 5476
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->()\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND (`t2`.`firstname` = 'Solveig')\nRETURN DISTINCT `t1`.`stageposition` AS `stageposition`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the stage positions of the musicians with first name \"Solveig\"",
    "evidence": "",
    "idx": 5478
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->()\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND (`t2`.`firstname` = 'Solveig')\nRETURN DISTINCT `t1`.`stageposition` AS `stageposition`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different stage positions for all musicians whose first name is \"Solveig\"?",
    "evidence": "",
    "idx": 5479
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`songs`:`songs`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many songs are there?",
    "evidence": "",
    "idx": 5480
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`songs`:`songs`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of songs.",
    "evidence": "",
    "idx": 5481
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t2`.`lastname` = 'Heilo')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the songs performed by artist with last name \"Heilo\"",
    "evidence": "",
    "idx": 5482
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t2`.`lastname` = 'Heilo')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the songs by the artist whose last name is \"Heilo\"?",
    "evidence": "",
    "idx": 5483
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t3`.`title` = 'Flash')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Hom many musicians performed in the song \"Flash\"?",
    "evidence": "",
    "idx": 5484
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t3`.`title` = 'Flash')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many musicians play in the song \"Flash\"?",
    "evidence": "",
    "idx": 5485
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t2`.`firstname` = 'Marianne')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the songs produced by artists with first name \"Marianne\".",
    "evidence": "",
    "idx": 5486
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t2`.`firstname` = 'Marianne')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all songs produced by the artist with the first name \"Marianne\"?",
    "evidence": "",
    "idx": 5487
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t3`.`title` = 'Badlands')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who performed the song named \"Badlands\"? Show the first name and the last name.",
    "evidence": "",
    "idx": 5488
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t3`.`title` = 'Badlands' AND `t1`.`stageposition` = 'back')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is performing in the back stage position for the song \"Badlands\"? Show the first name and the last name.",
    "evidence": "",
    "idx": 5490
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`albums`:`albums`)\nRETURN COUNT(DISTINCT `albums`.`label`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many unique labels are there for albums?",
    "evidence": "",
    "idx": 5492
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`albums`:`albums`)\nRETURN COUNT(DISTINCT `albums`.`label`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the unique labels for the albums?",
    "evidence": "",
    "idx": 5493
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`songs`:`songs`)\nWHERE `songs`.`title` =~ '(?i)(?s).* the .*'\nRETURN `songs`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the songs whose name contains the word \"the\".",
    "evidence": "",
    "idx": 5494
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`songs`:`songs`)\nWHERE `songs`.`title` =~ '(?i)(?s).* the .*'\nRETURN `songs`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the songs whose title has the word \"the\"?",
    "evidence": "",
    "idx": 5495
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nMATCH (`t2`:`band`)-[t4:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND `t4`.`songid` = `t3`.`songid` AND `t4`.`bandmateid` = `t2`.`id`\nAND (`t2`.`lastname` = 'Heilo' AND `t3`.`title` = 'Le Pop')\nRETURN `t4`.`instrument` AS `instrument`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What instrument did the musician with last name \"Heilo\" use in the song \"Le Pop\"?",
    "evidence": "",
    "idx": 5498
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->()\nWHERE `t1`.`bandmateid` = `t2`.`id`\nAND (`t2`.`lastname` = 'Heilo')\nRETURN COUNT(DISTINCT `t1`.`instrument`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many instrument does the musician with last name \"Heilo\" use?",
    "evidence": "",
    "idx": 5506
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->()\nWHERE `t1`.`bandmateid` = `t2`.`id`\nAND (`t2`.`lastname` = 'Heilo')\nRETURN COUNT(DISTINCT `t1`.`instrument`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many different instruments does the musician with the last name \"Heilo\" use?",
    "evidence": "",
    "idx": 5507
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->()\nWHERE `t1`.`bandmateid` = `t2`.`id`\nAND (`t2`.`lastname` = 'Heilo')\nRETURN `t1`.`instrument` AS `instrument`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the instruments ever used by the musician with last name \"Heilo\"?",
    "evidence": "",
    "idx": 5508
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->()\nWHERE `t1`.`bandmateid` = `t2`.`id`\nAND (`t2`.`lastname` = 'Heilo')\nRETURN `t1`.`instrument` AS `instrument`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the instruments used by the musician with the last name \"Heilo\"?",
    "evidence": "",
    "idx": 5509
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t3`:`band`)-[t1:performs_in]->(`t2`:`songs`)\nWHERE `t1`.`songid` = `t2`.`songid`\nAND `t1`.`bandmate` = `t3`.`id`\nAND (`t3`.`firstname` = 'Solveig' AND `t2`.`title` = 'A Bar In Amsterdam')\nRETURN `t1`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which vocal type did the musician with first name \"Solveig\" played in the song with title \"A Bar in Amsterdam\"?",
    "evidence": "",
    "idx": 5516
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t3`.`title` = 'Le Pop')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who performed the song named \"Le Pop\"?",
    "evidence": "",
    "idx": 5522
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nMATCH (`t2`:`band`)-[t4:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND `t4`.`songid` = `t3`.`songid` AND `t4`.`bandmateid` = `t2`.`id`\nAND (`t2`.`lastname` = 'Heilo' AND `t3`.`title` = 'Badlands')\nRETURN `t4`.`instrument` AS `instrument`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What instrument did the musician with last name \"Heilo\" use in the song \"Badlands\"?",
    "evidence": "",
    "idx": 5524
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t3`:`band`)-[t1:performs_in]->(`t2`:`songs`)\nWHERE `t1`.`songid` = `t2`.`songid`\nAND `t1`.`bandmate` = `t3`.`id`\nAND (`t3`.`lastname` = 'Heilo' AND `t2`.`title` = 'Der Kapitan')\nRETURN `t1`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which vocal type did the musician with last name \"Heilo\" played in the song with title \"Der Kapitan\"?",
    "evidence": "",
    "idx": 5534
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t2`:`band`)-[t1:performs_in]->(`t3`:`songs`)\nWHERE `t1`.`bandmate` = `t2`.`id`\nAND `t3`.`songid` = `t1`.`songid`\nAND (`t3`.`title` = 'Der Kapitan' AND `t1`.`stageposition` = 'back')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is performing in the back stage position for the song \"Der Kapitan\"? Show the first name and last name.",
    "evidence": "",
    "idx": 5536
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t1`:`albums`)-[t2:contains_song]->(`t3`:`songs`)\nWHERE `t1`.`aid` = `t2`.`albumid`\nAND `t2`.`songid` = `t3`.`songid`\nAND (`t1`.`title` = 'A Kiss Before You Go: Live in Hamburg')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the songs in album \"A Kiss Before You Go: Live in Hamburg\"?",
    "evidence": "",
    "idx": 5538
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t1`:`albums`)-[t2:contains_song]->(`t3`:`songs`)\nWHERE `t1`.`aid` = `t2`.`albumid`\nAND `t2`.`songid` = `t3`.`songid`\nAND (`t1`.`label` = 'Universal Music Group')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the songs in albums under label \"Universal Music Group\"?",
    "evidence": "",
    "idx": 5540
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t1`:`albums`)-[t2:contains_song]->(`t3`:`songs`)\nWHERE `t1`.`aid` = `t2`.`albumid`\nAND `t2`.`songid` = `t3`.`songid`\nAND (`t1`.`type` = 'Studio')\nRETURN COUNT(DISTINCT `t3`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of songs in all the studio albums.",
    "evidence": "",
    "idx": 5542
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_2",
    "gql_statement": "MATCH (`t1`:`albums`)-[t2:contains_song]->(`t3`:`songs`)\nWHERE `t1`.`aid` = `t2`.`albumid`\nAND `t2`.`songid` = `t3`.`songid`\nAND (`t1`.`type` = 'Studio')\nRETURN COUNT(DISTINCT `t3`.`title`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many songs appear in studio albums?",
    "evidence": "",
    "idx": 5543
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`name` = 'Sony'\nRETURN `manufacturers`.`founder` AS `founder`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the founder of Sony.",
    "evidence": "",
    "idx": 5545
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nORDER BY `manufacturers`.`revenue` IS NULL ASC, `manufacturers`.`revenue` DESC \nRETURN `manufacturers`.`name` AS `name`, `manufacturers`.`headquarter` AS `headquarter`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all manufacturers' names and their headquarters, sorted by the ones with highest revenue first.",
    "evidence": "",
    "idx": 5548
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nRETURN avg(`manufacturers`.`revenue`) AS `_col_0`, MAX(`manufacturers`.`revenue`) AS `_col_1`, sum(`manufacturers`.`revenue`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average, maximum and total revenues of all companies?",
    "evidence": "",
    "idx": 5550
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`founder` = 'Andy'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the number of companies created by Andy.",
    "evidence": "",
    "idx": 5553
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`headquarter` = 'Austin'\nRETURN sum(`manufacturers`.`revenue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total revenue created by the companies whose headquarter is located at Austin.",
    "evidence": "",
    "idx": 5554
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`headquarter` = 'Austin'\nRETURN sum(`manufacturers`.`revenue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the sum of revenue from companies with headquarters in Austin?",
    "evidence": "",
    "idx": 5555
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nRETURN DISTINCT `manufacturers`.`headquarter` AS `headquarter`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the distinct headquarters of manufacturers.",
    "evidence": "",
    "idx": 5557
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`headquarter` = 'Tokyo' OR `manufacturers`.`headquarter` = 'Beijing'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of manufactures that are based in Tokyo or Beijing.",
    "evidence": "",
    "idx": 5558
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`name` =~ '(?i)(?s)S.*'\nRETURN `manufacturers`.`founder` AS `founder`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the founder of the company whose name begins with the letter 'S'.",
    "evidence": "",
    "idx": 5560
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`name` =~ '(?i)(?s)S.*'\nRETURN `manufacturers`.`founder` AS `founder`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the founders of companies whose first letter is S?",
    "evidence": "",
    "idx": 5561
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`revenue` >= 100 AND `manufacturers`.`revenue` <= 150\nRETURN `manufacturers`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of companies whose revenue is between 100 and 150.",
    "evidence": "",
    "idx": 5562
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`headquarter` = 'Tokyo' OR `manufacturers`.`headquarter` = 'Taiwan'\nRETURN sum(`manufacturers`.`revenue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total revenue of all companies whose main office is at Tokyo or Taiwan?",
    "evidence": "",
    "idx": 5564
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nORDER BY `manufacturers`.`revenue` IS NULL ASC, `manufacturers`.`revenue` DESC \nRETURN `manufacturers`.`name` AS `name`, `manufacturers`.`headquarter` AS `headquarter`, `manufacturers`.`founder` AS `founder`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, headquarter and founder of the manufacturer that has the highest revenue.",
    "evidence": "",
    "idx": 5566
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nRETURN `manufacturers`.`name` AS `name`, `manufacturers`.`headquarter` AS `headquarter`, `manufacturers`.`revenue` AS `revenue` ORDER BY `revenue` IS NULL ASC, `revenue` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, headquarter and revenue of all manufacturers sorted by their revenue in the descending order.",
    "evidence": "",
    "idx": 5568
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "CALL(*) {\nMATCH (`manufacturers_sub0`:`manufacturers`)\nRETURN avg(`manufacturers_sub0`.`revenue`) AS `_col_0`  \n}\nMATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`revenue` > `_col_0`\nRETURN `manufacturers`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of companies whose revenue is greater than the average revenue of all companies.",
    "evidence": "",
    "idx": 5570
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "CALL(*) {\nMATCH (`manufacturers_sub0`:`manufacturers`)\nWHERE `manufacturers_sub0`.`headquarter` = 'Austin'\nRETURN min(`manufacturers_sub0`.`revenue`) AS `_col_0_1`  \n}\nMATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`revenue` > `_col_0_1`\nRETURN sum(`manufacturers`.`revenue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total revenue of companies whose revenue is larger than the revenue of some companies based in Austin.",
    "evidence": "",
    "idx": 5574
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "CALL(*) {\nMATCH (`manufacturers_sub0`:`manufacturers`)\nWHERE `manufacturers_sub0`.`headquarter` = 'Austin'\nRETURN min(`manufacturers_sub0`.`revenue`) AS `_col_0_1`  \n}\nMATCH (`manufacturers`:`manufacturers`)\nWHERE `manufacturers`.`revenue` > `_col_0_1`\nRETURN sum(`manufacturers`.`revenue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total revenue of companies with revenue greater than the lowest revenue of any manufacturer in Austin?",
    "evidence": "",
    "idx": 5575
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWITH `manufacturers`.`founder` AS _groupby_col_0, sum(`manufacturers`.`revenue`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `founder`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total revenue of companies of each founder.",
    "evidence": "",
    "idx": 5576
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWITH `manufacturers`.`founder` AS _groupby_col_0, sum(`manufacturers`.`revenue`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `founder`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total revenue of companies started by founder?",
    "evidence": "",
    "idx": 5577
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWITH `manufacturers`.`name` AS _groupby_col_0, sum(`manufacturers`.`revenue`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total revenue for each manufacturer.",
    "evidence": "",
    "idx": 5578
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`manufacturers`:`manufacturers`)\nWITH `manufacturers`.`name` AS _groupby_col_0, sum(`manufacturers`.`revenue`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total revenue of each manufacturer?",
    "evidence": "",
    "idx": 5579
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`t1`:`products`)-[manufactured_by_0:manufactured_by]->(`t2`:`manufacturers`)\nWHERE `t1`.`manufacturer` = `t2`.`code`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`price`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average prices of all products from each manufacture, and list each company's name.",
    "evidence": "",
    "idx": 5580
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`t1`:`products`)-[manufactured_by_0:manufactured_by]->(`t2`:`manufacturers`)\nWHERE `t1`.`manufacturer` = `t2`.`code`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`price`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average prices of products for each manufacturer?",
    "evidence": "",
    "idx": 5581
  }
]