[
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[handled_by_0:`handled_by`]->(t2@`sales team`)\nWHERE t2.`salesteamid` = t1.`_salesteamid`\nAND (t2.`region` = 'Midwest')\nRETURN COUNT(t1.`sales channel`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales channels does the sales team have in the Midwest?",
    "evidence": "\"Midwest\" is the Region",
    "idx": 1285
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[handled_by_0:`handled_by`]->(t2@`sales team`)\nWHERE t2.`salesteamid` = t1.`_salesteamid`\nAND (t1.`sales channel` = 'Online')\nORDER BY t1.`discount applied` DESC NULLS LAST \nRETURN t2.`region` AS `region` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which regions have online sales channels that have the most discounts?",
    "evidence": "most discount refers to Max(Discount Applied)",
    "idx": 1286
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[placed_by_0:`placed_by`]->(t2@`customers`)\nWHERE t2.`customerid` = t1.`_customerid`\nAND (t2.`customer names` = 'Apollo Ltd')\nORDER BY t1.`unit price` DESC NULLS LAST \nRETURN t1.`ordernumber` AS `ordernumber`, t1.`orderdate` AS `orderdate` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which Apollo Ltd customer's order number has the most expensive unit price, indicating the order date?",
    "evidence": "\"Apollo Ltd\" is the Customer Names; most expensive unit price refers to max(Unit Price)",
    "idx": 1287
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[handled_by_0:`handled_by`]->(t2@`sales team`)\nWHERE t2.`salesteamid` = t1.`_salesteamid`\nAND (t2.`region` = 'Midwest' AND t1.`order quantity` > 5)\nRETURN DISTINCT t2.`sales team` AS `sales team`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among sales teams in Midwest region, which sales team has an order quantity greater than 5?",
    "evidence": "order quantity greater than 5 refers to Order Quantity > 5",
    "idx": 1289
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (store_locations@`store locations`)\nRETURN CASE  WHEN MAX(store_locations.`population`)<> 0 THEN store_locations.`storeid`  END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the store id of the store located in the most populous county?",
    "evidence": "most populous country refers to Max(Population)",
    "idx": 1292
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (store_locations@`store locations`)\nRETURN CASE  WHEN MAX(store_locations.`water area`)<> 0 THEN store_locations.`type`  END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the type of store located in the city with the highest amount of water area?",
    "evidence": "type of store in City refers to Type = 'City'; highest amount of water area refers to Max(Water Area)",
    "idx": 1294
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (sales_orders@`sales orders`)\nRETURN sum(CASE WHEN like(sales_orders.`shipdate`,'6/%/18') AND sales_orders.`sales channel` = 'Online' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many online orders were shipped during the month of June 2018?",
    "evidence": "online orders refers to Sales Channel = 'Online'; shipped during the month of June 2018 refers to SUBSTR(ShipDate, 1, 1) = '6' AND SUBSTR(ShipDate,-2) = '18'",
    "idx": 1295
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`store locations`)-[located_in_0:`located_in`]->(t1@`regions`)\nWHERE t2.`statecode` = t1.`statecode`\nRETURN sum(CASE  WHEN t1.`region` = 'West' AND t2.`land area` < 20000000 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the West, how many stores are there in the city whose land area is below 20,000,000?",
    "evidence": "\"West\" is the Region; land area is below 20,000,000 refers to Land Area < 20,000,000",
    "idx": 1296
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[handled_by_0:`handled_by`]->(t2@`sales team`)\nWHERE t2.`salesteamid` = t1.`_salesteamid`\nAND ((t2.`sales team` = 'Carl Nguyen' AND like(t1.`shipdate`,'%/%/18')) OR (t2.`sales team` = 'Carl Nguyen' AND like(t1.`shipdate`,'%/%/19')) OR (t2.`sales team` = 'Carl Nguyen' AND like(t1.`shipdate`,'%/%/20')))\nRETURN cast (COUNT(t1.`ordernumber`) as float) / 3 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Between 2018 to 2020, what is the average amount of shipped orders per year under Carl Nguyen?",
    "evidence": "shipped refers to ShipDate; between 2018 and 2020 refers to SUBSTR(ShipDate, -2) IN ('18', '19', '20'); 'Carl Nguyen' is the name of Sales Team; average shipped orders per year = Divide (Count(OrderNumber), 3)",
    "idx": 1297
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t2@`store locations`)\nWHERE t2.`storeid` = t1.`_storeid`\nRETURN sum(CASE  WHEN t2.`city name` = 'Chandler' AND like(t1.`orderdate`,'%/%/20') THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales orders were processed by the store located in Chandler in 2020?",
    "evidence": "\"Chandler\" is the City Name; orders refers to OrderDate; in 2020 refers to Substr(OrderDate, -2) = '20'",
    "idx": 1299
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (store_locations@`store locations`)\nWHERE store_locations.`city name` = 'Glendale'\nRETURN avg(store_locations.`household income`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average household income of Glendale?",
    "evidence": "\"Glendale\" is the City Name; Average household income refers to avg(Household Income)",
    "idx": 1300
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (sales_orders@`sales orders`)\nWHERE like(sales_orders.`orderdate`,'%/%/20')\nRETURN MAX(sales_orders.`discount applied`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the best discount applied to sales orders in 2020?",
    "evidence": "sales orders in 2020 refers to Substr(OrderDate, -2) = '20'; best discount applied refers to Max(Discount Applied)",
    "idx": 1301
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (matchs@`matchs`)\nWHERE matchs.`season` = 2008 AND matchs.`awayteam` = 'Ebbsfleet' AND matchs.`ftr` = 'D'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the most consecutive games tied by Ebbsfleet as an away team in the 2008 season?",
    "evidence": "consecutive games mean happen one after the other without interruption and refer to Date; tied refers to FTR = 'D';",
    "idx": 1302
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (divisions@`divisions`)\nRETURN cast (COUNT(CASE  WHEN divisions.`country` = 'England' THEN divisions.`division` ELSE NULL END) as float) * 100 / COUNT(divisions.`division`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of all the divisions in the world, what percentage of them belong to England?",
    "evidence": "DIVIDE(COUNT(division where country = 'England'), COUNT(division)) as percentage;",
    "idx": 1303
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (matchs@`matchs`)\nWHERE matchs.`hometeam` = 'Cittadella'\nRETURN cast (COUNT(CASE  WHEN matchs.`ftr` = 'H' THEN 1 ELSE NULL END) / COUNT(matchs.`hometeam`) as float) * 100 AS `_col_0`, cast (COUNT(CASE  WHEN matchs.`ftr` = 'A' THEN 1 ELSE NULL END) as float) / COUNT(matchs.`hometeam`) AS `_col_1`, cast (COUNT(CASE  WHEN matchs.`ftr` = 'D' THEN 1 ELSE NULL END) as float) / COUNT(matchs.`hometeam`) AS `_col_2`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of games won, games lost and games drawn does Cittadella have as a home team in total?",
    "evidence": "Percentage of games won = DIVIDE(COUNT(FTR = 'H' where HomeTeam = 'Cittadella'), COUNT(Div where HomeTeam = 'Cittadella')) as percentage; Percentage of games lost = DIVIDE(COUNT(FTR = 'A' where HomeTeam = 'Cittadella')), COUNT(Div where HomeTeam = 'Cittadella') as percentage; percentage of games drawn = DIVIDE(SUM(FTR = 'D'where HomeTeam = 'Cittadella'), COUNT(Div where HomeTeam = 'Cittadella')) as percentage;\n",
    "idx": 1304
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (matchs@`matchs`)\nWHERE matchs.`date` = date('2005-07-30')\nRETURN cast (sum(CASE  WHEN matchs.`div` = 'F1' THEN 1 ELSE 0 END) as float) * 100 / COUNT(matchs.`div`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of matches played on 2005/07/30 belong to the F1 division?",
    "evidence": "Division refers to Div; DIVIDE(COUNT(Div = 'F1', Date = '2005/07/30'), COUNT(Div, Date = '2005/07/30')) as percentage;",
    "idx": 1305
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (matchs@`matchs`)\nWHERE matchs.`ftr` = 'D'\nRETURN cast (sum(CASE  WHEN matchs.`hometeam` = 'Sassuolo' OR matchs.`awayteam` = 'Sassuolo' THEN 1 ELSE 0 END) as float) * 100 / COUNT(matchs.`ftr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of all tied games did the Sassuolo team play in?",
    "evidence": "tied games refer FTR = 'D'; DIVIDE(COUNT(Div where FTR = 'D', HomeTeam = 'Sassuolo' or AwayTeam = 'Sassuolo'), COUNT(Div where HomeTeam = 'Sassuolo' or AwayTeam = 'Sassuolo')) as percentage;",
    "idx": 1306
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (matchs@`matchs`)\nWHERE matchs.`season` = 2017\nRETURN cast (sum(CASE  WHEN matchs.`ftag` = 2 THEN 1 ELSE 0 END) / COUNT(matchs.`ftag`) as float) * 100 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage whereby the away team scored 2 goals during the 2017 seasons?",
    "evidence": "scored 2 goals refers to FTAG = 2, which is short name for Final-time Away-team Goals; DIVIDE(COUNT(Div where season = 2017, FTAG = '2'), COUNT(Div where season = 2017)) as percentage;",
    "idx": 1307
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'EFL League One' AND t1.`div` = 'E2')\nRETURN t1.`hometeam` AS `hometeam`, t1.`awayteam` AS `awayteam`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of all the teams that played in the EFL League One division?",
    "evidence": "all the teams include both HomeTeam and AwayTeam; name = 'EFL League One'; DIV = 'E2';",
    "idx": 1308
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`country` = 'Greece')\nRETURN COUNT(DISTINCT CASE  WHEN t1.`fthg` >= 4 THEN t1.`hometeam` ELSE NULL END) + COUNT(DISTINCT CASE  WHEN t1.`ftag` >= 4 THEN t1.`awayteam` ELSE NULL END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many teams playing in divisions in Greece have ever scored 4 or more goals?",
    "evidence": "teams include both HomeTeam and AwayTeam; country = 'Greece'; scored 4 or more goals refer to FTAG≥4, which is short name for Final-time Away-team Goals;",
    "idx": 1309
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`season` = 2019 AND t2.`name` = 'Scottish Championship' AND t1.`ftag` = 2 AND t1.`fthg` = 2)\nRETURN COUNT(t1.`div`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many matches played in the 2019 season of Scottish Championship league were ended with an equal result of 2-2?",
    "evidence": "matches refer to Div; Scottish Championship is a name of the league; equal result of 2-2 refers to FTAG = 2 AND FTHG = 2;",
    "idx": 1310
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`country` = 'Scotland' AND t1.`fthg` = 10)\nRETURN t1.`hometeam` AS `hometeam`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which 2 Scottish teams scored 10 goals playing as a local team and in which seasons?",
    "evidence": "local team refers to HomeTeam; Scottish means belong to the country = 'Scotland'; scored 10 goals refer to FTHG = 10, which is short name for Final-time Away-team Goals;",
    "idx": 1311
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'LaLiga' AND t2.`country` = 'Spain' AND t1.`season` = 2017)\nRETURN t1.`hometeam` AS `hwht`, cast (COUNT(CASE  WHEN t1.`ftr` = 'H' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t1.`hometeam`) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From the Spanish LaLiga division in the 2017 season, which team won the most times as a local team and by what percentage?",
    "evidence": "local team refers to HomeTeam; Spanish means belong to the country = 'Spain'; LaLiga is a name of division; won as a local team refers to FTR = 'H', where H stands for home victory; DIVIDE(COUNT(Div where name = 'LaLiga', country = 'Spain', season = 2017, FRT = 'H'), COUNT(Div where name = 'LaLiga', country = 'Spain', season = 2017)) as percentage;",
    "idx": 1312
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (matchs@`matchs`)\nWHERE matchs.`div` = 'P1' AND matchs.`season` = 2021\nORDER BY matchs.`fthg` DESC NULLS LAST \nRETURN matchs.`hometeam` AS `hometeam` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the home team in division P1 with the highest final time goal in all seasons?",
    "evidence": "the highest final time goal refers to MAX(FTHG); P1 = Div;",
    "idx": 1313
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (matchs@`matchs`)\nWHERE matchs.`season` = 2010\nRETURN cast (COUNT(CASE  WHEN matchs.`ftr` = 'H' THEN 1 ELSE NULL END) as float) * 100 / COUNT(matchs.`ftr`) - cast (COUNT(CASE  WHEN matchs.`ftr` = 'A' THEN 1 ELSE NULL END) as float) * 100 / COUNT(matchs.`ftr`) AS `difference`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the difference in home team and away team win percentages across all divisions in 2010?",
    "evidence": "2010 refers to season = 2010; SUBTRACT(DIVIDE(COUNT(Div where FTR = 'H', season = 2010), COUNT(Div where season = 2010)), COUNT(Div where FTR = 'A', season = 2010), COUNT(Div where season = 2010)) as percentage;",
    "idx": 1314
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (matchs@`matchs`)\nWHERE matchs.`div` = 'EC' AND matchs.`date` = date('2008-01-20') AND matchs.`ftr` = 'H'\nRETURN matchs.`hometeam` AS `hometeam`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which team won the match in the EC division on January 20, 2008 at home?",
    "evidence": "won at home refers to FTR = 'H'; January 20, 2008 refers to Date = '2008-01-20'; EC division refers to Div = 'EC';",
    "idx": 1315
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`date` = date('2009-09-13') AND t1.`hometeam` = 'Club Brugge' AND t1.`awayteam` = 'Genk')\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the division in which Club Brugge and Genk competed on September 13, 2009?",
    "evidence": "September 13, 2009 refers to Date = '2009-09-13'; Club Brugge refers to HomeTeam; Genk refers to AwayTeam;",
    "idx": 1316
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Scottish Premiership' AND (t1.`season` >= 2006 AND t1.`season` <= 2008))\nRETURN COUNT(t1.`div`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many matches were played in the Scottish Premiership division from 2006 to 2008?",
    "evidence": "Scottish Premiership is a name of division; from 2006 to 2008 means seasons between 2006 and 2008;",
    "idx": 1317
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`hometeam` = 'Hearts' AND t1.`awayteam` = 'Hibernian')\nRETURN DISTINCT t2.`division` AS `division`, t2.`country` AS `country`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which division was the match between Hibernian, the away team, and Hearts, the home team, played? To which country does this division belong?",
    "evidence": "FALSE;",
    "idx": 1318
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Bundesliga')\nORDER BY t1.`ftag` DESC NULLS LAST \nRETURN t1.`awayteam` AS `awayteam` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which away team in the division of Bundesliga has the highest final time goals?",
    "evidence": "Bundesliga is a name of division; the highest final time goals refers to MAX(FTAG);",
    "idx": 1319
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'LaLiga' AND t1.`hometeam` = 'Valencia' AND t1.`ftr` = 'H')\nRETURN COUNT(t1.`hometeam`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times did Valencia's home team win in the LaLiga division?",
    "evidence": "LaLiga is a name of the division; Valencia's home team refers to HomeTeam = 'Valencia'; win refers to FTR = 'H';",
    "idx": 1321
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Seria A' AND t1.`ftr` = 'D')\nRETURN COUNT(t1.`ftr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In how many matches in the Seria A division did both teams have equal goals?",
    "evidence": "Seria A is a name of division; equal goals refers to FTR = 'D', where D stands for draft;",
    "idx": 1322
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (divisions@`divisions`)\nWHERE divisions.`country` = 'England'\nRETURN COUNT(divisions.`division`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many football divisions does England have?",
    "evidence": "England is the name of country;",
    "idx": 1323
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (divisions@`divisions`)\nWHERE divisions.`country` = 'Netherlands'\nRETURN divisions.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the name of the football division in the Netherlands?",
    "evidence": "Netherlands is the name of country;",
    "idx": 1324
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (matchs@`matchs`)\nWHERE matchs.`date` = date('2009-04-26') AND matchs.`hometeam` = 'Bursaspor' AND matchs.`awayteam` = 'Denizlispor'\nRETURN matchs.`fthg` AS `fthg`, matchs.`ftag` AS `ftag`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the final score for the game Bursaspor vs Denizlispor on 2009/4/26?",
    "evidence": "Bursaspor vs Denizlispor are names of teams where HomeTeam = 'Bursaspor' and AwayTeam = 'Denizlispor'; Date = '2009-04-26'; final score refers to FTHG, FTAG;",
    "idx": 1326
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Ligue 2')\nORDER BY t1.`ftag` + t1.`fthg` DESC NULLS LAST \nRETURN CASE  WHEN t1.`ftr` = 'H' THEN t1.`hometeam` ELSE t1.`awayteam` END AS `winner` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the Ligue 2 game that made the most goals, who is the winner of that game?",
    "evidence": "Ligue 2 is the name of division; the most goals refer to MAX(SUM(FTHG, FTAG)) which are short names for Final-time Home-team Goals and Final-time Away-team Goals; winner refers to FTR = 'A';",
    "idx": 1327
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'LaLiga 2' AND t1.`date` = date('2016-03-27') AND t1.`ftr` = 'A')\nRETURN COUNT(t1.`ftr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Away Victories happened on 2016/3/27 in the LaLiga 2 division?",
    "evidence": "Away victories refer to FTR = 'A'; LaLiga 2 is the name of division; Date = '2016-03-27';",
    "idx": 1328
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'National League' AND t1.`date` = date('2018-08-07') AND t1.`ftr` = 'D')\nRETURN COUNT(t1.`ftr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many draw games happened on 2018/8/7 for National League?",
    "evidence": "National League is the name of division; Date = '2018-08-07'; draw refers to FTR = 'D'; games refer to Div;",
    "idx": 1329
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`date` = date('2020-02-22') AND t1.`ftag` + t1.`fthg` > 5)\nORDER BY t1.`ftag` + t1.`fthg` DESC NULLS LAST \nRETURN t2.`division` AS `division`, t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which division had the most games with more than 5 total field goals on 2020/2/22? Give the full name of the division?",
    "evidence": "more than 5 total field goals refers to SUM(FTHG, FTAG)>5, which are short names for Final-time Home-team Goals and Final-time Away-team Goals; 2020/2/22 is a date;",
    "idx": 1331
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`hometeam` = 'Bradford' OR t1.`awayteam` = 'Bradford')\nRETURN DISTINCT t2.`country` AS `country`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country did Bradford Team belongs to?",
    "evidence": "Bradford team refers to HomeTeam = 'Bradford' or AwayTeam = 'Bradford';",
    "idx": 1334
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Eredivisie' AND t1.`season` = 2008)\nRETURN COUNT(DISTINCT t1.`hometeam`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Eredivisie teams have played in 2008?",
    "evidence": "Eredivisie is the name of division; 2008 refers to season; teams refer to HomeTeam;",
    "idx": 1335
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`season` = 2021 AND t2.`name` = 'Bundesliga')\nRETURN cast (COUNT(CASE  WHEN t1.`ftr` = 'H' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t1.`ftr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the home win ratio of the Bundesliga division in 2021?",
    "evidence": "home win refers to FTR = 'H', where H stands for home victory; season = '2021'; Bundesliga is a name of division; DIVIDE(COUNT(Div where FTR = 'H, season = '2021' and name = 'Bundesliga'), COUNT(Div where season = '2021' and name = 'Bundesliga')) as percentage;",
    "idx": 1336
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`fthg` = 1 AND t1.`ftag` = 1)\nRETURN cast (COUNT(CASE  WHEN t2.`name` = 'Liga NOS' THEN t1.`div` ELSE NULL END) as float) * 100 / COUNT(t1.`div`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For all the games ended up with 1-1, what percentage of them are from Liga NOS division?",
    "evidence": "1-1 is a score where FTHG = '1' and FTAG = '1'; Liga NOS is the name of division; DIVIDE(COUNT(Div where FTHG = '1', FTAG = '1', name = 'Liga NOS'), COUNT(Div where FTHG = '1' and FTAG = '1')) as percentage;",
    "idx": 1337
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`season` = 2021 AND t2.`name` = 'Premier League')\nRETURN COUNT(t1.`div`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many matches were held during the 2021 season's Premier League?",
    "evidence": "Premier League is the name of division;",
    "idx": 1338
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`date` = date('2020-10-02') AND t2.`name` = 'Bundesliga')\nRETURN t1.`hometeam` AS `hometeam`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which team was the home team in the match of the Bundesliga division on 2020/10/2?",
    "evidence": "Bundesliga is the name of division; Date = '2020/10/2';",
    "idx": 1339
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`date` = date('2020-10-02') AND t2.`name` = 'Bundesliga')\nRETURN CASE  WHEN t1.`ftr` = 'H' THEN t1.`hometeam` WHEN t1.`ftr` = 'A' THEN t1.`awayteam`  END AS `winner`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which team won the match of the Bundesliga division on 2020/10/2?",
    "evidence": "Bundesliga is the name of division; Date = '2020/10/2'; won the match refers to FTR = 'H';",
    "idx": 1340
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Bundesliga' AND t1.`awayteam` = 'Werder Bremen' AND t1.`ftr` = 'A')\nRETURN COUNT(t1.`div`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times did the team Werder Bremen win as the away team in matches of the Bundesliga division?",
    "evidence": "Bundesliga is the name of division; win as the away team refers to FTR = 'A', where 'A' stands for away victory;",
    "idx": 1341
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Bundesliga' AND t1.`ftr` = 'A' AND t1.`season` = 2021)\nRETURN COUNT(t1.`div`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many matches of the Bundesliga division ended with an away victory in the 2021 season?",
    "evidence": "Bundesliga is the name of division; away victory refers to FTR = 'A', where 'A' stands for away victory;",
    "idx": 1342
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Bundesliga' AND t1.`ftr` = 'D')\nRETURN COUNT(t1.`div`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the matches in all seasons of the Bundesliga division, how many of them ended with a tie?",
    "evidence": "Bundesliga is the name of division; tie refers to FTR = 'D', where D stands for draft;",
    "idx": 1343
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`season` = 2021 AND t1.`ftr` = 'H')\nRETURN COUNT(CASE  WHEN t2.`name` = 'Bundesliga' THEN 1 ELSE NULL END) - COUNT(CASE  WHEN t2.`name` = 'Premier League' THEN 1 ELSE NULL END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many home victories does the Bundesliga division have in more or less than the Premier League division in the 2021 season?",
    "evidence": "Bundesliga and the Premier League are names of division; home victories refer to FTR = 'H', where H stands for home victory; SUBTRACT(COUNT(FTR = 'H' where season = 2021, name = 'Bundesliga'), COUNT(FTR = 'H' where season = 2021, name = 'Premier League'));",
    "idx": 1344
  }
]