[
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`characters`:`characters`)\nORDER BY CASE  WHEN char_length(`characters`.`release_date`) - 1-1 < 0 AND char_length(`characters`.`release_date`) < 0  THEN substring(`characters`.`release_date`,(case when size(`characters`.`release_date`)+1+(char_length(`characters`.`release_date`) - 1-1)+char_length(`characters`.`release_date`) < 0 then 0 else size(`characters`.`release_date`)+1+(char_length(`characters`.`release_date`) - 1-1)+char_length(`characters`.`release_date`) end),-(char_length(`characters`.`release_date`)))  WHEN char_length(`characters`.`release_date`) - 1-1 < 0 AND char_length(`characters`.`release_date`) >= 0  THEN substring(`characters`.`release_date`,size(`characters`.`release_date`)+1+(char_length(`characters`.`release_date`) - 1-1),char_length(`characters`.`release_date`))  WHEN char_length(`characters`.`release_date`) - 1-1 >= 0 AND char_length(`characters`.`release_date`) < 0  THEN substring(`characters`.`release_date`,(case when char_length(`characters`.`release_date`) - 1-1+1+(char_length(`characters`.`release_date`)) < 0 then 0 else char_length(`characters`.`release_date`) - 1-1+1+(char_length(`characters`.`release_date`)) end),-(char_length(`characters`.`release_date`)))  ELSE substring(`characters`.`release_date`,char_length(`characters`.`release_date`) - 1-1,char_length(`characters`.`release_date`)) END IS NULL DESC, CASE  WHEN char_length(`characters`.`release_date`) - 1-1 < 0 AND char_length(`characters`.`release_date`) < 0  THEN substring(`characters`.`release_date`,(case when size(`characters`.`release_date`)+1+(char_length(`characters`.`release_date`) - 1-1)+char_length(`characters`.`release_date`) < 0 then 0 else size(`characters`.`release_date`)+1+(char_length(`characters`.`release_date`) - 1-1)+char_length(`characters`.`release_date`) end),-(char_length(`characters`.`release_date`)))  WHEN char_length(`characters`.`release_date`) - 1-1 < 0 AND char_length(`characters`.`release_date`) >= 0  THEN substring(`characters`.`release_date`,size(`characters`.`release_date`)+1+(char_length(`characters`.`release_date`) - 1-1),char_length(`characters`.`release_date`))  WHEN char_length(`characters`.`release_date`) - 1-1 >= 0 AND char_length(`characters`.`release_date`) < 0  THEN substring(`characters`.`release_date`,(case when char_length(`characters`.`release_date`) - 1-1+1+(char_length(`characters`.`release_date`)) < 0 then 0 else char_length(`characters`.`release_date`) - 1-1+1+(char_length(`characters`.`release_date`)) end),-(char_length(`characters`.`release_date`)))  ELSE substring(`characters`.`release_date`,char_length(`characters`.`release_date`) - 1-1,char_length(`characters`.`release_date`)) END  \nRETURN `characters`.`movie_title` AS `movie_title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the first movie released by Disney.",
    "evidence": "The first movie released refers to movie_title where substr(release_date, length(release_date) - 1, length(release_date)) asc limit 1;",
    "idx": 3634
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`movies_total_gross`:`movies_total_gross`)\nWHERE `movies_total_gross`.`genre` = 'Action'\nORDER BY toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`total_gross`),',','')) IS NULL ASC, toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`total_gross`),',','')) DESC \nRETURN `movies_total_gross`.`movie_title` AS `movie_title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is Disney's highest grossing action movie?",
    "evidence": "action movie refers to movie_title where genre = 'Action'; highest grossing movie refers to MAX(total_gross)",
    "idx": 3637
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`revenue`:`revenue`)\nWHERE `revenue`.`year` >= 2010 AND `revenue`.`year` <= 2016\nRETURN sum(`revenue`.`total`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Determine Disney's total box office gross between 2010 and 2016.",
    "evidence": "between 2010 and 2016 refers to Year between 2010 and 2016;",
    "idx": 3639
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)-[gross_info_for_0:gross_info_for]->(`t2`:`characters`)\nWHERE `t1`.`movie_title` = `t2`.`movie_title`\nAND (`t1`.`genre` = 'Adventure')\nORDER BY toFloat(replace(trim(BOTH '$' FROM `t1`.`inflation_adjusted_gross`),',','')) IS NULL ASC, toFloat(replace(trim(BOTH '$' FROM `t1`.`inflation_adjusted_gross`),',','')) DESC \nRETURN `t2`.`hero` AS `hero`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the main character of Disney's most popular adventure movie based on its inflation-adjusted gross.",
    "evidence": "adventure movie refers to genre = 'Adventure'; the main character of the movie refers to hero; most popular movie based on its inflation-adjusted gross refers to where MAX(inflation_adjusted_gross);",
    "idx": 3640
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)\nMATCH (`t2`:`director`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nORDER BY toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) IS NULL DESC, toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',',''))  \nRETURN `t2`.`director` AS `director`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the director of Disney's lowest grossing movie.",
    "evidence": "lowest grossing movie refers to movie_title where MIN(total_gross);",
    "idx": 3641
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`revenue`:`revenue`)\nWHERE `revenue`.`year` = 2010\nRETURN CASE WHEN sum(`revenue`.`total`)=0 THEN NULL ELSE sum(`revenue`.`walt disney parks and resorts`) / sum(`revenue`.`total`) END * 100 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find out what proportion of total revenue Walt Disney Parks and Resorts received in 2010.",
    "evidence": "DIVIDE(Walt Disney Parks and Resorts where year = 2010), SUM(year = 2010) as percentage;",
    "idx": 3642
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`movies_total_gross`:`movies_total_gross`)\nWHERE `movies_total_gross`.`mpaa_rating` = 'PG-13'\nRETURN CASE WHEN COUNT(`movies_total_gross`.`movie_title`)=0 THEN NULL ELSE sum(toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`total_gross`),',',''))) / COUNT(`movies_total_gross`.`movie_title`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Determine the average gross for Disney's PG-13-rated action movies.",
    "evidence": "DIVIDE(SUM(total_gross where genre = 'Action' and MPAA_rating = 'PG-13'), COUNT(movie_title where genre = 'Action' and MPAA_rating = 'PG-13'));",
    "idx": 3643
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`movies_total_gross`:`movies_total_gross`)\nRETURN sum(CASE  WHEN `movies_total_gross`.`movie_title` = 'Cars' THEN toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`inflation_adjusted_gross`),',','')) ELSE 0 END) AS `_col_0`, sum(CASE  WHEN `movies_total_gross`.`movie_title` = 'Cars 2' THEN toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`inflation_adjusted_gross`),',','')) ELSE 0 END) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference in the current gross of Cars and its sequel, Cars 2? Which movie is more popular?",
    "evidence": "SUBTRACT(inflation_adjusted_gross where movie_title = 'Cars', inflation_adjusted_gross where movie_title = 'Cars 2'); more popular movie refers to movie_title where MAX(inflation_adjusted_gross);",
    "idx": 3646
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)\nMATCH (`t2`:`director`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t2`.`director` = 'Chris Buck')\nRETURN `t1`.`movie_title` AS `movie_title`, MAX(`t1`.`release_date`) AS `_col_1`, MAX(`t1`.`inflation_adjusted_gross`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the most recent movie directed by Chris Buck. Which of his movies was more successful in terms of grossing? Use the current gross for comparison.",
    "evidence": "Chris Buck refers to director = 'Chris Buck'; the most recent movie refers to movie_title where MAX(release_date); current gross refers to inflation_adjusted_gross; more successful movie refers to MAX(inflation_adjusted_gross);",
    "idx": 3647
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`movies_total_gross`:`movies_total_gross`)\nRETURN CASE WHEN sum(toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`inflation_adjusted_gross`),',','')))=0 THEN NULL ELSE sum(CASE  WHEN toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`inflation_adjusted_gross`),',','')) > 1236035515 THEN toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`inflation_adjusted_gross`),',','')) ELSE 0 END) * 100 / sum(toFloat(replace(trim(BOTH '$' FROM `movies_total_gross`.`inflation_adjusted_gross`),',',''))) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the top 5 highest-grossing Disney movies adjusted for inflation. Identify the percentage they contributed to the total of Disney's current gross.",
    "evidence": "The top 5 highest-grossing movies adjusted for inflation refer to MAX(inflation_adjusted_gross)LIMIT 5; DIVIDE(SUM(MAX(inflation_adjusted_gross LIMIT 5)), SUM(inflation_adjusted_gross)) as percentage;",
    "idx": 3649
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (`t1`:`movies_total_gross`)\nMATCH (`t2`:`director`)\nWHERE `t1`.`movie_title` = `t2`.`name`\nAND (`t2`.`director` = 'Gary Trousdale')\nRETURN CASE WHEN COUNT(`t1`.`movie_title`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN toFloat(replace(trim(BOTH '$' FROM `t1`.`total_gross`),',','')) > 100000000 THEN `t1`.`movie_title` ELSE NULL END)) * 100 / COUNT(`t1`.`movie_title`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all Disney movies directed by Gary Trousdale, determine the percentage that earned over USD100m based on actual grossing.",
    "evidence": "DIVIDE(COUNT(movie_title where director = 'Gary Trousdale' and total_gross > 100000000), COUNT(movie_title where director = 'Gary Trousdale')) as percentage;",
    "idx": 3650
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`ballotpedia_id` = '' OR `current`.`ballotpedia_id` IS NULL\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many current legislators do not have an account on ballotpedia.org ?",
    "evidence": "do not have an account on ballotpedia.org refers to ballotpedia_id IS NULL OR ballotpedia_id = ''",
    "idx": 3651
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`cspan_id` IS NULL OR `current`.`cspan_id` = ''\nRETURN `current`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the official full names of all the current legislators who do not have an account on C-SPAN's video website.",
    "evidence": "legislators who do not have an account refers to cspan_id IS NULL OR cspan_id = ''",
    "idx": 3652
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`birthday_bio` >= localdatetime('1961-01-01T00:00:00')\nRETURN COUNT(`current`.`bioguide_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many current legislators were born after the year 1960?",
    "evidence": "born after the year 1960 refers to birthday_bio > '1960-01-01'",
    "idx": 3653
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE (`current`.`fec_id` IS NULL OR `current`.`fec_id` = '') AND `current`.`gender_bio` = 'F'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the current female legislators, how many of them have not been registered in Federal Election Commission data?",
    "evidence": "have not been registered refers to fec_id IS NULL; female refers to gender_bio = 'F'",
    "idx": 3654
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`official_full_name` = 'Sherrod Brown'\nRETURN `current`.`google_entity_id_id` AS `google_entity_id_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the google entity ID of current legislator Sherrod Brown?",
    "evidence": "Sherrod Brown is an official_full_name",
    "idx": 3655
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`official_full_name` = 'Sherrod Brown' OR `current`.`official_full_name` = 'Maria Cantwell'\nORDER BY `current`.`birthday_bio` IS NULL DESC, `current`.`birthday_bio`  \nRETURN `current`.`official_full_name` AS `official_full_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which current legislator is older, Sherrod Brown or Maria Cantwell?",
    "evidence": "older refers to MAX(birthday_bio); 'Sherrod Brown' and 'Maria Cantwell' are official_full_name",
    "idx": 3656
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t2`.`official_full_name` = 'Todd Young')\nRETURN `t1`.`facebook` AS `facebook`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the username of the current official Facebook presence of current legislator Todd Young?",
    "evidence": "Todd Young is an official_full_name; username of current official Facebook presences refers to facebook;",
    "idx": 3657
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide_id`\nAND (`t1`.`instagram` IS NULL)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many current legislators do not have an account on instagram?",
    "evidence": "do not have an account on instagram refers to instagram is null",
    "idx": 3658
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t2`.`twitter_id` = 234128524)\nRETURN `t1`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "To which current legislator does twitter ID234128524 belong? Please give his or her full official name.",
    "evidence": "full official name refers to official_full_name",
    "idx": 3659
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t1`.`gender_bio` = 'F')\nRETURN `t2`.`youtube` AS `youtube`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the current official YouTube usernames of all the current female legislators.",
    "evidence": "official YouTube usernames refers to youtube; female refers to gender_bio = 'F'",
    "idx": 3660
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nORDER BY `t1`.`birthday_bio` IS NULL DESC, `t1`.`birthday_bio`  \nRETURN `t2`.`facebook` AS `facebook`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the username of the current official Facebook presence of the oldest current legislator?",
    "evidence": "username of the official Facebook refers to facebook; the oldest refers to MAX(birthday_bio)",
    "idx": 3661
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide_id`\nAND (`t2`.`opensecrets_id` IS NULL OR `t2`.`opensecrets_id` = '')\nRETURN sum(CASE  WHEN `t1`.`instagram` IS NULL THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the current legislators who do not have accounts on OpenSecrets.org., how many of them do not have instagram accounts either?",
    "evidence": "do not have accounts on OpenSecrets.org refers to opensecrets_ID is NULL OR opensecrets_id = ''; do not have instagram accounts refers to instagram is null",
    "idx": 3662
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`district` IS NULL OR `t2`.`district` = '')\nRETURN sum(CASE  WHEN `t1`.`official_full_name` = 'Roger F. Wicker' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Current legislator Roger F. Wicker has not been a representative for how many terms?",
    "evidence": "Roger F. Wicker is an official_full_name; not a representative refers to district IS NULL OR district = ''",
    "idx": 3663
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`official_full_name` = 'Sherrod Brown')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how many terms has current legislator Sherrod Brown served?",
    "evidence": "Sherrod Brown is an official_full_name",
    "idx": 3664
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_term_0:has_term]->(`t1`:`current-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (NOT `t1`.`state_rank` IS NULL)\nRETURN `t2`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the official full names of all the current legislators who were once a senator during his or her terms.",
    "evidence": "once a senator during term refers to state_rank IS NOT NULL",
    "idx": 3665
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_term_0:has_term]->(`t1`:`current-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t1`.`start` = '1993-01-05' AND `t2`.`official_full_name` = 'Sherrod Brown')\nRETURN `t1`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For which state did current legislator Sherrod Brown serve during his term that started on 1993/1/5?",
    "evidence": "Sherrod Brown is an full official name; started on 1993/1/5 refers to start = '1993-01-05';",
    "idx": 3666
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`gender_bio` = 'F')\nRETURN CASE WHEN COUNT(DISTINCT `t1`.`bioguide_id`)=0 THEN NULL ELSE toFloat(COUNT(`t2`.`bioguide`)) / COUNT(DISTINCT `t1`.`bioguide_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of terms for a current female legislator?",
    "evidence": "female refers to gender_bio = 'F'; calculation refers to DIVIDE(COUNT(bioguide WHERE gender_bio = 'F'), COUNT(bioguide_id))",
    "idx": 3667
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide_id`\nAND (`t2`.`religion_bio` = 'Roman Catholic')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`instagram` IS NULL THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the current legislators whose religion is Roman Catholic, what is the percentage of the ones without an instagram account?",
    "evidence": "religion is Roman Catholic refers to religion_bio = 'Roman Catholic'; calculation = MULTIPLY(DIVIDE(COUNT(instagram is null), COUNT(bioguide_id)), 1.0)",
    "idx": 3668
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`gender_bio` = 'M'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many males were members of the current legislators?",
    "evidence": "male refers to gender_bio = 'M'",
    "idx": 3669
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current-terms`:`current-terms`)\nWHERE `current-terms`.`party` = 'Republican'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many current legislators chose Republican as their political party?",
    "evidence": "chose Republican as their political party refers to party = 'Republican'",
    "idx": 3670
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`social-media`:`social-media`)\nWHERE NOT `social-media`.`instagram` IS NULL AND `social-media`.`instagram` <> ''\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many legislators have an Instagram account?",
    "evidence": "have an Instagram account refers to instagram is NOT null and instagram <>''",
    "idx": 3671
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nWHERE `historical`.`gender_bio` = 'F'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many females were members of the past legislators?",
    "evidence": "female refers to gender_bio = 'F'",
    "idx": 3672
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`religion_bio` = 'Roman Catholic' AND `current`.`gender_bio` = 'M'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many male legislators are Roman Catholic?",
    "evidence": "male refers to gender_bio = 'M'; Roman Catholic is a religion_bio",
    "idx": 3673
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_term_0:has_term]->(`t1`:`current-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t2`.`first_name` = 'Sherrod' AND `t2`.`last_name` = 'Brown' AND `t1`.`start` =~ '(?i)(?s).*2005.*')\nRETURN `t1`.`party` AS `party`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What type of political party Sherrod Brown has in 2005?",
    "evidence": "political party refers to party; Sherrod Brown is an official_full_name; official_full_name refers to first_name, last_name; 2005 refers to start = 2005",
    "idx": 3674
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_term_0:has_term]->(`t1`:`current-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t1`.`state_rank` = 'senior' AND `t1`.`type` = 'sen' AND `t1`.`start` =~ '(?i)(?s)2013.*')\nRETURN `t2`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name of all the senior senators in year 2013.",
    "evidence": "full name refers to official_full_name; senior refers to state_rank = 'senior'; senators refers to type = 'sen'; 2013 refers to start LIKE '2013%'",
    "idx": 3675
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t1`.`official_full_name` = 'Chris Van Hollen')\nRETURN `t2`.`youtube` AS `youtube`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the current official Youtube username of Chris Van Hollen?",
    "evidence": "Youtube username refers to youtube; Chris Van Hollen is an official_full_name",
    "idx": 3676
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide_id`\nAND (`t2`.`first_name` = 'Mark' AND `t2`.`last_name` = 'Warner')\nRETURN CASE  WHEN NOT `t1`.`facebook` IS NULL THEN 1  END + CASE  WHEN NOT `t1`.`instagram` IS NULL THEN 1  END + CASE  WHEN NOT `t1`.`twitter` IS NULL THEN 1  END + CASE  WHEN NOT `t1`.`youtube` IS NULL THEN 1  END AS `countsocial`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many official social media does Mark Warner have?",
    "evidence": "official social media refers to facebook is not null, instagram is not null, twitter is not null, youtube is not null; Mark Warner is an official_full_name; official_full_name refers to first_name, last_name",
    "idx": 3677
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`state` = 'CA')\nWITH `t1`.`last_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the last name of all current legislators who live in California.",
    "evidence": "California refers to state = 'CA'",
    "idx": 3678
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t1`.`official_full_name` = 'Chris Van Hollen')\nRETURN `t2`.`govtrack` AS `govtrack`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the numeric ID of Chris Van Hollen on GovTrack.us?",
    "evidence": "Chris Van Hollen is an official_full_name; numeric ID on GovTrack.us refers to govtrack",
    "idx": 3679
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t1`.`official_full_name` = 'Roger F. Wicker')\nRETURN `t2`.`twitter` AS `twitter`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the current official Twitter handle of Roger F. Wicker?",
    "evidence": "Twitter handle refers to twitter; Roger F. Wicker is an official_full_name",
    "idx": 3680
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`official_full_name` = 'Chris Van Hollen' AND NOT `t2`.`district` IS NULL)\nWITH `t2`.`district` AS _groupby_col_0\nRETURN _groupby_col_0 AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the district number that Chris Van Hollen serving?",
    "evidence": "Chris Van Hollen is an official_full_name",
    "idx": 3681
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`first_name` = 'Richard' AND `t1`.`last_name` = 'Durbin')\nRETURN sum(CASE  WHEN `t2`.`district` = 20 THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times did Richard Durbin become a legislator in district 20?",
    "evidence": "Richard Durbin is an official_full_name;  official_full_name refers to first_name, last_name; district 20 refers to district = 20",
    "idx": 3682
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t1`.`official_full_name` = 'Adam Kinzinger')\nRETURN `t2`.`facebook` AS `facebook`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the Facebook, Twitter and YouTube usernames of Adam Kinzinger?",
    "evidence": "Facebook, Twitter and YouTube usernames refers to facebook, twitter, youtube; Adam Kinzinger is an official_full_name",
    "idx": 3684
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide_id`\nAND (NOT `t1`.`facebook` IS NULL AND (`t1`.`instagram` IS NULL OR `t1`.`instagram` = ''))\nRETURN `t2`.`official_full_name` AS `official_full_name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the official full names of 10 legislators who have a YouTube account but no Instagram account.",
    "evidence": "have a YouTube account but no Instagram account refers to facebook is not null and (instagram is null or instagram = '')",
    "idx": 3685
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`state` = 'VA')\nWITH `t1`.`official_full_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the official full names of legislators representing Virginia.",
    "evidence": "Virginia refers to state = 'VA'",
    "idx": 3686
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`historical`)-[has_term_0:has_term]->(`t1`:`historical-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t1`.`party` = 'National Greenbacker')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which historical legislators are members of the National Greenbacker party? Write their first and last names.",
    "evidence": "members of the National Greenbacker party refers to party = 'National Greenbacker'; first and last names refers to first_name, last_name",
    "idx": 3687
  }
]