[
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`reviews`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (like(t1.`city`,'Anthem'))\nRETURN avg(t2.`review_stars`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stars on average does a Yelp_Business in Anthem get from a user review?",
    "evidence": "in Anthem refers to city = 'Anthem'; stars on average = avg(review_stars)",
    "idx": 2070
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`reviews`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (like(t1.`state`,'AZ') AND t2.`user_id` = 3)\nRETURN avg(t2.`review_stars`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stars on average does user no.3 give to Yelp_Business in Arizona?",
    "evidence": "user no.3 refers to user_id = 3; in Arizona refers to state = 'AZ'; stars on average = avg(review_stars(user_id = 3))",
    "idx": 2071
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`days`)\nMATCH (t1@`business_hours`)\nWHERE t1.`day_id` = t2.`day_id`\nAND (t1.`business_id` = 1 AND (t2.`day_of_week` = 'Sunday' OR t2.`day_of_week` = 'Sunday'))\nRETURN cast (t1.`closing_time` as float) + cast ('12' as float) - cast (t1.`opening_time` as float) AS `avg opening hours`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average business time for Yelp_Business no.1 on weekends?",
    "evidence": "Yelp_Business no.1 refers to business_id = 1; on weekends refers to day_of_week = 'Saturday' or day_of_week = 'Sunday'; average business time refers to DIVIDE(SUBTRACT(closing_time, opening_time), 2)",
    "idx": 2072
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`city`,'Casa Grande')\nRETURN COUNT(business.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the busineses are in Casa Grande?",
    "evidence": "in Casa Grande refers to city = 'Casa Grande'",
    "idx": 2073
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`state`,'AZ') AND like(business.`active`,'True') AND like(business.`review_count`,'low')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of active businesses in AZ with a low review count?",
    "evidence": "active businesses refers to active = 'true'; in AZ refers to state = 'AZ'\n",
    "idx": 2074
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (users@`users`)\nWHERE users.`user_yelping_since_year` >= 2011 AND users.`user_yelping_since_year` <= 2013 AND like(users.`user_fans`,'High')\nRETURN COUNT(users.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In users yelping since 2011 to 2013, how many of them have high count of fans?",
    "evidence": "In users yelping since 2011 to 2013 refers to user_yelping_since_year > = 2011 AND user_yelping_since_year < 2014",
    "idx": 2076
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`user_id` = 35026 AND reviews.`business_id` = 2\nRETURN reviews.`review_length` AS `review_length`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the review length of user 35026 to business with business ID 2?",
    "evidence": "user 35026 refers to user_id = 35026",
    "idx": 2077
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`business_hours`)\nMATCH (t1@`business`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (like(t1.`city`,'Tempe'))\nORDER BY t1.`stars` DESC NULLS LAST \nRETURN t2.`closing_time` AS `closing_time`, t2.`opening_time` AS `opening_time` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the closing and opening time of businesses located at Tempe with highest star rating?",
    "evidence": "located at Tempe refers to city = 'Tempe'; highest star rating refers to max(stars)",
    "idx": 2078
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`city`,'Phoenix') AND like(business.`active`,'True')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many active businesses are located at Phoenix, Arizona?",
    "evidence": "active business refers to active = 'true'; 'Phoenix' is the city",
    "idx": 2079
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`review_count`,'High')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses are with high review count?",
    "evidence": "high review count refers to review_count = 'High'",
    "idx": 2080
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business_attributes@`business_attributes`)\nWHERE business_attributes.`attribute_id` = 1 AND business_attributes.`attribute_value` = 'beer_and_wine'\nRETURN COUNT(business_attributes.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses ID sell beer and wine?",
    "evidence": "attribute_value = 'beer_and_wine'",
    "idx": 2081
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business_attributes@`business_attributes`)\nWHERE business_attributes.`business_id` = 2\nRETURN COUNT(business_attributes.`attribute_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many attributes ID owned by business ID 2?",
    "evidence": "",
    "idx": 2082
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`compliments`)\nMATCH (t1@`users_compliments`)\nWHERE t1.`compliment_id` = t2.`compliment_id`\nAND (like(t1.`number_of_compliments`,'High') AND t2.`compliment_id` = 1)\nRETURN COUNT(t1.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users received high compliment type in photo?",
    "evidence": "high compliments refers to number_of_compliments = 'High'; type in photo refers to compliment_ID = 1",
    "idx": 2083
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`elite`)\nWHERE t1.`user_id` = t2.`user_id`\nAND (t2.`year_id` = 2013)\nRETURN cast (sum(CASE  WHEN t1.`user_average_stars` = '1' THEN 1 ELSE 0 END) as float) / COUNT(t2.`user_id`) AS `_col_0`, sum(CASE  WHEN t1.`user_average_stars` = '5' THEN 1 ELSE 0 END) * 1.0 / COUNT(t2.`user_id`) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio of having the best to worse elite user in 2013?",
    "evidence": "best elite refers to user_average_stars = 5; worse eliter refers to user_average_stars = 1: in 2013 refers to year_id = 2013; ratio = Divide(Count(user_id(user_average_stars = 5)),  Count(user_id(user_average_stars = 1)))",
    "idx": 2084
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`elite`)\nMATCH (t1@`reviews`)\nWHERE t1.`user_id` = t2.`user_id`\nRETURN cast (COUNT(t1.`user_id`) as float) / COUNT(DISTINCT t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of review received by each business given that the user is an elite?",
    "evidence": "average review = Divide(Count(user_id), Count(business_id))",
    "idx": 2086
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`reviews`)\nWHERE t1.`business_id` = t2.`business_id`\nRETURN cast (sum(t2.`review_stars`) as float) / COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the correlation between the review starts and business stars?",
    "evidence": "highest review count refers to review_count = 'Uber'; average business review stars = Divide (Sum(review_stars), Count(user_id))",
    "idx": 2087
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`active`,'True')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the businesses are active?",
    "evidence": "active refers to active = 'true'",
    "idx": 2088
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE like(business.`state`,'AZ') AND like(business.`review_count`,'High') AND like(business.`active`,'True')\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of active business in AZ with a high review count?",
    "evidence": "active business refers to active = 'true'; 'AZ' is the state; high review count refers to review_count = 'High'",
    "idx": 2090
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (users@`users`)\nWHERE users.`user_yelping_since_year` >= 2010 AND users.`user_yelping_since_year` <= 2012 AND like(users.`user_fans`,'Low')\nRETURN COUNT(users.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In users yelping since 2010 to 2012, how many of them has an low fans?",
    "evidence": "user yelping since 2010 to 2012 refers to user_yelping_since_year > = '2010' AND user_yelping_since_year < '2013'; low fans refers to user_fans = 'Low'",
    "idx": 2092
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`user_id` = 60776 AND reviews.`business_id` = 1\nRETURN reviews.`review_length` AS `review_length`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the review length of user 60776 to business with business ID 1?",
    "evidence": "\"60776\" is the user_id",
    "idx": 2093
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`business_hours`)\nMATCH (t1@`business`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (like(t1.`city`,'Gilbert'))\nORDER BY t1.`stars` DESC NULLS LAST \nRETURN t2.`closing_time` AS `closing_time`, t2.`opening_time` AS `opening_time` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the closing and opening time of businesses located at Gilbert with highest star rating?",
    "evidence": "\"Gilbert\" is the name of city; highest star rating refers to Max(stars)",
    "idx": 2094
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (users@`users`)\nWHERE users.`user_yelping_since_year` = 2004 AND like(users.`user_fans`,'None')\nRETURN COUNT(users.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users have no followers in 2014?",
    "evidence": "in 2004 refers to user_yelping_since_year = 2004; no follower refers to user_fans = 'None'",
    "idx": 2095
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`attributes`)\nMATCH (t2@`business_attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (like(t2.`attribute_value`,'TRUE') AND like(t1.`attribute_name`,'Open 24 Hours'))\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses are opened for 24 hours?",
    "evidence": "opened for 24 hours refers to attribute_name = 'Open 24 Hours' AND attribute_value = 'true'",
    "idx": 2097
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`attributes`)\nMATCH (t2@`business_attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (t2.`attribute_value` = 'true' AND t1.`attribute_name` = 'ambience_romantic')\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses have a romantic ambiance?",
    "evidence": "romantic ambiance refers to attribute_name = 'ambience_romantic' AND attribute_value = 'true'",
    "idx": 2098
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business_attributes`)\nMATCH (t2@`attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (t2.`attribute_name` = 'Accepts Insurance' AND t1.`attribute_value` = 'true')\nRETURN COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses accept insurance?",
    "evidence": "business that accept insurance refers to attribute_name = 'Accepts Insurance' AND attribute_value = 'true'",
    "idx": 2099
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business_attributes`)\nMATCH (t2@`attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (t2.`attribute_name` = 'good_for_dinner' AND t1.`business_id` = 14033)\nRETURN t1.`attribute_value` AS `attribute_value`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Is the Yelp business No. 14033 good for supper?",
    "evidence": "business no. 14033 refers to business_id = 14033; good for supper refers to attribute_name = 'good_for_dinner'",
    "idx": 2105
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`compliments`)\nMATCH (t2@`users_compliments`)\nWHERE t1.`compliment_id` = t2.`compliment_id`\nAND (t1.`compliment_type` = 'cool' AND t2.`user_id` = 41717)\nRETURN COUNT(t2.`number_of_compliments`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many \"cool\" type compliments does user No. 41717 get?",
    "evidence": "\"cool\" type compliments refers to compliment_type = 'cool'; user No. 41717 refers to user_id = 41717",
    "idx": 2108
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`categories`)\nMATCH (t1@`business_categories`)\nWHERE t1.`category_id` = t2.`category_id`\nRETURN cast (sum(CASE  WHEN t2.`category_name` = 'Pets' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`category_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage for the Yelp businesses in \"Pets\" category of all businesses?",
    "evidence": "businesses in \"Pets\" category refers to category_name = 'Pets'; percentage refers to DIVIDE(COUNT(category_name = 'Pets'), COUNT(business_id)) * 100%",
    "idx": 2111
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE business.`city` = 'Phoenix' AND business.`state` = 'AZ' AND business.`stars` = 2\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many 2 stars rated business located in Phoenix, Arizona?",
    "evidence": "located in Phoenix refers to city = 'Phoenix'; Arizona refers to state = 'AZ'",
    "idx": 2123
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE business.`city` = 'Phoenix' AND business.`stars` > 3\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses in Tempe are rated as 'Wonderful experience?",
    "evidence": "in Tempe refers to city = 'Tempe'; rated as 'Wonderful experience refers to stars > 3",
    "idx": 2124
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`years`)\nMATCH (t1@`elite`)\nWHERE t1.`year_id` = t2.`year_id`\nAND (t2.`actual_year` = 2012)\nRETURN DISTINCT t1.`user_id` AS `user_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which users become an elite in 2012?",
    "evidence": "in 2012 refers to actual_year = 2012;",
    "idx": 2127
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`checkins`)\nMATCH (t1@`days`)\nWHERE t1.`day_id` = t2.`day_id`\nAND (t1.`day_of_week` = 'Sunday' AND t2.`label_time_10` = 'Low')\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many business have low check-in on Sunday at 10AM?",
    "evidence": "on Sunday refers to day_of_week = 'Sunday'; low check-in at 10AM refers to label_time_10 = 'Low'",
    "idx": 2128
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`reviews`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`city` = 'Glendale' AND t2.`user_id` = 20241)\nRETURN COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses in Glendale are reviewed by user with the ID of 20241?",
    "evidence": "in Glendale refers to city = 'Glendale'",
    "idx": 2129
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`categories`)\nMATCH (t1@`business_categories`)\nWHERE t1.`category_id` = t2.`category_id`\nRETURN cast (sum(CASE  WHEN t2.`category_name` = 'Shopping' THEN 1 ELSE 0 END) as float) / sum(CASE  WHEN t2.`category_name` = 'Pets' THEN 1 ELSE 0 END) AS `radio`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio between business in shopping category and business in pets category?",
    "evidence": "ratio = divide(count(business_id where category_name = 'Shopping'), count(business_id where category_name = 'Pets'))",
    "idx": 2131
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`categories`)\nMATCH (t2@`business_categories`)\nWHERE t1.`category_id` = t2.`category_id`\nAND (t1.`category_name` = 'Banks & Credit Unions')\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses are registered in the database under 'Banks & Credit Unions' category?",
    "evidence": "category refers to category_name",
    "idx": 2132
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE business.`active` = 'true' AND business.`city` = 'Casa Grande'\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many active businesses from Casa Grande are registered in the database?",
    "evidence": "active business refers to active = 'true'; Casa Grande refers to city = 'Casa Grande'",
    "idx": 2133
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`days`)\nMATCH (t1@`business_hours`)\nWHERE t1.`day_id` = t2.`day_id`\nAND (t1.`business_id` = 12 AND t2.`day_of_week` = 'Monday')\nRETURN t1.`opening_time` AS `opening_time`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What time does the business with ID no.12 open on Monday?",
    "evidence": "open time refers to opening_time; on Monday refers to day_of_week = 'Monday'; business with ID no. refers to business_id \n\n",
    "idx": 2134
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`attributes`)\nMATCH (t2@`business_attributes`)\nWHERE t1.`attribute_id` = t2.`attribute_id`\nAND (t1.`attribute_name` = 'Good for Kids' AND t2.`attribute_value` = 'true')\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses that are registered in the database can be attributed to 'Good for Kids'?",
    "evidence": "can be attributed to 'Good for Kids' refers to attribute_name = 'Good for Kids' and attribute_value = 'true'",
    "idx": 2135
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`elite`)\nWHERE t1.`user_id` = t2.`user_id`\nAND (t1.`user_yelping_since_year` = 2004)\nRETURN DISTINCT t2.`user_id` AS `user_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Identify the user who has been yelping since 2004. Is he or she an Yelp Elite member?",
    "evidence": "has been yelping since 2004 refers to user_yelping_since_year = 2004",
    "idx": 2138
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (tips@`tips`)\nWHERE tips.`business_id` = 2 AND tips.`tip_length` = 'Short'\nRETURN COUNT(tips.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many short tips were left for the business with ID no.2?",
    "evidence": "short tip refers to tip_length = 'Short'; business category refers to category_name",
    "idx": 2141
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business_hours@`business_hours`)\nWHERE business_hours.`business_id` = 1 AND business_hours.`day_id` = 2\nRETURN business_hours.`opening_time` AS `opening_time`, business_hours.`closing_time` AS `closing_time`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the opening and closing time of business id 1 for day id 2?",
    "evidence": "false",
    "idx": 2145
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`business_hours`)\nMATCH (t1@`days`)\nWHERE t1.`day_id` = t2.`day_id`\nAND (t1.`day_of_week` = 'Sunday' AND t2.`business_id` = 4)\nRETURN t2.`closing_time` AS `closing_time`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the closing time of business id 4 on Sunday?",
    "evidence": "on Sunday refers to day_of_week = 'Sunday'",
    "idx": 2147
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`reviews`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`city` = 'Phoenix' AND t2.`review_length` = 'Short')\nRETURN DISTINCT t1.`business_id` AS `business_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the businesses which have short length of review, which one located in Phoenix?",
    "evidence": "short length of review refers to review_length = 'Short'; in Phoenix refers to city = 'Phoenix'",
    "idx": 2148
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`users_compliments`)\nWHERE t1.`user_id` = t2.`user_id`\nAND (t1.`user_yelping_since_year` = 2012 AND t2.`number_of_compliments` = 'Low')\nRETURN DISTINCT t2.`user_id` AS `user_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the users who received low compliments from other users, which users joined Yelp in 2012?",
    "evidence": "low compliments refers to number_of_compliments = 'Low'; joined Yelp in 2012 refers to user_yelping_since_year = 2012",
    "idx": 2150
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business_attributes`)\nMATCH (t2@`business`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`city` = 'Gilbert' AND t1.`attribute_value` IN ['None', 'no', 'false'])\nRETURN COUNT(t2.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the businesses without attribute, how many businesses located in Gilbert?",
    "evidence": "without attribute refers to attribute_value = 'None'; in Gilbert refers to city = 'Gilbert'",
    "idx": 2151
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business_attributes`)\nMATCH (t2@`business`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`city` = 'Peoria' AND t1.`attribute_value` = 'beer_and_wine')\nRETURN COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the businesses which have attribute of beer_and_wine, how many business located in Peoria?",
    "evidence": "attribute of beer_and_wine refers to attribute_value = 'beer_and_wine'; in Peoria refers to city = 'Peoria'",
    "idx": 2158
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`review_stars` = 5 AND reviews.`review_votes_funny` = 'Uber'\nRETURN COUNT(reviews.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many 5 star businesses have uber review votes for funny?",
    "evidence": "businesses refer to business_id; review_stars = 5.0; review_votes_funny = 'uber';",
    "idx": 2159
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (reviews@`reviews`)\nWHERE reviews.`review_votes_funny` = 'Uber'\nRETURN COUNT(DISTINCT reviews.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users have uber review votes for funny from the fans?",
    "evidence": "users refer to user_id; review_votes_funny = 'uber';",
    "idx": 2160
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`business_hours`)\nMATCH (t1@`business`)\nWHERE t1.`business_id` = t2.`business_id`\nRETURN cast (sum(CASE  WHEN t1.`stars` >= 3.5 AND t1.`stars` <= 5 THEN 1 ELSE 0 END) as float) / sum(CASE  WHEN t1.`stars` >= 1 AND t1.`stars` <= 2.5 THEN 1 ELSE 0 END) AS `ratio`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio of good to bad business star for a businesses that are opened all the time?",
    "evidence": "opened all the time refers to Business_Hours where day_id BETWEEN 1 and 7 and opening_time = closing_time; ratio can be computed as DIVIDE(COUNT(stars BETWEEN 3.5 and 5), COUNT(stars BETWEEN 1 and 2.5));",
    "idx": 2163
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`elite`)\nWHERE t1.`user_id` = t2.`user_id`\nAND (t1.`user_fans` = 'Uber')\nRETURN cast (sum(t2.`year_id` - t1.`user_yelping_since_year`) as float) / COUNT(t1.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average year needed by a user with uber fans to become an elite user?",
    "evidence": "AVG(user_yelping_since_year) where user_fans = 'uber';",
    "idx": 2164
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`elite`)\nWHERE t1.`user_id` = t2.`user_id`\nRETURN cast (sum(t2.`year_id` - t1.`user_yelping_since_year`) as float) / COUNT(t1.`user_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average year for a user to be upgraded to elite user?",
    "evidence": "AVG(user_yelping_since_year) where user_id from Elite;",
    "idx": 2165
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t2@`business_hours`)\nMATCH (t1@`business`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`city` = 'Mesa')\nRETURN cast (sum(CASE  WHEN t1.`active` = 'true' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`business_id`) AS `act`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many business are opened for more than 8 hour in Mesa and what is the percentage of the active businesses?",
    "evidence": "business are opened for more than 8 hours refer to business_id where SUBTRACT(closing_time, opening_time) > 8; DIVIDE(COUNT(business_id where active = 'true' and city = 'Mesa' and SUBTRACT(closing_time, opening_time) > 8), COUNT(business_id where city = 'Mesa' and SUBTRACT(closing_time, opening_time) > 8)) as percentage;",
    "idx": 2166
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business_hours@`business_hours`)\nWHERE business_hours.`opening_time` = '8AM' AND business_hours.`closing_time` = '6PM'\nRETURN DISTINCT business_hours.`business_id` AS `business_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many business ids have opening hours from 8AM to 6PM?",
    "evidence": "opening hours from 8AM to 6PM refer to Business_Hours where opening_time = '8AM' and closing_time = '6PM';",
    "idx": 2167
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (business@`business`)\nWHERE business.`stars` > 4\nRETURN COUNT(business.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many businesses id are rated more than 4?",
    "evidence": "rated more than 4 refers to stars > 4;",
    "idx": 2170
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`users`)\nMATCH (t2@`tips`)\nWHERE t1.`user_id` = t2.`user_id`\nAND (t1.`user_yelping_since_year` = 2010)\nRETURN sum(t2.`likes`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many likes did short comment left by users who joined in 2010 get?",
    "evidence": "short comment refers to tip_length = 'Short'; users who joined in 2010 refer to user_id where user_yelping_since_year = 2010;",
    "idx": 2183
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (t1@`business`)\nMATCH (t2@`tips`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t2.`tip_length` = 'Long')\nRETURN DISTINCT t1.`state` AS `state`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For businesses with long length reviews, which state are they located?",
    "evidence": "businesses with long length tips refer to business_id where tip_length = 'Long';",
    "idx": 2185
  }
]