[
  {
    "filename": "train_spider.json",
    "db_id": "company_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`salary` < 50000\nWITH `employee`.`sex` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `sex`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of employees of each gender whose salary is lower than 50000.",
    "evidence": "",
    "idx": 3069
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nORDER BY `employee`.`bdate` IS NULL DESC, `employee`.`bdate`  \nRETURN `employee`.`fname` AS `fname`, `employee`.`lname` AS `lname`, `employee`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list the first and last names, and the addresses of all employees in the ascending order of their birth date.",
    "evidence": "",
    "idx": 3070
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_in_alabama",
    "gql_statement": "MATCH (`services`:`services`)\nRETURN `services`.`service_type_code` AS `service_type_code` ORDER BY `service_type_code` IS NULL DESC, `service_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the type of the services in alphabetical order.",
    "evidence": "",
    "idx": 3074
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_in_alabama",
    "gql_statement": "MATCH (`events`:`events`)\nRETURN `events`.`service_id` AS `service_id`, `events`.`event_details` AS `event_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the service id and details for the events.",
    "evidence": "",
    "idx": 3075
  },
  {
    "filename": "train_spider.json",
    "db_id": "local_govt_in_alabama",
    "gql_statement": "MATCH (`t1`:`participants`)-[t2:participates_in]->()\nWHERE `t1`.`participant_id` = `t2`.`participant_id`\nAND (`t1`.`participant_details` =~ '(?i)(?s).*Dr..*')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many events had participants whose details had the substring 'Dr.'",
    "evidence": "",
    "idx": 3076
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nORDER BY `races`.`date` IS NULL ASC, `races`.`date` DESC \nRETURN `races`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the race held most recently?",
    "evidence": "",
    "idx": 3079
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nORDER BY `races`.`date` IS NULL ASC, `races`.`date` DESC \nRETURN `races`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the race that occurred most recently?",
    "evidence": "",
    "idx": 3080
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nRETURN `races`.`name` AS `name`, `races`.`date` AS `date` ORDER BY `date` IS NULL ASC, `date` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name and date of the most recent race?",
    "evidence": "",
    "idx": 3081
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nRETURN `races`.`name` AS `name`, `races`.`date` AS `date` ORDER BY `date` IS NULL ASC, `date` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name and date of the race that occurred most recently?",
    "evidence": "",
    "idx": 3082
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nWHERE `races`.`year` = 2017\nRETURN `races`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all races held in 2017.",
    "evidence": "",
    "idx": 3083
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nWHERE `races`.`year` = 2017\nRETURN `races`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the races that occurred in the year 2017?",
    "evidence": "",
    "idx": 3084
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nWHERE `races`.`year` >= 2014 AND `races`.`year` <= 2017\nRETURN DISTINCT `races`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct names of all races held between 2014 and 2017?",
    "evidence": "",
    "idx": 3085
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nWHERE `races`.`year` >= 2014 AND `races`.`year` <= 2017\nRETURN DISTINCT `races`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the unique names of all race held between 2014 and 2017?",
    "evidence": "",
    "idx": 3086
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nAND (`t2`.`milliseconds` < 93000)\nRETURN DISTINCT `t1`.`forename` AS `forename`, `t1`.`surname` AS `surname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the forename and surname of all distinct drivers who once had laptime less than 93000 milliseconds?",
    "evidence": "",
    "idx": 3087
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nAND (`t2`.`milliseconds` < 93000)\nRETURN DISTINCT `t1`.`forename` AS `forename`, `t1`.`surname` AS `surname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the forenames and surnames of all unique drivers who had a lap time of less than 93000 milliseconds?",
    "evidence": "",
    "idx": 3088
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nAND (`t2`.`milliseconds` > 100000)\nRETURN DISTINCT `t1`.`driverid` AS `driverid`, `t1`.`nationality` AS `nationality`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the distinct id and nationality of drivers who have had laptime more than 100000 milliseconds?",
    "evidence": "",
    "idx": 3089
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nAND (`t2`.`milliseconds` > 100000)\nRETURN DISTINCT `t1`.`driverid` AS `driverid`, `t1`.`nationality` AS `nationality`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different driver ids and nationalities of all drivers who had a laptime of more than 100000 milliseconds?",
    "evidence": "",
    "idx": 3090
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nORDER BY `t2`.`milliseconds` IS NULL DESC, `t2`.`milliseconds`  \nRETURN `t1`.`forename` AS `forename`, `t1`.`surname` AS `surname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the forename and surname of the driver who has the smallest laptime?",
    "evidence": "",
    "idx": 3091
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nORDER BY `t2`.`milliseconds` IS NULL DESC, `t2`.`milliseconds`  \nRETURN `t1`.`forename` AS `forename`, `t1`.`surname` AS `surname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the forename and surname of the driver with the shortest laptime?",
    "evidence": "",
    "idx": 3092
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nORDER BY `t2`.`milliseconds` IS NULL ASC, `t2`.`milliseconds` DESC \nRETURN `t1`.`driverid` AS `driverid`, `t1`.`surname` AS `surname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id and family name of the driver who has the longest laptime?",
    "evidence": "",
    "idx": 3093
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nORDER BY `t2`.`milliseconds` IS NULL ASC, `t2`.`milliseconds` DESC \nRETURN `t1`.`driverid` AS `driverid`, `t1`.`surname` AS `surname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id and last name of the driver with the longest laptime?",
    "evidence": "",
    "idx": 3094
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH ()-[t1:participated_in]->(`t2`:`races`)\nWHERE `t1`.`raceid` = `t2`.`raceid`\nAND (`t2`.`name` = 'Australian Grand Prix' AND `t2`.`year` = 2009)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many drivers participated in the race Australian Grand Prix held in 2009?",
    "evidence": "",
    "idx": 3095
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH ()-[t1:participated_in]->(`t2`:`races`)\nWHERE `t1`.`raceid` = `t2`.`raceid`\nAND (`t2`.`name` = 'Australian Grand Prix' AND `t2`.`year` = 2009)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many drivers were in the Australian Grand Prix held in 2009?",
    "evidence": "",
    "idx": 3096
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`races_sub0`:`races`)\nWHERE `races_sub0`.`year` <> 2009\nRETURN `races_sub0`.`raceid` AS `raceid`   } AS in_collect_0\nMATCH ()-[results:participated_in]->()\nWHERE NOT `results`.`raceid` IN in_collect_0\nRETURN COUNT(DISTINCT `results`.`driverid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many drivers did not participate in the races held in 2009?",
    "evidence": "",
    "idx": 3097
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`races_sub0`:`races`)\nWHERE `races_sub0`.`year` <> 2009\nRETURN `races_sub0`.`raceid` AS `raceid`   } AS in_collect_0\nMATCH ()-[results:participated_in]->()\nWHERE NOT `results`.`raceid` IN in_collect_0\nRETURN COUNT(DISTINCT `results`.`driverid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many drivers did not race in 2009?",
    "evidence": "",
    "idx": 3098
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t3`:`drivers`)-[t1:participated_in]->(`t2`:`races`)\nWHERE `t1`.`raceid` = `t2`.`raceid`\nAND `t1`.`driverid` = `t3`.`driverid`\nAND (`t3`.`forename` = 'Lewis')\nRETURN `t2`.`name` AS `name`, `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me a list of names and years of races that had any driver whose forename is Lewis?",
    "evidence": "",
    "idx": 3099
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t3`:`drivers`)-[t1:participated_in]->(`t2`:`races`)\nWHERE `t1`.`raceid` = `t2`.`raceid`\nAND `t1`.`driverid` = `t3`.`driverid`\nAND (`t3`.`forename` = 'Lewis')\nRETURN `t2`.`name` AS `name`, `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and years of all races that had a driver with the last name Lewis?",
    "evidence": "",
    "idx": 3100
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`drivers`:`drivers`)\nWHERE `drivers`.`nationality` = 'German'\nRETURN `drivers`.`forename` AS `forename`, `drivers`.`surname` AS `surname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the forename and surname of drivers whose nationality is German?",
    "evidence": "",
    "idx": 3101
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`drivers`:`drivers`)\nWHERE `drivers`.`nationality` = 'German'\nRETURN `drivers`.`forename` AS `forename`, `drivers`.`surname` AS `surname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first and last name of all the German drivers?",
    "evidence": "",
    "idx": 3102
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nAND (`t2`.`position` = 1 AND `t2`.`wins` = 1)\nRETURN DISTINCT `t1`.`forename` AS `forename`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the forenames of distinct drivers who was in position 1 as standing and won?",
    "evidence": "",
    "idx": 3103
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nAND (`t2`.`position` = 1 AND `t2`.`wins` = 1)\nRETURN DISTINCT `t1`.`forename` AS `forename`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the different first names of the drivers who are in position as standing and won?",
    "evidence": "",
    "idx": 3104
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->()\nWHERE `t1`.`driverid` = `t2`.`driverid`\nAND (`t2`.`position` = 1 AND `t2`.`wins` = 1 AND `t2`.`points` > 20)\nRETURN DISTINCT `t1`.`forename` AS `forename`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the forenames of distinct drivers who won in position 1 as driver standing and had more than 20 points?",
    "evidence": "",
    "idx": 3105
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`constructors`:`constructors`)\nWITH `constructors`.`nationality` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `nationality`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the numbers of constructors for different nationalities?",
    "evidence": "",
    "idx": 3107
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`constructors`:`constructors`)\nWITH `constructors`.`nationality` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `nationality`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each nationality, how many different constructors are there?",
    "evidence": "",
    "idx": 3108
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH ()-[constructorstandings:participated_in]->()\nWITH `constructorstandings`.`constructorid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `constructorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the numbers of races for each constructor id?",
    "evidence": "",
    "idx": 3109
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH ()-[constructorstandings:participated_in]->()\nWITH `constructorstandings`.`constructorid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `constructorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each constructor id, how many races are there?",
    "evidence": "",
    "idx": 3110
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`races`)-[held_at_0:held_at]->(`t2`:`circuits`)\nWHERE `t1`.`circuitid` = `t2`.`circuitid`\nAND (`t2`.`country` = 'Spain' AND `t1`.`year` > 2017)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of races that were held after 2017 and the circuits were in the country of Spain?",
    "evidence": "",
    "idx": 3111
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`races`)-[held_at_0:held_at]->(`t2`:`circuits`)\nWHERE `t1`.`circuitid` = `t2`.`circuitid`\nAND (`t2`.`country` = 'Spain' AND `t1`.`year` > 2017)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the races held after 2017 in Spain?",
    "evidence": "",
    "idx": 3112
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`races`)-[held_at_0:held_at]->(`t2`:`circuits`)\nWHERE `t1`.`circuitid` = `t2`.`circuitid`\nAND (`t2`.`country` = 'Spain' AND `t1`.`year` > 2000)\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the unique names of races that held after 2000 and the circuits were in Spain?",
    "evidence": "",
    "idx": 3113
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`races`)-[held_at_0:held_at]->(`t2`:`circuits`)\nWHERE `t1`.`circuitid` = `t2`.`circuitid`\nAND (`t2`.`country` = 'Spain' AND `t1`.`year` > 2000)\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all races held after 2000 in Spain?",
    "evidence": "",
    "idx": 3114
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "CALL(*) {\nMATCH ()-[pitstops_sub0:participated_in]->()\nWHERE `pitstops_sub0`.`raceid` = 841\nRETURN MAX(`pitstops_sub0`.`duration`) AS `_col_0`  \n}\nMATCH ()-[pitstops:participated_in]->()\nWHERE `pitstops`.`duration` < `_col_0`\nRETURN DISTINCT `pitstops`.`driverid` AS `driverid`, `pitstops`.`stop` AS `stop`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id and stop number for each driver that has a shorter pit stop than the driver in the race with id 841?",
    "evidence": "",
    "idx": 3116
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "CALL(*) {\nMATCH ()-[pitstops_sub0:participated_in]->()\nWHERE `pitstops_sub0`.`raceid` = 841\nRETURN min(`pitstops_sub0`.`duration`) AS `_col_0`  \n}\nMATCH ()-[pitstops:participated_in]->()\nWHERE `pitstops`.`duration` > `_col_0`\nRETURN DISTINCT `pitstops`.`driverid` AS `driverid`, `pitstops`.`stop` AS `stop`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct driver id of all drivers that have a longer stop duration than some drivers in the race whose id is 841?",
    "evidence": "",
    "idx": 3117
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "CALL(*) {\nMATCH ()-[pitstops_sub0:participated_in]->()\nWHERE `pitstops_sub0`.`raceid` = 841\nRETURN min(`pitstops_sub0`.`duration`) AS `_col_0`  \n}\nMATCH ()-[pitstops:participated_in]->()\nWHERE `pitstops`.`duration` > `_col_0`\nRETURN DISTINCT `pitstops`.`driverid` AS `driverid`, `pitstops`.`stop` AS `stop`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different ids and stop durations of all the drivers whose stop lasted longer than the driver in the race with the id 841?",
    "evidence": "",
    "idx": 3118
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`drivers`:`drivers`)\nRETURN DISTINCT `drivers`.`forename` AS `forename` ORDER BY `forename` IS NULL DESC, `forename`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the forenames of all distinct drivers in alphabetical order?",
    "evidence": "",
    "idx": 3119
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`drivers`:`drivers`)\nRETURN DISTINCT `drivers`.`forename` AS `forename` ORDER BY `forename` IS NULL DESC, `forename`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names of all the different drivers in alphabetical order?",
    "evidence": "",
    "idx": 3120
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nRETURN DISTINCT `races`.`name` AS `name` ORDER BY `name` IS NULL ASC, `name` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all distinct races in reversed  lexicographic order?",
    "evidence": "",
    "idx": 3121
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nRETURN DISTINCT `races`.`name` AS `name` ORDER BY `name` IS NULL ASC, `name` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different names of all the races in reverse alphabetical order?",
    "evidence": "",
    "idx": 3122
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nWHERE `races`.`year` >= 2009 AND `races`.`year` <= 2011\nRETURN `races`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of races held between 2009 and 2011?",
    "evidence": "",
    "idx": 3123
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nWHERE `races`.`year` >= 2009 AND `races`.`year` <= 2011\nRETURN `races`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all races held between 2009 and 2011?",
    "evidence": "",
    "idx": 3124
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nWHERE `races`.`time` > '12:00:00' OR `races`.`time` < '09:00:00'\nRETURN `races`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of races held after 12:00:00 or before 09:00:00?",
    "evidence": "",
    "idx": 3125
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`races`:`races`)\nWHERE `races`.`time` > '12:00:00' OR `races`.`time` < '09:00:00'\nRETURN `races`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all races that occurred after 12:00:00 or before 09:00:00?",
    "evidence": "",
    "idx": 3126
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`circuits`:`circuits`)\nWHERE `circuits`.`country` = 'UK' OR `circuits`.`country` = 'Malaysia'\nRETURN `circuits`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of circuits that belong to UK or Malaysia?",
    "evidence": "",
    "idx": 3127
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`circuits`:`circuits`)\nWHERE `circuits`.`country` = 'UK' OR `circuits`.`country` = 'Malaysia'\nRETURN `circuits`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the circuits that are in the UK or Malaysia?",
    "evidence": "",
    "idx": 3128
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`circuits`:`circuits`)\nWHERE `circuits`.`country` = 'France' OR `circuits`.`country` = 'Belgium'\nRETURN `circuits`.`circuitid` AS `circuitid`, `circuits`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id and location of circuits that belong to France or Belgium?",
    "evidence": "",
    "idx": 3129
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`circuits`:`circuits`)\nWHERE `circuits`.`country` = 'France' OR `circuits`.`country` = 'Belgium'\nRETURN `circuits`.`circuitid` AS `circuitid`, `circuits`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids and locations of all circuits in France or Belgium?",
    "evidence": "",
    "idx": 3130
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`constructors`)-[t2:participated_in]->()\nWHERE `t1`.`constructorid` = `t2`.`constructorid`\nAND (`t1`.`nationality` = 'Japanese' AND `t2`.`points` > 5)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of Japanese constructors that have once earned more than 5 points?",
    "evidence": "",
    "idx": 3131
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`constructors`)-[t2:participated_in]->()\nWHERE `t1`.`constructorid` = `t2`.`constructorid`\nAND (`t1`.`nationality` = 'Japanese' AND `t2`.`points` > 5)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the Japanese constructors that have earned more than 5 points?",
    "evidence": "",
    "idx": 3132
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH ()-[t2:participated_in]->(`t1`:`races`)\nWHERE `t1`.`raceid` = `t2`.`raceid`\nAND (`t1`.`year` = 2008 AND `t1`.`name` = 'Monaco Grand Prix')\nRETURN MAX(`t2`.`fastestlapspeed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum fastest lap speed in race named 'Monaco Grand Prix' in 2008 ?",
    "evidence": "",
    "idx": 3133
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH ()-[t2:participated_in]->(`t1`:`races`)\nWHERE `t1`.`raceid` = `t2`.`raceid`\nAND (`t1`.`year` = 2008 AND `t1`.`name` = 'Monaco Grand Prix')\nRETURN MAX(`t2`.`fastestlapspeed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum fastest lap speed in the Monaco Grand Prix in 2008?",
    "evidence": "",
    "idx": 3134
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->(`t3`:`races`)\nWHERE `t1`.`driverid` = `t2`.`driverid`\nAND `t2`.`raceid` = `t3`.`raceid`\nWITH `t1`.`driverid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 <= 30\nRETURN _groupby_col_0 AS `driverid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the driver id and number of races of all drivers who have at most participated in 30 races?",
    "evidence": "",
    "idx": 3135
  },
  {
    "filename": "train_spider.json",
    "db_id": "formula_1",
    "gql_statement": "MATCH (`t1`:`drivers`)-[t2:participated_in]->(`t3`:`races`)\nWHERE `t1`.`driverid` = `t2`.`driverid`\nAND `t2`.`raceid` = `t3`.`raceid`\nWITH `t1`.`driverid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 <= 30\nRETURN _groupby_col_0 AS `driverid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each id of a driver who participated in at most 30 races, how many races did they participate in?",
    "evidence": "",
    "idx": 3136
  },
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "MATCH (`technician`:`technician`)\nORDER BY `technician`.`age` IS NULL DESC, `technician`.`age`  \nRETURN `technician`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of technicians in ascending order of age.",
    "evidence": "",
    "idx": 3139
  },
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "MATCH (`technician`:`technician`)\nWHERE `technician`.`team` <> 'NYY'\nRETURN `technician`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of technicians whose team is not \"NYY\".",
    "evidence": "",
    "idx": 3143
  },
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "MATCH (`technician`:`technician`)\nWHERE `technician`.`age` = 36 OR `technician`.`age` = 37\nRETURN `technician`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of technicians aged either 36 or 37",
    "evidence": "",
    "idx": 3145
  },
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "MATCH (`technician`:`technician`)\nWITH `technician`.`team` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `team`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different teams of technicians and the number of technicians in each team.",
    "evidence": "",
    "idx": 3149
  },
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "MATCH (`technician`:`technician`)\nWITH `technician`.`team` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `team`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the team that have at least two technicians.",
    "evidence": "",
    "idx": 3151
  },
  {
    "filename": "train_spider.json",
    "db_id": "machine_repair",
    "gql_statement": "MATCH ()-[t1:repairs_machine]->(`t2`:`machine`)\nMATCH (`t3`:`technician`)-[t1:assigned_to_repair]->()\nWHERE `t1`.`machine_id` = `t2`.`machine_id`\nAND `t1`.`technician_id` = `t3`.`technician_id`\nRETURN `t3`.`name` AS `name`, `t2`.`machine_series` AS `machine_series`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of technicians and series of machines they are assigned to repair.",
    "evidence": "",
    "idx": 3153
  }
]