[
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nRETURN avg(`submission`.`scores`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average score of submissions?",
    "evidence": "",
    "idx": 6002
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nRETURN avg(`submission`.`scores`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the average score of submissions.",
    "evidence": "",
    "idx": 6003
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nORDER BY `submission`.`scores` IS NULL ASC, `submission`.`scores` DESC \nRETURN `submission`.`author` AS `author`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the author who achieved the highest score in a submission.",
    "evidence": "",
    "idx": 6005
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`submission`:`submission`)\nWITH `submission`.`college` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `college`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different colleges along with the number of authors of submission from each college.",
    "evidence": "",
    "idx": 6006
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`t2`:`submission`)-[t1:submitted_to]->()\nWHERE `t1`.`submission_id` = `t2`.`submission_id`\nRETURN `t2`.`author` AS `author`, `t1`.`result` AS `result`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the authors of submissions and the acceptance results of their submissions.",
    "evidence": "",
    "idx": 6008
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`t2`:`submission`)-[t1:submitted_to]->()\nWHERE `t1`.`submission_id` = `t2`.`submission_id`\nRETURN `t2`.`author` AS `author`, `t1`.`result` AS `result`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each submission, find its author and acceptance result.",
    "evidence": "",
    "idx": 6009
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`t2`:`submission`)-[t1:submitted_to]->()\nWHERE `t1`.`submission_id` = `t2`.`submission_id`\nORDER BY `t2`.`scores` IS NULL ASC, `t2`.`scores` DESC \nRETURN `t1`.`result` AS `result`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the result of the submission with the highest score.",
    "evidence": "",
    "idx": 6010
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`t2`:`submission`)-[t1:submitted_to]->()\nWHERE `t1`.`submission_id` = `t2`.`submission_id`\nWITH `t2`.`author` AS _groupby_col_0, COUNT(DISTINCT `t1`.`workshop_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `author`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show each author and the number of workshops they submitted to.",
    "evidence": "",
    "idx": 6012
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`t2`:`submission`)-[t1:submitted_to]->()\nWHERE `t1`.`submission_id` = `t2`.`submission_id`\nWITH `t2`.`author` AS _groupby_col_0, COUNT(DISTINCT `t1`.`workshop_id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `author`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the authors who have submissions to more than one workshop.",
    "evidence": "",
    "idx": 6014
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`t2`:`submission`)-[t1:submitted_to]->()\nWHERE `t1`.`submission_id` = `t2`.`submission_id`\nWITH `t2`.`author` AS _groupby_col_0, COUNT(DISTINCT `t1`.`workshop_id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `author`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which authors have submitted to more than one workshop?",
    "evidence": "",
    "idx": 6015
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`workshop`:`workshop`)\nRETURN `workshop`.`date` AS `date`, `workshop`.`venue` AS `venue` ORDER BY `venue` IS NULL DESC, `venue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the date and venue of each workshop in ascending alphabetical order of the venue.",
    "evidence": "",
    "idx": 6016
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "MATCH (`workshop`:`workshop`)\nRETURN `workshop`.`date` AS `date`, `workshop`.`venue` AS `venue` ORDER BY `venue` IS NULL DESC, `venue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort the each workshop in alphabetical order of the venue. Return the date and venue of each workshop.",
    "evidence": "",
    "idx": 6017
  },
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[acceptance_sub0:submitted_to]->()\nRETURN `acceptance_sub0`.`submission_id` AS `submission_id`   } AS in_collect_0\nMATCH (`submission`:`submission`)\nWHERE NOT `submission`.`submission_id` IN in_collect_0\nRETURN `submission`.`author` AS `author`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the authors who do not have submission to any workshop.",
    "evidence": "",
    "idx": 6018
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`investors`:`investors`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of investors in total.",
    "evidence": "",
    "idx": 6020
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`investors`:`investors`)\nRETURN `investors`.`investor_details` AS `investor_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all investor details.",
    "evidence": "",
    "idx": 6021
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`lots`:`lots`)\nRETURN DISTINCT `lots`.`lot_details` AS `lot_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all distinct lot details.",
    "evidence": "",
    "idx": 6022
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nRETURN MAX(`transactions`.`amount_of_transaction`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the maximum amount of transaction.",
    "evidence": "",
    "idx": 6023
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nRETURN `transactions`.`date_of_transaction` AS `date_of_transaction`, `transactions`.`share_count` AS `share_count`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all date and share count of transactions.",
    "evidence": "",
    "idx": 6024
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWHERE `transactions`.`transaction_type_code` = 'PUR'\nRETURN `transactions`.`transaction_id` AS `transaction_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all transaction ids with transaction code 'PUR'.",
    "evidence": "",
    "idx": 6025
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWHERE `transactions`.`transaction_type_code` = 'SALE'\nRETURN `transactions`.`date_of_transaction` AS `date_of_transaction`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all dates of transactions whose type code is \"SALE\".",
    "evidence": "",
    "idx": 6026
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWHERE `transactions`.`transaction_type_code` = 'SALE'\nRETURN avg(`transactions`.`amount_of_transaction`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average amount of transactions with type code \"SALE\".",
    "evidence": "",
    "idx": 6027
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`ref_transaction_types`:`ref_transaction_types`)\nWHERE `ref_transaction_types`.`transaction_type_code` = 'PUR'\nRETURN `ref_transaction_types`.`transaction_type_description` AS `transaction_type_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the description of transaction type with code \"PUR\".",
    "evidence": "",
    "idx": 6028
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWHERE `transactions`.`transaction_type_code` = 'PUR' AND `transactions`.`share_count` > 50\nRETURN min(`transactions`.`amount_of_transaction`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the minimum amount of transactions whose type code is \"PUR\" and whose share count is bigger than 50.",
    "evidence": "",
    "idx": 6029
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWHERE `transactions`.`amount_of_transaction` < 10000\nRETURN MAX(`transactions`.`share_count`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the maximum share count of transactions where the amount is smaller than 10000",
    "evidence": "",
    "idx": 6030
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWHERE `transactions`.`share_count` > 100 OR `transactions`.`amount_of_transaction` > 1000\nRETURN `transactions`.`date_of_transaction` AS `date_of_transaction`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the dates of transactions if the share count is bigger than 100 or the amount is bigger than 1000.",
    "evidence": "",
    "idx": 6031
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`t2`:`transactions`)-[type_0:type]->(`t1`:`ref_transaction_types`)\nWHERE `t1`.`transaction_type_code` = `t2`.`transaction_type_code`\nAND (`t2`.`share_count` < 10)\nRETURN `t1`.`transaction_type_description` AS `transaction_type_description`, `t2`.`date_of_transaction` AS `date_of_transaction`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the transaction type descriptions and dates if the share count is smaller than 10.",
    "evidence": "",
    "idx": 6032
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`t2`:`transactions`)-[investor_0:investor]->(`t1`:`investors`)\nWHERE `t1`.`investor_id` = `t2`.`investor_id`\nAND (`t2`.`share_count` > 100)\nRETURN `t1`.`investor_details` AS `investor_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show details of all investors if they make any transaction with share count greater than 100.",
    "evidence": "",
    "idx": 6033
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`lots`:`lots`)\nRETURN `lots`.`lot_details` AS `lot_details`, `lots`.`investor_id` AS `investor_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the lot details and investor ids.",
    "evidence": "",
    "idx": 6035
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`t2`:`lots`)-[owned_by_0:owned_by]->(`t1`:`investors`)\nWHERE `t1`.`investor_id` = `t2`.`investor_id`\nAND (`t1`.`investor_details` = 'l')\nRETURN `t2`.`lot_details` AS `lot_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the lot details of lots that belong to investors with details \"l\"?",
    "evidence": "",
    "idx": 6036
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`t1`:`lots`)-[t2:involves]->(`t3`:`transactions`)\nWHERE `t1`.`lot_id` = `t2`.`transaction_id`\nAND `t2`.`transaction_id` = `t3`.`transaction_id`\nAND (`t3`.`share_count` < 50)\nRETURN `t1`.`lot_details` AS `lot_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the lot details of lots associated with transactions with share count smaller than 50?",
    "evidence": "",
    "idx": 6039
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`t1`:`lots`)-[t2:involves]->(`t3`:`transactions`)\nWHERE `t1`.`lot_id` = `t2`.`transaction_id`\nAND `t2`.`transaction_id` = `t3`.`transaction_id`\nAND (`t3`.`share_count` > 100 AND `t3`.`transaction_type_code` = 'PUR')\nRETURN `t1`.`lot_details` AS `lot_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the lot details of lots associated with transactions whose share count is bigger than 100 and whose type code is \"PUR\"?",
    "evidence": "",
    "idx": 6040
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWITH `transactions`.`transaction_type_code` AS _groupby_col_0, avg(`transactions`.`amount_of_transaction`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `transaction_type_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average transaction amount for different transaction types.",
    "evidence": "",
    "idx": 6041
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWITH `transactions`.`transaction_type_code` AS _groupby_col_0, MAX(`transactions`.`share_count`) AS _groupby_col_1, min(`transactions`.`share_count`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `transaction_type_code`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the maximum and minimum share count of different transaction types.",
    "evidence": "",
    "idx": 6042
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWITH `transactions`.`investor_id` AS _groupby_col_0, avg(toFloat(`transactions`.`share_count`)) AS _groupby_col_1\nRETURN _groupby_col_0 AS `investor_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average share count of transactions for different investors.",
    "evidence": "",
    "idx": 6043
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWITH `transactions`.`investor_id` AS _groupby_col_0, avg(toFloat(`transactions`.`share_count`)) AS _groupby_col_1\nRETURN _groupby_col_0 AS `investor_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL DESC, `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average share count of transactions each each investor, ordered by average share count.",
    "evidence": "",
    "idx": 6044
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWITH `transactions`.`investor_id` AS _groupby_col_0, avg(`transactions`.`amount_of_transaction`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `investor_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average amount of transactions for different investors.",
    "evidence": "",
    "idx": 6045
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`t1`:`transactions`)-[t2:involves]->()\nWHERE `t1`.`transaction_id` = `t2`.`transaction_id`\nWITH `t2`.`lot_id` AS _groupby_col_0, avg(`t1`.`amount_of_transaction`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `lot_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average amount of transactions for different lots.",
    "evidence": "",
    "idx": 6046
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWHERE `transactions`.`transaction_type_code` = 'SALE'\nWITH `transactions`.`investor_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `investor_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of transactions with transaction type code \"SALE\" for different investors if it is larger than 0.",
    "evidence": "",
    "idx": 6048
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`transactions`:`transactions`)\nWITH `transactions`.`investor_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `investor_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of transactions for different investors.",
    "evidence": "",
    "idx": 6049
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`t2`:`transactions`)-[investor_0:investor]->(`t1`:`investors`)\nWHERE `t1`.`investor_id` = `t2`.`investor_id`\nWITH `t2`.`investor_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `investor_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ids of the investors who have at least two transactions.",
    "evidence": "",
    "idx": 6050
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "MATCH (`sales`:`sales`)\nRETURN `sales`.`sales_details` AS `sales_details`   \nUNION DISTINCT\nMATCH (`purchases`:`purchases`)\nRETURN `purchases`.`purchase_details` AS `sales_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the details of all sales and purchases?",
    "evidence": "",
    "idx": 6052
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of available hotels.",
    "evidence": "",
    "idx": 6054
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nRETURN `hotels`.`price_range` AS `price_range`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Tell me the price ranges for all the hotels.",
    "evidence": "",
    "idx": 6056
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`locations`:`locations`)\nRETURN DISTINCT `locations`.`location_name` AS `location_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all distinct location names.",
    "evidence": "",
    "idx": 6057
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`staff`:`staff`)\nRETURN `staff`.`name` AS `name`, `staff`.`other_details` AS `other_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names and details of all the staff members.",
    "evidence": "",
    "idx": 6059
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`visitors`:`visitors`)\nRETURN `visitors`.`tourist_details` AS `tourist_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show details of all visitors.",
    "evidence": "",
    "idx": 6061
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nWHERE `hotels`.`star_rating_code` = '5'\nRETURN `hotels`.`price_range` AS `price_range`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the price ranges of hotels with 5 star ratings.",
    "evidence": "",
    "idx": 6063
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nWHERE `hotels`.`star_rating_code` = '5'\nRETURN `hotels`.`price_range` AS `price_range`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the price ranges of five star hotels?",
    "evidence": "",
    "idx": 6064
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nWHERE `hotels`.`star_rating_code` = '5' AND `hotels`.`pets_allowed_yn` = 1\nRETURN avg(`hotels`.`price_range`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average price range of hotels that have 5 star ratings and allow pets.",
    "evidence": "",
    "idx": 6065
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nWHERE `hotels`.`star_rating_code` = '5' AND `hotels`.`pets_allowed_yn` = 1\nRETURN avg(`hotels`.`price_range`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average price range of five star hotels that allow pets?",
    "evidence": "",
    "idx": 6066
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`locations`:`locations`)\nWHERE `locations`.`location_name` = 'UK Gallery'\nRETURN `locations`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the address of the location \"UK Gallery\"?",
    "evidence": "",
    "idx": 6067
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`locations`:`locations`)\nWHERE `locations`.`location_name` = 'UK Gallery'\nRETURN `locations`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the address of the location named \"UK Gallery\".",
    "evidence": "",
    "idx": 6068
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`locations`:`locations`)\nWHERE `locations`.`location_name` = 'UK Gallery'\nRETURN `locations`.`other_details` AS `other_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the detail of the location named \"UK Gallery\".",
    "evidence": "",
    "idx": 6070
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`locations`:`locations`)\nWHERE `locations`.`location_name` =~ '(?i)(?s).*film.*'\nRETURN `locations`.`location_name` AS `location_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which location names contain the word \"film\"?",
    "evidence": "",
    "idx": 6071
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`locations`:`locations`)\nWHERE `locations`.`location_name` =~ '(?i)(?s).*film.*'\nRETURN `locations`.`location_name` AS `location_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the locations whose names contain the word \"film\".",
    "evidence": "",
    "idx": 6072
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`photos`:`photos`)\nRETURN COUNT(DISTINCT `photos`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of distinct names associated with the photos.",
    "evidence": "",
    "idx": 6074
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`tourist_attractions`:`tourist_attractions`)\nWHERE `tourist_attractions`.`how_to_get_there` = 'bus'\nRETURN `tourist_attractions`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which tourist attractions can we get to by bus? Tell me the names of the attractions.",
    "evidence": "",
    "idx": 6078
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`tourist_attractions`:`tourist_attractions`)\nWHERE `tourist_attractions`.`how_to_get_there` = 'bus' OR `tourist_attractions`.`how_to_get_there` = 'walk'\nRETURN `tourist_attractions`.`name` AS `name`, `tourist_attractions`.`opening_hours` AS `opening_hours`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names and opening hours of the tourist attractions that we get to by bus or walk.",
    "evidence": "",
    "idx": 6080
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`hotels`)-[has_star_rating_0:has_star_rating]->(`t2`:`ref_hotel_star_ratings`)\nWHERE `t1`.`star_rating_code` = `t2`.`star_rating_code`\nAND (`t1`.`price_range` > 10000)\nRETURN `t2`.`star_rating_description` AS `star_rating_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the star rating descriptions of the hotels that cost more than 10000.",
    "evidence": "",
    "idx": 6082
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`museums`)-[is_a_0:is_a]->(`t2`:`tourist_attractions`)\nWHERE `t1`.`museum_id` = `t2`.`tourist_attraction_id`\nRETURN `t1`.`museum_details` AS `museum_details`, `t2`.`opening_hours` AS `opening_hours`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the detail and opening hour for each museum.",
    "evidence": "",
    "idx": 6084
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`photos`)-[taken_at_0:taken_at]->(`t2`:`tourist_attractions`)\nWHERE `t1`.`tourist_attraction_id` = `t2`.`tourist_attraction_id`\nAND (`t1`.`name` = 'game1')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the tourist attraction that is associated with the photo \"game1\"?",
    "evidence": "",
    "idx": 6085
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`photos`)-[taken_at_0:taken_at]->(`t2`:`tourist_attractions`)\nWHERE `t1`.`tourist_attraction_id` = `t2`.`tourist_attraction_id`\nAND (`t2`.`name` = 'film festival')\nRETURN `t1`.`name` AS `name`, `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and descriptions of the photos taken at the tourist attraction \"film festival\"?",
    "evidence": "",
    "idx": 6087
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`royal_family`)-[is_a_0:is_a]->(`t2`:`tourist_attractions`)\nWHERE `t1`.`royal_family_id` = `t2`.`tourist_attraction_id`\nRETURN `t1`.`royal_family_details` AS `royal_family_details`, `t2`.`how_to_get_there` AS `how_to_get_there`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which tourist attractions are related to royal family? Tell me their details and how we can get there.",
    "evidence": "",
    "idx": 6090
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`shops`)-[is_a_0:is_a]->(`t2`:`tourist_attractions`)\nWHERE `t1`.`shop_id` = `t2`.`tourist_attraction_id`\nAND (`t2`.`how_to_get_there` = 'walk')\nRETURN `t1`.`shop_details` AS `shop_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the details of the shops that can be reached by walk.",
    "evidence": "",
    "idx": 6092
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`staff`)-[works_at_0:works_at]->(`t2`:`tourist_attractions`)\nWHERE `t1`.`tourist_attraction_id` = `t2`.`tourist_attraction_id`\nAND (`t2`.`name` = 'US museum')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the staff that is in charge of the attraction named \"US museum\"?",
    "evidence": "",
    "idx": 6093
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`street_markets`)-[is_a_0:is_a]->(`t2`:`tourist_attractions`)\nWHERE `t1`.`market_id` = `t2`.`tourist_attraction_id`\nAND (`t2`.`how_to_get_there` = 'walk' OR `t2`.`how_to_get_there` = 'bus')\nRETURN `t1`.`market_details` AS `market_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the details of all the markets that are accessible by walk or bus.",
    "evidence": "",
    "idx": 6096
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`visitors`)-[t2:visited]->()\nWHERE `t1`.`tourist_id` = `t2`.`tourist_id`\nAND (`t1`.`tourist_details` = 'Vincent')\nRETURN `t2`.`visit_date` AS `visit_date`, `t2`.`visit_details` AS `visit_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the visit date and details of the visitor whose detail is 'Vincent'?",
    "evidence": "",
    "idx": 6097
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`tourist_attractions`)-[t2:was_visited_by]->(`t3`:`visitors`)\nWHERE `t1`.`tourist_attraction_id` = `t2`.`tourist_attraction_id`\nAND `t2`.`tourist_id` = `t3`.`tourist_id`\nAND (`t3`.`tourist_details` = 'Vincent')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which tourist attractions does the visitor with detail 'Vincent' visit?",
    "evidence": "",
    "idx": 6099
  }
]