[
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`organization`)\nMATCH (t1@`language`)\nWHERE t1.`country` = t2.`country`\nAND (t1.`name` = 'Bosnian')\nRETURN COUNT(t2.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many organizations are established in countries where people speak Bosnian?",
    "evidence": "Bosnian is one of language",
    "idx": 4068
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`economy`)\nMATCH (t2@`population`)\nWHERE t1.`country` = t2.`country`\nAND (t1.`inflation` < 3)\nRETURN MAX(t2.`infant_mortality`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the highest infant mortality rate per thousand of the countries whose inflation is under 3?",
    "evidence": "",
    "idx": 4069
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`economy`)\nMATCH (t2@`population`)\nWHERE t1.`country` = t2.`country`\nAND (t1.`gdp` > 1000000 AND t2.`population_growth` > 3)\nRETURN COUNT(t1.`country`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the countries whose GDP is over 1000000, how many of them have a population groth rate of over 3%?",
    "evidence": "population growth rate of over 3% means population_growth > 3",
    "idx": 4070
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nORDER BY t2.`gdp` / t1.`population` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country has the highest GDP per capita?",
    "evidence": "GDP per capita = GDP / population",
    "idx": 4071
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`province` = 'Baghdad'\nRETURN country.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Where country does Baghdad belongs to?",
    "evidence": "Baghdad is one of provinces",
    "idx": 4072
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`religion`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Martinique')\nORDER BY t1.`population` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which religion has the largest population in Martinique?",
    "evidence": "",
    "idx": 4073
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`geo_mountain`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Indonesia')\nRETURN COUNT(DISTINCT t2.`mountain`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many mountains are there in Indonesia?",
    "evidence": "Indonesia refers to one of countries",
    "idx": 4077
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`geo_mountain`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Japan')\nRETURN COUNT(DISTINCT t2.`mountain`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the quantity of the mountains does Japan have?",
    "evidence": "Japan is one of country names",
    "idx": 4078
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`island`)\nMATCH (t2@`mountainonisland`)\nWHERE t1.`name` = t2.`island`\nAND (t2.`mountain` = 'Andringitra')\nRETURN t1.`latitude` AS `latitude`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the latitude of the island on which Mount Andrinjitra is located?",
    "evidence": "",
    "idx": 4079
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`city`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Japan')\nORDER BY t2.`population` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city in Japan has the most people in the country?",
    "evidence": "most people refers to largest population",
    "idx": 4080
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`city`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'Olsztyn')\nRETURN t1.`capital` AS `capital`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the country in which Olsztyn is located, where is the capital?",
    "evidence": "Olsztyn is one of country names",
    "idx": 4081
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`politics`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Uganda')\nRETURN t2.`independence` AS `independence`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did Uganda declare independence?",
    "evidence": "Uganda is one of country names",
    "idx": 4082
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`politics`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Iran')\nRETURN t2.`government` AS `government`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What kind of government does Iran have?",
    "evidence": "Uganda is one of country names",
    "idx": 4083
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`ethnicgroup`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'Malay')\nORDER BY t2.`percentage` DESC NULLS LAST \nRETURN t1.`capital` AS `capital` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Where is the capital of country which has the largest percentage of Malay people?",
    "evidence": "Malay is one of country names",
    "idx": 4084
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (sea_sub0@`sea`)\nWHERE sea_sub0.`depth` = 459\nRETURN collect(sea_sub0.`name`) AS `name` \n} \nMATCH (river@`river`)\nWHERE river.`sea` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many rivers finally flows to the sea of 459m in depth?",
    "evidence": "",
    "idx": 4086
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`politics`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`independence` = date('1921-03-13'))\nRETURN t1.`area` AS `area`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the area of the country which became independent in 1921/3/13?",
    "evidence": "",
    "idx": 4087
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`city`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'Petropavl')\nRETURN cast (t1.`population` as float) / t1.`area` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the population density of the Petropavl's home country?",
    "evidence": "Population density = Population / area",
    "idx": 4088
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`borders`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country2`\nAND (t1.`name` = 'United States')\nRETURN MAX(t2.`length`) / min(t2.`length`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times longer is the longest border in the United States than the shortest?",
    "evidence": "How many times longer = longest border / shortest border",
    "idx": 4089
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`city`)\nMATCH (t1@`province`)\nWHERE t1.`name` = t2.`province` AND t1.`country` = t2.`country`\nAND (t2.`name` = 'Glenrothes')\nRETURN t2.`province` AS `province`, t1.`capital` AS `capital`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which province is city Glenrothes located? What is the capital of the province?",
    "evidence": "",
    "idx": 4093
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (river@`river`)\nWHERE river.`sea` = 'Black Sea'\nRETURN river.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which are the rivers that flows to Black Sea?",
    "evidence": "Black Sea is a sea located in Eastern Europe and Western Asia",
    "idx": 4097
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (mountain@`mountain`)\nWHERE mountain.`mountains` = 'Andes'\nRETURN cast (sum(CASE  WHEN mountain.`type` <> 'volcano' THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many percent of the mountains on Andes which are non-volcanic?",
    "evidence": "Percent of non-volcanic mountains = count(mountains = 'Andes' & type ! = 'volcano') / count(mountains = 'Andes') * 100%",
    "idx": 4103
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`geo_river`)\nMATCH (t1@`river`)\nWHERE t2.`river` = t1.`name`\nAND (t2.`province` = 'Lorraine')\nRETURN t1.`sourcelongitude` AS `sourcelongitude`, t1.`sourcelatitude` AS `sourcelatitude`, t1.`sourcealtitude` AS `sourcealtitude`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Name the river of which Lorraine is on. Please name the mountains where to source flow from?",
    "evidence": "Lorraine is a province",
    "idx": 4104
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`mountain`)\nMATCH (t2@`geo_mountain`)\nWHERE t1.`name` = t2.`mountain`\nAND (t2.`province` = 'Nepal')\nRETURN avg(t1.`height`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average height of all mountains in Nepal?",
    "evidence": "Nepal is a province",
    "idx": 4107
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (language@`language`)\nWHERE language.`name` = 'Spanish' AND language.`percentage` = 100\nRETURN language.`country` AS `country`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which nations have a 100% Spanish-speaking population?",
    "evidence": "",
    "idx": 4108
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (politics@`politics`)\nWHERE politics.`government` = 'British crown dependency'\nRETURN politics.`country` AS `country`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which countries are dependent on the British Crown?",
    "evidence": "",
    "idx": 4109
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`located`)\nMATCH (t2@`country`)\nWHERE t1.`country` = t2.`code`\nAND (t2.`name` = 'Canada' AND NOT t1.`river` IS NULL)\nRETURN DISTINCT t1.`river` AS `river`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the rivers in Canada?",
    "evidence": "",
    "idx": 4110
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`economy`)\nMATCH (t2@`country`)\nWHERE t1.`country` = t2.`code`\nORDER BY t1.`inflation` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the country whose citizens have the lowest purchasing power?",
    "evidence": "Inflation can reduce purchasing power over time for recipients and payers.",
    "idx": 4111
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`city`)\nMATCH (t2@`country`)\nWHERE t1.`country` = t2.`code`\nAND (t2.`name` = 'United Kingdom')\nORDER BY t1.`population` DESC NULLS LAST \nRETURN t1.`province` AS `province`, t1.`population` AS `population` \nSKIP 3\nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What province does the 4th most populous city in the United Kingdom belong to, and how many people live there?",
    "evidence": "",
    "idx": 4112
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`ethnicgroup`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Moldova' AND t2.`name` = 'Jewish')\nRETURN t2.`percentage` * t1.`population` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Jewish residents are there in Moldova?",
    "evidence": "Moldova is one country located in Eastern Europe; The number of residents can be computed by percentage * population",
    "idx": 4113
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`encompasses`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`continent` = 'Asia')\nRETURN avg(t1.`area`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average area of Asian countries?",
    "evidence": "Asia is a continent",
    "idx": 4114
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`language`)\nMATCH (t2@`country`)\nWHERE t1.`country` = t2.`code`\nAND (t1.`name` = 'Serbian' AND t2.`name` = 'Montenegro')\nRETURN t1.`percentage` * t2.`population` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many people in Montenegro speaks Serbian?",
    "evidence": "Serbian is one language; Montenegro is a country located in Southeastern Europe",
    "idx": 4115
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "CALL {\nMATCH (country_sub0@`country`)\nORDER BY country_sub0.`area` DESC NULLS LAST \nRETURN country_sub0.`code` AS `code` \nLIMIT 1\n}\nMATCH (geo_mountain@`geo_mountain`)\nWHERE geo_mountain.`country` = code\nRETURN COUNT(geo_mountain.`mountain`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many mountains are there in the country with the most land area?",
    "evidence": "",
    "idx": 4116
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`politics`)\nWHERE t1.`country` = t2.`country`\nAND (t1.`government` = 'Communist state')\nORDER BY t2.`gdp`  NULLS FIRST \nRETURN t2.`country` AS `country` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which nation's GDP is the lowest among those that are communist states?",
    "evidence": "Communist is a government form",
    "idx": 4117
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`politics`)\nWHERE t1.`country` = t2.`country`\nORDER BY t2.`inflation` DESC NULLS LAST \nRETURN t1.`government` AS `government` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What kind of political system is in place in the country with the highest inflation rate?",
    "evidence": "Political system refers to government form",
    "idx": 4118
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`language`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'Arabic' AND t2.`percentage` = 100)\nORDER BY t1.`population`  NULLS FIRST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which Arabic-speaking country has the smallest population?",
    "evidence": "Arabic-speaking country = country that speaks 100% Arabic",
    "idx": 4119
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "CALL {\nMATCH (desert_sub0@`desert`)\nORDER BY desert_sub0.`area` DESC NULLS LAST \nRETURN desert_sub0.`name` AS `name` \nLIMIT 1\n}\nMATCH (geo_desert@`geo_desert`)\nWHERE geo_desert.`desert` = name\nRETURN geo_desert.`province` AS `province`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What provinces encompass the world's biggest desert in terms of overall area?",
    "evidence": "",
    "idx": 4120
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (desert@`desert`)\nORDER BY desert.`area` DESC NULLS LAST \nRETURN desert.`name` AS `name` \nSKIP 1\nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the name of the second biggest desert?",
    "evidence": "",
    "idx": 4121
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (language@`language`)\nWHERE language.`country` = 'MNE'\nORDER BY language.`percentage` DESC NULLS LAST \nRETURN language.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the main spoken language in MNE?",
    "evidence": "MNE is one country",
    "idx": 4122
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`language`)\nMATCH (t2@`country`)\nWHERE t1.`country` = t2.`code`\nAND (t2.`name` = 'Cayman Islands' AND t1.`name` = 'English')\nRETURN t1.`percentage` AS `percentage`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the percentage of people in Cayman Islands speak English?",
    "evidence": "Cayman Islands is a country",
    "idx": 4123
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`city`)\nMATCH (t1@`country`)\nWHERE t2.`country` = t1.`code`\nAND (t1.`name` = 'France' AND t2.`population` > 100000)\nRETURN COUNT(t2.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cities in France have a population of more than 100,000?",
    "evidence": "",
    "idx": 4126
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`sea`)\nMATCH (t2@`river`)\nWHERE t2.`sea` = t1.`name`\nAND (t1.`depth` = 540)\nORDER BY t2.`length` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the rivers finally flows to the sea of 540m in depth, which one has the longest length?",
    "evidence": "",
    "idx": 4127
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`area` < 100)\nORDER BY t2.`gdp` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For all the countries that is smaller than 100 square kilometres, which one has the most GDP?",
    "evidence": "",
    "idx": 4128
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`religion`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Japan')\nORDER BY t2.`percentage` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which religion has the majority of the people in Japan?",
    "evidence": "Japan is a country",
    "idx": 4129
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`population`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Switzerland')\nRETURN t2.`infant_mortality` * t1.`population` * t2.`population_growth` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the number of infant mortality in Switzerland in a year?",
    "evidence": "Number can be calculated = Infant_Mortality * Population * Population_Growth",
    "idx": 4130
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`politics`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Equatorial Guinea')\nRETURN t2.`independence` AS `independence`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did Equatorial Guinea become independent?",
    "evidence": "Equatorial Guinea is a country",
    "idx": 4131
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`name` = 'Switzerland')\nRETURN t2.`gdp` / t1.`population` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the GDP per capita in Switzerland?",
    "evidence": "GDP per capita = GDP / Population",
    "idx": 4132
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`located`)\nMATCH (t2@`river`)\nWHERE t1.`river` = t2.`name`\nAND (t1.`country` = 'TJ')\nRETURN MAX(t2.`length`) / min(t2.`length`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times longer is the longest river in Tajikistan than the shortest river?",
    "evidence": "TJ is an abbreviated country code of Tajikistan",
    "idx": 4133
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`borders`)\nOPTIONAL MATCH (t2@`country`)\nWHERE t1.`country1` = t2.`code`\nRETURN sum(CASE  WHEN t2.`name` = 'Angola' THEN t1.`length` ELSE 0 END) * 100 / sum(t1.`length`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of the border does Angola share with each of the countries with which it borders?",
    "evidence": "",
    "idx": 4134
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (island@`island`)\nWHERE island.`islands` = 'Lesser Antilles' AND (island.`type` <> 'volcanic' OR island.`type` IS NULL)\nRETURN sum(CASE  WHEN island.`area` <= 300 THEN 1 ELSE 0 END) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percent of the non volcanic islands in the Lesser Antilles group of islands have an area of no more than 300 square kilometers?",
    "evidence": "Percent = [count(non volcanic islands Lesser Antilles area 300 or less) / count(non volcanic islands Lesser Antilles)] * 100%",
    "idx": 4135
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`language`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'English')\nRETURN cast (sum(CASE  WHEN t2.`percentage` = 100 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of all the countries in which English is spoken, what percentage has English as their only language?",
    "evidence": "Percentage = [count(countries 100% English) / count(countries English)] * 100%",
    "idx": 4136
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (target@`target`)\nRETURN 100 - (cast (sum(CASE  WHEN target.`target` = 'Christian' THEN 1 ELSE 0 END) as float)) * 100 / COUNT(target.`country`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Based on the data shown at Target, what percentage of countries are non-Christian?",
    "evidence": "percentage of countries are non-Christian = [count(non-Christian) / count(non-Christian + Christian)] * 100%",
    "idx": 4139
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "CALL {\nMATCH (river_sub0@`river`)\nWHERE river_sub0.`name` = 'Manicouagan'\nRETURN river_sub0.`river` AS `river` \n}\nMATCH (lake@`lake`)\nWHERE lake.`river` = river\nRETURN lake.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which lake flows the river that is, in turn, the mouth of the Manicouagan River?",
    "evidence": "",
    "idx": 4140
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`religion`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`name` = 'Hindu')\nORDER BY t1.`population` / t1.`area`  NULLS FIRST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of all the countries of the Hindu religion, which has the lowest ratio of people per square meter of surface?",
    "evidence": "ratio of people per square meter of surface = Population / Area",
    "idx": 4141
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "CALL {\nMATCH (economy_sub0@`economy`)\nWHERE economy_sub0.`gdp` = 1100\nRETURN economy_sub0.`country` AS `country` \n}\nMATCH (politics@`politics`)\nWHERE politics.`country` = country\nRETURN politics.`independence` AS `independence`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On what date did the country have a gross domestic product 400% higher than Saint Kitts and Nevis become independent?",
    "evidence": "GDP refers to gross domestic product",
    "idx": 4142
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`name` = 'Anguilla'\nRETURN country.`capital` AS `capital`, country.`province` AS `province`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of Anguilla's capital, and where is it located?",
    "evidence": "Anguilla is a country",
    "idx": 4143
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (country@`country`)\nORDER BY country.`population`  NULLS FIRST \nRETURN country.`name` AS `name`, country.`capital` AS `capital` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which nation has the smallest population, and where is its capital located?",
    "evidence": "",
    "idx": 4144
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (continent@`continent`)\nWHERE continent.`name` = 'Asia' OR continent.`name` = 'Europe'\nRETURN MAX(continent.`area`) - min(continent.`area`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much more space does Asia have than Europe?",
    "evidence": "Asia and Europe are two continents.",
    "idx": 4145
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (country@`country`)\nWHERE country.`name` = 'United Kingdom' OR country.`name` = 'Italy'\nRETURN MAX(country.`population`) - min(country.`population`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the population gap between the United Kingdom and Italy?",
    "evidence": "Population gap = Total population of the United Kingdom - Total population of Italy",
    "idx": 4147
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (lake@`lake`)\nORDER BY lake.`area` * lake.`depth` DESC NULLS LAST \nRETURN lake.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which lake is the largest in terms of both surface area and depth?",
    "evidence": "Area * Depth can represents the metric in terms of both surface area and depth",
    "idx": 4149
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (politics_sub0@`politics`)\nWHERE politics_sub0.`government` = 'British Overseas Territories'\nRETURN collect(politics_sub0.`country`) AS `country` \n} \nMATCH (country@`country`)\nWHERE country.`code` IN in_collect_0\nRETURN country.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What nations are considered British Overseas Territories?",
    "evidence": "British Overseas Territories is one government form; Nation and country share the same meaning",
    "idx": 4155
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nORDER BY t2.`gdp` DESC NULLS LAST,t2.`agriculture`  NULLS FIRST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which of the top 3 economies by GDP has the lowest proportion of the economy devoted to agriculture?",
    "evidence": "Economies refers to countries",
    "idx": 4156
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`politics`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nORDER BY t2.`independence` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 3",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the most recent three independent nations?",
    "evidence": "Larger date of indepedence refers to more recent indepdence; Nation refers to country",
    "idx": 4157
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`mergeswith`)\nMATCH (t1@`sea`)\nWHERE t1.`name` = t2.`sea1`\nAND (t1.`name` = 'Baltic Sea')\nRETURN t2.`sea2` AS `sea2`, t1.`depth` AS `depth`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What sea does the Baltic Sea converge with, and how deep is the Baltic Sea?",
    "evidence": "Coverage refers to mergesWith",
    "idx": 4159
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (organization@`organization`)\nWHERE organization.`abbreviation` = 'ABEDA'\nRETURN organization.`name` AS `name`, organization.`established` AS `established`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of ABEDA and when was it established?",
    "evidence": "",
    "idx": 4160
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (organization@`organization`)\nWHERE organization.`city` = 'London'\nRETURN organization.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Provide a list of all organisations with headquarters in London?",
    "evidence": "London is a city",
    "idx": 4161
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`ismember`)\nMATCH (t2@`country`)\nWHERE t1.`country` = t2.`code`\nAND (t1.`organization` = 'IOC')\nORDER BY t2.`population` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the country member of 'IOC' organization, which country has the most population?",
    "evidence": "",
    "idx": 4166
  }
]