[
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`creditcard`:`creditcard`)\nWHERE `creditcard`.`cardtype` = 'vista'\nRETURN COUNT(`creditcard`.`cardnumber`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many types of credit cards are there and how many are vista?",
    "evidence": "type of credit card refers to CardType; CardType = 'Vista';",
    "idx": 5457
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`productid` = 475\nRETURN `product`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the product with the id \"475\"?",
    "evidence": "",
    "idx": 5458
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`maritalstatus` = 's' AND `employee`.`birthdate` < localdatetime('1980-01-01T00:00:00')\nRETURN COUNT(`employee`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees born before 1980 , how many of them are single?",
    "evidence": "BirthDate<'1980-01-01'; single refers to MaritalStatus = 'S' or null;",
    "idx": 5459
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`store`:`store`)\nWHERE `store`.`salespersonid` = 277\nRETURN `store`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the names of the stores assigned to the sales person with the id \"277\".",
    "evidence": "",
    "idx": 5460
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`transactionhistory`:`transactionhistory`)\nWHERE toString(`transactionhistory`.`transactiondate`) =~ '(?i)(?s)2013-08.*' AND `transactionhistory`.`transactiontype` = 'S' AND `transactionhistory`.`productid` = 989\nRETURN sum(`transactionhistory`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products with the id \"989\" were sold in August 2013?",
    "evidence": "TransactionDate BETWEEN '2013-08-01' AND '2013-08-30'; sold in refers to TransactionType = 'S' which means SalesOrder;",
    "idx": 5461
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`creditcard`:`creditcard`)\nWHERE `creditcard`.`expyear` < 2007\nRETURN `creditcard`.`cardnumber` AS `cardnumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of the credit cards that had expired by 2007.",
    "evidence": "card that expires in 2007 refers to ExpYear = 2007;",
    "idx": 5462
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (toFloat(CASE WHEN `t1`.`hiredate` is not NULL THEN apoc.temporal.format(`t1`.`hiredate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) = 20)\nRETURN `t2`.`rate` AS `rate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the pay rates of all employees that were hired at 20 years of age.",
    "evidence": "pay rate refers to Rate; 20 years old at the time of being hired refers to SUBTRACT(year(HireDate)), (year(BirthDate))) = 20;",
    "idx": 5463
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`salesperson`)-[assigned_to_0:assigned_to]->(`t2`:`salesterritory`)\nWHERE `t1`.`territoryid` = `t2`.`territoryid`\nAND (`t1`.`businessentityid` = 277)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the territory assigned to the sales person with business id \"277\"?",
    "evidence": "business id refers to BusinessEntityID",
    "idx": 5464
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`jobtitle` = 'Vice President of Production')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the Vice President of Production?",
    "evidence": "full name = FirstName+MiddleName+LastName; Vice President of Production is a JobTitle;",
    "idx": 5465
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`purchaseorderheader`)-[from_vendor_0:from_vendor]->(`t1`:`vendor`)\nWHERE `t1`.`businessentityid` = `t2`.`vendorid`\nAND (`t1`.`creditrating` = 5)\nRETURN `t2`.`purchaseorderid` AS `purchaseorderid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the purchase order ids of the vendor with a below average rating.",
    "evidence": "below average rating refers to CreditRating = 5;",
    "idx": 5466
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`purchaseorderheader`)-[uses_ship_method_0:uses_ship_method]->(`t1`:`shipmethod`)\nWHERE `t1`.`shipmethodid` = `t2`.`shipmethodid`\nAND (`t1`.`name` = 'cargo transport 5' AND `t2`.`orderdate` = localdatetime('2011-12-14T00:00:00'))\nRETURN sum(`t2`.`freight`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total shipment by \"cargo transport 5\" cost of all purchase orders created on 12/14/2011?",
    "evidence": "Catgo Transport 5 is a name of shipping method; OrderDate = '2011-12-14'; total shipment cost = SUM(Freight);",
    "idx": 5467
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`person`)\nMATCH (`t2`:`salesorderheader`)\nWHERE `t1`.`modifieddate` = `t2`.`duedate`\nAND (`t1`.`firstname` = 'David' AND `t1`.`middlename` = 'R' AND `t1`.`lastname` = 'Campbell' AND `t1`.`persontype` = 'SP')\nRETURN COUNT(`t2`.`totaldue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many sales orders did the salesperson David R. Campbell create?",
    "evidence": "SP is an abbreviation for Sales Person; PersonType = 'SP';",
    "idx": 5468
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nMATCH (`t3`:`emailaddress`)-[belongs_to_0:belongs_to]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (`t1`.`jobtitle` = 'Facilities Manager')\nRETURN `t3`.`emailaddress` AS `emailaddress`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the email address of the Facilities Manager?",
    "evidence": "Facilities Manager is a job title",
    "idx": 5469
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`customer`)-[located_in_territory_0:located_in_territory]->(`t1`:`salesterritory`)\nWHERE `t1`.`territoryid` = `t2`.`territoryid`\nAND (`t1`.`name` = 'Canada')\nRETURN COUNT(`t2`.`customerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many customers are there in Canada?",
    "evidence": "Canada is name of sales territory",
    "idx": 5470
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`address`)\nMATCH (`t1`:`salesorderheader`)\nWHERE `t1`.`billtoaddressid` = `t2`.`addressid`\nAND (`t1`.`salesorderid` = 43873)\nWITH `t1`.`shiptoaddressid` AS _groupby_col_0\nRETURN _groupby_col_0 AS `shiptoaddressid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the shipping address for the sales order \"43873\"?",
    "evidence": "shipping address = AddressLine1+AddressLine2+City;",
    "idx": 5471
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`sickleavehours` > 65)\nRETURN `t2`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the first names of the people with more than 65 sick leave hours.",
    "evidence": "SickLeaveHours>65;",
    "idx": 5472
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`salesorderheader`)\nMATCH (`t2`:`salesterritory`)\nWHERE `t1`.`territoryid` = `t2`.`territoryid`\nRETURN CASE WHEN COUNT(`t1`.`salesorderid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`name` = 'United Kingdom' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`salesorderid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What proportion of sales orders are made from the United Kingdom?",
    "evidence": "proportion = DIVIDE(SUM(Name = 'UK')), (COUNT(SalesOrderID))) as count;",
    "idx": 5473
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesperson`:`salesperson`)\nORDER BY `salesperson`.`salesytd` IS NULL ASC, `salesperson`.`salesytd` DESC \nRETURN `salesperson`.`businessentityid` AS `businessentityid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the business ID of the person who has made the most sales total year to date?",
    "evidence": "business ID refers to BusinessEntityID; sales total year to date refers to SalesYTD; most sales total year to date refers to MAX(SalesYTD);",
    "idx": 5474
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`vendor`:`vendor`)\nWHERE `vendor`.`activeflag` = 1\nRETURN `vendor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all active vendors who offer a purchasing web service.",
    "evidence": "active vendors refers to ActiveFlag = 1; vendor who offer a purchasing web service refers to PurchasingWebServiceURL NOT null;",
    "idx": 5475
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`purchaseorderheader`:`purchaseorderheader`)\nWHERE toString(`purchaseorderheader`.`orderdate`) =~ '(?i)(?s)2013-05-29.*'\nRETURN sum(`purchaseorderheader`.`totaldue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total cost for all the orders placed on 5/29/2013?",
    "evidence": "total cost = SUM(TotalDue); OrderDate = '2013-05-29';",
    "idx": 5476
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`jobtitle` = 'Production Technician - WC50')\nWITH `t2`.`firstname` AS _groupby_col_0, `t2`.`middlename` AS _groupby_col_1, `t2`.`lastname` AS _groupby_col_2\nRETURN _groupby_col_0 AS `firstname`, _groupby_col_1 AS `middlename`, _groupby_col_2 AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name of all the 'Production Technician - WC50'",
    "evidence": "full name = FirstName+MiddleName+LastName; Production Technician - WC50 is a job title;",
    "idx": 5477
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "WITH *, COLLECT { MATCH (`product_sub0`:`product`)\nWHERE `product_sub0`.`name` = 'Minipump'\nRETURN `product_sub0`.`productid` AS `productid`   } AS in_collect_0\nMATCH (`salesorderdetail`:`salesorderdetail`)\nWHERE `salesorderdetail`.`productid` IN in_collect_0\nRETURN COUNT(`salesorderdetail`.`orderqty`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Minipumps have been sold?",
    "evidence": "Minipump is name of a product",
    "idx": 5478
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`addresstype`)\nMATCH ()-[t1:has_address]->(`t3`:`address`)\nWHERE `t1`.`addresstypeid` = `t2`.`addresstypeid`\nAND `t1`.`addressid` = `t3`.`addressid`\nAND (`t1`.`businessentityid` = 5555 AND `t2`.`name` = 'Home')\nRETURN `t3`.`city` AS `city`, `t3`.`addressline1` AS `addressline1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where does the person with the BusinessEntityID \"5555\" live?",
    "evidence": "where the person live refers addresstype.Name = 'Home'",
    "idx": 5480
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:has_credit_card]->(`t3`:`creditcard`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`creditcardid` = `t3`.`creditcardid`\nAND (`t1`.`firstname` = 'Michelle' AND `t1`.`middlename` = 'E' AND `t1`.`lastname` = 'Cox')\nRETURN `t3`.`creditcardid` AS `creditcardid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the credit card number for Michelle E Cox?",
    "evidence": "credit card number refers to CreditCardID",
    "idx": 5482
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`salesorderheader`)\nMATCH (`t2`:`creditcard`)\nWHERE `t1`.`creditcardid` = `t2`.`creditcardid`\nAND (`t1`.`salesorderid` = 45793)\nRETURN `t2`.`cardnumber` AS `cardnumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the credit card number for the sales order \"45793\"?",
    "evidence": "",
    "idx": 5484
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`salesperson`)-[assigned_to_0:assigned_to]->(`t1`:`salesterritory`)\nWHERE `t1`.`territoryid` = `t2`.`territoryid`\nAND (`t1`.`name` = 'Northwest' AND `t1`.`countryregioncode` = 'US')\nRETURN `t2`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the sales people in the Northwest US.",
    "evidence": "Northwest is name of SalesTerritory; US is the CountryRegionCode;",
    "idx": 5485
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`jobtitle` =~ '(?i)(?s)Production Technician.*')\nORDER BY `t2`.`rate` IS NULL ASC, `t2`.`rate` DESC \nRETURN `t1`.`businessentityid` AS `businessentityid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which Production Technician has the highest pay rate?",
    "evidence": "highest pay rate refers to MAX(Rate);",
    "idx": 5486
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`salesperson`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`territoryid` = 9)\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the sales person in charge of the territory with the id \"9\"? Provide their full name.",
    "evidence": "full name = FirstName+MiddleName+LastName;",
    "idx": 5487
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`specialoffer`)-[t1:applies_to]->()\nWHERE `t1`.`specialofferid` = `t2`.`specialofferid`\nAND (`t1`.`productid` = 762)\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the description of the discount for the product with the id \"762\"?",
    "evidence": "",
    "idx": 5488
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nWITH `t1`.`gender` AS _groupby_col_0, avg(`t2`.`rate`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compare the average pay rate of male and female employees.",
    "evidence": "male refers to Gender = 'M'; female refers to Gender = 'F'; difference in average rate = DIVIDE(AVG(Rate where Gender = 'F')), (AVG(Rate where Gender = 'M'))) as diff;",
    "idx": 5489
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`shift`)\nMATCH (`t2`:`employeedepartmenthistory`)\nWHERE `t1`.`shiftid` = `t2`.`shiftid`\nRETURN CASE WHEN COUNT(`t2`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`name` = 'Night' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of employees who work the night shift?",
    "evidence": "percentage = DIVIDE(SUM(Name = 'Night')), (COUNT(ShiftID)) as percentage;",
    "idx": 5490
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`maritalstatus` = 'M' AND CASE WHEN `employee`.`birthdate` is not NULL THEN apoc.temporal.format(`employee`.`birthdate`,'yyyy') ELSE NULL END < '1960' AND `employee`.`gender` = 'M'\nRETURN COUNT(`employee`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many married male employees were born before the year 1960?",
    "evidence": "married refers to MaritalStatus = 'M'; male refers to Gender = 'M'; BirthDate < = '1959-12-31';",
    "idx": 5491
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nORDER BY `product`.`listprice` IS NULL ASC, `product`.`listprice` DESC \nRETURN `product`.`name` AS `name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the top 5 types of products with the highest selling price? ?",
    "evidence": "highest selling price refers to MAX(ListPrice);",
    "idx": 5492
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`jobtitle` = 'Accountant'\nRETURN min(`employee`.`hiredate`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did the company hired its first Accountant?",
    "evidence": "Accountant is a job title; first hired = MIN(HireDate)",
    "idx": 5493
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`persontype` = 'SP')\nRETURN avg(2009 - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average age of the sales agents in the company by 12/31/2009?",
    "evidence": "average age as of 12/31/2009 = AVG(SUBTRACT(2009, year(BirthDate));",
    "idx": 5495
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`jobtitle` = 'Marketing Specialist')\nRETURN 2015 - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) AS `_col_0`, `t2`.`rate` AS `rate` ORDER BY 2015 - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) IS NULL ASC, 2015 - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the age of the oldest Marketing Specialist by 12/31/2015 and what is his/her hourly rate?",
    "evidence": "age as of 12/31/2015 = SUBTRACT(2015, year(BirthDate)); hourly rate refers to Rate;",
    "idx": 5496
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`purchaseorderheader`)-[t1:contains]->()\nMATCH (`t2`:`purchaseorderheader`)-[from_vendor_0:from_vendor]->(`t3`:`vendor`)\nWHERE `t1`.`purchaseorderid` = `t2`.`purchaseorderid`\nAND `t2`.`vendorid` = `t3`.`businessentityid`\nRETURN `t1`.`unitprice` AS `unitprice`, `t3`.`name` AS `name` ORDER BY `t1`.`unitprice` IS NULL DESC, `t1`.`unitprice`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total amount due of all the purchases made by the company to the vendor that has the lowest selling price amount of a single product? Indicate the name of the vendor to which the purchases was made.",
    "evidence": "Vendor's selling price of a single product refers to UnitPrice;",
    "idx": 5497
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`purchaseorderheader`)-[created_by_0:created_by]->(`t2`:`employee`)\nWHERE `t1`.`employeeid` = `t2`.`businessentityid`\nORDER BY `t1`.`totaldue` IS NULL ASC, `t1`.`totaldue` DESC \nRETURN `t2`.`businessentityid` AS `businessentityid`, toFloat(CASE WHEN `t2`.`hiredate` is not NULL THEN apoc.temporal.format(`t2`.`hiredate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) AS `_col_1`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who made the purchase order with the greatest total due before freight? Indicate her employee ID and calculate for his/her age when he/she was hired.",
    "evidence": "total due before freight = SUBTRACT(TotalDue, Freight); age at the time an employee was hired = SUBTRACT(HireDate, year(BirthDate);",
    "idx": 5498
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employeepayhistory`)\nMATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t3`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nRETURN `t2`.`jobtitle` AS `jobtitle`, `t1`.`rate` AS `rate`, `t3`.`firstname` AS `firstname`, `t3`.`middlename` AS `middlename`, `t3`.`lastname` AS `lastname` ORDER BY `t1`.`rate` IS NULL ASC, `t1`.`rate` DESC \nSKIP 9\nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the position of the employee with the 10th highest salary? Indicate his/her salary amount and his/her full name.",
    "evidence": "salary and Rate are synonyms; full name = FirstName+MiddleName+LastName;",
    "idx": 5499
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productreview`)-[review_for_0:review_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`reviewername` = 'John Smith')\nORDER BY `t2`.`rating` IS NULL ASC, `t2`.`rating` DESC \nRETURN `t1`.`listprice` - `t1`.`standardcost` AS `_col_0`, `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the profit of a single product that received the highest rating from John Smith? List the product/s' names.",
    "evidence": "highest rating refers to Rating = 5; profit = SUBTRACT(ListPrice, StandardCost);",
    "idx": 5500
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employeepayhistory`)\nMATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t3`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nORDER BY `t2`.`hiredate` IS NULL DESC, `t2`.`hiredate`  \nRETURN `t1`.`rate` AS `rate` SKIP 0\nLIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the salary rate per hour that the company paid to the first 5 employees that they hired?",
    "evidence": "salary rate per hour refers to Rate; first 5 employees that were hired refers to 5 oldest HireDate;",
    "idx": 5501
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t1:supplied_by]->(`t2`:`vendor`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`maxorderqty` >= 500 AND `t1`.`maxorderqty` <= 750)\nORDER BY `t1`.`lastreceiptcost` - `t1`.`standardprice` IS NULL ASC, `t1`.`lastreceiptcost` - `t1`.`standardprice` DESC \nRETURN `t2`.`name` AS `name` SKIP 9\nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the vendors with maximum orders betweeen 500 to 750, which vendor has the 10th highest profit on net?",
    "evidence": "maximum orders refers to MaxOrderQty; MaxOrderQty BETWEEN '500' AND '750'; profit on net = SUBTRACT(LastReceiptCost, StandardPrice);",
    "idx": 5502
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`document`)\nWHERE `t1`.`owner` = `t2`.`businessentityid`\nAND (`t1`.`status` = 1)\nRETURN 2011 - toFloat(CASE WHEN `t2`.`hiredate` is not NULL THEN apoc.temporal.format(`t2`.`hiredate`,'yyyy') ELSE NULL END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "As of 12/31/2011, how long has the employee assigned to all pending for approval papers been working in the company from the date he was hired?",
    "evidence": "pending for approval papers refer to Status = 1; length of stay in the company as of 12/31/2011 = SUBTRACT(2011, year(HireDate));",
    "idx": 5503
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productreview`)-[review_for_0:review_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`rating` = 5 AND `t1`.`class` = 'M')\nORDER BY `t2`.`rating` IS NULL DESC, `t2`.`rating`  \nRETURN `t1`.`daystomanufacture` AS `daystomanufacture`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Jill ranked which medium-quality class product as the highest, and how long will it take the company to manufacture such a product?",
    "evidence": "second-lowest rating refers to Rating = 2; high-quality class product refers to Class = 'H'; length of time it takes the company to manufacture a product refers to DaysToManufacture;",
    "idx": 5504
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t1`.`hiredate` IS NULL DESC, `t1`.`hiredate`  \nRETURN `t1`.`jobtitle` AS `jobtitle`, `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the first job position that the company needed, and who was hired? Indicate his/her full name.",
    "evidence": "job position and job title are synonyms; full name = FirstName+MiddleName+LastName;",
    "idx": 5505
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`transactionhistory`)-[transaction_for_0:transaction_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`quantity` >= 100 AND `t1`.`quantity` <= 250 AND `t2`.`reorderpoint` <= 375)\nRETURN COUNT(`t1`.`transactionid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many work orders with quantities ranging from 100 to 250 have a reorder point of no more than 375?",
    "evidence": "work order refers to TransactionType = 'W'; Quantity BETWEEN 100 AND 250; ReorderPoint< = 375;",
    "idx": 5506
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`gender` = 'F')\nRETURN avg(`t2`.`rate`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the average salary of female employees in comparison to male employees?",
    "evidence": "female refers to Gender = 'F'; male refers to Gender = 'M'; difference in the average salary of female against male employees = SUBTRACT(AVG(Rate where Gender = 'F')), (AVG(Rate where Gender = 'M')));",
    "idx": 5507
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`productsubcategory`)\nMATCH (`t1`:`product`)-[t2:supplied_by]->(`t4`:`vendor`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND `t1`.`productsubcategoryid` = `t3`.`productsubcategoryid`\nAND `t2`.`businessentityid` = `t4`.`businessentityid`\nAND (`t1`.`makeflag` = 0 AND `t1`.`style` = 'W' AND `t3`.`name` = 'Tights')\nRETURN DISTINCT `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the vendors to which the company purchased its women's tights products?",
    "evidence": "product is purchased refers to MakeFlag = 0; women's refers to Style = 'W'; ProductSubcategoryID = 'Tights';",
    "idx": 5508
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`jobtitle` = 'Scheduling Assistant')\nORDER BY `t1`.`hiredate` IS NULL DESC, `t1`.`hiredate`  \nRETURN `t2`.`payfrequency` AS `payfrequency`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How frequently does the first-ever Scheduling Assistant get paid?",
    "evidence": "PayFrequency = 1 refers to ‘Salary received monthly’; PayFrequency = 2 refers to ‘Salary received biweekly';",
    "idx": 5509
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`salesperson`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t1`.`commissionpct` IS NULL ASC, `t1`.`commissionpct` DESC \nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the sales person who has the the highest commission percent received per sale?",
    "evidence": "commision percent received per sale refers to CommissionPct; highest commision percent received per sale refers to MAX(CommissionPcT); full name = FirstName+MiddleName+LastName;",
    "idx": 5510
  }
]