[
  {
    "filename": "train_spider.json",
    "db_id": "workshop_paper",
    "gql_statement": "{MATCH (submission@`submission`)\nWHERE submission.`scores` > 90\nRETURN submission.`college` AS `college` \n} \nINTERSECT DISTINCT\n{MATCH (submission@`submission`)\nWHERE submission.`scores` < 80\nRETURN submission.`college` AS `college` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which colleges have both authors with submission score above 90 and authors with submission score below 80?",
    "evidence": "",
    "idx": 4940
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_share_transactions",
    "gql_statement": "{MATCH (lots@`lots`)\nRETURN lots.`lot_details` AS `lot_details` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`lots`)-[t2:`involves_2`]->()\nWHERE t1.`lot_id` = t2.`lot_id`\nRETURN t1.`lot_details` AS `lot_details` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the details of the lots which are not used in any transactions?",
    "evidence": "",
    "idx": 4972
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "{MATCH (student@`student`)\nRETURN student.`stuid` AS `stuid` \n} \nEXCEPT DISTINCT\n{MATCH (sportsinfo@`sportsinfo`)\nRETURN sportsinfo.`stuid` AS `stuid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of all students who don't play sports?",
    "evidence": "",
    "idx": 5082
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "{MATCH (student@`student`)\nWHERE student.`major` = 600\nRETURN student.`stuid` AS `stuid` \n} \nINTERSECT DISTINCT\n{MATCH (sportsinfo@`sportsinfo`)\nWHERE sportsinfo.`onscholarship` = 'Y'\nRETURN sportsinfo.`stuid` AS `stuid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the student ids for those on scholarship in major number 600?",
    "evidence": "",
    "idx": 5084
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "{MATCH (student@`student`)\nWHERE student.`sex` = 'F'\nRETURN student.`stuid` AS `stuid` \n} \nINTERSECT DISTINCT\n{MATCH (sportsinfo@`sportsinfo`)\nWHERE sportsinfo.`sportname` = 'Football'\nRETURN sportsinfo.`stuid` AS `stuid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of all female students who play football?",
    "evidence": "",
    "idx": 5086
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "{MATCH (student@`student`)\nWHERE student.`sex` = 'M'\nRETURN student.`stuid` AS `stuid` \n} \nEXCEPT DISTINCT\n{MATCH (sportsinfo@`sportsinfo`)\nWHERE sportsinfo.`sportname` = 'Football'\nRETURN sportsinfo.`stuid` AS `stuid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of all male students who do not play football?",
    "evidence": "",
    "idx": 5088
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "{MATCH (student@`student`)\nRETURN student.`stuid` AS `stuid` \n} \nEXCEPT DISTINCT\n{MATCH ()-[plays_games:`plays`]->()\nRETURN plays_games.`stuid` AS `stuid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of all students who are not video game players?",
    "evidence": "",
    "idx": 5096
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "{MATCH (sportsinfo@`sportsinfo`)\nRETURN sportsinfo.`stuid` AS `stuid` \n} \nINTERSECT DISTINCT\n{MATCH ()-[plays_games:`plays`]->()\nRETURN plays_games.`stuid` AS `stuid` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of all students who played video games and sports?",
    "evidence": "",
    "idx": 5098
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "{MATCH (t2@`volume`)-[by_artist_0:`by_artist`]->(t1@`artist`)\nWHERE t1.`artist_id` = t2.`artist_id`\nAND (t2.`weeks_on_top` > 2)\nRETURN t1.`famous_title` AS `famous_title` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`volume`)-[by_artist_1:`by_artist`]->(t1@`artist`)\nWHERE t1.`artist_id` = t2.`artist_id`\nAND (t2.`weeks_on_top` < 2)\nRETURN t1.`famous_title` AS `famous_title` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the famous titles of artists who have not only had volumes that spent more than 2 weeks on top but also volumes that spent less than 2 weeks on top?",
    "evidence": "",
    "idx": 5204
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "{MATCH (captain@`captain`)\nWHERE captain.`class` = 'Cutter'\nRETURN captain.`rank` AS `rank` \n} \nINTERSECT DISTINCT\n{MATCH (captain@`captain`)\nWHERE captain.`class` = 'Armed schooner'\nRETURN captain.`rank` AS `rank` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ranks of captains that are both in the Cutter and Armed schooner classes?",
    "evidence": "",
    "idx": 5242
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "{MATCH (captain@`captain`)\nRETURN captain.`rank` AS `rank` \n} \nEXCEPT DISTINCT\n{MATCH (captain@`captain`)\nWHERE captain.`class` = 'Third-rate ship of the line'\nRETURN captain.`rank` AS `rank` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ranks of captains that have no captain that are in the Third-rate ship of the line class?",
    "evidence": "",
    "idx": 5244
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "{MATCH (ship@`ship`)\nWHERE ship.`flag` = 'Panama'\nRETURN ship.`type` AS `type_` \n} \nINTERSECT DISTINCT\n{MATCH (ship@`ship`)\nWHERE ship.`flag` = 'Malta'\nRETURN ship.`type` AS `type_` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What types of ships have both ships that have Panama Flags and Malta flags?",
    "evidence": "",
    "idx": 5256
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "{MATCH (t2@`captain`)-[commands_0:`commands`]->(t1@`ship`)\nWHERE t1.`ship_id` = t2.`ship_id`\nAND (t2.`rank` = 'Midshipman')\nRETURN t1.`name` AS `name` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`captain`)-[commands_1:`commands`]->(t1@`ship`)\nWHERE t1.`ship_id` = t2.`ship_id`\nAND (t2.`rank` = 'Lieutenant')\nRETURN t1.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of ships that are commanded by both captains with the rank of Midshipman and captains with the rank of Lieutenant?",
    "evidence": "",
    "idx": 5264
  },
  {
    "filename": "train_spider.json",
    "db_id": "e_government",
    "gql_statement": "{MATCH (services@`services`)\nRETURN services.`service_name` AS `service_name` \n} \nEXCEPT DISTINCT\n{MATCH ()-[t2:`booked_service`]->(t1@`services`)\nWHERE t1.`service_id` = t2.`service_id`\nRETURN t1.`service_name` AS `service_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of the services that have never been used?",
    "evidence": "",
    "idx": 5304
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "{MATCH (documents@`documents`)\nRETURN documents.`document_id` AS `document_id` \n} \nEXCEPT DISTINCT\n{MATCH (documents_with_expenses@`documents_with_expenses`)\nRETURN documents_with_expenses.`document_id` AS `document_id` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the ids of documents which don't have expense budgets?",
    "evidence": "",
    "idx": 5405
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Docs_and_Epenses",
    "gql_statement": "{MATCH (t2@`documents_with_expenses`)-[is_a_2_0:`is_a_2`]->(t1@`documents`)\nWHERE t1.`document_id` = t2.`document_id`\nAND (t2.`budget_type_code` = 'GV')\nRETURN t1.`document_date` AS `document_date` \n} \nINTERSECT DISTINCT\n{MATCH (t2@`documents_with_expenses`)-[is_a_2_1:`is_a_2`]->(t1@`documents`)\nWHERE t1.`document_id` = t2.`document_id`\nAND (t2.`budget_type_code` = 'SF')\nRETURN t1.`document_date` AS `document_date` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the dates for the documents with both 'GV' type and 'SF' type expenses?",
    "evidence": "",
    "idx": 5413
  },
  {
    "filename": "train_spider.json",
    "db_id": "scientist_1",
    "gql_statement": "{MATCH (t3@`scientists`)-[t1:`assigned_to`]->(t2@`projects`)\nWHERE t1.`project` = t2.`code`\nAND t1.`scientist` = t3.`ssn`\nAND (t2.`name` = 'Matter of Time')\nRETURN t3.`name` AS `name` \n} \nINTERSECT DISTINCT\n{MATCH (t3@`scientists`)-[t1:`assigned_to`]->(t2@`projects`)\nWHERE t1.`project` = t2.`code`\nAND t1.`scientist` = t3.`ssn`\nAND (t2.`name` = 'A Puzzling Parallax')\nRETURN t3.`name` AS `name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the names of any scientists who worked on projects named 'Matter of Time' and 'A Puzzling Pattern'?",
    "evidence": "",
    "idx": 5436
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "{MATCH (wine@`wine`)\nWHERE wine.`year` > 2008\nRETURN wine.`appelation` AS `appelation` \n} \nEXCEPT DISTINCT\n{MATCH (appellations@`appellations`)\nWHERE appellations.`area` = 'Central Coast'\nRETURN appellations.`appelation` AS `appelation` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the appelations for wines produced after 2008 but not in the Central Coast area?",
    "evidence": "",
    "idx": 5524
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "{MATCH (customers@`customers`)\nRETURN customers.`last_name` AS `last_name` \n} \nINTERSECT DISTINCT\n{MATCH (staff@`staff`)\nRETURN staff.`last_name` AS `last_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "Which last names are both used by customers and by staff?",
    "evidence": "",
    "idx": 5621
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "{MATCH (customers@`customers`)\nRETURN customers.`last_name` AS `last_name` \n} \nINTERSECT DISTINCT\n{MATCH (staff@`staff`)\nRETURN staff.`last_name` AS `last_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What are the last names that are used by customers and staff?",
    "evidence": "",
    "idx": 5622
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "{MATCH (staff@`staff`)\nRETURN staff.`first_name` AS `first_name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`lessons`)-[instructed_by_0:`instructed_by`]->(t2@`staff`)\nWHERE t1.`staff_id` = t2.`staff_id`\nRETURN t2.`first_name` AS `first_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What is the first name of the staff who did not give any lesson?",
    "evidence": "",
    "idx": 5623
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "{MATCH (staff@`staff`)\nRETURN staff.`first_name` AS `first_name` \n} \nEXCEPT DISTINCT\n{MATCH (t1@`lessons`)-[instructed_by_0:`instructed_by`]->(t2@`staff`)\nWHERE t1.`staff_id` = t2.`staff_id`\nRETURN t2.`first_name` AS `first_name` \n}",
    "gql_dialect": "nebula",
    "source": "spider_train",
    "nl_query": "What is the first name of all employees who do not give any lessons?",
    "evidence": "",
    "idx": 5624
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH ()-[sales:`sells`]->()\nRETURN sales.`ord_date` AS `ord_date`, sum(sales.`qty`) AS `_col_1` \nGROUP BY ord_date\nORDER BY _col_1 DESC NULLS LAST \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which date has the most ordered quantity? What is the total order quantity on that day?",
    "evidence": "total quantity refers to qty; most ordered quantity refers to order with the highest quantity where MAX(sum(qty))",
    "idx": 0
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`employee`)-[has_job_0:`has_job`]->(t2@`jobs`)\nWHERE t1.`job_id` = t2.`job_id`\nRETURN cast (sum(CASE  WHEN t2.`job_desc` IN ['Editor', 'Designer'] THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`job_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of the employees who are Editor or Designer?",
    "evidence": "Editor or Auditor are job description which refers to job_desc; percentage = DIVIDE(count(job_desc = 'Editor' or job_desc = 'Auditor'), count(emp_id))*100",
    "idx": 23
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (publishers@`publishers`)\nWHERE publishers.`country` = 'USA'\nRETURN COUNT(publishers.`pub_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many publishers are in the USA?",
    "evidence": "",
    "idx": 25
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`pub_info`)-[info_for_0:`info_for`]->(t2@`publishers`)\nWHERE t1.`pub_id` = t2.`pub_id`\nAND (t2.`pub_name` = 'New Moon Books')\nRETURN t1.`pr_info` AS `pr_info`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the publisher's information of New Moon Books?",
    "evidence": "publisher name refers to pub_name; New Moon Books is a publisher name",
    "idx": 26
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`employee`)-[has_job_0:`has_job`]->(t2@`jobs`)\nWHERE t1.`job_id` = t2.`job_id`\nORDER BY t1.`hire_date`  NULLS FIRST \nRETURN t2.`max_lvl` AS `max_lvl` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the highest level of job to get to for the employee who got hired the earliest?",
    "evidence": "highest job level refers to MAX(job_lvl); hired the earliest refers to MIN(hire_date)",
    "idx": 28
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH ()-[t1:`sells`]->(t2@`titles`)\nWHERE t1.`title_id` = t2.`title_id`\nORDER BY t1.`qty` DESC NULLS LAST \nRETURN t2.`price` AS `price` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the price of the book that sells the best?",
    "evidence": "qty is abbreviation for quantity; sells the best mean with the most sales quantity; MAX(qty)",
    "idx": 29
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH ()-[t1:`sold_at`]->(t2@`stores`)\nMATCH ()-[t1:`sells`]->(t3@`titles`)\nWHERE t1.`stor_id` = t2.`stor_id`\nAND t1.`title_id` = t3.`title_id`\nAND (t2.`state` = 'Massachusetts')\nRETURN COUNT(t1.`stor_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the stores that have ordered the book \"Life Without Fear\", how many of them are located in Massachusetts?",
    "evidence": "Massachusetts is a state",
    "idx": 31
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`titles`)-[published_by_0:`published_by`]->(t2@`publishers`)\nWHERE t1.`pub_id` = t2.`pub_id`\nORDER BY t1.`price` DESC NULLS LAST \nRETURN t2.`pub_name` AS `pub_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the publisher that has published the most expensive book?",
    "evidence": "most expensive book refers to MAX(price)",
    "idx": 33
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`titles`)-[published_by_0:`published_by`]->(t2@`publishers`)\nWHERE t1.`pub_id` = t2.`pub_id`\nAND (t2.`country` = 'USA' AND t1.`price` > 15)\nRETURN COUNT(DISTINCT t1.`pub_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the publishers in the USA, how many of them have published books that are over $15?",
    "evidence": "are over $15 refers to price>15",
    "idx": 34
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH ()-[t1:`sold_at`]->(t2@`stores`)\nMATCH ()-[t1:`sells`]->(t3@`titles`)\nWHERE t1.`stor_id` = t2.`stor_id`\nAND t1.`title_id` = t3.`title_id`\nAND (t2.`state` = 'Massachusetts' AND t3.`type` = 'business')\nRETURN sum(t1.`qty`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books on business have the bookstores in Massachusetts ordered?",
    "evidence": "Massachusetts is a state; business books refers to type = 'business'",
    "idx": 36
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (titles@`titles`)\nWHERE titles.`type` = 'business'\nORDER BY titles.`price`  NULLS FIRST \nRETURN titles.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which one is the cheapest business book?",
    "evidence": "business books refers to type = 'business'; cheapest book refers to MIN(price)",
    "idx": 38
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (titles@`titles`)\nORDER BY titles.`advance` DESC NULLS LAST \nRETURN titles.`type` AS `type_` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which type of book had the most pre-paid amount?",
    "evidence": "most pre-paid amount refers to MAX(advance)",
    "idx": 39
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (titles@`titles`)\nORDER BY titles.`ytd_sales` DESC NULLS LAST \nRETURN titles.`royalty` AS `royalty` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the royalty for the bestseller book?",
    "evidence": "qty is abbreviation for quantity; bestseller means with the most sales quantity; MAX(qty)",
    "idx": 40
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (employee@`employee`)\nWHERE employee.`lname` = 'O\\'Rourke'\nRETURN employee.`job_lvl` AS `job_lvl`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which job level is O'Rourke at?",
    "evidence": "job level refers to job_lvl",
    "idx": 41
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`employee`)-[has_job_0:`has_job`]->(t2@`jobs`)\nWHERE t1.`job_id` = t2.`job_id`\nAND (t1.`fname` = 'Pedro' AND t1.`minit` = 'S' AND t1.`lname` = 'Afonso')\nRETURN t2.`job_desc` AS `job_desc`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's Pedro S Afonso's job title?",
    "evidence": "job title means job description which refers to job_desc",
    "idx": 45
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`employee`)-[has_job_0:`has_job`]->(t2@`jobs`)\nWHERE t1.`job_id` = t2.`job_id`\nAND (t1.`fname` = 'Diego' AND t1.`minit` = 'W' AND t1.`lname` = 'Roel')\nRETURN t2.`max_lvl` - t1.`job_lvl` AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many levels are there left for Diego W Roel to reach if he/she could go to the max level for his/her position?",
    "evidence": "max level for his position refers to max_lvl; job level refers to job_lvl; level left to reach the max = SUBTRACT(max_lvl, job_lvl)",
    "idx": 46
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`employee`)-[works_for_0:`works_for`]->(t2@`publishers`)\nWHERE t1.`pub_id` = t2.`pub_id`\nAND (t1.`fname` = 'Victoria' AND t1.`minit` = 'P' AND t1.`lname` = 'Ashworth')\nRETURN t2.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city did Victoria P Ashworth work in?",
    "evidence": "",
    "idx": 49
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH ()-[t1:`sold_at`]->(t2@`stores`)\nWHERE t1.`stor_id` = t2.`stor_id`\nAND (t2.`city` = 'Remulade')\nRETURN COUNT(t1.`ord_num`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales did the store in Remulade make?",
    "evidence": "Remulade is a city; sales in the store refers to ord_num",
    "idx": 50
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`employee`)-[has_job_0:`has_job`]->(t2@`jobs`)\nWHERE t1.`job_id` = t2.`job_id`\nRETURN cast (sum(CASE  WHEN t2.`job_desc` = 'publisher' THEN 1 ELSE 0 END) - sum(CASE  WHEN t2.`job_desc` = 'designer' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`job_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the employees, how many percent more for the publishers than designers?",
    "evidence": "publisher and designer are job descriptions which refers to job_desc; percentage more = 100*(SUBTRACT(SUM(CASE WHERE job_desc = 'publisher), SUM(CASE WHERE job_desc = 'designer'))",
    "idx": 51
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "CALL {\nMATCH (roysched_sub0@`roysched`)\nRETURN cast (sum(roysched_sub0.`royalty`) as float) / COUNT(roysched_sub0.`title_id`) AS `_col_0` \n}\nMATCH (t2@`roysched`)-[royalty_schedule_for_0:`royalty_schedule_for`]->(t1@`titles`)\nWHERE t1.`title_id` = t2.`title_id`\nAND (t2.`royalty` > _col_0)\nRETURN DISTINCT t1.`title` AS `title`, t1.`type` AS `type_`, t1.`price` AS `price`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which titles has above average royalty rate? Give those title's name, type and price?",
    "evidence": "average royalty rate = DIVIDE(SUM(royalty), COUNT(title_id))",
    "idx": 52
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t3@`roysched`)-[royalty_schedule_for_0:`royalty_schedule_for`]->(t1@`titles`)-[published_by_0:`published_by`]->(t2@`publishers`)\nWHERE t1.`pub_id` = t2.`pub_id`\nAND t1.`title_id` = t3.`title_id`\nRETURN (cast (sum(CASE  WHEN t2.`country` = 'USA' THEN t1.`royalty` ELSE 0 END) as float) / sum(CASE  WHEN t2.`country` = 'USA' THEN 1 ELSE 0 END)) - (cast (sum(CASE  WHEN t2.`country` <> 'USA' THEN t1.`royalty` ELSE 0 END) as float) / sum(CASE  WHEN t2.`country` <> 'USA' THEN 1 ELSE 0 END)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Find the difference between the average royalty of titles published by US and non US publishers?",
    "evidence": "US publisher refers publisher in the US where country = 'USA'; non-US publishers refers publisher not in the US where country! = 'USA'; difference = SUBTRACT(AVG(royalty) where country = 'USA', AVG(royalty) where country! = 'USA'))",
    "idx": 56
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t2@`employee`)-[works_for_0:`works_for`]->(t1@`publishers`)\nMATCH (t2@`employee`)-[has_job_0:`has_job`]->(t3@`jobs`)\nWHERE t1.`pub_id` = t2.`pub_id`\nAND t2.`job_id` = t3.`job_id`\nAND (t3.`job_desc` = 'Managing Editor')\nRETURN (cast (sum(CASE  WHEN t1.`country` = 'USA' THEN t2.`job_lvl` ELSE 0 END) as float) / sum(CASE  WHEN t1.`country` = 'USA' THEN 1 ELSE 0 END)) - (cast (sum(CASE  WHEN t1.`country` <> 'USA' THEN t2.`job_lvl` ELSE 0 END) as float) / sum(CASE  WHEN t1.`country` <> 'USA' THEN 1 ELSE 0 END)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Calculate the average level difference between the Marketing editors hired by the US and non-US publishers?",
    "evidence": "Marketing manager is a job description which refers to job_desc; US publisher refers publisher in the US where country = 'USA'; non-US publishers refers publisher not in the US where country! = 'USA'; job level refers to job_lvl; average level = AVG(job_lvl)",
    "idx": 57
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`titles`)-[published_by_0:`published_by`]->(t2@`publishers`)\nWHERE t1.`pub_id` = t2.`pub_id`\nAND (t1.`notes` = 'Helpful hints on how to use your electronic resources to the best advantage.')\nRETURN t1.`title` AS `title`, t2.`pub_name` AS `pub_name`, t1.`price` AS `price`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which title is about helpful hints on how to use your electronic resources, which publisher published it and what is the price of this book?",
    "evidence": "publisher refers to pub_name; about the title refers to notes",
    "idx": 58
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (t1@`titles`)-[published_by_0:`published_by`]->(t2@`publishers`)\nWHERE t1.`pub_id` = t2.`pub_id`\nAND (t1.`notes` = 'Carefully researched study of the effects of strong emotions on the body. Metabolic charts included.')\nRETURN t1.`title` AS `title`, t2.`pub_name` AS `pub_name`, t1.`ytd_sales` AS `ytd_sales`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the titles, which title is about the Carefully researched study of the effects of strong emotions on the body, which state-based publisher published this book, and what is the year-to-date sale?",
    "evidence": "year to date sales refers to ytd_sales; about the title refers to notes",
    "idx": 59
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (callcenterlogs@`callcenterlogs`)\nRETURN CASE  WHEN sum(CASE  WHEN callcenterlogs.`complaint id` = 'CR2400594' THEN callcenterlogs.`priority`  END) > sum(CASE  WHEN callcenterlogs.`complaint id` = 'CR2405641' THEN callcenterlogs.`priority`  END) THEN 'CR2400594' ELSE 'CR2405641' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which complaint is more urgent, complaint ID CR2400594 or ID CR2405641?",
    "evidence": "more urgent refers to MAX(priority);",
    "idx": 60
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`first` = 'Diesel' AND t1.`last` = 'Galloway')\nRETURN COUNT(t1.`client_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many complaints have the client Diesel Galloway filed?",
    "evidence": "",
    "idx": 62
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`first` = 'Diesel' AND t1.`last` = 'Galloway' AND t2.`date received` = date('2014-07-03'))\nRETURN t2.`sub-product` AS `sub-product`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the detailed product of the complaint filed by Diesel Galloway on 2014/7/3?",
    "evidence": "detailed product refers to \"sub-product\"; on 2014/7/3 refers to \"Date received\" = '2014-07-03';",
    "idx": 63
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t1.`first` = 'Matthew' AND t1.`last` = 'Pierce' AND t2.`date received` = date('2016-10-28'))\nRETURN CASE  WHEN t2.`consumer consent provided?` IN [NULL, 'N/A', 'Empty'] THEN 'No' ELSE 'Yes' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Was the tag in the complaint filed by Matthew Pierce on 2016/10/28 approved by himself?",
    "evidence": "on 2016/10/28 refers to Date received = '2016-10-28'; \"Consumer consent provided?\" in (null, 'N/A', 'Empty') means that the company didn't get the permission of consent; \"Consumer consent provided?\" not in (null, 'N/A', 'Empty') means that customers provide the consent for this tag;",
    "idx": 64
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t1@`client`)\nWHERE t1.`client_id` = t2.`rand client`\nAND (t2.`date received` = date('2017-03-27') AND t2.`server` = 'MICHAL')\nRETURN t1.`first` AS `first`, t1.`middle` AS `middle`, t1.`last` AS `last`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the client whose complaint on 2017/3/27 was received by MICHAL?",
    "evidence": "full names = first, middle, last; on 2017/3/27 refers to \"Date received\" = '2017-03-27'; MICHAL refers to server = 'MICHAL';",
    "idx": 65
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t2@`callcenterlogs`)-[submitted_by_0:`submitted_by`]->(t1@`client`)\nWHERE t1.`client_id` = t2.`rand client`\nAND (t1.`first` = 'Rachel' AND t1.`last` = 'Hicks' AND t2.`date received` = date('2017-03-27'))\nRETURN t2.`ser_time` AS `ser_time`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For how long did the complaint filed on 2017/3/27 by Rachel Hicks last?",
    "evidence": "how long did the complaint filed last refers to ser_time; on 2017/3/27 refers to \"Date received\" = '2017-03-27';",
    "idx": 66
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`issue` = 'Deposits and withdrawals' AND t1.`city` = 'New York City')\nRETURN COUNT(t2.`issue`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the clients from the New York city, how many of them have filed a complaint on the issue of Deposits and withdrawals?",
    "evidence": "",
    "idx": 67
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[t2:`filed_complaint`]->()\nWHERE t1.`client_id` = t2.`client_id`\nAND (t2.`timely response?` = 'No' AND t1.`city` = 'New York City')\nRETURN COUNT(t1.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the clients who did receive a timely response for their complaint, how many of them are from New York?",
    "evidence": "did not receive a timely response refers to \"Timely response?\" = 'No'; New York refers to city = 'New York';",
    "idx": 69
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (t1@`client`)-[located_in_0:`located_in`]->(t2@`district`)\nWHERE t1.`district_id` = t2.`district_id`\nAND (t1.`first` = 'Diesel' AND t1.`last` = 'Galloway')\nRETURN t2.`division` AS `division`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which division is Diesel Galloway in?",
    "evidence": "",
    "idx": 70
  }
]