[
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_4`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`region` = 'West')\nORDER BY t1.`discount` DESC NULLS LAST \nRETURN t2.`customer name` AS `customer name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the customer from the West region that received the highest discount?",
    "evidence": "received the highest discount refers to MAX(discount); customer refers to \"Customer Name\"",
    "idx": 1104
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t3.`product name` = 'Bush Mission Pointe Library' AND t3.`region` = 'Central')\nRETURN DISTINCT t2.`customer name` AS `customer name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who ordered the Bush Mission Pointe Library in the Central Region?",
    "evidence": "Bush Mission Pointe Library' is the \"Product Name\";",
    "idx": 1107
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_3`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t1.`ship mode` = 'First Class' AND t2.`category` = 'Furniture')\nRETURN COUNT(t1.`order id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders in the south superstore with the fastest delivery are items of furniture?",
    "evidence": "fastest delivery refers to Ship Mode = 'First Class'; furniture refers to Category = 'Furniture'",
    "idx": 1112
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_3`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t3.`category` = 'Office Supplies' AND t2.`customer name` = 'Cindy Stewart')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many office supply orders were made by Cindy Stewart in the south superstore?",
    "evidence": "office supply refers to Category = 'Office Supplies'",
    "idx": 1113
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_3`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nORDER BY t1.`profit` DESC NULLS LAST \nRETURN t2.`category` AS `category` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What product category got the highest profit in the south superstore?",
    "evidence": "highest profit refers to MAX(Profit)",
    "idx": 1114
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_2`]->(t3@`product`)\nOPTIONAL MATCH ()-[t4:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t2.`customer name` = 'Sam Craven') AND t3.`product id` = t4.`product id`\nRETURN DISTINCT t3.`category` AS `category`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What product category that Sam Craven ordered from the central and east superstore?",
    "evidence": "",
    "idx": 1117
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_3`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t2.`customer name` = 'Cindy Stewart' AND t3.`product name` = 'Lexmark X 9575 Professional All-in-One Color Printer')\nRETURN sum(t1.`quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total quantity that Cindy Stewart order \"Lexmark X 9575 Professional All-in-One Color Printer\" in the south superstore?",
    "evidence": "Lexmark X 9575 Professional All-in-One Color Printer' is the \"Product Name\"",
    "idx": 1118
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_4`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nORDER BY t1.`sales`  NULLS FIRST \nRETURN t2.`category` AS `category` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What product category got the least sales in the west superstore?",
    "evidence": "least sales refers to Sales = MIN(Sales)",
    "idx": 1120
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (people@`people`)\nRETURN cast (sum(CASE  WHEN people.`state` = 'Texas' THEN 1 ELSE 0 END) as float) * 100 / sum(CASE  WHEN people.`state` = 'Indiana' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio between customers who live in Texas and customers who live in Indiana?",
    "evidence": "live in Texas refers to State = 'Texas'; live in Indiana refers to State = 'Indiana'; Ratio = divide(sum(State = 'Texas'), sum(State = 'Indiana'))",
    "idx": 1123
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`region` = 'Central' AND t1.`profit` < 0)\nRETURN DISTINCT t2.`product name` AS `product name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the ordered products that have profit deficiency in central superstore?",
    "evidence": "names of the ordered products refers to Product Name; deficiency refers to profit value is negative; profit > 0",
    "idx": 1126
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_4`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`region` = 'West')\nORDER BY duration_between(t1.`ship date`,t1.`order date`)  NULLS FIRST \nRETURN DISTINCT t2.`product name` AS `product name`, t1.`ship mode` AS `ship mode` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In west superstore, what is the name and the shipping mode of the product that was ordered with the shortest shipment time?",
    "evidence": "name refers to \"Product Name\"; shipping mode refers to Ship Mode; shortest shipment time refers to min(subtract(Ship Date, Order Date))",
    "idx": 1127
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`product name` = 'O\\'Sullivan Plantations 2-Door Library in Landvery Oak' AND t2.`region` = 'Central' AND t1.`ship mode` = 'First Class')\nRETURN COUNT(DISTINCT t1.`order id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders of O'Sullivan Plantations 2-Door Library in Landvery Oak in central superstore were shipped through the shipping mode with the fastest delivery speed?",
    "evidence": "'O'Sullivan Cherrywood Estates Traditional Bookcase' is the \"Product Name\"; shipping mode with the fastest delivery speed refers to \"Ship Mode\" = 'First Class'",
    "idx": 1128
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t3@`people`)-[t1:`purchased_4`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND t3.`customer id` = t1.`customer id`\nAND (t1.`sales` > 5000 AND t3.`state` = 'California' AND t2.`region` = 'West')\nRETURN COUNT(DISTINCT t1.`order id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the orders with sales value of no less than 5,000 in west superstore, how many were bought by the customers in California?",
    "evidence": "customers in California refers to State = 'California'; orders with sales value of no less than 5,000 refers to Sales > = 5,000",
    "idx": 1129
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_2`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t1.`region` = 'East')\nORDER BY (t1.`sales` / (1 - t1.`discount`)) DESC NULLS LAST \nRETURN t2.`segment` AS `segment` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which segment does the customer who purchased the product from the east superstore with the highest original price belong?",
    "evidence": "highest original price refers to max(divide(Sales, subtract(1, Discount)))",
    "idx": 1130
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[central_superstore:`purchased_1`]->()\nWHERE central_superstore.`quantity` > 5 AND central_superstore.`ship mode` = 'First Class'\nRETURN COUNT(DISTINCT central_superstore.`order id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders with a quantity greater than 5 have been shipped by the fastest delivery method?",
    "evidence": "orders with a quantity greater than 5 refers to Quantity > 5; shipped by the fastest delivery method refers to Ship Mode = 'First Class'",
    "idx": 1131
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t2.`product id`\nAND (t1.`customer name` = 'Phillina Ober')\nRETURN DISTINCT t3.`product name` AS `product name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which product did Phillina Ober buy?",
    "evidence": "product refers to \"Product Name\"",
    "idx": 1133
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_4`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`product name` = 'Hon Pagoda Stacking Chairs')\nRETURN sum(t1.`quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the \"Hon Pagoda Stacking Chairs\" have been sold in total in the west superstore?",
    "evidence": "Hon Pagoda Stacking Chairs' is the \"Product Name\"; west superstore refers to Region = 'West'",
    "idx": 1135
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`customer name` = 'Aaron Bergman' AND t2.`ship mode` = 'Standard Class')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders purchased by Aaron Bergman have been delivered with the slowest shipping speed?",
    "evidence": "slowest shipping speed refers to \"Ship Mode\" = 'Standard Class'",
    "idx": 1136
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_2`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t1.`product id`\nAND (t2.`customer name` = 'Aimee Bixby')\nRETURN DISTINCT t3.`product name` AS `product name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the product that Aimee Bixby bought?",
    "evidence": "name of the product refers to \"Product Name\"",
    "idx": 1138
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_2`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t1.`ship mode` = 'Standard Class')\nRETURN COUNT(t2.`category`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many furniture products had been shipped by standard class in the East superstore?",
    "evidence": "furniture products refers to Category = 'Furniture'; shipped by standard class refers to \"Ship Mode\" = 'Standard Class'",
    "idx": 1140
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_2`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t2.`city` = 'Houston' AND t2.`state` = 'Texas')\nORDER BY t1.`profit` DESC NULLS LAST \nRETURN t1.`order id` AS `order id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the highest profit order in the East superstore of customers from Houston, Texas?",
    "evidence": "highest profit refers to max(Profit); Houston, Texas refers to City = 'Houston' and State = 'Texas'",
    "idx": 1141
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`category` = 'Furniture')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many furniture products were ordered at central superstore?",
    "evidence": "furniture products refers to Category = 'Furniture'",
    "idx": 1142
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`state` = 'Texas')\nRETURN COUNT(DISTINCT t2.`order id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders were made by customers who live in Texas at the Central superstore?",
    "evidence": "customer live in Texas refers to State = 'Texas'",
    "idx": 1143
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_2`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t1.`order id` = 'CA-2011-141817')\nRETURN DISTINCT t2.`product name` AS `product name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the product name of order CA-2011-115791 in the East superstore?",
    "evidence": "order CA-2011-115791 refers to \"Order ID\" = 'CA-2011-115791'",
    "idx": 1144
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`state` = 'Texas')\nRETURN cast (sum(CASE  WHEN t2.`discount` = 0.2 THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of orders with 0.2 discount in the Central superstore were purchased by customers who live in Texas?",
    "evidence": "live in Texas refers to State = 'Texas'; percentage = divide(sum(Order ID) when Discount = 0.2, sum(Order ID)) as percentage",
    "idx": 1145
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_4`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`order date` = date('2013-08-12') AND t1.`discount` = 0.2 AND t1.`region` = 'West')\nRETURN DISTINCT t2.`customer name` AS `customer name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who order from the west region on August 12, 2013, and received a discount of 0.2?",
    "evidence": "Who refers to \"Customer Name\"; on August 12, 2013 refers to \"Order Date\" = '2013-08-12'; discount of 0.2 refers to discount = 0.2",
    "idx": 1146
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_1`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`product name` = 'Security-Tint Envelopes' AND t1.`order date` = date('2013-06-03'))\nRETURN DISTINCT t1.`order id` AS `order id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the order ID of the security-Tint Envelopes product ordered on June 3, 2013, in the Central region?",
    "evidence": "Security-Tint Envelopes' refers to \"Product Name\"; ordered on June 3, 2013 refers to \"Order Date\" = '2013-06-03'",
    "idx": 1147
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->(t3@`product`)\nWHERE t1.`customer id` = t2.`customer id`\nAND t3.`product id` = t2.`product id`\nAND (t1.`city` = 'Houston' AND t1.`state` = 'Texas' AND t2.`region` = 'Central')\nRETURN sum(t2.`profit`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers from Houston, Texas, what is the total profit of their orders in the Central region?",
    "evidence": "customers from Houston, Texas refers to State = 'Texas' and City = 'Houston'; total profit = sum(Profit)",
    "idx": 1150
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_2`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`ship date` = date('2013-03-05'))\nRETURN DISTINCT t2.`customer name` AS `customer name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the customer with an order shipped on March 5, 2013, in the eastern region?",
    "evidence": "Who is the customer refers to Customer Name; shipped on March 5, 2013 refers to \"Ship Date\" = '2013-03-05'; eastern region refers to Region = 'East'",
    "idx": 1151
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t2@`people`)-[t1:`purchased_2`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t1.`order id` = 'CA-2011-118976' AND t2.`region` = 'East')\nRETURN DISTINCT t2.`customer name` AS `customer name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who ordered the order ID CA-2011-118976 from the East region?",
    "evidence": "Who refers to \"Customer Name\"",
    "idx": 1152
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH ()-[t1:`purchased_2`]->(t2@`product`)\nWHERE t1.`product id` = t2.`product id`\nAND (t2.`region` = 'East')\nORDER BY t1.`quantity` DESC NULLS LAST \nRETURN t2.`product name` AS `product name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the product's name in the highest quantity in a single purchase?",
    "evidence": "highest quantity refers to max(Quantity)",
    "idx": 1155
  },
  {
    "filename": "train.json",
    "db_id": "superstore",
    "gql_statement": "MATCH (t1@`people`)-[t2:`purchased_1`]->()\nWHERE t1.`customer id` = t2.`customer id`\nAND (t2.`region` = 'Central' AND t1.`state` = 'Indiana')\nRETURN cast (sum(CASE  WHEN t2.`discount` = 0 THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers from Indiana, what is the percentage of their purchased orders in the Central region with no discount?",
    "evidence": "Indiana refers to State = 'Indiana'; no discount refers to Discount = 0; percentage = divide(sum(Discount) when Discount = 0, count(Discount)) as percentage",
    "idx": 1157
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (officers@`officers`)\nWHERE officers.`gender` = 'M'\nRETURN cast (sum(CASE WHEN officers.`race` = 'W' THEN 1 ELSE 0 END) as float) * 100 / COUNT(officers.`case_number`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the male officers, what is the percentage of them are White?",
    "evidence": "male refers to gender = 'M'; white refers to race = 'W'; percentage = divide(count(officers where race = 'W'), count(officers)) where gender = 'M' * 100%",
    "idx": 1158
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (t2@`officers`)-[involved_in_1_0:`involved_in_1`]->(t1@`incidents`)\nWHERE t1.`case_number` = t2.`case_number`\nAND (t1.`subject_weapon` = 'Vehicle' AND t2.`gender` = 'F')\nRETURN COUNT(t1.`case_number`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many incidents in which the subject's weapon was a vehicle were investigated by a female officer?",
    "evidence": "subject's weapon was a vehicle refers to subject_weapon = 'Vehicle'; female refers to gender = 'F'",
    "idx": 1163
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (t2@`subjects`)-[involved_in_2_0:`involved_in_2`]->(t1@`incidents`)\nWHERE t1.`case_number` = t2.`case_number`\nAND (t2.`gender` = 'F' AND t1.`subject_statuses` = 'Deceased')\nRETURN COUNT(t1.`case_number`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In how many cases where the subject was a female was the subject's status listed as Deceased?",
    "evidence": " female refers to gender = 'F'; subject's status listed as Deceased refers to subject_statuses = 'Deceased'",
    "idx": 1164
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (t1@`officers`)-[involved_in_1_0:`involved_in_1`]->(t2@`incidents`)\nWHERE t2.`case_number` = t1.`case_number`\nAND (t1.`race` = 'B' AND t2.`date` >= date('2010-01-01') AND t2.`date` <= date('2015-12-31'))\nRETURN COUNT(t1.`case_number`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the black officers, how many of them investigated cases between the years 2010 and 2015?",
    "evidence": "black refers to race = 'B'; between the years 2010 and 2015 refers to date between '2010-01-01' and '2015-12-31'; case refers to case_number",
    "idx": 1165
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (incidents@`incidents`)\nWHERE incidents.`date` >= date('2015-06-01') AND incidents.`date` <= date('2015-06-30')\nRETURN COUNT(incidents.`case_number`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many instances were found in June 2015?",
    "evidence": "in June 2015 refers to date between '2015-06-01' and '2015-06-30'; record number refers to case_number",
    "idx": 1166
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (incidents@`incidents`)\nWHERE incidents.`subject_weapon` = 'Handgun' AND incidents.`subject_statuses` = 'Injured' AND incidents.`date` >= date('2006-01-01') AND incidents.`date` <= date('2013-12-31')\nRETURN COUNT(incidents.`location`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many people were injured between 2006 and 2014 as a result of a handgun?",
    "evidence": "injured refers to subject_statuses = 'injured'; between 2006 and 2014 refers to date between '2006-01-01' and '2013-12-31'; handgun refers to subject_weapon = 'handgun'; where the incidents took place refers to location",
    "idx": 1167
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (t2@`subjects`)-[involved_in_2_0:`involved_in_2`]->(t1@`incidents`)\nWHERE t1.`case_number` = t2.`case_number`\nAND (t1.`case_number` = '031347-2015')\nRETURN t1.`subject_weapon` AS `subject_weapon`, t2.`race` AS `race`, t2.`gender` AS `gender`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which type of weapon was used to attack the victim in the record number 031347-2015? What is the victim's race and gender?",
    "evidence": "type of weapon refers to subject_weapon; record number 031347-2015 refers to case_number = '031347-2015'",
    "idx": 1168
  },
  {
    "filename": "train.json",
    "db_id": "shooting",
    "gql_statement": "MATCH (t2@`officers`)-[involved_in_1_0:`involved_in_1`]->(t1@`incidents`)\nMATCH (t3@`subjects`)-[involved_in_2_0:`involved_in_2`]->(t1@`incidents`)\nWHERE t1.`case_number` = t2.`case_number`\nAND t1.`case_number` = t3.`case_number`\nAND (t2.`first_name` = 'Fredirick' AND t2.`last_name` = 'Ruben')\nRETURN t1.`case_number` AS `case_number`, t3.`race` AS `race`, t3.`gender` AS `gender`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which near-death incident did a policeman by the name of Ruben Fredirick look into? What is the victim in this incident's race and gender?",
    "evidence": "near-death refers to subject_statuses = 'Deceased Injured'; incident refers to case_number; Ruben Fredirick refers to full_name = 'Ruben Fredirick'",
    "idx": 1169
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[has_classification_0:`has_classification`]->(t2@`classification`)\nWHERE t1.`geneid` = t2.`geneid`\nAND (t2.`localization` = 'nucleus' AND t1.`essential` = 'Non-Essential')\nRETURN COUNT(t1.`geneid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many non-essential genes are located in the nucleus?",
    "evidence": "",
    "idx": 1171
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[has_classification_0:`has_classification`]->(t2@`classification`)\nWHERE t1.`geneid` = t2.`geneid`\nAND (t2.`localization` = 'vacuole' AND t1.`phenotype` = 'Nucleic acid metabolism defects')\nRETURN COUNT(t1.`geneid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the genes with nucleic acid metabolism defects, how many of them can be found in the vacuole?",
    "evidence": "",
    "idx": 1172
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nMATCH (t3@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND t3.`geneid` = t2.`geneid2`\nAND (t1.`localization` = 'nucleus' AND t3.`localization` = 'nucleus')\nORDER BY t2.`expression_corr` DESC NULLS LAST \nRETURN t2.`expression_corr` AS `expression_corr` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the pairs of genes that are both located in the nucleus, what is the highest expression correlation score?",
    "evidence": "",
    "idx": 1174
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND (t2.`expression_corr` < 0 AND t1.`class` = 'Motorproteins')\nRETURN COUNT(t1.`geneid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the pairs of genes that are not from the class of motorproteins, how many of them are negatively correlated?",
    "evidence": "If Expression_Corr < 0, it means the negatively correlated",
    "idx": 1176
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND (t1.`chromosome` = 6 OR t1.`chromosome` = 8)\nORDER BY t2.`expression_corr` DESC NULLS LAST \nRETURN t2.`expression_corr` AS `expression_corr` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the pairs of genes with one having 8 chromosomes and the other having 6 chromosomes, what is the highest expression correlation score?",
    "evidence": "",
    "idx": 1177
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND (t1.`localization` <> 'cytoplasm' AND t1.`function` = 'TRANSCRIPTION' AND t1.`essential` = 'NON-Essential')\nRETURN COUNT(t1.`geneid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the non-essential genes whose functions are transcription, how many of them are not located in the cytoplasm?",
    "evidence": "",
    "idx": 1179
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND (t2.`expression_corr` > 0 AND t1.`essential` = 'Non-Essential')\nRETURN COUNT(t2.`geneid2`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many pairs of positively correlated genes are both non-essential?",
    "evidence": "If Expression_Corr > 0, it means the expression correlation is positive",
    "idx": 1180
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nMATCH (t3@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND t3.`geneid` = t2.`geneid2`\nAND (t2.`expression_corr` > 0)\nRETURN cast (sum(CASE WHEN t1.`chromosome` > 10 AND t3.`chromosome` > 10 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`geneid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "If a pair of genes is positively correlated, what is the possibility of it being composed of two genes both with over 10 chromosomes?",
    "evidence": "Positively correlated means Expression_Corr > 0; Possibility = count(the pairs of genes with both chromosomes over 20) / count(pairs of genes that are positively correlated)",
    "idx": 1181
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND (t1.`class` = 'ATPases')\nRETURN avg(t2.`expression_corr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the pairs of genes both from the class ATPases, what is the average expression correlation score?",
    "evidence": "",
    "idx": 1182
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (classification@`classification`)\nWHERE classification.`localization` IN ['plasma', 'nucleus']\nRETURN COUNT(classification.`geneid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many different genes do we have if we add those located in the plasma and in the nucleus?",
    "evidence": "",
    "idx": 1184
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND (t1.`function` = 'TRANSCRIPTION' AND t1.`essential` = 'Non-Essential')\nRETURN t2.`type` AS `type_`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What type of interactions occurs in genes whose function is cellular transport and transport medicine and are classified as non-essential?",
    "evidence": "",
    "idx": 1185
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND (t2.`type` <> 'Physical' AND t1.`phenotype` = 'Cell cycle defects' AND t1.`class` <> 'Motorproteins' AND t1.`essential` = 'Non-Essential')\nRETURN COUNT(t1.`geneid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of all the nonessential genes that are not of the motorprotein class and whose phenotype is cell cycle defects, how many do not have a physical type of interaction?",
    "evidence": "",
    "idx": 1188
  }
]