[
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`name` = 'Applied Deep Learning ' AND `t2`.`grade` IS NULL)\nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who were the students who failed the course \"Applied Deep Learning\"? Give the full name.",
    "evidence": "If grade is null or empty, it means that this student fails to pass the course in which grade = NULL;",
    "idx": 630
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`name` = 'Intro to BlockChain' AND `t2`.`grade` = 'A')\nRETURN `t1`.`phone_number` AS `phone_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the phone number of the only student who obtained \"A\" in the course \"Intro to BlockChain\".",
    "evidence": "A refers to an excellent grade in which grade = 'A' for the course;",
    "idx": 631
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`prof`:`prof`)\nWHERE `prof`.`graduate_from` = 'University of Boston'\nRETURN `prof`.`first_name` AS `first_name`, `prof`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the professor who got graduation from the University of Boston.",
    "evidence": "Name the professor refers to full name which includes f_name and l_name;",
    "idx": 648
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL(*) {\nMATCH (`course_sub0`:`course`)\nRETURN min(`course_sub0`.`diff`) AS `_col_0`  \n}\nMATCH (`course`:`course`)\nWHERE `course`.`diff` = `_col_0`\nRETURN `course`.`name` AS `name`, `course`.`credit` AS `credit`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the names and credits of the least difficult courses.",
    "evidence": "diff refers to difficulty; the least difficult courses refer to MIN(diff);",
    "idx": 651
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`prof`)-[t2:advises]->(`t3`:`student`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nORDER BY `t1`.`popularity` IS NULL ASC, `t1`.`popularity` DESC \nRETURN `t3`.`f_name` AS `f_name`, `t3`.`l_name` AS `l_name`, `t3`.`gpa` AS `gpa`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the students' full names and GPAs under the supervision of the most popular professor.",
    "evidence": "student's full names = f_name, l_name; most popular refers to MAX(popularity);",
    "idx": 652
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`prof`)-[t2:advises]->(`t3`:`student`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nAND (`t1`.`first_name` = 'Merwyn' AND `t1`.`last_name` = 'Conkay')\nRETURN `t3`.`f_name` AS `f_name`, `t3`.`l_name` AS `l_name`, `t2`.`capability` AS `capability`, `t3`.`gpa` AS `gpa`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the research assistants' full names, capabilities and GPAs who were under the supervision of Merwyn Conkay.",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; full names = f_name, l_name;",
    "idx": 654
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`name` = 'Intro to BlockChain')\nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`, `t2`.`grade` AS `grade`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the students' full names and grades in Intro to BlockChain course.",
    "evidence": "student's full names = f_name, l_name;",
    "idx": 655
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t2`.`grade` = 'A')\nORDER BY `t3`.`diff` IS NULL ASC, `t3`.`diff` DESC \nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among students registered for the most difficult course, list the students' full names who got grade A.",
    "evidence": "difficulty refers to diff; most difficult course refers to MAX(diff); student's full names = f_name, l_name;",
    "idx": 656
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`prof`)-[t2:advises]->(`t3`:`student`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nAND (`t3`.`f_name` = 'Olia' AND `t3`.`l_name` = 'Rabier')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t1`.`graduate_from` AS `graduate_from`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the full names and graduated universities of the professors who advised Olia Rabier.",
    "evidence": "full names of the professors = first_name, last_name; graduated universities of the professors refers to graduate_from;",
    "idx": 657
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`name` = 'Advanced Database Systems')\nORDER BY `t2`.`sat` IS NULL ASC, `t2`.`sat` DESC \nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the students of the Advanced Database Systems course with the highest satisfaction.",
    "evidence": "full the students = f_name, l_name; course refers to name; satisfaction refers to sat; highest satisfaction refers to MAX(sat);",
    "idx": 658
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t1`.`type` = 'UG' AND `t1`.`gpa` > 3.7)\nRETURN DISTINCT `t1`.`f_name` AS `f_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the registered courses' names by undergraduate students with GPA of 3.7 and above.",
    "evidence": "Undergraduate students refers to type = 'UG'; GPA of 3.7 and above refers to gpa > 3.7;",
    "idx": 660
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`prof`)-[t2:advises]->(`t3`:`student`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nAND (`t1`.`graduate_from` = 'University of Washington')\nRETURN `t3`.`f_name` AS `f_name`, `t3`.`l_name` AS `l_name`, `t2`.`capability` AS `capability`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the names and capability of the students who were advised by professors from the University of Washington.",
    "evidence": "names of the students = f_name, l_name;",
    "idx": 661
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`course`:`course`)\nWHERE `course`.`name` = 'Computer Vision'\nRETURN `course`.`credit` AS `credit`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the credit of the course named \"Computer Vision\"?",
    "evidence": "",
    "idx": 666
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`name` = 'C for Programmers' AND `t1`.`gpa` = 2.5)\nRETURN `t2`.`student_id` AS `student_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the student's ID of students with 2.5 GPA and enrolled in C for Programmers.",
    "evidence": "",
    "idx": 667
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`name` = 'Intro to Database 2')\nORDER BY `t2`.`sat` IS NULL ASC, `t2`.`sat` DESC \nRETURN `t1`.`l_name` AS `l_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the student's last name that gave the highest student satisfaction for the course \"Intro to Database 2\".",
    "evidence": "student's last name refers to l_name; satisfaction refers to sat; highest satisfaction refers to MAX(sat);",
    "idx": 668
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t1`.`type` = 'UG')\nORDER BY `t2`.`sat` IS NULL ASC, `t2`.`sat` DESC \nRETURN `t3`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among undergraduate students, list the name of the course with the highest student satisfaction.",
    "evidence": "Undergraduate students refers to type = 'UG'; satisfaction refers to sat; highest satisfaction refers to MAX(sat);",
    "idx": 670
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taken_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t2`.`grade` = 'D')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the course's name where students acquired a grade of D.",
    "evidence": "",
    "idx": 675
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`gpa` > 3 AND `student`.`intelligence` < 4\nRETURN `student`.`f_name` AS `f_name`, `student`.`l_name` AS `l_name`, `student`.`phone_number` AS `phone_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the students with less than four intelligence, list the full name and phone number of students with a greater than 3 GPA.",
    "evidence": "intelligence < 4; full name = f_name, l_name; gpa > 3;",
    "idx": 682
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL(*) {\nMATCH ()-[ra_sub0:advises]->()\nRETURN avg(`ra_sub0`.`capability`) AS `_col_0`  \n}\nMATCH (`t1`:`student`)-[t2:advised_by]->()\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND (`t2`.`capability` > `_col_0`)\nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the students with above-average capability.",
    "evidence": "name of the students = f_name, l_name; above average-capability refers to capability > AVG(capability);",
    "idx": 683
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t1`.`intelligence` = 5 AND `t1`.`gpa` < 3)\nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`, `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the students with an intelligence of 5, list the full name and courses taken by them who have less than a 3 GPA.",
    "evidence": "full name of the students = f_name, l_name; gpa < 3;",
    "idx": 684
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`prof`)-[t2:advises]->(`t3`:`student`)\nWHERE `t1`.`prof_id` = `t2`.`prof_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nAND (`t3`.`intelligence` = 1)\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name of the professors who advised students with intelligence 1.",
    "evidence": "full name of the professors = first_name, last_name;",
    "idx": 686
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`diff` IN [2, 1])\nWITH `t3`.`diff` AS _groupby_col_0, avg(`t1`.`gpa`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference in the average GPA of students who took the hardest and easiest courses?",
    "evidence": "difference in the average gpa = SUBTRACT(AVG(gpa WHERE MAX(diff)), AVG(gpa where min(diff))); difficulty of the course refers to diff; hardest course refers to MAX(diff); easiest course refers to MIN(diff);",
    "idx": 687
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t2`:`student`)-[t1:advised_by]->()\nMATCH (`t2`:`student`)-[t3:takes]->()\nWHERE `t2`.`student_id` = `t1`.`student_id`\nAND `t2`.`student_id` = `t3`.`student_id`\nAND (`t3`.`grade` IS NULL OR `t3`.`grade` = '')\nRETURN `t2`.`f_name` AS `f_name`, `t2`.`l_name` AS `l_name`, `t1`.`capability` AS `capability`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the full name and capability of students who failed in any courses.",
    "evidence": "full name of students = f_name, l_name; failed refers to grade IS NULL;",
    "idx": 688
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t3`.`name` = 'Applied Deep Learning ' AND `t2`.`grade` = 'C')\nRETURN `t1`.`f_name` AS `f_name`, `t1`.`l_name` AS `l_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the student's first and last name that got a C in the course named \"Applied Deep Learning\".",
    "evidence": "student's first name refers to f_name; student's last name refers to l_name; got a C refers to grade = 'C';",
    "idx": 695
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:takes]->(`t3`:`course`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t2`.`sat` = 1 AND `t1`.`type` = 'RPG')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among research postgraduate students, give the name of the course with the student satisfaction value of 1.",
    "evidence": "research postgraduate students refers to type = 'RPG'; name of the course refers to name; satisfaction refers to sat; sat = 1;",
    "idx": 696
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`advisedby`:`advisedby`)\nWITH `advisedby`.`p_id_dummy` AS _groupby_col_0, CASE WHEN COUNT(DISTINCT `advisedby`.`p_id_dummy`)=0 THEN NULL ELSE toFloat(COUNT(`advisedby`.`p_id`)) / COUNT(DISTINCT `advisedby`.`p_id_dummy`) END AS _groupby_col_1\nRETURN _groupby_col_1 AS `avgnum`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of students for each advisor?",
    "evidence": "students refers to advisedBy.p_id; advisor refers to p_id_dummy; average number = avg(count(advisedBy.p_id))",
    "idx": 698
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`course`:`course`)\nWHERE `course`.`courselevel` = 'Level_500'\nRETURN `course`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the course IDs for professional or master/graduate courses.",
    "evidence": "professional or master/graduate courses refers to courseLevel = 'Level_500'",
    "idx": 700
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taught_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`courselevel` = 'Level_400')\nRETURN `t2`.`p_id` AS `p_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ID of professors who are teaching high-level or harder undergraduate course.",
    "evidence": "ID of professors refers to taughtBy.p_id; high-level or harder undergraduate course refers to courseLevel = 'Level_400'",
    "idx": 703
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`advisedby`)\nWHERE `t1`.`p_id` = `t2`.`p_id`\nAND (`t2`.`yearsinprogram` = 'Year_3')\nRETURN `t1`.`p_id` AS `p_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the advisors for students in Year 3 of the program.",
    "evidence": "advisors refers to p_id_dummy; students in Year 3 of the program refers to yearsInProgram = 'Year_3'",
    "idx": 705
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taught_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t2`.`course_id` = 165)\nRETURN `t1`.`courselevel` AS `courselevel`, `t2`.`p_id` AS `p_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What level is course 165? List the professors who teach the course.",
    "evidence": "course 165 refers to course_id = 165; professors refers to taughtBy.p_id",
    "idx": 707
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`advisedby`)\nWHERE `t1`.`p_id` = `t2`.`p_id`\nAND (`t1`.`p_id_dummy` = 5)\nRETURN `t1`.`p_id` AS `p_id`, `t2`.`yearsinprogram` AS `yearsinprogram`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ID and years in program for students taught by advisor with ID 5.",
    "evidence": "advisor with ID 5 refers to p_id_dummy = 5",
    "idx": 708
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t3`:`course`)-[t1:taught_by]->(`t2`:`person`)\nWHERE `t1`.`p_id` = `t2`.`p_id`\nAND `t3`.`course_id` = `t1`.`course_id`\nAND (`t2`.`hasposition` = 'Faculty_eme')\nRETURN `t3`.`course_id` AS `course_id`, `t3`.`courselevel` AS `courselevel`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the courses and level of courses by professors who are faculty employees.",
    "evidence": "professors who are faculty employees refers to professor = 1; faculty employees refers to hasPosition = 'Faculty_eme'",
    "idx": 709
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`advisedby`)\nMATCH (`t2`:`course`)-[t3:taught_by]->()\nWHERE `t1`.`p_id` = `t2`.`course_id`\nAND `t2`.`course_id` = `t3`.`course_id`\nAND (`t1`.`p_id` = 80)\nRETURN `t1`.`p_id_dummy` AS `p_id_dummy`, `t2`.`courselevel` AS `courselevel`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the ID of advisor of student ID 80 and state the level of courses taught by him/her.",
    "evidence": "ID of advisor refers to p_id_dummy; student ID 80 refers to advisedBy.p_id = 80; level of courses refers to courseLevel",
    "idx": 710
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taught_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`courselevel` = 'Level_400' OR `t1`.`courselevel` = 'Level_500')\nRETURN DISTINCT `t2`.`p_id` AS `p_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ID of professors who teach in both harder undergraduate course and master/graduate courses.",
    "evidence": "harder undergraduate course refers to courseLevel = 'Level_400'; master/graduate courses refers to courseLevel = 'Level_500'; ID of professors refers to taughtBy.p_id",
    "idx": 711
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`advisedby`:`advisedby`)\nWITH `advisedby`.`p_id_dummy` AS _groupby_col_0, COUNT(`advisedby`.`p_id_dummy`) AS _groupby_col_1\nWHERE _groupby_col_1 > 4\nRETURN _groupby_col_0 AS `p_id_dummy`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the teachers who have advised more than 4 others to teach.",
    "evidence": "teachers refers to p_id_dummy; have advised more than 4 others refers to count(advisedBy.p_id) > 4",
    "idx": 716
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taught_by]->(`t3`:`person`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND `t3`.`p_id` = `t2`.`p_id`\nAND (`t1`.`courselevel` = 'Level_300' AND `t3`.`hasposition` = 'Faculty_eme')\nRETURN `t2`.`p_id` AS `p_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of all the faculty employees who teaches a basic or medium undergraduate course.",
    "evidence": "faculty employees refers to hasPosition = 'Faculty_eme'; basic or medium undergraduate course refers to courseLevel = 'Level_300'",
    "idx": 718
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taught_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t2`.`p_id` = 79)\nRETURN `t1`.`courselevel` AS `courselevel`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the levels of the all courses taught by teacher no.79.",
    "evidence": "levels of the all courses refers to courseLevel; teacher no.79 refers to taughtBy.p_id = 79",
    "idx": 720
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`advisedby`)\nWHERE `t1`.`p_id` = `t2`.`p_id`\nAND (`t2`.`yearsinprogram` = 'Year_5')\nRETURN `t1`.`p_id_dummy` AS `p_id_dummy`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the advisors of the students who are in the 5th year of their program.",
    "evidence": "IDs of the advisors refers to p_id_dummy; in the 5th year of their program refers to yearsInProgram = 'Year_5'",
    "idx": 721
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t3`:`advisedby`)\nMATCH (`t2`:`course`)-[t1:taught_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND `t3`.`p_id` = `t1`.`p_id`\nAND (`t1`.`p_id` = 9)\nRETURN `t2`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the professor who advised student no.6, please list the IDs of the courses he or she teaches.",
    "evidence": "professor refers to p_id_dummy and professor = 1; student no.6 refers to advisedBy.p_id = 6; IDs of the courses refers to taughtBy.course_id",
    "idx": 724
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`course`:`course`)\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `course`.`courselevel` = 'Level_400' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `per`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of high-level undergraduate course.",
    "evidence": "high-level undergraduate course refers to courseLevel = 'Level_400'; percentage = divide(count(course.course_id) when courseLevel = 'Level_400', count(course.course_id)) * 100%",
    "idx": 729
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`advisedby`)\nWHERE `t1`.`p_id_dummy` = `t2`.`p_id`\nAND (`t1`.`p_id` = 303)\nRETURN `t2`.`hasposition` AS `hasposition`, `t1`.`p_id_dummy` AS `p_id_dummy`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the position status and IDs of professor who advised student ID \"303\".",
    "evidence": "position status refers to hasPosition; IDs of professor refers to p_id_dummy; student ID \"303\" refers to advisedBy.p_id = 303",
    "idx": 731
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t3`:`course`)-[t2:taught_by]->(`t1`:`person`)\nWHERE `t1`.`p_id` = `t2`.`p_id`\nAND `t3`.`course_id` = `t2`.`course_id`\nAND (`t1`.`hasposition` = 'Faculty_aff')\nRETURN `t1`.`p_id` AS `p_id`, `t3`.`courselevel` AS `courselevel`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the person IDs and course levels of the affiliated professors in faculty.",
    "evidence": "person IDs refers to person.p_id; affiliated professors in faculty refers to professor = 1 and hasPosition = 'Faculty_aff'",
    "idx": 732
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`advisedby`)\nWHERE `t1`.`p_id_dummy` = `t2`.`p_id`\nAND (`t2`.`hasposition` = 'Faculty_eme')\nRETURN `t1`.`p_id` AS `p_id`, `t2`.`p_id` AS `p_id_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the advised student IDs and IDs of employing professor in faculty.",
    "evidence": "advised student IDs refers to person.p_id; IDs of employing professor in faculty refers to p_id_dummy and hasPosition = 'Faculty_eme'",
    "idx": 733
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taught_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t2`.`p_id` >= 40 AND `t2`.`p_id` <= 50)\nRETURN `t1`.`course_id` AS `course_id`, `t1`.`courselevel` AS `courselevel`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the course IDs and levels of person IDs from 40 to 50.",
    "evidence": "course IDs and levels refers to course.course_id and courseLevel; person IDs from 40 to 50 refers to taughtBy.p_id between 40 and 50",
    "idx": 734
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taught_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t2`.`p_id` = 141)\nRETURN `t1`.`courselevel` AS `courselevel`, `t1`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the course level and list of person IDs who taught course ID of 147.",
    "evidence": "person IDs refers to taughtBy.p_id; course ID of 147 refers to course.course_id = 147",
    "idx": 735
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t3`:`course`)-[t2:taught_by]->(`t1`:`person`)\nWHERE `t1`.`p_id` = `t2`.`p_id`\nAND `t3`.`course_id` = `t2`.`course_id`\nAND (`t3`.`course_id` = 104 AND `t1`.`hasposition` <> '0')\nRETURN `t1`.`p_id` AS `p_id`, `t3`.`courselevel` AS `courselevel`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the person ID of faculty professor who taught course ID 104 and the course level.",
    "evidence": "person ID refers to person.p_id; faculty professor refers to professor = 1 and hasPosition ! = 0",
    "idx": 736
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t3`:`course`)-[t2:taught_by]->(`t1`:`person`)\nWHERE `t1`.`p_id` = `t2`.`p_id`\nAND `t3`.`course_id` = `t2`.`course_id`\nAND (`t3`.`courselevel` = 'Level_400' AND `t2`.`course_id` < 10)\nRETURN `t1`.`p_id` AS `p_id`, `t1`.`hasposition` AS `hasposition`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the professor ID and position in faculty who taught high-level undergraduate course of less than 10 in ID.",
    "evidence": "professor ID refers to person.p_id when professor = 1; position in faculty refers to hasPosition; high-level undergraduate course refers to courseLevel = 'Level_400'; less than 10 in ID refers to course.course_id < 10",
    "idx": 737
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taught_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`courselevel` = 'Level_300' AND `t1`.`course_id` > 121 AND `t1`.`course_id` < 130)\nRETURN `t2`.`p_id` AS `p_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the professor ID who taught the course ID from 121 to 130 of basic undergraduate courses.",
    "evidence": "professor ID refers to taughtBy.p_id; course ID from 121 to 130 of basic undergraduate courses refers to courseLevel = 'Level_300' and course.course_id between 121 and 130",
    "idx": 738
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`advisedby`)\nWHERE `t1`.`p_id` = `t2`.`p_id`\nAND (`t2`.`yearsinprogram` = 'Year_8')\nRETURN `t1`.`p_id_dummy` AS `p_id_dummy`, `t2`.`hasposition` AS `hasposition`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the advisor IDs for students with eighth year of program and position status in faculty of those professors.",
    "evidence": "advisor IDs refers to p_id_dummy and person.p_id where professor = 1; eighth year of program refers to yearsInprogram = 'Year_8'; position status in faculty of those professors refers to hasPosition",
    "idx": 739
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t1`:`course`)-[t2:taught_by]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`courselevel` = 'Level_500')\nRETURN `t1`.`course_id` AS `course_id`, `t2`.`p_id` AS `p_id`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List any five of course IDs with professor IDs who taught master courses.",
    "evidence": "professor IDs refers to taughtBy.p_id; master course refers to courseLevel = 'Level_500'",
    "idx": 740
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`course`)-[t2_sub0:taught_by]->()\nWHERE `t1_sub0`.`course_id` = `t2_sub0`.`course_id`\nAND (`t1_sub0`.`courselevel` = 'Level_400')\nWITH `t2_sub0`.`p_id` AS _groupby_col_0, COUNT(DISTINCT `t1_sub0`.`course_id`) AS _groupby_col_1, COUNT(`t2_sub0`.`p_id`) AS _groupby_col_2\nWHERE _groupby_col_1 <= 2\nRETURN _groupby_col_2 AS `_col_0`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many professors teaches no more than two high-level or harder undergraduate courses?",
    "evidence": "professors refers to taughtBy.p_id; high-level or harder undergraduate courses  refers to courseLevel = 'Level_400' ; no more than two refers to count(taughtBy.course_id) < = 2",
    "idx": 747
  }
]