[
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t2`.`publisher_name` = 'AK Press')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the title of books published by AK Press.",
    "evidence": "\"AK Press\" is the publisher_name",
    "idx": 4728
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t4`:`order_line`)\nMATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND `t4`.`book_id` = `t1`.`book_id`\nAND (`t4`.`price` > 19)\nRETURN DISTINCT `t3`.`author_name` AS `author_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the author's name of the books that cost 19 dollars and above.",
    "evidence": "books cost 19 dollars and above refers to price > = 19",
    "idx": 4729
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t1`.`isbn13` = '76092025986')\nRETURN `t2`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the publisher name of the book with ISBN 76092025986.",
    "evidence": "\"76092025986\" is the isbn13",
    "idx": 4730
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t2`.`publisher_name` = 'Birlinn' AND CASE WHEN `t1`.`publication_date` is not NULL THEN apoc.temporal.format(`t1`.`publication_date`,'yyyy') ELSE NULL END = '2008' AND `t1`.`num_pages` >= 600 AND `t1`.`num_pages` <= 700)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the books published by Birlinn in 2008, how many books have pages around 600 to 700?",
    "evidence": "\"Birlinn\" is the publisher_name; books have pages around 600 to 700 refers to num_pages BETWEEN 600 AND 700; in 2008 refers to SUBSTR(publication_date, 1, 4) = '2008'",
    "idx": 4731
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[written_in_0:written_in]->(`t2`:`book_language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`language_name` = 'British English')\nRETURN DISTINCT `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the title of the books published in British-English.",
    "evidence": "\"British English\" is the language_name of the book",
    "idx": 4734
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t2`.`publisher_name` = 'Brava' AND CASE WHEN `t1`.`publication_date` is not NULL THEN apoc.temporal.format(`t1`.`publication_date`,'yyyy') ELSE NULL END = '2006')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many books were published by Brava in 2006?",
    "evidence": "\"Brava\" is the publisher_name; in 2006 refers to SUBSTR(publication_date, 1, 4) = '2006'",
    "idx": 4735
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`order_line`)\nMATCH (`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND (`t2`.`book_id` = 6503)\nRETURN `t1`.`isbn13` AS `isbn13`, `t2`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ISBN and price of the book with book ID 7160.",
    "evidence": "ISBN refers to isbn13;",
    "idx": 4736
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`order_line`)\nMATCH (`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND (`t2`.`price` = 7.5)\nRETURN `t1`.`isbn13` AS `isbn13`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ISBN of the books that cost 7.5 dollars.",
    "evidence": "ISBN refers to isbn13; books cost 7.5 dollars refers to price = 7.5",
    "idx": 4739
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nMATCH (`t1`:`book`)-[published_by_0:published_by]->(`t4`:`publisher`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND `t4`.`publisher_id` = `t1`.`publisher_id`\nAND (`t3`.`author_name` = 'Alan Lee')\nWITH `t4`.`publisher_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the publisher's name of the books authored by Alan Lee.",
    "evidence": "\"Alan Lee\" is the author_name; publisher's name refers to publisher_name",
    "idx": 4740
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nORDER BY `t1`.`publication_date` IS NULL ASC, `t1`.`publication_date` DESC \nRETURN `t3`.`author_name` AS `author_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the author's name of the book most recently published.",
    "evidence": "author's name refers to author_name; book most recently published refers to Max(publication_date)",
    "idx": 4741
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL(*) {\nMATCH (`employee_sub0`:`employee`)\nWHERE `employee_sub0`.`first_name` = 'Darlisha' AND `employee_sub0`.`last_name` = 'Jacobs'\nRETURN `employee_sub0`.`employee_id` AS `employee_id`  \n}\nMATCH (`employee`:`employee`)\nWHERE `employee`.`title` = 'Sanitarian' AND `employee`.`supervisor` = `employee_id`\nRETURN `employee`.`first_name` AS `first_name`, `employee`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of all the sanitarians under the supervision of Darlisha Jacobs.",
    "evidence": "full name refers to first_name, last_name",
    "idx": 4744
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2010-05' AND `t1`.`title` = 'Sanitarian')\nRETURN DISTINCT `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of the sanitarians who did at least one inspection in May, 2010.",
    "evidence": "full name refers to first_name, last_name; in May 2010 refers to inspection_date like '2010-05%'; sanitarian refers to title = 'Sanitarian'",
    "idx": 4745
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy') ELSE NULL END = '2010' AND `t1`.`first_name` = 'Joshua' AND `t1`.`last_name` = 'Rosa')\nRETURN COUNT(`t2`.`inspection_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many inspections were sanitarian Joshua Rosa responsible for in 2010?",
    "evidence": "in 2010 refers to inspection_date like '2010%'",
    "idx": 4746
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nMATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t3`:`establishment`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND `t2`.`license_no` = `t3`.`license_no`\nAND (`t1`.`first_name` = 'Joshua' AND `t1`.`last_name` = 'Rosa')\nRETURN DISTINCT `t3`.`dba_name` AS `dba_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the assumed name of all the facilities inspected by Joshua Rosa.",
    "evidence": "assumed name refers to dba_name",
    "idx": 4747
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[performed_at_0:performed_at]->(`t2`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (CASE WHEN `t1`.`inspection_date` is not NULL THEN apoc.temporal.format(`t1`.`inspection_date`,'yyyy') ELSE NULL END = '2010' AND `t2`.`facility_type` = 'Restaurant')\nRETURN COUNT(DISTINCT `t1`.`license_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the facilities that have undergone at least one inspection in 2010, how many of them are restaurants or cafeterias?",
    "evidence": "in 2010 refers to inspection_date like '2010%'; restaurant or cafeteria refers to facility_type = 'Restaurant'",
    "idx": 4748
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[performed_at_0:performed_at]->(`t2`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`inspection_date` = localdatetime('2010-05-11T00:00:00'))\nRETURN DISTINCT `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the location coordinates of all the facilities that had an inspection on 2010/5/11.",
    "evidence": "location coordinates refers to latitude, longitude; on 2010/5/11 refers to inspection_date = '2010-05-11'",
    "idx": 4749
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[performed_at_0:performed_at]->(`t2`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (CASE WHEN `t1`.`inspection_date` is not NULL THEN apoc.temporal.format(`t1`.`inspection_date`,'yyyy') ELSE NULL END = '2010' AND `t2`.`ward` = 42)\nRETURN COUNT(DISTINCT `t1`.`license_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the facilities that have undergone at least one inspection in 2010, how many of them are in ward no.42?",
    "evidence": "in 2010 refers to inspection_date like '2010%'; in ward no.42 refers to ward = 42",
    "idx": 4750
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nMATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t3`:`establishment`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND `t2`.`license_no` = `t3`.`license_no`\nAND (`t3`.`dba_name` = 'Burbank' AND `t1`.`title` = 'Sanitarian')\nRETURN DISTINCT `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of all the sanitarians who have inspected the facility Burbank.",
    "evidence": "full name refers to first_name, last_name; the facility Burbank refers to dba_name = 'Burbank'",
    "idx": 4751
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[performed_at_0:performed_at]->(`t2`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`results` = 'Fail' AND CASE WHEN `t1`.`inspection_date` is not NULL THEN apoc.temporal.format(`t1`.`inspection_date`,'yyyy') ELSE NULL END = '2010')\nRETURN DISTINCT `t2`.`dba_name` AS `dba_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the assumed name of all the facilities that failed an inspection in 2010.",
    "evidence": "assumed name refers to dba_name; failed an inspection refers to results = 'Fail'; in 2010 refers to inspection_date like '2010%'",
    "idx": 4752
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`results` = 'Pass' AND `t1`.`first_name` = 'Joshua' AND `t1`.`last_name` = 'Rosa')\nRETURN COUNT(`t2`.`inspection_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the inspections done by sanitarian Joshua Rosa, how many of them have the result of \"pass\"?",
    "evidence": "have the result of \"pass\" refers to results = 'Pass'",
    "idx": 4754
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[performed_at_0:performed_at]->(`t2`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (CASE WHEN `t1`.`inspection_date` is not NULL THEN apoc.temporal.format(`t1`.`inspection_date`,'yyyy') ELSE NULL END = '2010' AND `t2`.`risk_level` = 3)\nRETURN COUNT(DISTINCT `t2`.`license_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the facilities that had undergone at least one inspection in 2010, how many of them have the most serious food safety issues?",
    "evidence": "in 2010 refers to inspection_date like '2010%'; the most serious food safety issues refers to risk_level = 3",
    "idx": 4756
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`inspection_point`:`inspection_point`)\nWHERE `inspection_point`.`description` = 'Refrigeration and metal stem thermometers provided and conspicuous '\nRETURN `inspection_point`.`point_level` AS `point_level`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the point level of \"Refrigeration and metal stem thermometers provided and conspicuous\"?",
    "evidence": "\"Refrigeration and metal stem thermometers provided and conspicuous\" refers to Description = 'Refrigeration and metal stem thermometers provided and conspicuous '",
    "idx": 4758
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[conducted_by_0:conducted_by]->(`t2`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t1`.`inspection_id` = 48224)\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which employee was responsible for inspection no.48224? Give the full name.",
    "evidence": "inspection no.48224 refers to inspection_id = '48224'; full name refers to first_name, last_name;",
    "idx": 4759
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`aka_name` = 'WING HUNG CHOP SUEY RESTAURANT')\nRETURN min(`t2`.`inspection_date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did Wing Hung Chop Suey Restaurant have its first inspection?",
    "evidence": "Wing Hung Chop Suey Restaurant refers to aka_name = 'WING HUNG CHOP SUEY RESTAURANT'; first inspection refers to min(inspection_date)",
    "idx": 4761
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH ()-[t2:has_violation]->(`t1`:`inspection_point`)\nWHERE `t1`.`point_id` = `t2`.`point_id`\nAND (`t2`.`inspection_id` = '1454071' AND `t1`.`category` = 'Food Maintenance')\nRETURN COUNT(`t2`.`point_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many \"food maintenance\" related violations did inspection no.1454071 have?",
    "evidence": "\"food maintenance\" related refers to category = 'Food Maintenance'; inspection no.1454071 refers to inspection_id = '1454071'",
    "idx": 4763
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nMATCH (`t2`:`inspection`)-[t3:has_violation]->()\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND `t2`.`inspection_id` = `t3`.`inspection_id`\nAND (`t2`.`inspection_date` = localdatetime('2015-05-08T00:00:00') AND `t1`.`dba_name` = 'ROYAL THAI CUISINE')\nRETURN COUNT(`t3`.`point_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of violations did Royal Thai Cuisine has during the 2015/5/8 inspection.",
    "evidence": "Royal Thai Cuisine refers to dba_name = 'ROYAL THAI CUISINE'; 2015/5/8 refers to inspection_date = '2015-05-08'",
    "idx": 4764
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`inspection`)-[conducted_by_1:conducted_by]->(`t2_sub0`:`employee`)\nWHERE `t1_sub0`.`employee_id` = `t2_sub0`.`employee_id`\nWITH `t2_sub0`.`employee_id` AS _groupby_col_0, `t2_sub0`.`first_name` AS _groupby_col_1, `t2_sub0`.`last_name` AS _groupby_col_2, COUNT(`t1_sub0`.`inspection_id`) AS _groupby_col_3\nRETURN _groupby_col_0 AS `employee_id`, _groupby_col_1 AS `first_name`, _groupby_col_2 AS `last_name`, _groupby_col_3 AS `_col_3` ORDER BY `_col_3` IS NULL ASC, `_col_3` DESC \nLIMIT 1\n}\nWITH *\nRETURN `first_name`, `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is responsible for most of the inspections? Give the full name.",
    "evidence": "full name refers to first_name, last_name; most of the inspections refers to max(count(employee_id))",
    "idx": 4766
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[conducted_by_0:conducted_by]->(`t2`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`first_name` = 'Lisa' AND `t2`.`last_name` = 'Tillman' AND `t1`.`results` = 'Out of Business')\nRETURN COUNT(`t1`.`inspection_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many inspections done by Lisa Tillman ended up with the result of \"Out of Business\"?",
    "evidence": "the result of \"Out of Business\" refers to results = 'Out of Business'",
    "idx": 4767
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[conducted_by_0:conducted_by]->(`t2`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`address` = '5000 N Wolcott Ave' AND `t2`.`title` = 'Sanitarian' AND CASE WHEN `t1`.`inspection_date` is not NULL THEN apoc.temporal.format(`t1`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2011-05')\nRETURN COUNT(`t1`.`inspection_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the sanitarian who lives on 5000 N Wolcott Ave, how many establishments did he/she inspect in the May of 2011?",
    "evidence": "sanitarian refers to title = 'Sanitarian'; 5000 N Wolcott Ave refers to address = '5000 N Wolcott Ave'; in May 2011 refers to inspection_date between '2011-04-30' and '2011-06-01'",
    "idx": 4768
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[conducted_by_0:conducted_by]->(`t2`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t1`.`inspection_id` = 634597 AND `t2`.`title` = 'Sanitarian')\nRETURN `t2`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the phone number of the sanitarian who was responsible for inspection no.634597.",
    "evidence": "phone number refers to phone; sanitarian refers to title = 'Sanitarian'; inspection no.634597 refers to inspection_id = '634597'",
    "idx": 4769
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL (*) {\nMATCH (`t_sub0`:`inspection`)\nWITH `t_sub0`.`employee_id` AS _groupby_col_0, COUNT(`t_sub0`.`inspection_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `employee_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nMATCH (`t1`:`employee`)\nWHERE `t1`.`employee_id` = `employee_id`\nRETURN `t1`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the salary of the employee who did the most inspections.",
    "evidence": "the most inspections refers to max(count(employee_id))",
    "idx": 4770
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`dba_name` = 'POCKETS' AND `t1`.`facility_type` = 'Restaurant')\nRETURN CASE WHEN COUNT(`t2`.`inspection_id`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t2`.`results` = 'Pass' THEN `t2`.`inspection_id` ELSE NULL END)) * 100 / COUNT(`t2`.`inspection_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the inspection pass rate of Pockets Restaurant.",
    "evidence": "Pockets refers to dba_name = 'POCKETS'; Restaurant refers to facility_type = 'Restaurant'; pass refers to results = 'Pass'; the inspection pass rate = divide(sum(inspection_id where results = 'Pass'), count(license_no)) where dba_name = 'POCKETS' and facility_type = 'Restaurant'",
    "idx": 4772
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`zip` = '60617'\nRETURN COUNT(`employee`.`employee_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many sanitarian employees in Chicago are from the zip code 60617?",
    "evidence": "sanitarian refers to title = 'Sanitarian'; in Chicago refers to city = 'Chicago'; zip code 60617 refers to zip = 60617",
    "idx": 4773
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t1`.`dba_name` = 'RENALDI\\'S PIZZA')\nRETURN min(`t2`.`inspection_date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did Renaldi's Pizza had its first inspection?",
    "evidence": "Renaldi's Pizza refers to dba_name = 'RENALDI''S PIZZA'; first inspection refers to min(inspection_date)",
    "idx": 4779
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`inspection`)\nWHERE CASE WHEN `t1_sub0`.`inspection_date` is not NULL THEN apoc.temporal.format(`t1_sub0`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2016-03'\nWITH `t1_sub0`.`employee_id` AS _groupby_col_0, COUNT(`t1_sub0`.`inspection_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `employee_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nMATCH (`t3`:`employee`)\nWHERE `employee_id` = `t3`.`employee_id`\nRETURN `t3`.`first_name` AS `first_name`, `t3`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the employee who was responsible for the most inspection in March 2016?",
    "evidence": "full name refers to first_name, last_name; the most inspection refers to max(count(employee_id)); in March 2016 refers to inspection_date like '2016-03%'",
    "idx": 4780
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t1`:`inspection`)-[performed_at_0:performed_at]->(`t2`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (CASE WHEN `t1`.`inspection_date` is not NULL THEN apoc.temporal.format(`t1`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2012-05' AND `t1`.`results` = 'Pass w/ Conditions')\nRETURN DISTINCT `t2`.`dba_name` AS `dba_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the businesses that passed with conditions in May 2012?",
    "evidence": "name of business refers to dba_name; passed with conditions refers to results = 'Pass w/ Conditions'; in May 2012 refers to inspection_date like '2012-05%'",
    "idx": 4781
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "WITH *, COLLECT { CALL (*) {\nMATCH (`inspection_sub0_sub0`:`inspection`)\nWHERE `inspection_sub0_sub0`.`results` = 'Fail'\nWITH `inspection_sub0_sub0`.`license_no` AS _groupby_col_0, COUNT(`inspection_sub0_sub0`.`results`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 5\nRETURN _groupby_col_0 AS `license_no`  \n}\nWITH *\nRETURN `license_no`   } AS in_collect_0\nMATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND (`t2`.`inspection_date` >= localdatetime('2010-01-01T00:00:00') AND `t2`.`inspection_date` <= localdatetime('2015-12-31T00:00:00') AND `t1`.`ward` = 42 AND `t1`.`license_no` IN in_collect_0)\nRETURN COUNT(DISTINCT `t1`.`license_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many businesses from ward 42 have at least 5 failed inspection results between 1/1/2010 to 12/31/2015?",
    "evidence": "ward 42 refers to ward = 42; at least 5 failed inspection results refers to count(results = 'Fail') > = 5; between 1/1/2010 to 12/31/2015 refers to inspection_date between '2010-01-01' and '2015-12-31'",
    "idx": 4783
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`inspection`)-[performed_at_1:performed_at]->(`t1_sub0`:`establishment`)\nMATCH (`t2_sub0`:`inspection`)-[t3_sub0:has_violation]->()\nWHERE `t1_sub0`.`license_no` = `t2_sub0`.`license_no`\nAND `t2_sub0`.`inspection_id` = `t3_sub0`.`inspection_id`\nAND (CASE WHEN `t2_sub0`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2_sub0`.`inspection_date`,'yyyy') ELSE NULL END = '2014')\nWITH `t1_sub0`.`dba_name` AS _groupby_col_0, sum(`t3_sub0`.`fine`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `dba_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `dba_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the assumed name of the business that has the highest total fine in 2014?",
    "evidence": "assumed name of business refers to dba_name; the highest total fine refers to max(sum(fine)); in 2014 refers to inspection_date like '2014%'",
    "idx": 4785
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL (*) {\nMATCH (`inspection_sub0`:`inspection`)\nWHERE `inspection_sub0`.`results` = 'Fail'\nWITH `inspection_sub0`.`license_no` AS _groupby_col_0, COUNT(`inspection_sub0`.`results`) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `license_no`  LIMIT 1\n}\nMATCH (`t1`:`establishment`)\nWHERE `t1`.`license_no` = `license_no`\nRETURN `t1`.`latitude` AS `latitude`, `t1`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the precise location of the establishment with the highest number of failed inspections?",
    "evidence": "precise location refers to latitude, longitude; the highest number of failed inspections refers to max(count(results where results = 'Fail'))",
    "idx": 4786
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nMATCH (`t2`:`inspection`)-[t3:has_violation]->()\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND `t2`.`inspection_id` = `t3`.`inspection_id`\nAND (CASE WHEN `t2`.`inspection_date` is not NULL THEN apoc.temporal.format(`t2`.`inspection_date`,'yyyy-MM') ELSE NULL END = '2014-02' AND `t1`.`dba_name` = 'RON OF JAPAN INC')\nRETURN sum(`t3`.`fine`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the total fine given to Ron of Japan Inc in its inspection done on February 2014?",
    "evidence": "total fine = sum(fine); Ron of Japan Inc refers to dba_name = 'RON OF JAPAN INC'; on February 2014 refers to inspection_date like '2014-02%'",
    "idx": 4788
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[performed_at_0:performed_at]->(`t1`:`establishment`)\nMATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t3`:`employee`)\nWHERE `t1`.`license_no` = `t2`.`license_no`\nAND `t2`.`employee_id` = `t3`.`employee_id`\nAND (`t1`.`dba_name` = 'TAQUERIA LA PAZ')\nRETURN DISTINCT `t3`.`first_name` AS `first_name`, `t3`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names of the employees who were responsible for inspecting Taqueria La Paz.",
    "evidence": "full name refers to first_name, last_name; Taqueria La Paz refers to dba_name = 'TAQUERIA LA PAZ'",
    "idx": 4789
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`inspection`)-[conducted_by_1:conducted_by]->(`t1_sub0`:`employee`)\nMATCH (`t2_sub0`:`inspection`)-[t3_sub0:has_violation]->()\nWHERE `t1_sub0`.`employee_id` = `t2_sub0`.`employee_id`\nAND `t2_sub0`.`inspection_id` = `t3_sub0`.`inspection_id`\nWITH `t1_sub0`.`first_name` AS _groupby_col_0, `t1_sub0`.`last_name` AS _groupby_col_1, sum(`t3_sub0`.`fine`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`, _groupby_col_2 AS `_col_2` ORDER BY `_col_2` IS NULL ASC, `_col_2` DESC \nLIMIT 1\n}\nWITH *\nRETURN `first_name`, `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the employee who gave the highest amount of fine of all time?",
    "evidence": "full name refers to first_name, last_name; the highest amount of fine refers to max(sum(fine))",
    "idx": 4790
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (`t2`:`inspection`)-[conducted_by_0:conducted_by]->(`t1`:`employee`)\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t1`.`title` = 'Sanitarian')\nORDER BY `t1`.`salary` IS NULL ASC, `t1`.`salary` DESC \nRETURN CASE WHEN 5=0 THEN NULL ELSE toFloat(COUNT(DISTINCT `t2`.`inspection_id`)) / 5 END AS `_col_0`, `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of inspections done by the top 5 employees with the highest salary? List the names of the said employees.",
    "evidence": "the highest salary refers to max(salary); sanitarian refers to title = 'Sanitarian'; name refers to first_name, last_name; average number = divide(sum(inspection_id), 5)",
    "idx": 4791
  }
]