[
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`gender_bio` = 'F' AND CASE WHEN `t1`.`birthday_bio` is not NULL THEN apoc.temporal.format(`t1`.`birthday_bio`,'yyyy') ELSE NULL END >= '1930' AND CASE WHEN `t1`.`birthday_bio` is not NULL THEN apoc.temporal.format(`t1`.`birthday_bio`,'yyyy') ELSE NULL END <= '1970')\nRETURN sum(CASE  WHEN `t2`.`type` = 'sen' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t2`.`type` = 'rep' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the difference between the number of female senators and representatives born between 1930 to 1970.",
    "evidence": "difference = SUBTRACT(SUM(type = 'sen' WHERE gender_bio = 'F' AND strftime('%Y', birthday_bio) between '1930' and '1970'), SUM(type = 'rep' WHERE gender_bio = 'F' AND strftime('%Y', birthday_bio) between '1930' and '1970')); female refers to gender_bio = 'F'; senators refers to type = 'sen'; representatives refers to type = 'rep'; born between 1930 to 1970 strftime('%Y', birthday_bio) between '1930' and '1970';",
    "idx": 3744
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`gender_bio` = 'M' AND CASE WHEN `t1`.`birthday_bio` is not NULL THEN apoc.temporal.format(`t1`.`birthday_bio`,'yyyy') ELSE NULL END >= '1955' AND CASE WHEN `t1`.`birthday_bio` is not NULL THEN apoc.temporal.format(`t1`.`birthday_bio`,'yyyy') ELSE NULL END <= '1965')\nRETURN CASE WHEN COUNT(`t2`.`party`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`party` = 'Independent' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`party`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the male legislators born between 1955 to 1965, what is the percentage of the legislators with an independent party?",
    "evidence": "male refers to gender_bio = 'M'; born between 1955 to 1965 refers to strftime('%Y', birthday_bio) between '1955' and '1965'; percentage = MULTIPLY(DIVIDE(SUM(party = 'Independent' WHERE gender_bio = 'M' AND strftime('%Y', birthday_bio) between '1955' and '1965'), COUNT(party WHERE gender_bio = 'M' AND strftime('%Y', birthday_bio) between '1955' and '1965')), 100.0);",
    "idx": 3745
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nWHERE `historical`.`bioguide_id` = 'W000059'\nRETURN `historical`.`first_name` AS `first_name`, `historical`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the legislator with the ID of W000059?",
    "evidence": "name of the legislator = first_name, last_name; ID of W000059 refers to bioguide_id = 'W000059';",
    "idx": 3746
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nWHERE `historical`.`first_name` = 'Thomas' AND `historical`.`last_name` = 'Carnes'\nRETURN CASE  WHEN `historical`.`ballotpedia_id` IS NULL THEN 'doesn\\'t have' ELSE 'have' END AS `haveornot`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Does Thomas Carnes have an account on ballotpedia.org?",
    "evidence": "if first_name = 'Thomas' and last_name = 'Carnes' AND ballotpedia_id is null then Thomas Carnes doesn't have an account on ballotpedia.org; if first_name = 'Thomas' and last_name = 'Carnes' AND ballotpedia_id is NOT null then Thomas Carnes have an account on ballotpedia.org;",
    "idx": 3747
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nWHERE `historical`.`birthday_bio` =~ '(?i)(?s)1736.*'\nRETURN COUNT(`historical`.`bioguide_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many legislators were born in 1736?",
    "evidence": "born in 1736 refers to birthday_bio like '1736%';",
    "idx": 3748
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nWHERE `historical`.`gender_bio` = 'F'\nRETURN `historical`.`first_name` AS `first_name`, `historical`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which legislators are woman?",
    "evidence": "woman refers to gender_bio = 'F';",
    "idx": 3749
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current-terms`:`current-terms`)\nWHERE `current-terms`.`state` = 'ID'\nRETURN COUNT(`current-terms`.`district`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many districts are in Idaho?",
    "evidence": "Idaho refers to state = 'ID';",
    "idx": 3750
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current-terms`:`current-terms`)\nWHERE `current-terms`.`class` IS NULL\nRETURN COUNT(`current-terms`.`bioguide`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many legislators are not senator?",
    "evidence": "not senator refers to class is null;",
    "idx": 3751
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nRETURN CASE WHEN sum(CASE  WHEN `historical`.`gender_bio` = 'F' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `historical`.`gender_bio` = 'M' THEN 1 ELSE 0 END)) / sum(CASE  WHEN `historical`.`gender_bio` = 'F' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ratio between male and female legislators?",
    "evidence": "ratio = DIVIDE(SUM(gender_bio = 'M'),  SUM(gender_bio = 'F')); male refers to gender_bio = 'M'; female refers to gender_bio = 'F'",
    "idx": 3752
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nRETURN CASE WHEN COUNT(`historical`.`bioguide_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN NOT `historical`.`wikipedia_id` IS NULL THEN 1 ELSE 0 END)) * 100 / COUNT(`historical`.`bioguide_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of famous_legislatorss.",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(wikipedia_id is not null), (bioguide_id)), 100.0); famous legislators refers to wikipedia_id is not null;",
    "idx": 3753
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`instagram` IS NULL)\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which legislators do not have instagram account?",
    "evidence": "do not have instagram account refers to instagram is null;",
    "idx": 3754
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`start` =~ '(?i)(?s)1789.*')\nRETURN `t2`.`district` AS `district`, `t2`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the representatives in 1789 along with the districts and state.",
    "evidence": "representatives refers to type = 'rep'; in 1789 refers to start like '1789%';",
    "idx": 3755
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`first_name` = 'Benjamin' AND `t1`.`last_name` = 'Contee')\nRETURN `t2`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State all the district that Benjamin Contee has served before.",
    "evidence": "",
    "idx": 3756
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`first_name` = 'Amy' AND `t1`.`last_name` = 'Klobuchar' AND `t2`.`start` = '2001-04-01')\nRETURN `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the address of Amy Klobuchar at the term of 4th of January 2001.",
    "evidence": "at the term of 4th of January 2001 refers to start = '2001-04-01';",
    "idx": 3757
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`start` =~ '(?i)(?s)1997.*' AND `t2`.`state_rank` = 'junior')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the junior senators in 1997.",
    "evidence": "junior senators refers to state_rank = 'junior'; in 1997 refers to start like '1997%';",
    "idx": 3758
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END = '2015' AND `t2`.`state` = 'CA' AND `t1`.`gender_bio` = 'F')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many female legislators become representatives for California in 2015?",
    "evidence": "female legislators refers to gender_bio = 'F'; representatives refers to type = 'rep'; for California refers to state = 'CA'; in 2015 refers to the year of start date is '2015';",
    "idx": 3759
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t2`.`first_name` = 'Emanuel' AND `t2`.`last_name` = 'Cleaver')\nRETURN `t1`.`twitter_id` AS `twitter_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the Twitter ID of Emanuel Cleaver?",
    "evidence": "",
    "idx": 3760
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`social-media`)\nMATCH (`t1`:`current-terms`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide`\nAND (`t1`.`party` = 'Democrat')\nWITH `t2`.`facebook_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `facebook_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State all the Facebook ID for current legislators under the democrat party.",
    "evidence": "",
    "idx": 3761
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`end` = '1791-03-03' AND `t1`.`gender_bio` = 'F')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which historical female legislator that have their term ended on the 3rd of March 1791?",
    "evidence": "female legislator refers to gender_bio = 'F'; term ended on the 3rd of March 1791 refers to end = '1791-03-03';",
    "idx": 3762
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`religion_bio` = 'Jewish' AND `t2`.`state` = 'FL')\nWITH `t1`.`first_name` AS _groupby_col_0, `t1`.`last_name` AS _groupby_col_1\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the Jewish current legislators that had served in Florida.",
    "evidence": "Jewish refers to religion_bio = 'Jewish'; in Florida refers to state = 'FL';",
    "idx": 3763
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nRETURN CASE WHEN COUNT(`t1`.`bioguide_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END >= '2000' AND CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END <= '2017' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`bioguide_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Based on the number of current legislators, calculate the percentage of legislators that served in 21st-Century.",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(strftime('%Y', start) between '2000' and '2017'), COUNT(bioguide_id)), 100.0); 1st-Century refers to strftime('%Y', T2.start) between '2000' and '2017';",
    "idx": 3764
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nWHERE `historical`.`religion_bio` = 'Catholic' AND `historical`.`ballotpedia_id` IS NULL\nRETURN COUNT(`historical`.`bioguide_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Catholic legislators do not have an account on ballotpedia.org?",
    "evidence": "Catholic refers to religion_bio = 'Catholic'; do not have an account on ballotpedia.org refers to ballotpedia_id is null;",
    "idx": 3765
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current-terms`:`current-terms`)\nWHERE `current-terms`.`class` = 1 AND `current-terms`.`party` = 'Republican'\nRETURN COUNT(`current-terms`.`bioguide`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many class 1 senators belong to the Republican party?",
    "evidence": "senators refers to type = 'sen';",
    "idx": 3766
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nWHERE `historical`.`gender_bio` = 'F' AND `historical`.`google_entity_id_id` IS NULL AND `historical`.`fec_id` IS NULL\nRETURN `historical`.`first_name` AS `first_name`, `historical`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the full names of the non-google female entity legislators that have not been registered in Federal Election Commission data?",
    "evidence": "full names = first_name, last_name; non-google entity refers to google_entity_id_id is null; female refers to gender_bio = 'F'; have not been registered in Federal Election Commission data refers to fec_id is null;",
    "idx": 3767
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current-terms`:`current-terms`)\nWHERE `current-terms`.`state` = 'CA' AND `current-terms`.`type` = 'rep' AND `current-terms`.`end` =~ '(?i)(?s)1995.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In California, how many representatives ended their term in 1995?",
    "evidence": "California refers to state = 'CA'; representatives refers to type = 'rep'; ended the term in 1995 refers to end like '1995%';",
    "idx": 3768
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nORDER BY `historical`.`birthday_bio` IS NULL DESC, `historical`.`birthday_bio`  \nRETURN `historical`.`first_name` AS `first_name`, `historical`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the oldest legislator?",
    "evidence": "full name = first_name, last_name; oldest legislator refers to MIN(birthday_bio);",
    "idx": 3769
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current-terms`:`current-terms`)\nWHERE `current-terms`.`type` = 'rep' AND `current-terms`.`party` = 'Democrat' AND `current-terms`.`end` = '2019-01-03' AND `current-terms`.`district` = 13\nRETURN `current-terms`.`bioguide` AS `bioguide`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of the ids of the representatives belonging to the Democrat party in district 13 that ended their term on 1/3/2019?",
    "evidence": "ids refers to bioguide; representatives refers to type = 'rep'; ended the term on 1/3/2019 refers to end = '2019-01-03';",
    "idx": 3770
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`official_full_name` = 'Jason Lewis')\nRETURN `t2`.`twitter` AS `twitter`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the official Twitter handle of Jason Lewis?",
    "evidence": "official Twitter handle refers to twitter;",
    "idx": 3771
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`party` = 'Independent' AND CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END >= '2011' AND `t2`.`type` = 'sen' AND `t2`.`caucus` = 'Democrat')\nRETURN `t1`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the Independent senators that started their term in 2011 and onwards, what are the official full names of the senators that caucused with the Democrat?",
    "evidence": "Independent refers to party = 'Independent'; senators refers to type = 'sen'; started the term in 2011 and onwards refers to strftime('%Y', start) > = '2011'; caucused with the Democrat refers to caucus = 'Democrat';",
    "idx": 3772
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`current`)-[has_social_media_1:has_social_media]->(`t2_sub0`:`social-media`)\nWHERE `t1_sub0`.`bioguide_id` = `t2_sub0`.`bioguide`\nAND (`t2_sub0`.`facebook` IS NULL)\nWITH `t1_sub0`.`bioguide_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `bioguide_id`  \n}\nWITH *\nRETURN COUNT(`bioguide_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Jewish legislators do not have facebook?",
    "evidence": "Jewish legislators refers to religion_bio = 'Jewish'; do not have facebook refers to facebook is null;",
    "idx": 3773
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (NOT `t2`.`facebook` IS NULL AND NOT `t2`.`instagram` IS NULL AND NOT `t2`.`twitter` IS NULL AND NOT `t2`.`youtube` IS NULL)\nRETURN `t1`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the official full names of all the legislators who have facebook, instagram, twitter and youtube accounts.",
    "evidence": "have facebook, instagram, twitter and youtube accounts refers to 'facebook' is not null AND 'instagram' is not null AND 'twitter' is not null AND 'youtube' is not null;",
    "idx": 3774
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`current`)-[has_term_1:has_term]->(`t2_sub0`:`current-terms`)\nWHERE `t1_sub0`.`bioguide_id` = `t2_sub0`.`bioguide`\nAND (`t1_sub0`.`official_full_name` = 'John Conyers, Jr.')\nWITH `t2_sub0`.`district` AS _groupby_col_0\nRETURN _groupby_col_0 AS `district`  \n}\nWITH *\nRETURN COUNT(`district`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many districts did John Conyers, Jr. serve in total?",
    "evidence": "",
    "idx": 3775
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`type` = 'sen' AND `t2`.`party` = 'Anti-Administration')\nRETURN `t1`.`wikipedia_id` AS `wikipedia_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the Wikipedia page names of all the anti-administration senators?",
    "evidence": "Wikipedia page names refers to wikipedia_id; anti-administration refers to party = 'Anti-Administration'; senators refers to type = 'sen';",
    "idx": 3776
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`historical`)-[has_term_1:has_term]->(`t2_sub0`:`historical-terms`)\nWHERE `t1_sub0`.`bioguide_id` = `t2_sub0`.`bioguide`\nAND (`t1_sub0`.`first_name` = 'Benjamin' AND `t2_sub0`.`party` = 'Federalist' AND `t2_sub0`.`type` = 'rep')\nWITH `t1_sub0`.`bioguide_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `bioguide_id`  \n}\nWITH *\nRETURN COUNT(`bioguide_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Federalist representatives are there whose first names are Benjamin?",
    "evidence": "Federalist refers to party = 'Federalist'; representatives refers to type = 'rep';",
    "idx": 3777
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`current`)-[has_term_1:has_term]->(`t2_sub0`:`current-terms`)\nWHERE `t1_sub0`.`bioguide_id` = `t2_sub0`.`bioguide`\nAND (`t1_sub0`.`gender_bio` = 'F' AND `t2_sub0`.`state` = 'CA' AND `t2_sub0`.`type` = 'rep')\nRETURN CASE  WHEN sum(toInteger(CASE WHEN `t2_sub0`.`end` is not NULL THEN apoc.temporal.format(`t2_sub0`.`end`,'yyyy') ELSE NULL END) - toInteger(CASE WHEN `t2_sub0`.`start` is not NULL THEN apoc.temporal.format(`t2_sub0`.`start`,'yyyy') ELSE NULL END)) > 10 THEN 1 ELSE 0 END AS `result`  \n}\nWITH *\nRETURN sum(`result`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many female representatives served in the state of California for at least 10 years?",
    "evidence": "female refers to gender_bio = 'F'; representatives refers to type = 'rep'; served for at least 10 years refers to SUBTRACT(SUM(CAST(strftime('%Y', end)), CAST(strftime('%Y', start)))) > 10;",
    "idx": 3778
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`historical`)-[has_term_0:has_term]->(`t1`:`historical-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nORDER BY `t2`.`birthday_bio` IS NULL DESC, `t2`.`birthday_bio`  \nRETURN `t1`.`party` AS `party`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the party of the oldest legislator?",
    "evidence": "oldest legislator refers to MIN(birthday_bio);",
    "idx": 3779
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE CASE WHEN `current`.`birthday_bio` is not NULL THEN apoc.temporal.format(`current`.`birthday_bio`,'yyyy') ELSE NULL END > '1960' AND `current`.`google_entity_id_id` IS NULL\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the current legislators born after the year 1960, how many of them are not google entities?",
    "evidence": "born after the year 1960 refers to strftime('%Y', birthday_bio) > '1960'; not google entities refers to google_entity_id_id is null;",
    "idx": 3780
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE NOT `current`.`house_history_id` IS NULL\nRETURN `current`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the official full names of all the current legislators who have served in the U.S. House.",
    "evidence": "have served in the U.S. House refers to house_history_id is not null;",
    "idx": 3781
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE NOT `current`.`icpsr_id` IS NULL AND NOT `current`.`maplight_id` IS NULL\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many current legislators have both accounts on both VoteView.com and maplight.org?",
    "evidence": "have both accounts on both VoteView.com and maplight.org refers to icpsr_id is not null AND maplight_id is not null;",
    "idx": 3782
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`gender_bio` = 'F' AND NOT `current`.`lis_id` IS NULL\nRETURN COUNT(`current`.`lis_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the current female legislators, how many of them have attended in Senate roll call votes?",
    "evidence": "female refers to gender_bio = 'F'; have attended in Senate roll call votes refers to lis_id is not null;",
    "idx": 3783
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`official_full_name` = 'Sherrod Brown'\nRETURN `current`.`religion_bio` AS `religion_bio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the religion of current legislator Sherrod Brown?",
    "evidence": "religion refers to religion_bio;",
    "idx": 3784
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`official_full_name` = 'Bob Corker')\nRETURN `t2`.`instagram` AS `instagram`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the current official Instagram handle of current legislator Bob Corker?",
    "evidence": "official Instagram handle refers to instagram;",
    "idx": 3785
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (NOT `t1`.`thomas_id` IS NULL AND NOT `t2`.`instagram` IS NULL)\nRETURN COUNT(DISTINCT `t1`.`bioguide_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the current legislators who have accounts on both http://thomas.gov, how many of them have accounts on instagram?",
    "evidence": "have accounts on both http://thomas.gov refers to thomas_id is NOT null; have accounts on instagram refers to instagram is not null;",
    "idx": 3786
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (NOT `t1`.`wikipedia_id` IS NULL)\nWITH `t2`.`facebook` AS _groupby_col_0\nRETURN _groupby_col_0 AS `facebook`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the username of the current official Facebook presence of all the current legislators that are famous or impact.",
    "evidence": "username of the current official Facebook presence of the legislators refers to facebook; legislators that are famous or impact refers to wikipedia_id is not null;",
    "idx": 3787
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "CALL(*) {\nMATCH (`current_sub0`:`current`)\nRETURN min(`current_sub0`.`birthday_bio`) AS `_col_0_1`  \n}\nMATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`birthday_bio` = `_col_0_1`)\nRETURN COUNT(`t2`.`bioguide`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how many terms have the oldest current legislator served?",
    "evidence": "oldest legislator refers to MIN(birthday_bio);",
    "idx": 3788
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_term_0:has_term]->(`t1`:`current-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t2`.`official_full_name` = 'Sherrod Brown' AND `t1`.`start` = '2013-01-03')\nRETURN `t1`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was current legislator Sherrod Brown's Washington, D.C. office phone number during his term starting on 2013/1/3?",
    "evidence": "Washington, DC office phone number refers to phone; terms starting on 2013/1/3 refers to start = '2013-01-03';",
    "idx": 3789
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`official_full_name` = 'Sherrod Brown' AND `t2`.`party` = 'Democrat')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Current legislator Sherrod Brown has been in the Democrat party during how many terms that he has served?",
    "evidence": "",
    "idx": 3790
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`start` = '2013-01-03')\nRETURN `t1`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full official names of all the current legislators who served the term that started on 2013/1/3.",
    "evidence": "term that started on 2013/1/3 refers to start = '2013-01-03';",
    "idx": 3791
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`start` = '2013-01-03' AND `t1`.`gender_bio` = 'F')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the current legislators who served the term starting on 2013/1/3, how many of them are female?",
    "evidence": "term starting on 2013/1/3 refers to start = '2013-01-03; female refers to gender_bio = 'F';",
    "idx": 3792
  }
]