[
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t2`.`start_station_name` = `t1`.`name`\nAND (toFloat(CASE WHEN (apoc.text.indexOf(`t2`.`start_date`,'/') + 1) + 1-1 < 0 THEN substring(toString(`t2`.`start_date`),size(toString(`t2`.`start_date`))+1+((apoc.text.indexOf(`t2`.`start_date`,'/') + 1) + 1-1)) ELSE substring(toString(`t2`.`start_date`),(apoc.text.indexOf(`t2`.`start_date`,'/') + 1) + 1-1) END) - toFloat(CASE WHEN (apoc.text.indexOf(`t2`.`start_date`,' ') + 1) - 5-1 < 0 THEN substring(toString(`t2`.`start_date`),size(toString(`t2`.`start_date`))+1+((apoc.text.indexOf(`t2`.`start_date`,' ') + 1) - 5-1)) ELSE substring(toString(`t2`.`start_date`),(apoc.text.indexOf(`t2`.`start_date`,' ') + 1) - 5-1) END) <> toFloat(CASE WHEN (apoc.text.indexOf(`t2`.`end_date`,'/') + 1) + 1-1 < 0 THEN substring(toString(`t2`.`end_date`),size(toString(`t2`.`end_date`))+1+((apoc.text.indexOf(`t2`.`end_date`,'/') + 1) + 1-1)) ELSE substring(toString(`t2`.`end_date`),(apoc.text.indexOf(`t2`.`end_date`,'/') + 1) + 1-1) END) - toFloat(CASE WHEN (apoc.text.indexOf(`t2`.`end_date`,' ') + 1) - 5-1 < 0 THEN substring(toString(`t2`.`end_date`),size(toString(`t2`.`end_date`))+1+((apoc.text.indexOf(`t2`.`end_date`,' ') + 1) - 5-1)) ELSE substring(toString(`t2`.`end_date`),(apoc.text.indexOf(`t2`.`end_date`,' ') + 1) - 5-1) END))\nRETURN DISTINCT `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all the trips where the bike was borrowed and returned on a different day. State the city where the bike was returned.",
    "evidence": "the bike was borrowed and returned on a different day implies that start_date and end_date are not equal to each other; where the bike was returned refers to end_station_name;",
    "idx": 6895
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`station`)\nMATCH (`t2`:`status`)\nWHERE `t2`.`station_id` = `t1`.`id`\nAND (`t2`.`time` = '2013/11/03 02:01:01' AND `t2`.`bikes_available` = 0)\nRETURN `t1`.`name` AS `name`, `t1`.`long` AS `long`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which is the station where no bike could not be borrowed form on the 2013/11/03 02:01:01? State the location of the station.",
    "evidence": "Latitude and longitude coordinates can be used to indicate a location, where latitude refers to lat longtitude refer to long; bikes_available = 0 means no bike can be borrowed; 3/11/2013 02:01:01 refers to time;",
    "idx": 6896
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code` AND `t2`.`date` = CASE  WHEN 1-1 < 0 AND (apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 < 0  THEN substring(toString(`t1`.`start_date`),(case when size(toString(`t1`.`start_date`))+1+(1-1)+(apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 < 0 then 0 else size(toString(`t1`.`start_date`))+1+(1-1)+(apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 end),-((apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1))  WHEN 1-1 < 0 AND (apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 >= 0  THEN substring(toString(`t1`.`start_date`),size(toString(`t1`.`start_date`))+1+(1-1),(apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1)  WHEN 1-1 >= 0 AND (apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 < 0  THEN substring(toString(`t1`.`start_date`),(case when 1-1+1+((apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1) < 0 then 0 else 1-1+1+((apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1) end),-((apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1))  ELSE substring(toString(`t1`.`start_date`),1-1,(apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1) END\nAND (`t1`.`id` = 4080)\nRETURN MAX(`t2`.`max_temperature_f`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the hottest temperature on the day of trip ID 4080?",
    "evidence": "the hottest temperature refers to max_temperature_f;",
    "idx": 6897
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t2`.`end_station_name` = `t1`.`name`\nAND (`t1`.`lat` = 37.331415 AND `t1`.`long` = -121.8932)\nRETURN `t2`.`end_station_name` AS `end_station_name`, `t2`.`start_date` AS `start_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all trips where bikes were returned at location 37.331415, -121.8932. State the date the bike was borrowed.",
    "evidence": "37.331415 and -121.8932 are latitude (lat) and longitude (long) coordinates indicating location; returned at refers to end_station_name; the date the bike was borrowed refers to start_date;",
    "idx": 6899
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t2`.`start_station_name` = `t1`.`name`\nAND (`t2`.`start_date` =~ '(?i)(?s)8/.*/2013.*' AND `t1`.`city` = 'Redwood City')\nRETURN COUNT(`t2`.`start_date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the trips in August 2013, how many bikes were borrowed from Redwood City.",
    "evidence": "Redwood City is the name of the city; trips in August 2013 refers to start_date like '8%2013%';",
    "idx": 6900
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t1`.`duration` < 300)\nRETURN `t1`.`start_station_name` AS `start_station_name`, `t1`.`end_station_name` AS `end_station_name`, `t2`.`mean_temperature_f` AS `mean_temperature_f`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all trips which took less 5 minutes, state the station name where the bike were borrowed and returned. Indicate mean temperature of the day.",
    "evidence": "less than 5 minutes refers to duration<300 in seconds; the station where the bike was borrowed refers to start_station_name; the station where the bike was returned refers to end_station_name; mean temperature refers to min_temperature_f;",
    "idx": 6901
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (CASE  WHEN 1-1 < 0 AND (apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1 < 0  THEN substring(toString(`t2`.`date`),(case when size(toString(`t2`.`date`))+1+(1-1)+(apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1 < 0 then 0 else size(toString(`t2`.`date`))+1+(1-1)+(apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1 end),-((apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1))  WHEN 1-1 < 0 AND (apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1 >= 0  THEN substring(toString(`t2`.`date`),size(toString(`t2`.`date`))+1+(1-1),(apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1)  WHEN 1-1 >= 0 AND (apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1 < 0  THEN substring(toString(`t2`.`date`),(case when 1-1+1+((apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1) < 0 then 0 else 1-1+1+((apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1) end),-((apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1))  ELSE substring(toString(`t2`.`date`),1-1,(apoc.text.indexOf(`t2`.`date`,'/') + 1) - 1) END IN ['7', '8', '9'] AND CASE WHEN -4-1 < 0 THEN substring(toString(`t2`.`date`),size(toString(`t2`.`date`))+1+(-4-1)) ELSE substring(toString(`t2`.`date`),-4-1) END = '2013')\nRETURN avg(`t1`.`duration`) AS `_col_0`, avg(`t2`.`wind_dir_degrees`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average usage of each bike in the third quarter of year 2013. Find the average wind direction within the same period.",
    "evidence": "the third quarter of year 2013 implies 3 month interval, including July, August, and September of 2013 and refers to date; the average usage of each bike = DIVIDE(SUM(duration), COUNT(bike_id)); the average wind direction = DIVIDE(SUM(wind_dir_degrees), COUNT(date));",
    "idx": 6902
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`station`:`station`)\nRETURN sum(CASE  WHEN `station`.`city` = 'San Jose' AND CASE WHEN -4-1 < 0 THEN substring(`station`.`installation_date`,size(`station`.`installation_date`)+1+(-4-1)) ELSE substring(`station`.`installation_date`,-4-1) END = '2014' THEN 1 ELSE 0 END) AS `_col_0`   \nUNION DISTINCT\nMATCH (`station`:`station`)\nWHERE `station`.`city` = 'San Jose' AND CASE WHEN -4-1 < 0 THEN substring(`station`.`installation_date`,size(`station`.`installation_date`)+1+(-4-1)) ELSE substring(`station`.`installation_date`,-4-1) END = '2014'\nRETURN `station`.`name` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many bike stations were installed in San Jose in 2014? Indicate the names of the stations.",
    "evidence": "San Jose is the name of the city; 2014 refers to installation_date between '1/1/2014' and '12/31/2014';",
    "idx": 6903
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nWHERE `trip`.`start_date` =~ '(?i)(?s)8/29/2013.*' AND `trip`.`end_date` =~ '(?i)(?s)8/29/2013.*'\nRETURN MAX(`trip`.`duration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the longest trip duration that started and ended August 29, 2013?",
    "evidence": "started and ended August 29, 2013 refers to start_date = '8/29/2013' and end_date = '8/29/2013';",
    "idx": 6904
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nWHERE `trip`.`bike_id` = 426 AND `trip`.`end_station_name` = '2nd at South Park' AND `trip`.`start_station_name` = 'Market at 4th' AND `trip`.`start_date` =~ '(?i)(?s)8/29/2013.*' AND `trip`.`end_date` =~ '(?i)(?s)8/29/2013.*'\nRETURN CASE WHEN 60=0 THEN NULL ELSE toFloat(`trip`.`duration`) / 60 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How long did it take for bike id 426 to reach 2nd at South Park from Market at 4th on 8/29/2013? Indicate the duration in minutes.",
    "evidence": "duration in minutes refers to DIVIDE(duration, 60 seconds); 2nd at South Park refers to end_station_name; Market at 4th refers to start_station_name; start_date = '8/29/2013'; end_date = '8/29/2013';",
    "idx": 6905
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "CALL(*) {\nMATCH (`trip_sub0`:`trip`)\nWHERE `trip_sub0`.`start_date` =~ '(?i)(?s)8/29/2013.*' AND `trip_sub0`.`end_date` =~ '(?i)(?s)8/29/2013.*' AND `trip_sub0`.`end_station_name` = 'California Ave Caltrain Station' AND `trip_sub0`.`start_station_name` = 'University and Emerson'\nRETURN MAX(`trip_sub0`.`duration`) AS `_col_0`  \n}\nMATCH (`trip`:`trip`)\nWHERE `trip`.`start_date` =~ '(?i)(?s)8/29/2013.*' AND `trip`.`end_date` =~ '(?i)(?s)8/29/2013.*' AND `trip`.`end_station_name` = 'California Ave Caltrain Station' AND `trip`.`start_station_name` = 'University and Emerson' AND `trip`.`duration` = `_col_0`\nRETURN `trip`.`bike_id` AS `bike_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On 8/29/2013, who took the longest to arrive in California Ave Caltrain Station from University and Emerson? Indicate the bike id.",
    "evidence": "start_date = '8/29/2013'; end_date = '8/29/2013'; end_station_name = 'California Ave Caltrain Station'; start_station_name = 'University and Emerson'; who took the longest to arrive refers to MAX(duration);",
    "idx": 6906
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`station`:`station`)\nRETURN sum(CASE  WHEN `station`.`city` = 'San Francisco' AND `station`.`dock_count` > 20 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many stations in San Francico can hold more than 20 bikes?",
    "evidence": "San Francico is the name of the city; can hold more than 20 bikes implies dock's capacity and refers to dock_count≥20;",
    "idx": 6907
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "CALL(*) {\nMATCH (`weather_sub0`:`weather`)\nWHERE NOT `weather_sub0`.`max_temperature_f` IS NULL AND NOT `weather_sub0`.`max_temperature_f` = ''\nRETURN MAX(`weather_sub0`.`max_temperature_f`) AS `_col_0`  \n}\nMATCH (`weather`:`weather`)\nWHERE `weather`.`max_temperature_f` = `_col_0`\nRETURN `weather`.`max_temperature_f` AS `max_temperature_f`, `weather`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was the hottest temperature recorded? If there are multiple dates with the hottest temperature, indicate all of the dates.",
    "evidence": "the hottest temperature refers to max_temperature_f;",
    "idx": 6908
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`weather`:`weather`)\nRETURN DISTINCT CASE  WHEN `weather`.`date` = '7/15/2014' AND `weather`.`zip_code` = '94301' THEN `weather`.`max_dew_point_f`  END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the maximum dew point in Fahrenheit degree on 7/15/2014 in the area with a zip code of 94301?",
    "evidence": "the maximum dew point in Fahrenheit degree refers to max_dew_point_f; date = '7/15/2014';",
    "idx": 6909
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t2`.`start_station_name` = `t1`.`name`\nAND (`t2`.`start_date` =~ '(?i)(?s)10/20/2014.*' AND `t1`.`lat` = 37.789625 AND `t1`.`long` = -122.400811)\nRETURN min(`t2`.`duration`) AS `_col_0`, `t2`.`bike_id` AS `bike_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On 10/20/2014, what is the duration of the fastest trip which started from the station with latitude and longitudes of 37.789625 and -122.400811, respectively? Indicate the bike id.",
    "evidence": "lat = '37.789625' and long = '-122.400811' are latitude and longitude coordinates indicating location; started from the station refers to start_station_name; start_date = '10/20/2014'; duration of the fastest trip refers to MIN(duration);",
    "idx": 6910
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t2`.`start_station_name` = `t1`.`name`\nAND (`t2`.`start_date` =~ '(?i)(?s)12/1/2013.*' AND `t2`.`start_station_name` = 'South Van Ness at Market' AND `t2`.`subscription_type` = 'Subscriber')\nRETURN min(`t2`.`duration`) AS `_col_0`, `t2`.`end_station_name` AS `end_station_name`, COUNT(`t2`.`start_station_name`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the subscribers who rented a bike from South Van Ness at Market on 12/1/2013, whose duration was the shortest and to which station was the bike returned to? Indicate South Van Ness's dock count.",
    "evidence": "South Van Ness at Market refers to start_station_name; subscriber refers to subscription_type; start_date = '12/1/2013'; the shortest duration refers to MIN(duration); which station was the bike returned to refers to end_station_name;",
    "idx": 6911
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t1`.`start_date` =~ '(?i)(?s)8/29/2013.*' AND `t1`.`bike_id` = 496 AND `t1`.`start_station_name` = 'Powell Street BART')\nRETURN `t2`.`max_humidity` AS `max_humidity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the maximum humidity in Powell Street BART when bike 496 was borrowed from the station on 8/29/2013?",
    "evidence": "Powell Street refers to start_station_name; bike 496 refers to bike_id = '496'; start_date = '8/29/2013';",
    "idx": 6912
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t2`.`date` =~ '(?i)(?s)11/.*/2014.*' AND `t2`.`zip_code` = '94301' AND `t2`.`events` = 'Fog' AND `t1`.`subscription_type` = 'Subscriber')\nRETURN `t2`.`date` AS `date`, COUNT(`t1`.`start_station_name`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which day in the month of November, 2014 have a foggy weather in the zip code 94301 and in total, how many bikes were borrowed by subscribers from all of the stations in the said day?",
    "evidence": "day in the month of November, 2014 refers to start_date between '11/1/2014' and '11/30/2014'; foggy weather refers to events = 'Fog'; subscriber refers to subscription_type; all of the stations bikes were borrowed from refer to start_station_name;",
    "idx": 6913
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`station`)\nMATCH (`t2`:`status`)\nWHERE `t2`.`station_id` = `t1`.`id`\nAND (`t2`.`bikes_available` = 0 AND `t2`.`time` =~ '(?i)(?s)2013/11/03.*')\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On 11/3/2013, which stations are often empty? Indicate the names of the stations.",
    "evidence": "time = '11/3/2013'; which stations are empty refers to bikes_available = '0';",
    "idx": 6914
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nOPTIONAL MATCH (`t2`:`station`)\nWHERE `t2`.`city` = 'Palo Alto'\nAND `t2`.`name` = `t1`.`start_station_name`\nRETURN avg(`t1`.`duration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average duration of bike trips in the city of Palo Alto?",
    "evidence": "DIVIDE(SUM(duration where city = 'Palo Alto'), COUNT(start_station_id));",
    "idx": 6915
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`station`:`station`)\nWHERE (CASE  WHEN 1-1 < 0 AND (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 < 0  THEN substring(toString(`station`.`installation_date`),(case when size(toString(`station`.`installation_date`))+1+(1-1)+(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 < 0 then 0 else size(toString(`station`.`installation_date`))+1+(1-1)+(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 end),-((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1))  WHEN 1-1 < 0 AND (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 >= 0  THEN substring(toString(`station`.`installation_date`),size(toString(`station`.`installation_date`))+1+(1-1),(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1)  WHEN 1-1 >= 0 AND (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 < 0  THEN substring(toString(`station`.`installation_date`),(case when 1-1+1+((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1) < 0 then 0 else 1-1+1+((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1) end),-((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1))  ELSE substring(toString(`station`.`installation_date`),1-1,(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1) END = '5' AND CASE  WHEN (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) + 1-1 < 0 AND -6 < 0  THEN substring(toString(`station`.`installation_date`),(case when size(toString(`station`.`installation_date`))+1+((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) + 1-1)+-6 < 0 then 0 else size(toString(`station`.`installation_date`))+1+((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) + 1-1)+-6 end),-(-6))  WHEN (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) + 1-1 < 0 AND -6 >= 0  THEN substring(toString(`station`.`installation_date`),size(toString(`station`.`installation_date`))+1+((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) + 1-1),-6)  WHEN (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) + 1-1 >= 0 AND -6 < 0  THEN substring(toString(`station`.`installation_date`),(case when (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) + 1-1+1+(-6) < 0 then 0 else (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) + 1-1+1+(-6) end),-(-6))  ELSE substring(toString(`station`.`installation_date`),(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) + 1-1,-6) END >= '8' AND CASE WHEN -4-1 < 0 THEN substring(toString(`station`.`installation_date`),size(toString(`station`.`installation_date`))+1+(-4-1)) ELSE substring(toString(`station`.`installation_date`),-4-1) END = '2013') OR (CASE  WHEN 1-1 < 0 AND (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 < 0  THEN substring(toString(`station`.`installation_date`),(case when size(toString(`station`.`installation_date`))+1+(1-1)+(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 < 0 then 0 else size(toString(`station`.`installation_date`))+1+(1-1)+(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 end),-((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1))  WHEN 1-1 < 0 AND (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 >= 0  THEN substring(toString(`station`.`installation_date`),size(toString(`station`.`installation_date`))+1+(1-1),(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1)  WHEN 1-1 >= 0 AND (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 < 0  THEN substring(toString(`station`.`installation_date`),(case when 1-1+1+((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1) < 0 then 0 else 1-1+1+((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1) end),-((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1))  ELSE substring(toString(`station`.`installation_date`),1-1,(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1) END IN ['6', '7', '8', '9', '10', '11', '12'] AND CASE WHEN -4-1 < 0 THEN substring(toString(`station`.`installation_date`),size(toString(`station`.`installation_date`))+1+(-4-1)) ELSE substring(toString(`station`.`installation_date`),-4-1) END = '2013')\nRETURN `station`.`name` AS `name`, `station`.`installation_date` AS `installation_date`, `station`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of stations that were installed from 8/5/2013 to 12/31/2013. Indicate their installation date and city name.",
    "evidence": "from 8/5/2013 to 12/31/2013 refers to installation_date between '8/5/2013' and '12/31/2013';",
    "idx": 6916
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nWHERE `trip`.`start_station_name` = 'Adobe on Almaden' AND `trip`.`end_station_name` = 'Ryland Park'\nRETURN avg(`trip`.`duration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average duration of trips which are started at Adobe on Almaden station to Ryland Park?",
    "evidence": "trips refer to id; DIVIDE(SUM(duration where start_station_name = 'Adobe on Almaden', end_station_name = 'Ryland Park'), COUNT(id));",
    "idx": 6917
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`station`)\nMATCH (`t2`:`status`)\nWHERE `t2`.`station_id` = `t1`.`id`\nAND (`t2`.`bikes_available` = 0)\nRETURN `t2`.`time` AS `time`, `t1`.`name` AS `name`, `t1`.`lat` AS `lat`, `t1`.`long` AS `long`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the times when there is no available bike to borrow in a station. List down the stations name and location coordinate.",
    "evidence": "no available bike to borrow refers to bikes_available = 0; latitude and longitude coordinates can be used to indicate a location;",
    "idx": 6918
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nOPTIONAL MATCH (`t2`:`station`)\nWHERE `t1`.`start_station_name` = `t1`.`end_station_name`\nAND `t2`.`name` = `t1`.`start_station_name`\nRETURN `t1`.`id` AS `id`, `t2`.`lat` AS `lat`, `t2`.`long` AS `long`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the trips in which their start and end station are similar. Give me their trip IDs and location coordinates.",
    "evidence": "start and end station are similar refers to start_station_name = end_station_name; latitude and longitude coordinates can be used to indicate a location;",
    "idx": 6919
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`station`)\nMATCH (`t2`:`status`)\nWHERE `t1`.`id` = `t2`.`station_id`\nAND (`t1`.`name` = 'San Jose Diridon Caltrain Station' AND `t2`.`time` = '2013/08/29 06:14:01')\nRETURN sum(`t1`.`dock_count` - `t2`.`bikes_available`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On 8/29/2013 at 6:14:01 PM, how many bikes were borrowed from San Jose Diridon Caltrain Station?",
    "evidence": "How many bikes borrowed can be computed as SUBTRACT(SUM(dock_count), bikes_available where name = 'San Jose Diridon Caltrain Station' and time = '2013/08/29 06:14:01');",
    "idx": 6920
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t1`.`bike_id` = 10 AND `t2`.`mean_temperature_f` > 62 AND `t1`.`subscription_type` = 'Subscriber')\nRETURN `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the trip IDs when bike no. 10 was used by subscribers and the weather's mean temperature is no less than 62 degress Fahrenheit.",
    "evidence": "bike no. 10 refers to bike_id = '10'; subscription_type = 'Subscriber'; the weather's mean temperature is no less than 62 degress Fahrenheit refers to mean_temperature_f>62;",
    "idx": 6921
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code` AND `t2`.`date` = CASE  WHEN 1-1 < 0 AND (apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 < 0  THEN substring(toString(`t1`.`start_date`),(case when size(toString(`t1`.`start_date`))+1+(1-1)+(apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 < 0 then 0 else size(toString(`t1`.`start_date`))+1+(1-1)+(apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 end),-((apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1))  WHEN 1-1 < 0 AND (apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 >= 0  THEN substring(toString(`t1`.`start_date`),size(toString(`t1`.`start_date`))+1+(1-1),(apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1)  WHEN 1-1 >= 0 AND (apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1 < 0  THEN substring(toString(`t1`.`start_date`),(case when 1-1+1+((apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1) < 0 then 0 else 1-1+1+((apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1) end),-((apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1))  ELSE substring(toString(`t1`.`start_date`),1-1,(apoc.text.indexOf(`t1`.`start_date`,' ') + 1) - 1) END\nAND (`t1`.`bike_id` = 10 AND `t2`.`mean_temperature_f` > 62 AND `t1`.`subscription_type` = 'Customer' AND `t1`.`start_station_name` = 'MLK Library' AND `t1`.`end_station_name` = 'San Salvador at 1st' AND `t1`.`duration` = 386)\nRETURN `t2`.`max_gust_speed_mph` AS `max_gust_speed_mph`, `t2`.`cloud_cover` AS `cloud_cover`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What were the max gust speed and cloud clover when the customer using bike no. 10 recorded the 386 seconds duration of the trip from MLK Library to San Salvador at 1st?",
    "evidence": "subscription_type = 'Customer'; duration = '364'; bike no. 10 refers to bike_id = 10; start_station_name = 'San Jose Civic Center'; end_station_name = 'San Jose City Hall';",
    "idx": 6922
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t1`.`subscription_type` = 'Subscriber' AND `t2`.`min_visibility_miles` = 4 AND `t1`.`duration` < 490 AND `t1`.`start_station_name` = '2nd at Folsom' AND `t1`.`end_station_name` = 'Civic Center BART (7th at Market)')\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the subscriber, how many of them finished the 2nd at Folsom and Civic Center BART (7th at Market) as their start and end stations respectively for no more than 490 seconds under minimum visibility of 4 miles.",
    "evidence": "subscription_type = 'Subscriber'; no more than 490 seconds refers to duration<490; start_station_name = '2nd at Folsom'; end_station_name = 'Civic Center BART (7th at Market)'; min_visibility_miles = 4;",
    "idx": 6923
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`status`)\nWHERE `t2`.`station_id` = `t1`.`start_station_id`\nAND (`t1`.`zip_code` = 912900)\nRETURN sum(`t2`.`docks_available`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many docks were available at the starting station of trip ID 912900?",
    "evidence": "",
    "idx": 6924
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t2`.`min_temperature_f` < 45)\nRETURN `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please write down the trip IDs which ended on the days when the minimum temperature is less than 45 degrees Fahrenheit.",
    "evidence": "the minimum temperature is less than 45 degrees Fahrenheit refers to min_temperature_f<45;",
    "idx": 6925
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t1`.`start_date` = '1/1/2014 0:00' AND `t1`.`end_date` = '12/31/2014 11:59' AND `t1`.`start_station_name` = '2nd at Folsom' AND `t1`.`end_station_name` = '5th at Howard' AND `t1`.`subscription_type` = 'Subscriber')\nRETURN min(`t1`.`duration`) AS `_col_0`, min(`t1`.`duration`) - avg(`t1`.`duration`) AS `_col_1`, `t2`.`min_temperature_f` AS `min_temperature_f`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2014, what is the shortest duration of trips by subscribers which started at 2nd at Folsom and ended in the 5th at Howard stations, and by how much shorter than the average? Give me the minimum temperature, maximum gust speed and weather event on that trip.",
    "evidence": "the shortest duration refers to MIN(duration); subscription_type = 'Subscriber', start_station_name = '2nd at Folsom', end_station_name = '5th at Howard'; in 2014 refers to time period between start_date = '1/1/2014 0:00' and end_date = '12/31/2014 11:59; Average duration = DIVIDE(SUM(duration), COUNT(id));",
    "idx": 6926
  }
]