[
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`candidate`:`candidate`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of candidates.",
    "evidence": "",
    "idx": 3286
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`candidate`:`candidate`)\nRETURN `candidate`.`support_rate` AS `support_rate` ORDER BY `support_rate` IS NULL ASC, `support_rate` DESC \nLIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the top 3 greatest support rates.",
    "evidence": "",
    "idx": 3288
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`candidate`:`candidate`)\nORDER BY `candidate`.`oppose_rate` IS NULL DESC, `candidate`.`oppose_rate`  \nRETURN `candidate`.`candidate_id` AS `candidate_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id of the candidate who got the lowest oppose rate.",
    "evidence": "",
    "idx": 3289
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`candidate`:`candidate`)\nORDER BY `candidate`.`unsure_rate` IS NULL DESC, `candidate`.`unsure_rate`  \nRETURN `candidate`.`support_rate` AS `support_rate`, `candidate`.`consider_rate` AS `consider_rate`, `candidate`.`oppose_rate` AS `oppose_rate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please list support, consider, and oppose rates for each candidate in ascending order by unsure rate.",
    "evidence": "",
    "idx": 3291
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`candidate`:`candidate`)\nORDER BY `candidate`.`oppose_rate` IS NULL ASC, `candidate`.`oppose_rate` DESC \nRETURN `candidate`.`poll_source` AS `poll_source`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the poll source corresponding to the candidate who has the oppose rate.",
    "evidence": "",
    "idx": 3294
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`people`:`people`)\nORDER BY `people`.`date_of_birth` IS NULL DESC, `people`.`date_of_birth`  \nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all people names in the order of their date of birth from old to young.",
    "evidence": "",
    "idx": 3295
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`people`:`people`)\nWHERE `people`.`sex` = 'M'\nRETURN avg(`people`.`height`) AS `_col_0`, avg(`people`.`weight`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average height and weight for all males (sex is M).",
    "evidence": "",
    "idx": 3297
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`people`:`people`)\nWHERE `people`.`height` > 200 OR `people`.`height` < 190\nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the names of people who are taller than 200 or lower than 190.",
    "evidence": "",
    "idx": 3299
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`people`:`people`)\nWITH `people`.`sex` AS _groupby_col_0, avg(`people`.`weight`) AS _groupby_col_1, min(`people`.`weight`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `sex`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average and minimum weight for each gender.",
    "evidence": "",
    "idx": 3301
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`t2`:`candidate`)-[is_a_0:is_a]->(`t1`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nORDER BY `t2`.`support_rate` IS NULL ASC, `t2`.`support_rate` DESC \nRETURN `t1`.`name` AS `name`, `t1`.`sex` AS `sex`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and gender of the candidate who got the highest support rate.",
    "evidence": "",
    "idx": 3303
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "WITH *, COLLECT { MATCH (`candidate_sub0`:`candidate`)\nRETURN `candidate_sub0`.`people_id` AS `people_id`   } AS in_collect_0\nMATCH (`people`:`people`)\nWHERE NOT `people`.`people_id` IN in_collect_0\nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the names of people who did not participate in the candidate election.",
    "evidence": "",
    "idx": 3305
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "WITH *, COLLECT { MATCH (`candidate_sub0`:`candidate`)\nRETURN `candidate_sub0`.`people_id` AS `people_id`   } AS in_collect_0\nMATCH (`people`:`people`)\nWHERE NOT `people`.`people_id` IN in_collect_0\nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the names of people who did not participate in the candidate election.",
    "evidence": "",
    "idx": 3306
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`t2`:`candidate`)-[is_a_0:is_a]->(`t1`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t2`.`support_rate` < `t2`.`oppose_rate`)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the candidates whose support percentage is lower than their oppose rate.",
    "evidence": "",
    "idx": 3307
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`people`:`people`)\nWHERE `people`.`weight` > 85\nWITH `people`.`sex` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `sex`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of people of each sex who have a weight higher than 85.",
    "evidence": "",
    "idx": 3310
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`candidate`:`candidate`)\nRETURN MAX(`candidate`.`support_rate`) AS `_col_0`, min(`candidate`.`consider_rate`) AS `_col_1`, min(`candidate`.`oppose_rate`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the highest support percentage, lowest consider rate and oppose rate of all candidates.",
    "evidence": "",
    "idx": 3311
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`t2`:`candidate`)-[is_a_0:is_a]->(`t1`:`people`)\nWHERE `t1`.`people_id` = `t2`.`people_id`\nAND (`t1`.`sex` = 'F')\nRETURN `t1`.`name` AS `name` ORDER BY `t1`.`name` IS NULL DESC, `t1`.`name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list all female (sex is F) candidate names in the alphabetical order.",
    "evidence": "",
    "idx": 3313
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "CALL(*) {\nMATCH (`people_sub0`:`people`)\nRETURN avg(`people_sub0`.`height`) AS `_col_0`  \n}\nMATCH (`people`:`people`)\nWHERE `people`.`height` < `_col_0`\nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the name of people whose height is lower than the average.",
    "evidence": "",
    "idx": 3315
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`people`:`people`)\nRETURN `people`.`people_id` AS `people_id`, `people`.`sex` AS `sex`, `people`.`name` AS `name`, `people`.`date_of_birth` AS `date_of_birth`, `people`.`height` AS `height`, `people`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all info about all people.",
    "evidence": "",
    "idx": 3317
  },
  {
    "filename": "train_spider.json",
    "db_id": "candidate_poll",
    "gql_statement": "MATCH (`people`:`people`)\nRETURN `people`.`people_id` AS `people_id`, `people`.`sex` AS `sex`, `people`.`name` AS `name`, `people`.`date_of_birth` AS `date_of_birth`, `people`.`height` AS `height`, `people`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information about all people?",
    "evidence": "",
    "idx": 3318
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`director` = 'Steven Spielberg'\nRETURN `movie`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the titles of all movies directed by steven spielberg.",
    "evidence": "",
    "idx": 3319
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`reviewer`:`reviewer`)\nWHERE `reviewer`.`name` =~ '(?i)(?s).*Mike.*'\nRETURN `reviewer`.`rid` AS `rid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id of the reviewer whose name has substring “Mike”?",
    "evidence": "",
    "idx": 3329
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`reviewer`:`reviewer`)\nWHERE `reviewer`.`name` =~ '(?i)(?s).*Mike.*'\nRETURN `reviewer`.`rid` AS `rid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id of the reviewer whose name includes the word \"Mike\"?",
    "evidence": "",
    "idx": 3330
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH ()-[rating:rated]->()\nWHERE `rating`.`stars` > 3\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of ratings that has more than 3 stars?",
    "evidence": "",
    "idx": 3333
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH ()-[rating:rated]->()\nWHERE `rating`.`stars` > 3\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many movie ratings have more than 3 stars?",
    "evidence": "",
    "idx": 3334
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH ()-[t2:rated]->(`t1`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND (`t2`.`stars` >= 4)\nRETURN DISTINCT `t1`.`year` AS `year` ORDER BY `t1`.`year` IS NULL DESC, `t1`.`year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "In what years did a movie receive a 4 or 5 star rating, and list the years from oldest to most recently?",
    "evidence": "",
    "idx": 3338
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t2`:`reviewer`)-[t1:rated]->()\nWHERE `t1`.`rid` = `t2`.`rid`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`stars`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average rating star for each reviewer?",
    "evidence": "",
    "idx": 3341
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t2`:`reviewer`)-[t1:rated]->()\nWHERE `t1`.`rid` = `t2`.`rid`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`stars`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average number of stars that each reviewer awards for a movie?",
    "evidence": "",
    "idx": 3342
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[rating_sub0:rated]->()\nRETURN `rating_sub0`.`mid` AS `mid`   } AS in_collect_0\nMATCH (`movie`:`movie`)\nWHERE NOT `movie`.`mid` IN in_collect_0\nRETURN `movie`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the titles of all movies that have no ratings.",
    "evidence": "",
    "idx": 3343
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[rating_sub0:rated]->()\nRETURN `rating_sub0`.`mid` AS `mid`   } AS in_collect_0\nMATCH (`movie`:`movie`)\nWHERE NOT `movie`.`mid` IN in_collect_0\nRETURN `movie`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles of all movies that have not been rated?",
    "evidence": "",
    "idx": 3344
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t1`:`reviewer`)-[t2:rated]->()\nWHERE `t1`.`rid` = `t2`.`rid`\nAND (`t2`.`ratingdate` = 'null')\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all reviewers who have ratings with a NULL value for the date.",
    "evidence": "",
    "idx": 3345
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t1`:`reviewer`)-[t2:rated]->()\nWHERE `t1`.`rid` = `t2`.`rid`\nAND (`t2`.`ratingdate` = 'null')\nRETURN DISTINCT `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different names of all reviewers whose ratings do not have a date field?",
    "evidence": "",
    "idx": 3346
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "CALL(*) {\nMATCH (`movie_sub0`:`movie`)\nRETURN min(`movie_sub0`.`year`) AS `_col_0_1`  \n}\nMATCH ()-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND (`t2`.`year` = `_col_0_1`)\nRETURN avg(`t1`.`stars`) AS `_col_0`, `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average rating stars and title for the oldest movie?",
    "evidence": "",
    "idx": 3347
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "CALL(*) {\nMATCH (`movie_sub0`:`movie`)\nRETURN min(`movie_sub0`.`year`) AS `_col_0_1`  \n}\nMATCH ()-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND (`t2`.`year` = `_col_0_1`)\nRETURN avg(`t1`.`stars`) AS `_col_0`, `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For the oldest movie listed, what is its average rating and title?",
    "evidence": "",
    "idx": 3348
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "CALL(*) {\nMATCH (`movie_sub0`:`movie`)\nRETURN MAX(`movie_sub0`.`year`) AS `_col_0_1`  \n}\nMATCH ()-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND (`t2`.`year` = `_col_0_1`)\nRETURN MAX(`t1`.`stars`) AS `_col_0`, `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum stars and year for the most recent movie?",
    "evidence": "",
    "idx": 3351
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "CALL(*) {\nMATCH (`movie_sub0`:`movie`)\nRETURN MAX(`movie_sub0`.`year`) AS `_col_0_1`  \n}\nMATCH ()-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND (`t2`.`year` = `_col_0_1`)\nRETURN MAX(`t1`.`stars`) AS `_col_0`, `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is highest rating for the most recent movie and when was it released?",
    "evidence": "",
    "idx": 3352
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "CALL(*) {\nMATCH (`movie`:`movie`)\nWHERE `movie`.`director` = 'Steven Spielberg'\nRETURN MAX(`movie`.`year`) AS `_col_0`  \n}\nMATCH (`movie`:`movie`)\nWHERE `movie`.`year` > `_col_0`\nRETURN `movie`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the names of movies whose created year is after all movies directed by Steven Spielberg?",
    "evidence": "",
    "idx": 3353
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "CALL(*) {\nMATCH (`movie`:`movie`)\nWHERE `movie`.`director` = 'Steven Spielberg'\nRETURN MAX(`movie`.`year`) AS `_col_0`  \n}\nMATCH (`movie`:`movie`)\nWHERE `movie`.`year` > `_col_0`\nRETURN `movie`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all movies that were created after the most recent Steven Spielberg film?",
    "evidence": "",
    "idx": 3354
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "CALL(*) {\nMATCH ()-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND (`t2`.`director` = 'James Cameron')\nRETURN avg(`t1`.`stars`) AS `_col_0`  \n}\nMATCH ()-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND (`t1`.`stars` > `_col_0`)\nRETURN `t2`.`title` AS `title`, `t2`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles and directors of the movies whose star is greater than the average stars of the movies directed by James Cameron?",
    "evidence": "",
    "idx": 3355
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "CALL(*) {\nMATCH ()-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND (`t2`.`director` = 'James Cameron')\nRETURN avg(`t1`.`stars`) AS `_col_0`  \n}\nMATCH ()-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND (`t1`.`stars` > `_col_0`)\nRETURN `t2`.`title` AS `title`, `t2`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the titles and directors of all movies that have a rating higher than the average James Cameron film rating?",
    "evidence": "",
    "idx": 3356
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t3`:`reviewer`)-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND `t1`.`rid` = `t3`.`rid`\nRETURN `t3`.`name` AS `name`, `t2`.`title` AS `title`, `t1`.`stars` AS `stars`, `t1`.`ratingdate` AS `ratingdate` ORDER BY `t3`.`name` IS NULL DESC, `t3`.`name` , `t2`.`title` IS NULL DESC, `t2`.`title` , `t1`.`stars` IS NULL DESC, `t1`.`stars`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return reviewer name, movie title, stars, and ratingDate. And sort the data first by reviewer name, then by movie title, and lastly by number of stars.",
    "evidence": "",
    "idx": 3357
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t3`:`reviewer`)-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND `t1`.`rid` = `t3`.`rid`\nRETURN `t3`.`name` AS `name`, `t2`.`title` AS `title`, `t1`.`stars` AS `stars`, `t1`.`ratingdate` AS `ratingdate` ORDER BY `t3`.`name` IS NULL DESC, `t3`.`name` , `t2`.`title` IS NULL DESC, `t2`.`title` , `t1`.`stars` IS NULL DESC, `t1`.`stars`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the reviewer name, film title, movie rating, and rating date  for every movie ordered by reviewer name, movie title, then finally rating?",
    "evidence": "",
    "idx": 3358
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t3`:`reviewer`)-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND `t1`.`rid` = `t3`.`rid`\nAND (`t2`.`title` = 'Gone with the Wind')\nRETURN DISTINCT `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all reviewers who rated Gone with the Wind.",
    "evidence": "",
    "idx": 3359
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t3`:`reviewer`)-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND `t1`.`rid` = `t3`.`rid`\nAND (`t3`.`name` = 'Sarah Martinez')\nRETURN DISTINCT `t2`.`director` AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all directors whose movies are rated by Sarah Martinez.",
    "evidence": "",
    "idx": 3361
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t3`:`reviewer`)-[t1:rated]->(`t2`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nAND `t1`.`rid` = `t3`.`rid`\nAND (`t2`.`director` = `t3`.`name`)\nRETURN DISTINCT `t3`.`name` AS `name`, `t2`.`title` AS `title`, `t1`.`stars` AS `stars`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For any rating where the name of reviewer is the same as the director of the movie, return the reviewer name, movie title, and number of stars.",
    "evidence": "",
    "idx": 3363
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`reviewer`:`reviewer`)\nRETURN `reviewer`.`name` AS `name`   \nUNION DISTINCT\nMATCH (`movie`:`movie`)\nRETURN `movie`.`title` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return all reviewer names and movie names together in a single list.",
    "evidence": "",
    "idx": 3365
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`reviewer`:`reviewer`)\nRETURN `reviewer`.`name` AS `name`   \nUNION DISTINCT\nMATCH (`movie`:`movie`)\nRETURN `movie`.`title` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the reviewers and movie names?",
    "evidence": "",
    "idx": 3366
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t2`:`movie`)\nMATCH (`t1`:`movie`)\nWHERE `t1`.`director` = `t2`.`director`\nAND (`t1`.`title` <> `t2`.`title`)\nRETURN `t1`.`title` AS `title`, `t1`.`director` AS `director` ORDER BY `t1`.`director` IS NULL DESC, `t1`.`director` , `t1`.`title` IS NULL DESC, `t1`.`title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For all directors who directed more than one movie, return the titles of all movies directed by them, along with the director name. Sort by director name, then movie title.",
    "evidence": "",
    "idx": 3367
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t2`:`movie`)\nMATCH (`t1`:`movie`)\nWHERE `t1`.`director` = `t2`.`director`\nAND (`t1`.`title` <> `t2`.`title`)\nRETURN `t1`.`title` AS `title`, `t1`.`director` AS `director` ORDER BY `t1`.`director` IS NULL DESC, `t1`.`director` , `t1`.`title` IS NULL DESC, `t1`.`title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For all directors who have directed more than one movie, what movies have they directed and what are their names?",
    "evidence": "",
    "idx": 3368
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t2`:`movie`)\nMATCH (`t1`:`movie`)\nWHERE `t1`.`director` = `t2`.`director`\nAND (`t1`.`title` <> `t2`.`title`)\nRETURN `t1`.`title` AS `title`, `t1`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For directors who had more than one movie, return the titles and produced years of all movies directed by them.",
    "evidence": "",
    "idx": 3369
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t2`:`movie`)\nMATCH (`t1`:`movie`)\nWHERE `t1`.`director` = `t2`.`director`\nAND (`t1`.`title` <> `t2`.`title`)\nRETURN `t1`.`title` AS `title`, `t1`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each director who directed more than one movie, what are the titles and dates of release for all those movies?",
    "evidence": "",
    "idx": 3370
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH ()-[t2:rated]->(`t1`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nWITH `t1`.`director` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many movie reviews does each director get?",
    "evidence": "",
    "idx": 3375
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH ()-[t2:rated]->(`t1`:`movie`)\nWHERE `t1`.`mid` = `t2`.`mid`\nWITH `t1`.`director` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `director`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each director, how many reviews have they received?",
    "evidence": "",
    "idx": 3376
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t2`:`reviewer`)-[t1:rated]->()\nWHERE `t1`.`rid` = `t2`.`rid`\nAND (`t1`.`stars` > 3)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of reviewers who had given higher than 3 star ratings.",
    "evidence": "",
    "idx": 3381
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH (`t2`:`reviewer`)-[t1:rated]->()\nWHERE `t1`.`rid` = `t2`.`rid`\nAND (`t1`.`stars` > 3)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the reviewers who have rated a movie more than 3 stars before?",
    "evidence": "",
    "idx": 3382
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`t2`:`reviewer`)-[t1:rated]->()\nWHERE `t1`.`rid` = `t2`.`rid`\nAND (`t2`.`name` = 'Brittany Harris')\nRETURN `t1`.`mid` AS `mid`   } AS in_collect_0\nMATCH ()-[rating:rated]->()\nWHERE NOT `rating`.`mid` IN in_collect_0\nWITH `rating`.`mid` AS _groupby_col_0, avg(`rating`.`stars`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `mid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average rating star for each movie that are not reviewed by Brittany Harris.",
    "evidence": "",
    "idx": 3383
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`t2`:`reviewer`)-[t1:rated]->()\nWHERE `t1`.`rid` = `t2`.`rid`\nAND (`t2`.`name` = 'Brittany Harris')\nRETURN `t1`.`mid` AS `mid`   } AS in_collect_0\nMATCH ()-[rating:rated]->()\nWHERE NOT `rating`.`mid` IN in_collect_0\nWITH `rating`.`mid` AS _groupby_col_0, avg(`rating`.`stars`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `mid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average rating for each movie that has never been reviewed by Brittany Harris?",
    "evidence": "",
    "idx": 3384
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH ()-[rating:rated]->()\nWITH `rating`.`mid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, avg(`rating`.`stars`) AS _groupby_col_2\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `mid`, _groupby_col_2 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each movie that received more than 3 reviews, what is the average rating?",
    "evidence": "",
    "idx": 3386
  },
  {
    "filename": "train_spider.json",
    "db_id": "movie_1",
    "gql_statement": "MATCH ()-[rating:rated]->()\nWHERE `rating`.`stars` <> 4\nRETURN `rating`.`rid` AS `rid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of all reviewers who have not given 4 stars at least once?",
    "evidence": "",
    "idx": 3388
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`county_public_safety`:`county_public_safety`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of countries.",
    "evidence": "",
    "idx": 3394
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`county_public_safety`:`county_public_safety`)\nORDER BY `county_public_safety`.`population` IS NULL ASC, `county_public_safety`.`population` DESC \nRETURN `county_public_safety`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of counties in descending order of population.",
    "evidence": "",
    "idx": 3395
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`county_public_safety`:`county_public_safety`)\nWHERE `county_public_safety`.`location` <> 'East'\nRETURN DISTINCT `county_public_safety`.`police_force` AS `police_force`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the distinct police forces of counties whose location is not on east side.",
    "evidence": "",
    "idx": 3397
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`county_public_safety`:`county_public_safety`)\nRETURN min(`county_public_safety`.`crime_rate`) AS `_col_0`, MAX(`county_public_safety`.`crime_rate`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the minimum and maximum crime rates across all counties.",
    "evidence": "",
    "idx": 3400
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`county_public_safety`:`county_public_safety`)\nORDER BY `county_public_safety`.`police_officers` IS NULL DESC, `county_public_safety`.`police_officers`  \nRETURN `county_public_safety`.`crime_rate` AS `crime_rate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the crime rates of counties in ascending order of number of police officers.",
    "evidence": "",
    "idx": 3401
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`city`:`city`)\nRETURN `city`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of cities, ordered alphabetically.",
    "evidence": "",
    "idx": 3404
  },
  {
    "filename": "train_spider.json",
    "db_id": "county_public_safety",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`black` > 10\nRETURN `city`.`hispanic` AS `hispanic`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the hispanic percentage for cities in which the black percentage is greater than 10.",
    "evidence": "",
    "idx": 3406
  }
]