[
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Bella' AND `t1`.`last` = 'Rolfson')\nRETURN DISTINCT `t2`.`description` AS `description`, `t2`.`value` AS `value`, `t2`.`units` AS `units`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out all the observation information collected for the patient named Bella Rolfson.",
    "evidence": "observation information refers to observations.DESCRIPTION AND observations.VALUE AND observations.UNITS;",
    "idx": 957
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Calcium' AND `t2`.`value` < 8.6)\nRETURN DISTINCT `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out patient names with calcium deficiency.",
    "evidence": "patient names = first, last; calcium deficiency refers to observations.DESCRIPTION = 'Calcium' and observations.VALUE < 8.6;",
    "idx": 958
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`encounters`)\nMATCH ()-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`reasondescription` = 'Normal pregnancy' AND `t1`.`date` = `t2`.`date`)\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many mothers have taken immunization during prenatal visit?",
    "evidence": "expecting mothers can be attributed to encounters.REASONDESCRIPTION = 'Normal pregnancy';",
    "idx": 959
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`careplans`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END = '2013')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What care plans have been received by Mrs. Elly Koss during year 1970?",
    "evidence": "during year 1970 refers to substr(careplans.START, 1, 4) = '1970' and substr(careplans.STOP, 1, 4) = '1970';",
    "idx": 960
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Hypertension')\nRETURN COUNT(DISTINCT CASE  WHEN `t2`.`gender` = 'M' THEN `t2`.`patient`  END) AS `male`, COUNT(DISTINCT CASE  WHEN `t2`.`gender` = 'F' THEN `t2`.`patient`  END) AS `female`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many male patients are diagnosed with hypertension as compared to female patients?",
    "evidence": "male refers to gender = 'M'; diagnosed with hypertension refers to conditions.DESCRIPTION = 'Hypertension'; female refers to gender = 'F'; number of male patients with hypertension = count(patient WHERE gender = 'M' AND conditions.DESCRIPTION = 'Hypertension'); number of female patients with hypertension = count(patient WHERE gender = 'F' AND conditions.DESCRIPTION = 'Hypertension');",
    "idx": 961
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Normal pregnancy' AND `t2`.`gender` = 'F' AND `t2`.`marital` = 'S')\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many unmarried women were checked for normal pregnancy?",
    "evidence": "unmarried refers to marital = 'S'; women refers to gender = 'F'; normal pregnancy refers to conditions.DESCRIPTION = 'normal pregnancy';",
    "idx": 962
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "CALL (*) {\nMATCH (`observations_sub0`:`observations`)\nWHERE `observations_sub0`.`description` = 'Total Cholesterol' AND `observations_sub0`.`value` > 200\nRETURN DISTINCT `observations_sub0`.`patient` AS `patient`  \n}\nMATCH (`t1`:`observations`)\nWHERE `t1`.`patient` = `patient`\nAND (`t1`.`description` = 'Body Mass Index')\nRETURN CASE WHEN COUNT(`t1`.`patient`)=0 THEN NULL ELSE sum(`t1`.`value`) / COUNT(`t1`.`patient`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average body mass index for patients with higher total cholesterol?",
    "evidence": "average body mass index = DIVIDE(SUM(observations.VALUE), COUNT(PATIENT) WHERE observations.DESCRIPTION = 'Body Mass Index'); body mass index refers to observations.DESCRIPTION = 'Body Mass Index'; higher total cholesterol refers to observations.DESCRIPTION = 'Total Cholesterol' and observations.VALUE > = 200;",
    "idx": 963
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Walter' AND `t1`.`last` = 'Bahringer' AND toString(`t2`.`date`) =~ '(?i)(?s)2009-07.*')\nRETURN `t2`.`reasondescription` AS `reasondescription`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the reason Walter Bahringer visited medical professionals in July 2009.",
    "evidence": "reason for visiting medical professionals refers to encounters.REASONDESCRIPTION;  in July 2009 refers to  substr(encounters.DATE, 1, 7) = '2009-07' ;",
    "idx": 964
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Stacy' AND `t1`.`last` = 'Morar' AND `t2`.`description` = 'Emergency Room Admission' AND `t2`.`reasondescription` = 'Drug overdose')\nORDER BY `t2`.`date` IS NULL DESC, `t2`.`date`  \nRETURN duration.between(`t2`.`date`,`t1`.`birthdate`) AS `age`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How old was Mr. Stacy Morar at the time of his first emergency room admission due to a drug overdose?",
    "evidence": "how old = SUBTRACT(MIN(encounters.DATE), patients.birthdate); his first emergency room admission refers to MIN(encounters.DATE); drug overdose refers to encounters.REASONDESCRIPTION = 'Drug overdose' ;",
    "idx": 965
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`procedures`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Transplant of lung (procedure)')\nRETURN `t2`.`first` AS `first`, `t2`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please include the full name of the patient who received a lung transplant.",
    "evidence": "full name = first, last; lung transplant refers to procedures.DESCRIPTION = 'Transplant of lung (procedure)';",
    "idx": 966
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`procedures`:`procedures`)\nWHERE `procedures`.`description` = 'Combined chemotherapy and radiation therapy (procedure)'\nRETURN CASE WHEN COUNT(DISTINCT CASE WHEN `procedures`.`date` is not NULL THEN apoc.temporal.format(`procedures`.`date`,'yyyy') ELSE NULL END)=0 THEN NULL ELSE toFloat(COUNT(`procedures`.`patient`)) / COUNT(DISTINCT CASE WHEN `procedures`.`date` is not NULL THEN apoc.temporal.format(`procedures`.`date`,'yyyy') ELSE NULL END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients on average receive combined chemotherapy and radiation therapy procedures each year?",
    "evidence": "average = DIVIDE(COUNT(procedures.PATIENT), COUNT(substr(procedures.DATE, 1, 4))); combined chemotherapy and radiation therapy refers to procedures.DESCRIPTION = 'Combined chemotherapy and radiation therapy (procedure)';",
    "idx": 967
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`allergies`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Isadora' AND `t1`.`last` = 'Moen')\nRETURN `t2`.`start` AS `start`, `t2`.`stop` AS `stop`, `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the allergy period for Isadora Moen and what triggered it.",
    "evidence": "allergy period = SUBTRACT(allergies.START, allergies.STOP); what triggered the allergy refers to allergies.DESCRIPTION;",
    "idx": 968
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Laronda' AND `t1`.`last` = 'Bernier')\nORDER BY `t2`.`date` IS NULL ASC, `t2`.`date` DESC \nRETURN duration.between(`t2`.`date`,`t1`.`birthdate`) AS `age`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How old was Mrs. Laronda Bernier at the time of her most recent medical encounter?",
    "evidence": "how old = SUBTRACT(MIN(encounters.DATE), patients.birthdate); most recent medical encounter refers to MIN(encounters.DATE);",
    "idx": 969
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Joye' AND `t1`.`last` = 'Homenick' AND CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END = '2017')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What condition forced Mrs. Joye Homenick to seek medical attention in 2017?",
    "evidence": "condition refers to conditions.DESCRIPTION; in 2017 refers to substr(conditions.START, 1, 4) = '2017';",
    "idx": 970
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Influenza  seasonal  injectable  preservative free' AND `t1`.`first` = 'Joye' AND `t1`.`last` = 'Homenick')\nRETURN `t2`.`date` AS `date` ORDER BY `t2`.`date` IS NULL ASC, `t2`.`date` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did Mrs. Joye Homenick receive her most recent influenza seasonal vaccine?",
    "evidence": "when a patient received her most recent vaccine refers to MAX(immunications.DATE); influenza seasonal vaccine refers to immunizations.DESCRIPTION = 'Influenza seasonal injectable preservative free';",
    "idx": 971
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`careplans`)\nMATCH (`t1`:`encounters`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`reasondescription` = 'Second degree burn')\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`, `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients sought medical attention due to a second-degree burn? Describe the care plan recommended to them.",
    "evidence": "second-degree burn refers to encounters.REASONDESCRIPTION = 'Second degree burn'; ;",
    "idx": 972
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`encounters`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (CASE WHEN `t1`.`date` is not NULL THEN apoc.temporal.format(`t1`.`date`,'yyyy') ELSE NULL END = '2010' AND `t1`.`reasondescription` = 'Contact dermatitis')\nRETURN CASE WHEN COUNT(`t1`.`patient`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`gender` = 'F' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`patient`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all patients who sought medical attention in 2010 due to contact dermatitis, identify the percentage of females.",
    "evidence": "in 2010 refers to substr(encounters.DATE, 1, 4) = '2010'; contact dermatitis refers to encounters.REASONDESCRIPTION = 'Contact dermatitis'; percentage = MULTIPLY(DIVIDE(COUNT(encounters.PATIENT WHERE gender = 'F'), count(encounters.PATIENT) WHERE encounters.REASONDESCRIPTION = 'Contact dermatitis'), 1.0) females refers to gender = 'F';",
    "idx": 973
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Lorri' AND `t1`.`last` = 'Simonis' AND CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy') ELSE NULL END >= '2010' AND CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy') ELSE NULL END <= '2017')\nRETURN COUNT(`t1`.`patient`) AS `_col_0`, CASE WHEN COUNT(`t1`.`patient`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`description` = 'Prenatal visit' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`patient`) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many interactions did Lorri Simons have with medical professionals between 2010 and 2017? What percentage of encounters are attributed to prenatal visits?",
    "evidence": "between 2010 and 2017 refers to substr(encounters.DATE, 1, 4) between '2010' and '2017'; percentage = MULTIPLY(DIVIDE(COUNT(encounters.ID WHERE DESCRIPTION = 'Prenatal visit'), count(encounters.ID)), 1.0); prenatal visits refers to encounters.DESCRIPTION = 'Prenatal visit';",
    "idx": 974
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`medications`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`first` = 'Joye' AND `t2`.`last` = 'Homenick')\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State description of medication taken by Joe Homenick.",
    "evidence": "description of medication refers to medications.DESCRIPTION;",
    "idx": 975
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`maiden` = 'Adams')\nRETURN DISTINCT `t1`.`start` AS `start`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the start date of the care plan of the patient whose maiden name is Adams?",
    "evidence": "start date of the care plan refers to careplans.START;",
    "idx": 976
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`gender` = 'M')\nORDER BY `t1`.`start` IS NULL DESC, `t1`.`start`  \nRETURN `t2`.`first` AS `first`, `t2`.`last` AS `last`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the male patients, who has the earliest starting date of the care plan?",
    "evidence": "male patients refers to gender = 'M'; earliest starting date of the care plan refers to MIN(careplans.START);",
    "idx": 977
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (CASE WHEN `t1`.`stop` is not NULL THEN apoc.temporal.format(`t1`.`stop`,'yyyy') ELSE NULL END = '2011')\nRETURN CASE WHEN COUNT(`t1`.`patient`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`race` = 'hispanic' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`patient`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of Hispanic patients who stopped their care plan in 2011?",
    "evidence": "Hispanic patients refers to ethnicity = 'hispanic'; percentage = MULTIPLY(DIVIDE(COUNT(careplans.PATIENT WHERE ethnicity = 'hispanic'), COUNT(careplans.PATIENT)), 1.0); stopped their care plan in 2011 refers to substr(careplans.stop, 1, 4) = '2011';",
    "idx": 978
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`first` = 'Angelo' AND `t2`.`last` = 'Buckridge')\nRETURN DISTINCT `t1`.`reasondescription` AS `reasondescription`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the description of the reason why Angelo Buckridge needs the care plan.",
    "evidence": "description of the reason of the care plan refers to careplans.REASONDESCRIPTION;",
    "idx": 979
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`ethnicity` = 'american')\nRETURN DISTINCT `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the description of the care plan of American patients.",
    "evidence": "American refers to ethnicity = 'american';",
    "idx": 980
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`birthplace` = 'Pembroke MA US')\nRETURN DISTINCT `t1`.`encounter` AS `encounter`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the medical encounter ids of patients who were born in Pembroke MA US?",
    "evidence": "medical encounter ids careplans.ID; born in Pembroke MA US refers to birthplace = 'Pembroke MA US';",
    "idx": 981
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`deathdate` IS NULL)\nRETURN DISTINCT `t1`.`start` AS `start`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the start date of the care plan of alive patients.",
    "evidence": "start of the care plan refers to careplans.START; alive patients refers to deathdate is null;",
    "idx": 982
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`race` = 'white' AND `t1`.`reasoncode` = '10509002')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many white patients have the reason code of 10509002?",
    "evidence": "white refers to race = 'white'; reason code of 10509002 refers to careplans.REASONCODE = '10509002';",
    "idx": 983
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Diabetic diet')\nRETURN DISTINCT `t2`.`first` AS `first`, `t2`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out full name of patients who have \"Diabetic diet\" in the description of the care plan.",
    "evidence": "full name = first, last; Diabetic diet refers to careplans.DESCRIPTION = 'Diabetic diet';",
    "idx": 984
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (NOT `t2`.`deathdate` IS NULL AND NOT `t1`.`stop` IS NULL)\nRETURN DISTINCT `t1`.`stop` AS `stop`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the stop date of the care plan of dead patients.",
    "evidence": "stop date of the care plan refers to careplans.STOP; dead patients refers to deathdate is not null;",
    "idx": 985
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`ethnicity` = 'italian' AND `t1`.`code` = '304510005')\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Italian patients have the care plan code of 304510005?",
    "evidence": "Italian patients refers to ethnicity = 'italian';",
    "idx": 986
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (CASE WHEN `t1`.`start` is not NULL THEN apoc.temporal.format(`t1`.`start`,'yyyy') ELSE NULL END = '2010')\nRETURN CASE WHEN COUNT(`t1`.`patient`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`gender` = 'F' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`patient`) END AS `percentage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of female patients who started the care plan in 2010?",
    "evidence": "female patients refers to gender = 'F'; started the care plan in 2010 refers to substr(careplans.START, 1, 4) = '2010'; percentage = MULTIPLY(DIVIDE(COUNT(patients.patient WHERE patients.gender = 'F'), COUNT(patients.patient) WHERE substr(careplans.START, 1, 4) = '2010'), 100);",
    "idx": 987
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`race` = 'black' AND CASE WHEN `t1`.`stop` is not NULL THEN apoc.temporal.format(`t1`.`stop`,'yyyy') ELSE NULL END = '2017')\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many black patients stopped their care plan in 2017?",
    "evidence": "black refers to race = 'black'; stopped their care plan in 2017 refers to substr(careplans.STOP, 1, 4) = '2017';",
    "idx": 988
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)\nMATCH (`t1`:`patients`)\nWHERE `t2`.`description` = 'Prediabetes' AND `t1`.`gender` = 'M'\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many male patients have prediabetes condition?",
    "evidence": "male refers to gender = 'M'; prediabetes condition refers to conditions.DESCRIPTION = 'Prediabetes';",
    "idx": 989
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`allergies`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Allergy to nut')\nRETURN DISTINCT `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names of patients with nut allergy.",
    "evidence": "full names = first, last; nut allergy refers to allergies.DESCRIPTION = 'Allergy to nut';",
    "idx": 990
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Wilmer' AND `t1`.`last` = 'Koepp')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the condition of patient Wilmer Koepp.",
    "evidence": "",
    "idx": 991
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Viral sinusitis (disorder)')\nRETURN sum(CASE  WHEN `t1`.`gender` = 'F' THEN 1 ELSE 0 END) AS `_col_0`, sum(CASE  WHEN `t1`.`gender` = 'M' THEN 1 ELSE 0 END) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the patients with viral sinusitis condition, which patient's gender is most affected? Provide the number for each respectively.",
    "evidence": "viral sinusitis condition refers to conditions.DESCRIPTION = 'Viral sinusitis (disorder)'; gender that is most affected refers to MAX(COUNT(gender WHERE conditions.DESCRIPTION = 'Viral sinusitis (disorder)'));",
    "idx": 992
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Penicillin V Potassium 250 MG' AND CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END >= '1948')\nRETURN DISTINCT `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the full names of patients who have been taking Penicillin V Potassium 250 MG since 1948.",
    "evidence": "full names = first, last; Penicillin V Potassium 250 MG refers to medications.DESCRIPTION = 'Penicillin V Potassium 250 MG'; since 1948 refers to substr(medications.START, 1, 4) > = '1948';",
    "idx": 993
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END = '1935' AND `t1`.`race` = 'white' AND `t2`.`description` = 'Stroke')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many white patients whose birth year is 1935 have a stroke?",
    "evidence": "white refers to race = 'white'; birth year is 1935 refers to substr(birthdate, 1, 4) = '1935'; stroke refers to conditions.DESCRIPTION = 'Stroke';",
    "idx": 994
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)-[t3:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND `t1`.`patient` = `t3`.`patient`\nAND (`t3`.`description` = 'IPV')\nRETURN DISTINCT `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which conditions the patient has when receiving the IPV immunization?",
    "evidence": "IPV immunization refers to immunizations.DESCRIPTION = 'IPV';",
    "idx": 995
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nMATCH (`t2`:`conditions`)-[prevalence_0:prevalence]->(`t3`:`all_prevalences`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND `t3`.`item` = `t2`.`description`\nORDER BY `t3`.`occurrences` IS NULL ASC, `t3`.`occurrences` DESC \nRETURN `t1`.`patient` AS `patient`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the patient ids whose disease has the most occurrences.",
    "evidence": "patient ids refers to patients.patient; disease with the most occurrence refers to MAX(all_prevalences.OCCURENCES);",
    "idx": 996
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Cystitis')\nRETURN DISTINCT `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the full names of patients with a condition described as cystitis.",
    "evidence": "full names = first, last; condition described as cystitis refers to conditions.DESCRIPTION = ''Cystitis';",
    "idx": 997
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'HPV  quadrivalent' AND `t1`.`gender` = 'M')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many male patients have been described as immune to quadrivalent HPV?",
    "evidence": "male refers to gender = 'M'; immune to quadrivalent HPV refers to immunizations.DESCRIPTION = 'HPV quadrivalent';",
    "idx": 998
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`careplans`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Walter' AND `t1`.`last` = 'Bahringer')\nRETURN DISTINCT `t2`.`start` AS `start`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the start date of patient Walter Bahringer's care plan.",
    "evidence": "start date of the care plan refers to careplans.START;",
    "idx": 999
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`careplans`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Major' AND `t1`.`last` = 'D\\'Amore')\nRETURN DISTINCT `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the care plans of patient Major D'Amore's plan of care.",
    "evidence": "",
    "idx": 1000
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Viral sinusitis (disorder)')\nRETURN CASE WHEN COUNT(`t1`.`patient`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`gender` = 'M' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`patient`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of male patients with viral sinusitis condition.",
    "evidence": "percentage = MULTIPLY(DIVIDE(COUNT(patients.patient WHERE gender = 'M'), COUNT(patients.patient) WHERE conditions.DESCRIPTION = 'Viral sinusitis (disorder))), 100); male patients refers to gender = 'M'; viral sinusitis condition refers to conditions.DESCRIPTION = 'Viral sinusitis (disorder)';",
    "idx": 1001
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Penicillin V Potassium 250 MG')\nRETURN CASE WHEN COUNT(`t1`.`patient`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`gender` = 'F' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`patient`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the patients who have been using Penicillin V Potassium 250 MG, what percentage of patients are female?",
    "evidence": "Penicillin V Potassium 250 MG refers to medications.DESCRIPTION = 'Penicillin V Potassium 250 MG'; percentage = MULTIPLY(DIVIDE(patients.patient WHERE gender = 'F'), COUNT(patients.patient) WHERE medications.DESCRIPTION = 'Penicillin V Potassium 250 MG'), 100) female refers to gender = 'F';",
    "idx": 1002
  }
]