[
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t2`.`youtube` = 'RoskamIL06')\nRETURN `t1`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which legislator has the YouTube channel 'RoskamIL06?' Write the official full name.",
    "evidence": "YouTube channel 'RoskamIL06' refers to youtube = 'RoskamIL06';",
    "idx": 3688
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide_id`\nAND ((`t1`.`youtube` IS NULL OR `t1`.`youtube` = '') AND (`t1`.`instagram` IS NULL OR `t1`.`instagram` = '') AND (`t1`.`twitter` IS NULL OR `t1`.`twitter` = '') AND NOT `t1`.`facebook` IS NULL AND `t1`.`facebook` <> '')\nRETURN `t2`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names of 10 legislators who only have a Facebook account.",
    "evidence": "full names refers to official_full_name; only have a Facebook account refers to youtube is NULL or youtube = '', instagram is NULL or instagram = '', twitter is NULL or twitter = '', facebook is not NULL and facebook = ''",
    "idx": 3689
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`party` = 'Republican' AND `t2`.`state_rank` = 'junior')\nWITH `t1`.`official_full_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the full names of junior ranked Republicans.",
    "evidence": "full name refers to official_full_name; junior refers to state_rank = 'junior'; Republicans refers to party = 'Republican'",
    "idx": 3690
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`official_full_name` = 'Claire McCaskill')\nWITH `t2`.`contact_form` AS _groupby_col_0\nRETURN _groupby_col_0 AS `contact_form`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the contact URL of Claire McCaskill?",
    "evidence": "contact URL refers to contact_form; Claire McCaskill is an official_full_name",
    "idx": 3691
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`historical`)-[has_term_0:has_term]->(`t1`:`historical-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t1`.`party` = 'Readjuster Democrat')\nRETURN `t2`.`wikipedia_id` AS `wikipedia_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the Wikipedia IDs of historical legislators who are Readjuster Democrats.",
    "evidence": "Readjuster Democrats refers to party = 'Readjuster Democrat'",
    "idx": 3692
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`party` = 'Republican' AND NOT `t1`.`nickname_name` IS NULL)\nWITH `t1`.`official_full_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names of Republican legislators who have a nickname.",
    "evidence": "full names refers to official_full_name; Republican refers to party = 'Republican'; nickname refers to nickname_name",
    "idx": 3693
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nRETURN CASE WHEN sum(CASE  WHEN `historical`.`gender_bio` = 'F' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `historical`.`gender_bio` = 'M' THEN 1 ELSE 0 END)) / sum(CASE  WHEN `historical`.`gender_bio` = 'F' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ratio of males and females among historical legislators?",
    "evidence": "male refers to gender_bio = 'M'; female refers to gender_bio = 'F'; calculation = DIVIDE(COUNT(gender_bio = 'M' THEN bioguide_id), COUNT(gender_bio = 'F' THEN bioguide_id))",
    "idx": 3694
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current-terms`:`current-terms`)\nWHERE CASE WHEN `current-terms`.`end` is not NULL THEN apoc.temporal.format(`current-terms`.`end`,'yyyy') ELSE NULL END = '2009' AND `current-terms`.`party` = 'Republican'\nRETURN `current-terms`.`end` AS `end`, `current-terms`.`party` AS `party`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the legislators who will end in 2009, how many are from the Republican party?",
    "evidence": "the legislators who will end in 2009 refers to END 2009; from the Republican party refers to party = 'Republican'",
    "idx": 3695
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`last_name` = 'Collins'\nRETURN `current`.`official_full_name` AS `official_full_name`, `current`.`gender_bio` AS `gender_bio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the official full names and genders of legislators who have Collins as their last name.",
    "evidence": "genders refers to gender_bio; Collins is a last_name",
    "idx": 3696
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical-terms`:`historical-terms`)\nWHERE `historical-terms`.`type` = 'sen'\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `historical-terms`.`class` = 1 THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many percent of senators were from class 1?",
    "evidence": "senator refers to type = 'sen'; class 1 refers to class = 1; calculation = MULTIPLY(DIVIDE(COUNT(class = 1 then bioguide), COUNT(bioguide)), 1.0)",
    "idx": 3697
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`party` = 'Independent')\nWITH `t1`.`official_full_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the current legislators' official full names who are from the Independent party.",
    "evidence": "Independent party refers to party = 'Independent'",
    "idx": 3698
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`state` = 'ME')\nWITH `t1`.`official_full_name` AS _groupby_col_0, `t2`.`relation` AS _groupby_col_1, `t2`.`party` AS _groupby_col_2\nRETURN _groupby_col_0 AS `official_full_name`, _groupby_col_1 AS `relation`, _groupby_col_2 AS `party`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names, religions, and parties of legislators who have served in Maine.",
    "evidence": "full names refers to official_full_name; religion refers to religion_bio; Maine refers to state = \"ME\"",
    "idx": 3699
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (NOT `t2`.`instagram` IS NULL AND `t1`.`thomas_id` < 1000)\nRETURN `t1`.`official_full_name` AS `official_full_name`, `t1`.`nickname_name` AS `nickname_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among legislators who have an Instagram account, list down their full names and nicknames who have a Thomas ID of less than 1000.",
    "evidence": "have an Instagram account refers to instagram is not null; full names refers to official_full_name; nicknames refers to nickname_name; Thomas ID of less than 1000 refers to thomas_id < 1000;",
    "idx": 3700
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`historical`)-[has_term_0:has_term]->(`t1`:`historical-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t2`.`official_full_name` = 'Matt Salmon')\nRETURN `t1`.`end` AS `end`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was the last serving date of Matt Salmon?",
    "evidence": "Matt Salmon is an official_full_name",
    "idx": 3701
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`historical`)-[has_term_0:has_term]->(`t1`:`historical-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (NOT `t2`.`house_history_id` IS NULL AND `t2`.`birthday_bio` =~ '(?i)(?s).*1738.*')\nRETURN `t1`.`party` AS `party`, `t1`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the legislators who have served in the U.S. House, provide the party and the state of the legislators who were born in 1738.",
    "evidence": "have served in the U.S. House refers to house_history_id IS NOT NULL; born in 1738 refers to birthday_bio = 1738",
    "idx": 3702
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`historical`)-[has_term_0:has_term]->(`t1`:`historical-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t1`.`party` = 'Liberal Republican')\nRETURN `t2`.`bioguide_id` AS `bioguide_id`, `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the IDs and full names of legislators from the Liberal Republican party.",
    "evidence": "full_name refers to first_name, last_name; from the Liberal Republican party refers to party = 'Liberal Republican'",
    "idx": 3703
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`gender_bio` = 'M' AND `t2`.`start` = '1793-12-02')\nRETURN COUNT(`t1`.`bioguide_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the legislators who started a term on 2nd December 1793, how many of them were males?",
    "evidence": "started a term on 2nd December 1793 refers to start = '1793-12-02'; male refers to gender_bio = 'M'",
    "idx": 3704
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide_id`\nAND (`t2`.`first_name` = 'Richard')\nRETURN `t2`.`official_full_name` AS `official_full_name`, `t1`.`twitter_id` AS `twitter_id`, `t1`.`youtube_id` AS `youtube_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names, Twitter IDs, and YouTube IDs of legislators who have Richard as their first name.",
    "evidence": "full names refers to official_full_name; Richard as their first name refers to first_name = 'Richard'",
    "idx": 3705
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`first_name` = 'Pearl' AND `t1`.`middle_name` = 'Peden' AND `t1`.`last_name` = 'Oldfield')\nRETURN `t2`.`start` AS `start`, `t2`.`end` AS `end`, `t2`.`party` AS `party`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the start date, end date, and party of Pearl Peden Oldfield.",
    "evidence": "start date refers to start; end date refers to end date; Pearl Peden Oldfield refers to official_full_name; official_full_name refers to first_name, middle_name, last_name",
    "idx": 3706
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`first_name` = 'Amy' AND `current`.`last_name` = 'Klobuchar'\nRETURN `current`.`birthday_bio` AS `birthday_bio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the birthday of Amy Klobuchar?",
    "evidence": "birthday refers to birthday_bio; Amy Klobuchar refers to full name; full name refers to first_name, last_name",
    "idx": 3707
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`fec_id` IS NULL OR `current`.`fec_id` = ''\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many legislators have not been registered in Federal Election Commission data?",
    "evidence": "have not been registered in Federal Election Commission data refers to fec_id is null OR fec_id = ''",
    "idx": 3708
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`gender_bio` = 'F'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of female legislators in the list.",
    "evidence": "female refers to gender_bio = 'F'",
    "idx": 3709
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE NOT `current`.`opensecrets_id` IS NULL AND `current`.`opensecrets_id` <> ''\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the full name of legislators who have accounts on OpenSecrets.org.",
    "evidence": "full name refers to first_name, last_name; have accounts on OpenSecrets.org refers to opensecrets_id IS NOT NULL AND opensecrets_id <> ''",
    "idx": 3710
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`birthday_bio` = localdatetime('1956-08-24T00:00:00')\nRETURN `current`.`middle_name` AS `middle_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the middle name of the legislator whose birthday was on 8/24/1956?",
    "evidence": "birthday was on 8/24/1956 refers to birthday_bio = '1956-08-24'",
    "idx": 3711
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`birthday_bio` = localdatetime('1942-02-20T00:00:00'))\nWITH `t2`.`title` AS _groupby_col_0\nRETURN _groupby_col_0 AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of legislator whose birthday on 2/20/1942?",
    "evidence": "birthday on 2/20/1942 refers to birthday_bio = '1942-02-20'",
    "idx": 3713
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`address` = '317 Russell Senate Office Building Washington DC 20510')\nRETURN `t1`.`gender_bio` AS `gender_bio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the gender of the legislator whose address at 317 Russell Senate Office Building Washington DC 20510?",
    "evidence": "gender refers to gender_bio",
    "idx": 3714
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`state_rank` = 'senior')\nWITH `t1`.`first_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `first_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the first name of legislators who are senior Senator.",
    "evidence": "senior refers to state_rank = 'senior'; only senator has this value 'senior'",
    "idx": 3715
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`current`)-[has_term_1:has_term]->(`t2_sub0`:`current-terms`)\nWHERE `t1_sub0`.`bioguide_id` = `t2_sub0`.`bioguide`\nAND (`t1_sub0`.`gender_bio` = 'M' AND (`t2_sub0`.`class` IS NULL OR `t2_sub0`.`class` = ''))\nWITH `t2_sub0`.`state` AS _groupby_col_0\nRETURN _groupby_col_0 AS `state`  \n}\nWITH *\nRETURN COUNT(`state`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among male legislators, state number of the legislators who are not the senator.",
    "evidence": "male refers to gender_bio = M; not the senator refers to class IS NULL OR class = ''",
    "idx": 3716
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (toString(`t1`.`birthday_bio`) =~ '(?i)(?s).*1964.*')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN NOT `t2`.`class` IS NULL THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of legislators who are Senator and were born in 1964.",
    "evidence": "are senator refers to class IS NOT NULL; born in 1964 refers to birthday_bio = 1964; calculation = MULTIPLY(DIVIDE(COUNT(class IS NOT NULL THEN bioguide_id), COUNT(bioguide_id)), 1.0)",
    "idx": 3717
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t1`.`birthday_bio` = localdatetime('1946-05-27T00:00:00'))\nRETURN `t2`.`twitter` AS `twitter`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the twitter name of the legislator whose birthday was on 5/27/1946?",
    "evidence": "birthday on 5/27/1946 refers to birthday_bio = '1946-05-27'",
    "idx": 3718
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t2`.`youtube` = 'BLuetkemeyer')\nRETURN `t1`.`opensecrets_id` AS `opensecrets_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the opensecrets_id of the legislator whose YouTube name is Bluetkemeyer.",
    "evidence": "Bluetkemeyer refers to youtube",
    "idx": 3719
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t2`.`bioguide` = `t1`.`bioguide_id`\nAND (`t1`.`first_name` = 'Ralph' AND `t1`.`last_name` = 'Abraham')\nRETURN `t2`.`facebook` AS `facebook`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the username of Facebook of Ralph Abraham.",
    "evidence": "username of Facebook refers to facebook; Ralph Abraham is an official_full_name; official_full_name refers to first_name, last_name",
    "idx": 3720
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`address` = '1005 Longworth HOB Washington DC 20515-1408')\nWITH `t1`.`first_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `first_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the first name of the legislator whose address at 1005 Longworth HOB; Washington DC 20515-1408?",
    "evidence": "",
    "idx": 3721
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide_id`\nAND (`t2`.`birthday_bio` = localdatetime('1952-08-24T00:00:00'))\nRETURN `t1`.`instagram` AS `instagram`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the Instagram name of the legislator whose birthday was on 8/24/1952?",
    "evidence": "Instagram name refers to instagram; birthday on 8/24/1952 refers to birthday_bio = '1952-08-24'",
    "idx": 3722
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`gender_bio` = 'F' AND (`t2`.`class` IS NULL OR `t2`.`class` = ''))\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State number of legislators who are not the senator among female legislators.",
    "evidence": "not the senator refers to class IS NULL OR class = ''; female refers to gender_bio = 'F';",
    "idx": 3723
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t1`.`bioguide` = `t2`.`bioguide_id`\nAND (`t1`.`youtube` = 'MaxineWaters')\nRETURN `t2`.`religion_bio` AS `religion_bio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the religion of the legislator whose YouTube name is MaxineWaters.",
    "evidence": "MaxineWaters relates to youtube",
    "idx": 3724
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`title` = 'Minority Leader' AND (`t1`.`fec_id` IS NULL OR `t1`.`fec_id` = ''))\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many minority leaders have not been registered in Federal Election Commission data?",
    "evidence": "minority leaders is a title; have not been registered in Federal Election Commission data refers to fec_id IS NULL OR fec_id = ''",
    "idx": 3725
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`gender_bio` = 'M'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the legislators are male?",
    "evidence": "male refers to gender_bio = 'M';",
    "idx": 3726
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`first_name` = 'John'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of legislators with \"John\" as their first name?",
    "evidence": "",
    "idx": 3728
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE toString(`current`.`birthday_bio`) =~ '(?i)(?s)1960.*'\nRETURN `current`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name of legislators whose born in 1960.",
    "evidence": "full name refers to official_full_name; born in 1960 refers to birthday_bio like '1960%';",
    "idx": 3730
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical`:`historical`)\nWHERE `historical`.`first_name` = 'Benjamin' AND `historical`.`last_name` = 'Hawkins'\nRETURN `historical`.`google_entity_id_id` AS `google_entity_id_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the google entity ID of Benjamin Hawkins?",
    "evidence": "",
    "idx": 3731
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`party` = 'Pro-Administration' AND `t2`.`start` = '1789-03-04' AND `t2`.`end` = '1791-12-31')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the Pro-Administration senator that runs from March 4, 1789 to December 31, 1791?",
    "evidence": "Pro-Administration refers to party = 'Pro-Administration'; senator refers to type = 'sen'; runs from March 4, 1789 refers to start = '1789-03-04'; runs to refers to end = '1791-12-31';",
    "idx": 3732
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`historical`)-[has_term_0:has_term]->(`t1`:`historical-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t1`.`district` = 9)\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the first and last name of the representatives of the house in district 9?",
    "evidence": "representatives refers to type = 'rep';",
    "idx": 3733
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`type` = 'sen' AND `t2`.`state` = 'NJ')\nWITH `t1`.`opensecrets_id` AS _groupby_col_0, `t1`.`thomas_id` AS _groupby_col_1\nRETURN _groupby_col_0 AS `opensecrets_id`, _groupby_col_1 AS `thomas_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the open secrets and thomas ID of the democrat senators of New Jersey.",
    "evidence": "open secrets refers to opensecrets_id; democrat refers to party = democrat; senators refers to type = 'sen'; New Jersey refers to state = 'NJ';",
    "idx": 3735
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`type` = 'sen' AND `t2`.`state` = 'NY')\nRETURN `t1`.`google_entity_id_id` AS `google_entity_id_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the google entity ID of the senators in New York.",
    "evidence": "google entity ID refers to google_entity_id_id; senators refers to type = 'sen'; New York refers to state = 'NY';",
    "idx": 3736
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`rss_url` = 'http://www.corker.senate.gov/public/index.cfm/rss/feed')\nWITH `t1`.`religion_bio` AS _groupby_col_0\nRETURN _groupby_col_0 AS `religion_bio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the religion of the legislator with RSS url of http://www.corker.senate.gov/public/index.cfm/rss/feed.",
    "evidence": "religion refers to religion_bio;",
    "idx": 3737
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`official_full_name` = 'Susan M. Collins')\nWITH `t2`.`party` AS _groupby_col_0\nRETURN _groupby_col_0 AS `party`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the party of the legislator named Susan M. Collins?",
    "evidence": "legislator's name refers to offical_full_name;",
    "idx": 3738
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`last_name` = 'Grout' AND `t1`.`first_name` = 'Jonathan' AND `t2`.`type` = 'rep')\nRETURN `t2`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the district number of the representative of the house named Jonathan Grout.",
    "evidence": "district number refers to district; representative of the house refers to type = 'rep';",
    "idx": 3739
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`opensecrets_id` = 'N00003689' AND `t1`.`thomas_id` = 186)\nWITH `t2`.`party` AS _groupby_col_0, `t2`.`state` AS _groupby_col_1\nRETURN _groupby_col_0 AS `party`, _groupby_col_1 AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the party and state of the legislator that has an open secrets ID of N00003689 and thomas ID of 186?",
    "evidence": "",
    "idx": 3740
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`contact_form` = 'http://www.brown.senate.gov/contact/')\nRETURN `t1`.`official_full_name` AS `official_full_name`, `t1`.`birthday_bio` AS `birthday_bio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the full name and birth date of the legislator with a contact form of http://www.brown.senate.gov/contact/.",
    "evidence": "full name refers to official_full_name; birth date refers to birthday_bio;",
    "idx": 3741
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`google_entity_id_id` = 'kg:/m/02pyzk')\nRETURN `t2`.`state` AS `state`, `t2`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the state and type of term of the legislator with the google entity ID of kg:/m/02pyzk.",
    "evidence": "type of term refers to type; google entity ID refers to google_entity_id_id; google_entity_id_id = 'kg:/m/02pyzk';",
    "idx": 3742
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`first_name` = 'John' AND `t1`.`last_name` = 'Vining')\nRETURN `t2`.`type` AS `type`, `t2`.`end` AS `end`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the type and end date of the term of the legislator named John Vining.",
    "evidence": "end date of the term refers to end;",
    "idx": 3743
  }
]