[
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "CALL(*) {\nMATCH (`productreview_sub0`:`productreview`)\nRETURN `productreview_sub0`.`rating` AS `rating` ORDER BY `rating` IS NULL DESC, `rating`  \nLIMIT 1\n}\nMATCH (`t1`:`productreview`)-[review_for_0:review_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`rating` = `rating`)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the product that has the lowest rating?",
    "evidence": "lowest rating refers to Rating = 1;",
    "idx": 5301
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`department`)\nMATCH (`t2`:`employeedepartmenthistory`)\nWHERE `t1`.`departmentid` = `t2`.`departmentid`\nAND (`t2`.`startdate` >= localdatetime('2009-01-01T00:00:00') AND `t2`.`startdate` < localdatetime('2010-01-01T00:00:00') AND `t1`.`name` = 'Production')\nRETURN COUNT(`t2`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the workers who started working in 2009 are from the Production Department?",
    "evidence": "StartDate BETWEEN '2009-01-01' AND '2009-12-31';",
    "idx": 5302
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`jobtitle` = 'Vice President of Engineering')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`, `t1`.`hiredate` AS `hiredate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the Vice President of Engineering and when did he join the company? Indicate his/her full name.",
    "evidence": "full name = FirstName+MiddleName+LastName; HiredDate refers to the date the person joins the company;",
    "idx": 5303
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`currentflag` = 1 AND `t2`.`rate` <= 30)\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many active employees whose payrate is equal or below 30 per hour.",
    "evidence": "active employee refers to CurrentFlag = 1; Rate< = 30;",
    "idx": 5304
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`department`)\nMATCH (`t2`:`employeedepartmenthistory`)\nWHERE `t1`.`departmentid` = `t2`.`departmentid`\nORDER BY `t2`.`startdate` IS NULL ASC, `t2`.`startdate` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which department has a worker who just recently started working?",
    "evidence": "recently started working refers to latest StartDate;",
    "idx": 5305
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`persontype` = 'SP')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`, `t1`.`gender` AS `gender`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which store sales person was reently hired? Indicate his/her full name and gender.",
    "evidence": "SC is an abbreviation for Store Contact; store contact person refers to PersonType = 'SC'; recently hired refers to latest StartDate;",
    "idx": 5306
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t1`.`sickleavehours` IS NULL DESC, `t1`.`sickleavehours`  \nRETURN `t2`.`payfrequency` AS `payfrequency`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How frequently do the employee with the least number of sick leave hours get paid?",
    "evidence": "least number of sick leave refers to min(SickLeaveHours); PayFrequency = 1 means ‘Salary received monthly’; PayFrequency = 2 means ‘Salary received biweekly';",
    "idx": 5307
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)\nMATCH (`t2`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t2`.`rate` IS NULL DESC, `t2`.`rate`  \nRETURN `t1`.`jobtitle` AS `jobtitle`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which job title has the lowest pay?",
    "evidence": "lowest pay refers to min(Rate);",
    "idx": 5308
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`department`)\nMATCH (`t2`:`employeedepartmenthistory`)\nWHERE `t1`.`departmentid` = `t2`.`departmentid`\nAND (`t1`.`name` = 'Finance')\nRETURN COUNT(`t2`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of employees that worked in the Finance department?",
    "evidence": "",
    "idx": 5309
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`addressline2` <> ''\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many accounts have an address that is too long?",
    "evidence": "address that is too long refers to AddressLine2! = null",
    "idx": 5311
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`address`:`address`)\nORDER BY `address`.`modifieddate` IS NULL ASC, `address`.`modifieddate` DESC \nRETURN `address`.`postalcode` AS `postalcode`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the postal code of the street address of the account that is latest updated?",
    "evidence": "account latest updated refers to year(ModifiedDate) = 2022 and month(ModifiedDate) = 10",
    "idx": 5312
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`billofmaterials`:`billofmaterials`)\nWHERE `billofmaterials`.`enddate` IS NULL\nRETURN COUNT(`billofmaterials`.`billofmaterialsid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many assembly items for bicycles aren't finished?",
    "evidence": "assembly lines that are not finished refers to EndDate = null",
    "idx": 5313
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`billofmaterials`:`billofmaterials`)\nORDER BY `billofmaterials`.`perassemblyqty` IS NULL ASC, `billofmaterials`.`perassemblyqty` DESC \nRETURN `billofmaterials`.`unitmeasurecode` AS `unitmeasurecode`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the unit measure code of the component that is of the greatest need in quantity to create the assembly.",
    "evidence": "greatest need in quantity refers to max(PerAssemblyQty)",
    "idx": 5314
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`document`:`document`)\nWHERE `document`.`documentsummary` IS NULL\nRETURN COUNT(`document`.`documentnode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many product maintenance documents are private?",
    "evidence": "product maintenance documents are private refers to DocumentSummary = null",
    "idx": 5315
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`document`:`document`)\nWHERE `document`.`status` = 1\nRETURN `document`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of the documents that are pending approval.",
    "evidence": "documents pending approval refers to Status = 1",
    "idx": 5316
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`document`)\nWHERE `t1`.`owner` = `t2`.`businessentityid`\nAND (`t1`.`status` = 2)\nRETURN DISTINCT `t2`.`businessentityid` AS `businessentityid`, `t2`.`jobtitle` AS `jobtitle`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the job titles of the employees who has a document that has been approved.",
    "evidence": "document has been approved refers to Status = 2",
    "idx": 5317
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t2`.`birthdate` IS NULL DESC, `t2`.`birthdate`  \nRETURN `t1`.`payfrequency` AS `payfrequency`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the pay frequency of the oldest employee?",
    "evidence": "oldest employee refers to min(BirthDate); PayFrequency = 1 refers to ‘Salary received monthly’; PayFrequency = 2 refers to ‘Salary received biweekly'",
    "idx": 5318
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t2`.`hiredate` IS NULL ASC, `t2`.`hiredate` DESC \nRETURN `t1`.`rate` AS `rate`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the employee who has been hired the latest, what is his or her pay rate?",
    "evidence": "hired the latest refers to max(HireDate)",
    "idx": 5319
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`rate` > 40)\nRETURN sum(CASE  WHEN `t2`.`gender` = 'M' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees who have a pay rate of above 40, how many of them are male?",
    "evidence": "pay rate above 40 refers to Rate>40; male employee refers to Gender = M",
    "idx": 5320
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`salariedflag` = 1)\nRETURN `t1`.`rate` AS `rate` ORDER BY `t1`.`rate` IS NULL ASC, `t1`.`rate` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest pay rate of the employees who are exempt from collective bargaining?",
    "evidence": "employee exempt from collective bargaining refers to SalariedFlag = 1; highest pay rate refers to max(Rate)",
    "idx": 5321
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t2`.`vacationhours` IS NULL ASC, `t2`.`vacationhours` DESC \nRETURN `t1`.`rate` AS `rate`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the pay rate of the employee who has the longest vacation hours?",
    "evidence": "longest vacation hour refers to max(VacationHours)",
    "idx": 5322
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`sickleavehours` > 10 AND `t1`.`rate` > 35)\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees with a pay rate of over 35 have more than 10 sick leave hours?",
    "evidence": "more than 10 sick leave hours refers to SickLeaveHours>10; pay rate over 35 refers to Rate>35;",
    "idx": 5323
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`currentflag` = 1 AND `t2`.`gender` = 'M' AND `t1`.`payfrequency` = 2)\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the active male employees, how many of them are paid with the highest frequency?",
    "evidence": "active status of employees refers to CurrentFlag = 1; Male refers to Gender = 'M'; highest frequency refers to PayFrequency = 2;",
    "idx": 5324
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`gender` = 'M' AND `t2`.`persontype` = 'SP')\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many male employees have the job position of sales person?",
    "evidence": "Sales person refers to PersonType = 'SP'; Male refers to Gender = 'M';",
    "idx": 5325
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nORDER BY `t1`.`birthdate` IS NULL DESC, `t1`.`birthdate`  \nRETURN `t2`.`persontype` AS `persontype`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the job position of the oldest employee?",
    "evidence": "Oldest employee refers to Max ( Subtract((now())-BirthDate));",
    "idx": 5326
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employeepayhistory`)\nMATCH (`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (NOT `t1`.`rate` IS NULL)\nORDER BY `t1`.`rate` IS NULL DESC, `t1`.`rate`  \nRETURN `t2`.`namestyle` AS `namestyle`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name style of the employee with the lowest pay rate?",
    "evidence": "lowest pay rate refers to Min(Rate);",
    "idx": 5327
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`namestyle` = 0 AND `t1`.`maritalstatus` = 'M')\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees who are married, how many of them have a western name style?",
    "evidence": "married refers to MaritalStatus = 'M'; western name style refers to NameStyle = '0';",
    "idx": 5328
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`emailpromotion` = 1 AND `t1`.`sickleavehours` > 10)\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees who have more than 10 hours of sick leave, how many of them wish to receive e-mail promotions?",
    "evidence": "Contact does wish to receive e-mail promotions refers to EmailPromotion = (1,2); more than 10 hours of sick leave refer to SickLeaveHours >10;",
    "idx": 5329
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`emailpromotion` = 1 AND `t1`.`vacationhours` > 20)\nRETURN `t1`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the employees who have more than 20 vacations hours and wish to receive e-mail promotions.",
    "evidence": "Contact does wish to receive e-mail promotions refers to EmailPromotion = (1,2); more than 20 vacations hours refers to VacationHours>20",
    "idx": 5330
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`persontype` = 'SP')\nORDER BY `t1`.`birthdate` IS NULL DESC, `t1`.`birthdate`  \nRETURN `t2`.`additionalcontactinfo` AS `additionalcontactinfo`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the additional contact information of the oldest employee with the jod position of sales person.",
    "evidence": "Sales person refers to PersonType = 'SP'; oldest employee refers to Max (Subtract((now())-BirthDate));",
    "idx": 5331
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`namestyle` = 0 AND `t1`.`gender` = 'M')\nRETURN `t2`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the first name of the male employee who has a western name style?",
    "evidence": "western name style refers to NameStyle = 0; Male refers to Gender = 'M';",
    "idx": 5332
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`currentflag` = 1 AND `t2`.`title` = 'Mr.')\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the active employees, how many of them have a courtesy title of \"Mr\"?",
    "evidence": "active status of employees refers to CurrentFlag = 1;",
    "idx": 5333
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`employeepayhistory`)\nMATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (`t1`.`maritalstatus` = 'M')\nORDER BY `t3`.`rate` IS NULL ASC, `t3`.`rate` DESC \nRETURN `t2`.`demographics` AS `demographics`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the personal information of the married employee who has the highest pay rate.",
    "evidence": "married refers to MaritalStatus = 'M'; Highest pay rate refers to Max(Rate)",
    "idx": 5334
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`persontype` = 'SP')\nORDER BY `t1`.`sickleavehours` IS NULL ASC, `t1`.`sickleavehours` DESC \nRETURN `t2`.`suffix` AS `suffix`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the surname suffix of the employee who works as a store contact and has the longest sick leave hours?",
    "evidence": "store contact refers to PersonType = 'SC';",
    "idx": 5335
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`currentflag` = 1 AND `t2`.`emailpromotion` = 1)\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many active employees do not wish to receive e-mail promotions?",
    "evidence": "active status of employees refers to CurrentFlag = 1; the employee does not wish to receive an e-mail promotion refers to EmailPromotion = 0;",
    "idx": 5336
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:has_credit_card]->()\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`persontype` = 'SC')\nRETURN `t2`.`creditcardid` AS `creditcardid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the credit card IDs of the employees who work as store contact.",
    "evidence": "store contact refers to PersonType = 'SC';",
    "idx": 5337
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`gender` = 'M' AND `t2`.`persontype` = 'EM')\nRETURN CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(`t1`.`vacationhours`)) / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many vacation hours do the male employees have on average?",
    "evidence": "employee refers to PersonType = 'EM'; Male refers to Gender = 'M'; Average = Divide( SUM(VacationHours(PersonType = 'EM'& Gender = 'M')),Count(BusinessEntityID(PersonType = 'EM' & Gender = 'M')));",
    "idx": 5338
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employeepayhistory`)\nMATCH (`t3`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (`t2`.`emailpromotion` = 2 AND `t3`.`maritalstatus` = 'M')\nRETURN MAX(`t1`.`rate`) - CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE sum(`t1`.`rate`) / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees who are married and wish to receive e-mail promotions, how much higher is their highest pay rate from the average pay rate?",
    "evidence": "married refers to MaritalStatus = 'M'; Contact does wish to receive e-mail promotions from Adventure Works refers to EmailPromotion = 1; Average = Divide (Sum(Rate (MaritalStatus = 'M' & EmailPromotion = 1))), Count (BusinessEntityID (MaritalStatus = 'M' & EmailPromotion = 1)); MAX(Rate (MaritalStatus = 'M' & EmailPromotion = 1) - Average;",
    "idx": 5339
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`person`)\nMATCH (`t2`:`employee`)\nWHERE `t1`.`persontype` = 'SC' AND `t1`.`namestyle` = 0 AND `t2`.`maritalstatus` = 'M'\nRETURN CASE WHEN COUNT(`t1`.`persontype`)=0 THEN NULL ELSE toFloat(COUNT(CASE WHEN `t1`.`persontype` = 'SC' THEN `t1`.`persontype` ELSE NULL END)) / COUNT(`t1`.`persontype`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "If a married employee has a western name style, what is the probability of him or her working as a store contact?",
    "evidence": "married refers to MaritalStatus = 'M'; western name style refers to NameStyle = 0; store contact refers to PersonType = 'SC'; probability = Divide (Count (BusinessEntityID( PersonType = 'SC' & MaritalStatus = 'M')), Count (BusinessEntityID ( PersonType) & MariatlStatus = 'M'))\n",
    "idx": 5340
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`employeepayhistory`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`currentflag` = 1 AND `t2`.`sickleavehours` > 10)\nRETURN CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`vacationhours` > 20 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the active employees with over 10 hours of sick leave, what is the percentage of the employees with over 20 vacation hours?",
    "evidence": "CurrentFlag = 1 refers to the active status of employees; Percentage = Divide (Count (BusinessEntityID (CurrentFlag = 1 & VacationHours >20 & SickLeaveHours > 10)), Count (BusinessEntityID (CurrentFlag = 1 & SickLeaveHours>10))) * 100;",
    "idx": 5341
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`transactionhistoryarchive`:`transactionhistoryarchive`)\nWHERE `transactionhistoryarchive`.`transactiontype` = 'P' AND `transactionhistoryarchive`.`transactiondate` >= localdatetime('2012-01-01T00:00:00') AND `transactionhistoryarchive`.`transactiondate` < localdatetime('2012-07-01T00:00:00')\nRETURN CASE WHEN COUNT(`transactionhistoryarchive`.`transactionid`)=0 THEN NULL ELSE toFloat(sum(`transactionhistoryarchive`.`actualcost`)) / COUNT(`transactionhistoryarchive`.`transactionid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Average cost of purchase orders made during the first six months of 2012.",
    "evidence": "purchase orders refers to TransactionType = 'P'; first six months of 2012 refers to TransactionDate bewteen '2012-01-01'and '2012-06-30'; average = DIVIDE(ActualCost where TransactionType = 'P', count(TransactionID))\n",
    "idx": 5343
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`firstname` = 'Mary'\nRETURN CASE WHEN sum(CASE  WHEN `person`.`persontype` = 'SC' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `person`.`emailpromotion` = 2 THEN 1 ELSE 0 END)) * 100 / sum(CASE  WHEN `person`.`persontype` = 'SC' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of people named Mary who wants Receive Email promotions of AdventureWorks and selected partners are store contacts?",
    "evidence": "wants Receive Email promotions of AdventureWorks and selected partners refers to EmailPromotion = 2; store contact refers to PersonType = 'SC'; percentage = DIVIDE(count(BusinessEntityID(FirstName = 'Marry'&EmailPromotion = '2')),count(BusinessEntityID)))\n",
    "idx": 5344
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`purchaseorderheader`:`purchaseorderheader`)\nWHERE `purchaseorderheader`.`status` = 2\nRETURN CASE WHEN COUNT(`purchaseorderheader`.`totaldue`)=0 THEN NULL ELSE sum(`purchaseorderheader`.`totaldue`) / COUNT(`purchaseorderheader`.`totaldue`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average total due price of products with approved status?",
    "evidence": "approved refers to Status = 2 , average total due price = AVG( DIVIDE(TotalDue, SUM(Status = 2 )))",
    "idx": 5346
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesorderdetail`:`salesorderdetail`)\nRETURN CASE WHEN COUNT(`salesorderdetail`.`salesorderid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `salesorderdetail`.`orderqty` < 3 AND `salesorderdetail`.`unitpricediscount` = 0.2 THEN 1 ELSE 0 END)) / COUNT(`salesorderdetail`.`salesorderid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage, by number of sales order units, for orders with quantities not greater than 3 and a discount of 0.2?",
    "evidence": "quantities not greater than 3 refers to OrderQty<3; discount of 0.2 refers to UnitPriceDiscount = 0.2; percentage = DIVIDE(count(SalesOrderID(OrderQty<3 & UnitPriceDiscount = 0.2)), count(SalesOrderID))*100%",
    "idx": 5347
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesperson`:`salesperson`)\nWHERE `salesperson`.`salesytd` > `salesperson`.`saleslastyear` + `salesperson`.`saleslastyear` * 0.6 AND `salesperson`.`bonus` > 3000\nRETURN `salesperson`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Lists all companies by BusinessEntityID that increased their current year sales by more than 60% over last year's sales and have a bonus greater than 3,000.",
    "evidence": "increased their current year sales by more than 60% refers to\nDIVIDE(SUBTRACT(SalesYTD, SalesLastYear),SalesLastYear)>0.6",
    "idx": 5348
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`addresstype`)\nMATCH ()-[t1:has_address]->()\nWHERE `t1`.`addresstypeid` = `t2`.`addresstypeid`\nRETURN sum(CASE  WHEN `t2`.`name` = 'Home' THEN 1 ELSE 0 END) AS `_col_0`, sum(CASE  WHEN `t2`.`name` = 'Shipping' THEN 1 ELSE 0 END) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Add the number of businesses that indicate their home address as their address and those whose address corresponds to the shipping address.",
    "evidence": "their home address as their address refers to AddressTypeID = 2; address corresponds to the shipping address refers to AddressTypeID = 5",
    "idx": 5349
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`customer`)\nMATCH (`t1`:`salesorderdetail`)\nWHERE `t1`.`unitprice` = 35 AND `t1`.`orderqty` = 32\nRETURN `t2`.`customerid` AS `customerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identifies the ID number of the customer whose sales order for 32 units had a unit price of 35.",
    "evidence": "sales order for 32 units refers to OrderQty = 32",
    "idx": 5350
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:has_credit_card]->(`t1`:`creditcard`)\nWHERE `t1`.`creditcardid` = `t2`.`creditcardid`\nAND (`t1`.`cardtype` = 'ColonialVoice' AND `t1`.`expmonth` = 3 AND `t1`.`expyear` = 2005)\nRETURN `t2`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What company has a Colonial Voice card that expired in March 2005?",
    "evidence": "Colonial Voice card refers to CardType = 'ColonialVoice' ; expired in March 2005 refers to ExpMonth = 3, ExpYear = 2005",
    "idx": 5351
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t1:supplied_by]->(`t2`:`vendor`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`standardprice` = 18.9900 AND `t1`.`averageleadtime` = 16 AND CASE WHEN `t1`.`lastreceiptdate` is not NULL THEN apoc.temporal.format(`t1`.`lastreceiptdate`,'yyyy-MM-dd') ELSE NULL END = '2011-08-27')\nRETURN `t2`.`creditrating` AS `creditrating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the credit rating of the company whose average lead time is 16 days for a standard price of 18.9900 and whose last receipt date is August 27, 2011?",
    "evidence": "last receipt date is August 17, 2011 refers to LastReceiptDate> = '2011-08-17 00:00:00' and LastReceiptDate < '2011-08-18 00:00:00';",
    "idx": 5352
  }
]