[
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`chronname` IN ['Brown University', 'Columbia University', 'Cornell University', 'Dartmouth College', 'Harvard University', 'Princeton University', 'University of Pennsylvania', 'Yale University'] AND `t2`.`year` = 2013 AND `t2`.`race` = 'B' AND `t2`.`cohort` = '4y bach')\nORDER BY `t2`.`grad_cohort` IS NULL ASC, `t2`.`grad_cohort` DESC \nRETURN `t1`.`chronname` AS `chronname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the Ivy League Schools in 2013, which schools have the highest number of Black students who graduated within 150 percent of normal/expected time who were seeking a bachelor's/equivalent cohort at 4-year institutions?",
    "evidence": "Ivy League Schools refers to chronname = 'Brown University' or chronname = 'Columbia University' or chronname = 'Cornell University' or chronname = 'Dartmouth College' or chronname = 'Harvard University' or chronname = 'Princeton University' or chronname = 'University of Pennsylvania' or chronname = 'Yale University'; in 2013 refers to year = '2013'; highest number of Black students who graduated within 150 percent of normal/expected time refers to MAX(grad_150 WHERE race = 'B'); seeking a bachelor's/equivalent cohort at 4-year institutions refers to cohort = '4y bach';",
    "idx": 2897
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t1`:`institution_details`)-[has_graduation_data_0:has_graduation_data]->(`t2`:`institution_grads`)\nWHERE `t2`.`unitid` = `t1`.`unitid`\nAND (`t1`.`chronname` = 'United Education Institute-Huntington Park Campus' AND `t2`.`year` >= 2011 AND `t2`.`year` <= 2013 AND `t2`.`gender` = 'M' AND `t2`.`race` = 'H')\nRETURN avg(toFloat(`t2`.`grad_150`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Between 2011 to 2013, what is the average number of male Hispanic degree-seeking students at 2-year institutions who graduated within 150 percent of normal/expected time in United Education Institute-Huntington Park Campus?",
    "evidence": "between 2011 to 2013 refers to year BETWEEN '2011' AND '2013'; male refers to gender = 'M'; Hispanic refers to race = 'H'; number of degree-seeking students at 2-year institutions who graduated within 150 percent of normal/expected time refers to grad_150; United Education Institute-Huntington Park Campus refers to chronname = 'United Education Institute-Huntington Park Campus';",
    "idx": 2898
  },
  {
    "filename": "train.json",
    "db_id": "college_completion",
    "gql_statement": "MATCH (`t2`:`state_sector_details`)-[contains_institutions_0:contains_institutions]->(`t1`:`institution_details`)\nWHERE `t2`.`state` = `t1`.`state`\nORDER BY `t1`.`awards_per_value` - `t2`.`awards_per_natl_value` IS NULL ASC, `t1`.`awards_per_value` - `t2`.`awards_per_natl_value` DESC \nRETURN `t1`.`chronname` AS `chronname`, `t2`.`state_appr_value` AS `state_appr_value`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the school with the highest difference in the average completion rate for the national in which it belongs? Indicate the state appropriations to higher education in fiscal year 2011 per resident to which the school belongs.",
    "evidence": "name of the school refers to chronname; highest difference in the average completion rate for the national in which it belongs = MAX(SUBTRACT(awards_per_value, awards_per_natl_value)); state appropriations to higher education in fiscal year 2011 per resident to which the school belongs refers to state_appr_value;",
    "idx": 2899
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`state` =~ '(?i)(?s)AZ' AND `business`.`stars` < 3\nRETURN COUNT(`business`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Yelp businesses are there in 'AZ' with less than \"3\" stars?",
    "evidence": "AZ refers to state = 'AZ'; stars < 3;",
    "idx": 2900
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_fans` =~ '(?i)(?s)Uber'\nRETURN COUNT(`users`.`user_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many users have \"uber\" number of fans?",
    "evidence": "uber number of fans refers to user_fans = 'uber';",
    "idx": 2903
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`attributes`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t2`.`business_id` = 10172 AND `t1`.`attribute_name` =~ '(?i)(?s)wi-fi')\nRETURN `t2`.`attribute_value` AS `attribute_value`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What kind of \"wi-fi\" does Yelp business No.\"10172\" have?",
    "evidence": "kind of wi-fi refers to attribute_value where attribute_name = 'Wi-Fi'; business No. refers to business_id;",
    "idx": 2905
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`business_categories`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nRETURN sum(CASE  WHEN `t1`.`category_name` =~ '(?i)(?s)Buffets' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t1`.`category_name` =~ '(?i)(?s)Gyms' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many more \"buffets\" than \"gyms\" in Yelp business?",
    "evidence": "buffets refers to category_name = 'Buffets'; gyms refers to category_name = 'Gyms'; difference = SUBTRACT(SUM(category_name = 'Buffets'), SUM(category_name = 'Gyms'));",
    "idx": 2907
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`categories`)\nMATCH (`t1`:`business_categories`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nRETURN CASE WHEN COUNT(`t1`.`business_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`category_name` =~ '(?i)(?s)Automotive' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`business_id`) END AS `percentage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the percentage of \"Automotive\" businesses among all the Yelp businesses.",
    "evidence": "automotive businesses refers to category_name = 'Automotive'; percentage = MULTIPLY(DIVIDE(SUM(category_name = 'Automotive'), COUNT(business_id)), 1.0);",
    "idx": 2909
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`categories`)\nMATCH (`t1`:`business_categories`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nRETURN CASE WHEN COUNT(`t1`.`business_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`category_name` =~ '(?i)(?s)Women\\'s Clothing' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`business_id`) END - CASE WHEN COUNT(`t1`.`business_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`category_name` =~ '(?i)(?s)Men\\'s Clothing' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`business_id`) END AS `more percentage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage more for the \"Women's Clothing\" Yelp businesses to \"Men's Clothing\"?",
    "evidence": "Women's clothing refers to category_name = 'Women''s Clothing'; Men's clothing refers to category_name = 'Men''s Clothing'; percentage more = MULTIPLY(DIVIDE(SUBTRACT(SUM(category_name = 'Women''s Clothing'), SUM(category_name = 'Men''s Clothing')), COUNT(business_id)), 1.0);",
    "idx": 2910
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_yelping_since_year` = 2004\nRETURN COUNT(`users`.`user_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of users who joined Yelp since \"2004\".",
    "evidence": "joined yelp since 2004 refers to user_yelping_since_year = 2004;",
    "idx": 2911
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_yelping_since_year` = 2005 AND `users`.`user_fans` =~ '(?i)(?s)None'\nRETURN COUNT(`users`.`user_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many users who have joined Yelp since \"2005\" but have no fans?",
    "evidence": "joined Yelp since 2005 refers to user_yelping_since_year = 2005; no fans refers to user_fans = 'None';",
    "idx": 2912
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` =~ '(?i)(?s)Tolleson' AND `business`.`active` =~ '(?i)(?s)TRUE'\nRETURN COUNT(`business`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of actively running Yelp businesses in \"Tolleson\".",
    "evidence": "actively running refers to active = 'TRUE'; Tolleson refers to city = 'Tolleson';",
    "idx": 2913
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`reviews`:`reviews`)\nWHERE `reviews`.`user_id` = 21679\nRETURN COUNT(`reviews`.`review_length`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the number of reviews from user No. \"21679\"?",
    "evidence": "user No. refers to user_id;",
    "idx": 2914
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`reviews`:`reviews`)\nWHERE `reviews`.`business_id` = 10682 AND `reviews`.`review_stars` = 5\nRETURN COUNT(`reviews`.`review_length`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many \"5\" star reviews does the Yelp business No. \"10682\" get?",
    "evidence": "5 star reviews refers to review_stars = 5; business No. refers to business_id;",
    "idx": 2915
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`attributes`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t2`.`business_id` = 4960)\nRETURN DISTINCT CASE  WHEN `t1`.`attribute_name` =~ '(?i)(?s)Has TV' THEN 'yes' ELSE 'no' END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Does Yelp business No.\"4960\" have TV?",
    "evidence": "business No. refers to business_id; have TV refers to attribute_name = 'Has TV';",
    "idx": 2917
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`attributes`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t1`.`attribute_name` =~ '(?i)(?s)Dogs Allowed' AND `t2`.`attribute_value` =~ '(?i)(?s)TRUE')\nRETURN COUNT(`t2`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of \"dogs allowed\" Yelp businesses.",
    "evidence": "number of Yelp businesses refers to business_id; dogs allowed refers to attribute_name = 'Dogs Allowed' AND attribute_value = 'true';",
    "idx": 2918
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business_hours`)\nMATCH (`t2`:`days`)\nWHERE `t1`.`day_id` = `t2`.`day_id`\nAND (`t2`.`day_of_week` =~ '(?i)(?s)Saturday' AND `t1`.`business_id` = 5734)\nRETURN toFloat(`t1`.`closing_time`) - toFloat(`t1`.`opening_time`) AS `hour`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many hours does the Yelp business No. \"5734\" open on Saturday?",
    "evidence": "how many hours = SUBTRACT(closing_time, opening_time); business No. refers to business_id; open on Saturday refers to day_of_week = 'Saturday';",
    "idx": 2919
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`business_categories`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nAND (`t1`.`category_name` =~ '(?i)(?s)Hair Removal')\nRETURN COUNT(`t1`.`category_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of \"hair removal\" Yelp businesses.",
    "evidence": "hair removal refers to category_name = 'Hair Removal';",
    "idx": 2920
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`business_categories`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nRETURN sum(CASE  WHEN `t1`.`category_name` =~ '(?i)(?s)Chinese' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t1`.`category_name` =~ '(?i)(?s)Filipino' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many more \"Chinese\" than \"Filipino\" Yelp businesses?",
    "evidence": "Chinese refers to category_name = 'Chinese'; Filipino refers to category_name = 'Filipino'; how many more = SUBTRACT(SUM(category_name = 'Chinese'), SUM(category_name = 'Filipino'));",
    "idx": 2921
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`attributes`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t2`.`attribute_value` =~ '(?i)(?s)TRUE' AND `t2`.`business_id` = 1141)\nRETURN COUNT(`t1`.`attribute_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many types of music does Yelp business No.\"1141\" have?",
    "evidence": "types of music refers to attribute_name LIKE '%music%' WHERE attribute_value = 'true'; business No. refers to business_id;\n",
    "idx": 2923
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "WITH *, COLLECT { MATCH (`compliments_sub0`:`compliments`)\nWHERE `compliments_sub0`.`compliment_type` =~ '(?i)(?s)funny'\nRETURN `compliments_sub0`.`compliment_id` AS `compliment_id`   } AS in_collect_0\nMATCH (`users_compliments`:`users_compliments`)\nWHERE `users_compliments`.`compliment_id` IN in_collect_0\nRETURN `users_compliments`.`user_id` AS `user_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who has got the most number of \"funny\" type of compliments? Give the user ID.",
    "evidence": "type of compliments refers to compliment_type; most number of funny type of compliments refers to MAX(COUNT(number of compliments = 'high' WHERE compliment_type = 'funny'));",
    "idx": 2925
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`state` =~ '(?i)(?s)AZ' AND `business`.`stars` = 5\nRETURN `business`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of business in AZ with a rating of 5.",
    "evidence": "AZ refers to state = 'AZ'; rating refers to stars;",
    "idx": 2926
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` =~ '(?i)(?s)Scottsdale' AND `business`.`stars` > 3\nRETURN COUNT(`business`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many businesses in Scottsdale are rated as \"wonderful experience\"?",
    "evidence": "Scottsdale refers to city = 'Scottsdale'; rated refers to stars; rated as wonderful experience refers to stars > 3;",
    "idx": 2930
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`attribute_value` =~ '(?i)(?s)full.bar')\nWITH `t1`.`city` AS _groupby_col_0\nRETURN _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which city has the most businesses whose attribute is full_bar?",
    "evidence": "most business refers to MAX(business_id); full_bar refers to attribute_value = 'full_bar';",
    "idx": 2933
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`reviews`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`city` =~ '(?i)(?s)Mesa' AND `t2`.`review_stars` > 3)\nWITH `t1`.`business_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all business IDs in Mesa city that review stars of over 3.",
    "evidence": "stars > 3;",
    "idx": 2934
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`reviews`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`review_votes_funny` =~ '(?i)(?s)low')\nWITH `t1`.`city` AS _groupby_col_0\nRETURN _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which city has the least number of businesses whose amount of funny votes is low?",
    "evidence": "least number of businesses refers to MIN(business_id); funny votes is low refers to review_votes_funny = 'Low';",
    "idx": 2935
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`reviews`)\nMATCH (`t2`:`business`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`state` =~ '(?i)(?s)AZ' AND `t1`.`review_stars` = 5)\nRETURN DISTINCT `t2`.`business_id` AS `business_id`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please state any three business numbers in AZ state that have received the \"Great experience\" review stars.",
    "evidence": "business numbers refers to business_id; great experience review stars refers to review_stars = 5;",
    "idx": 2942
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`attributes`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t2`.`attribute_value` =~ '(?i)(?s)none')\nRETURN `t1`.`attribute_name` AS `attribute_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please name one attribute that business number 2 does not have.",
    "evidence": "business number refers to business_id; business_id = 2; does not have refers to attribute_value = 'none';",
    "idx": 2943
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business_hours`)\nMATCH (`t2`:`days`)\nWHERE `t1`.`day_id` = `t2`.`day_id`\nAND (`t2`.`day_of_week` =~ '(?i)(?s)Friday' AND `t1`.`business_id` = 53)\nRETURN toFloat(`t1`.`closing_time`) - toFloat(`t1`.`opening_time`) AS `opening hours`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the opening hours of business number 53 on Friday?",
    "evidence": "opening hours refers to opening_time; business number refers to business_id; Friday refers to day_of_week = 'Friday';",
    "idx": 2945
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`compliments`)\nMATCH (`t1`:`users_compliments`)\nWHERE `t1`.`compliment_id` = `t2`.`compliment_id`\nAND (`t1`.`number_of_compliments` =~ '(?i)(?s)Uber' AND `t2`.`compliment_type` =~ '(?i)(?s)cute')\nRETURN `t1`.`user_id` AS `user_id`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any two user numbers that have an \"Uber\" number of cute compliments.",
    "evidence": "user numbers refers to user_id; Uber number refers to number_of_compliments = 'Uber'; cute compliments refers to compliment_type = 'cute';",
    "idx": 2948
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`business_hours`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`business_id` = 12 AND `t1`.`city` =~ '(?i)(?s)Scottsdale' AND `t2`.`day_id` = 3)\nRETURN toFloat(`t2`.`closing_time`) - toFloat(`t2`.`opening_time`) AS `hour`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How long does business number 12 in Scottsdale stay open on day number 3?",
    "evidence": "business number refers to business_id; Scottsdale refers to city = 'Scottsdale'; day number refers to day_id;",
    "idx": 2949
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`stars` = 5\nWITH `business`.`city` AS _groupby_col_0\nRETURN _groupby_col_0 AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the cities of the Yelp_Businesses that have gotten a 5 in the Elitestar rating.",
    "evidence": "5 in the Elitestar rating refers to stars = 5;",
    "idx": 2956
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_fans` =~ '(?i)(?s)High'\nWITH `users`.`user_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `user_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the users who have a high number of followers.",
    "evidence": "high number of followers refers to user_fans = 'High'",
    "idx": 2961
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`attributes`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t1`.`attribute_name` =~ '(?i)(?s)Good for Kids' AND `t2`.`attribute_value` =~ '(?i)(?s)TRUE')\nRETURN `t2`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the business IDs of all the Yelp_Businesses that are good for kids.",
    "evidence": "good for kids refers to attribute_name = 'Good for Kids' and attribute_value = 'true'\n",
    "idx": 2963
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`business_categories`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nAND (`t1`.`category_name` =~ '(?i)(?s)Shopping')\nRETURN COUNT(`t1`.`category_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Yelp_Business falls under the category of \"Shopping\"?",
    "evidence": "category of \"Shopping\" refers to category_name = 'Shopping'",
    "idx": 2964
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` =~ '(?i)(?s)Mesa' AND `business`.`stars` >= 2 AND `business`.`stars` <= 3\nRETURN `business`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the business ID with a star range from 2 to 3, located at Mesa.",
    "evidence": "star range from 2 to 3 refers to stars > = 2 AND stars < 4;  located at Mesa refers to city = 'Mesa'",
    "idx": 2976
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`elite`:`elite`)\nRETURN CASE WHEN COUNT(CASE  WHEN `elite`.`year_id` = 2005 THEN 1.0 ELSE NULL END)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `elite`.`year_id` < 2014 THEN 1 ELSE NULL END)) * 100 / COUNT(CASE  WHEN `elite`.`year_id` = 2005 THEN 1.0 ELSE NULL END) END AS `increment`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the increment percentage of elite user for each year since year 2005.",
    "evidence": "since year 2005 refers to year_id Between 2005 and 2014; increment percentage = Divide(Count(user_id(year_id < 2014)), Count (user_id(year_id = 2015))) * 100",
    "idx": 2986
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`users`)\nMATCH (`t1`:`reviews`)\nWHERE `t1`.`user_id` = `t2`.`user_id`\nAND (`t1`.`user_id` = 3)\nRETURN COUNT(`t1`.`business_id`) AS `_col_0`, toFloat(CASE WHEN 'now' is not NULL THEN apoc.temporal.format('now','yyyy') ELSE NULL END) - `t2`.`user_yelping_since_year` AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many business have been reviewed by user ID 3 and how long have this user been with Yelp?",
    "evidence": "year with yelp = Subtract ('%Y'(CURRENT TIME), user_yelping_since_year)",
    "idx": 2987
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` =~ '(?i)(?s)Phoenix' AND `business`.`review_count` =~ '(?i)(?s)Low'\nRETURN `business`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the business ID with a low review count in Phoenix.",
    "evidence": "\"Phoenix\" is the city; low review count refers to review_count = 'Low'",
    "idx": 2991
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` =~ '(?i)(?s)Tempe' AND `business`.`stars` >= 3 AND `business`.`stars` <= 4\nRETURN `business`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the business ID with a star range from 3 to 4, located at Tempe.",
    "evidence": "star range from 3 to 4 refers to stars > = 3 AND stars < 5; 'Tempe' is the name of city",
    "idx": 2993
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_average_stars` = '4'\nRETURN COUNT(`users`.`user_id`) AS `_col_0`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List at least 10 users ID that has 4 as an average ratings of all reviews sent.",
    "evidence": "4 as an average rating refers to user_average_stars = 4",
    "idx": 2998
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`attributes`:`attributes`)\nWHERE `attributes`.`attribute_name` = 'Accepts Insurance'\nRETURN `attributes`.`attribute_id` AS `attribute_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the ID number for the attribute named \"Accepts Insurance\"?",
    "evidence": "ID number refers to attribute_id",
    "idx": 3002
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`active` = 'true' AND `business`.`city` = 'Phoenix'\nRETURN COUNT(`business`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many actively running Yelp businesses are there located in \"Phoenix\" city?",
    "evidence": "actively running business refers to active = 'true'; 'Phoenix' is the name of city",
    "idx": 3003
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`stars` = 4 AND `business`.`city` = 'Mesa'\nRETURN COUNT(`business`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of \"4\" stars Yelp businesses in \"Mesa\" city.",
    "evidence": "\"4\" stars refers to stars = '4'; 'Mesa' is the name of city",
    "idx": 3004
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`review_count` = 'High' AND `business`.`city` = 'Gilbert'\nRETURN COUNT(`business`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of Yelp businesses in \"Gilbert\" which got a\" high\" review count.",
    "evidence": "\"Gilbert\" is the name of city; high review count refers to review_count = 'High'",
    "idx": 3005
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`reviews`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`active` = 'true' AND `t1`.`city` = 'Gilbert' AND `t1`.`review_count` = 'Uber')\nRETURN DISTINCT `t1`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which actively running Yelp business in \"Gilbert\" has got the most reviews? Give the business id.",
    "evidence": "actively running business refers to active = 'true'; 'Gilbert' is the name of city; most review refers to review_count = 'Uber'",
    "idx": 3006
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business_hours`)\nMATCH (`t2`:`days`)\nWHERE `t1`.`day_id` = `t2`.`day_id`\nAND (`t2`.`day_of_week` = 'Monday' AND `t1`.`business_id` = 15098)\nRETURN toFloat(CASE  WHEN 1-1 < 0 AND 2 < 0  THEN substring(`t1`.`closing_time`,(case when size(`t1`.`closing_time`)+1+(1-1)+2 < 0 then 0 else size(`t1`.`closing_time`)+1+(1-1)+2 end),-(2))  WHEN 1-1 < 0 AND 2 >= 0  THEN substring(`t1`.`closing_time`,size(`t1`.`closing_time`)+1+(1-1),2)  WHEN 1-1 >= 0 AND 2 < 0  THEN substring(`t1`.`closing_time`,(case when 1-1+1+(2) < 0 then 0 else 1-1+1+(2) end),-(2))  ELSE substring(`t1`.`closing_time`,1-1,2) END) + 12 - toFloat(CASE  WHEN 1-1 < 0 AND 2 < 0  THEN substring(`t1`.`opening_time`,(case when size(`t1`.`opening_time`)+1+(1-1)+2 < 0 then 0 else size(`t1`.`opening_time`)+1+(1-1)+2 end),-(2))  WHEN 1-1 < 0 AND 2 >= 0  THEN substring(`t1`.`opening_time`,size(`t1`.`opening_time`)+1+(1-1),2)  WHEN 1-1 >= 0 AND 2 < 0  THEN substring(`t1`.`opening_time`,(case when 1-1+1+(2) < 0 then 0 else 1-1+1+(2) end),-(2))  ELSE substring(`t1`.`opening_time`,1-1,2) END) AS `yysj`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How long is the Yelp business No. 15098 opened on Monday?",
    "evidence": "Yelp business No. 15098 refers to business_id = '15098'; Monday refers to day_of_week = 'Monday'",
    "idx": 3009
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`reviews`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`city` = 'Phoenix' AND `t2`.`review_stars` = 5 AND `t2`.`review_votes_funny` = 'Uber')\nRETURN `t1`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the Yelp businesses which received a \"5\" star review with \"uber\" number of votes for funny, which one is located in \"Phoenix\"? Give the business ID.",
    "evidence": "located in \"Phoenix\" refers to city = 'Phoenix'; received a \"5\" star review refers to review_stars = '5'; \"uber\" number of votes for funny refers to review_votes_funny = 'Uber'",
    "idx": 3010
  }
]