[
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->()\nMATCH (t3@`game_platform`)-[available_on_0:`available_on`]->(t4@`platform`)\nWHERE t1.`id` = t2.`publisher_id`\nAND t2.`id` = t3.`game_publisher_id`\nAND t3.`platform_id` = t4.`id`\nAND (t3.`release_year` = 2004 AND t1.`publisher_name` = 'Codemasters')\nRETURN t4.`platform_name` AS `platform_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In 2004, what are the names of the platforms where Codemasters publish its games?",
    "evidence": "name of platform refers to platform_name; Codemasters refers to publisher_name = 'Codemasters'; in 2004 refers to release_year = 2004",
    "idx": 1708
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t1@`platform`)\nMATCH ()-[t3:`published_by`]->()\nWHERE t1.`id` = t2.`platform_id`\nAND t2.`game_publisher_id` = t3.`id`\nAND (t1.`platform_name` = 'PS4' AND t2.`release_year` = 2014)\nRETURN COUNT(DISTINCT t3.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games were released on PS4 in 2014?",
    "evidence": "on PS4 refers to platform_name = 'PS4'; in 2014 refers to release_year = 2014",
    "idx": 1709
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)\nMATCH ()-[t2:`published_by`]->(t3@`publisher`)\nWHERE t1.`game_publisher_id` = t2.`id`\nAND t2.`publisher_id` = t3.`id`\nORDER BY t1.`release_year`  NULLS FIRST \nRETURN DISTINCT t3.`publisher_name` AS `publisher_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the publishers who published the oldest games?",
    "evidence": "name of publisher refers to publisher_name; the oldest game refers to min(release_year)",
    "idx": 1710
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t3@`game_platform`)-[has_sales_0:`has_sales`]->(t2@`region_sales`)-[sold_in_0:`sold_in`]->(t1@`region`)\nMATCH (t3@`game_platform`)-[available_on_0:`available_on`]->(t4@`platform`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`game_platform_id` = t3.`id`\nAND t3.`platform_id` = t4.`id`\nAND (t4.`platform_name` = 'X360' AND t3.`release_year` = 2011 AND t1.`region_name` = 'Japan')\nRETURN COUNT(t3.`game_publisher_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many publishers in Japan released a game on X360 in 2011?",
    "evidence": "in Japan refers to region_name = 'Japan'; on X360 refers to platform_name = 'X360'; in 2011 refers to release_year = 2011",
    "idx": 1711
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->(t3@`game`)\nWHERE t1.`id` = t2.`publisher_id`\nAND t2.`game_id` = t3.`id`\nAND (t1.`publisher_name` = '505 Games')\nRETURN t3.`game_name` AS `game_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the games that were published by 505 Games?",
    "evidence": "name of game refers to game_name; published by 505 Games refers to publisher_name = '505 Games'",
    "idx": 1712
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game`)\nWHERE t.`game_name` = '25 to Life'\nRETURN t.`genre_id` AS `genre_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre ID of the game named 25 to Life?",
    "evidence": "the game named 25 to Life refers to game_name = '25 to Life'",
    "idx": 1713
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`region_sales`)\nWHERE t.`region_id` = 2 AND t.`game_platform_id` = 9615\nRETURN t.`num_sales` * 100000 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of sales in region ID 2 with game platform ID 9615?",
    "evidence": "number of sales refers to multiply(num_sales, 100000)",
    "idx": 1718
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)\nMATCH ()-[t2:`publishes`]->(t3@`game`)\nWHERE t1.`game_publisher_id` = t2.`id`\nAND t2.`game_id` = t3.`id`\nAND (t3.`game_name` = '3DS Classic Collection')\nRETURN t1.`release_year` AS `release_year`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When was the game titled 3DS Classic Collection released?",
    "evidence": "when refers to release_year; the game titled 3DS Classic Collection refers to game_name = '3DS Classic Collection'",
    "idx": 1720
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`region_sales`)-[sold_in_0:`sold_in`]->(t1@`region`)\nWHERE t1.`id` = t2.`region_id`\nAND (t1.`region_name` = 'Japan')\nRETURN avg(t2.`num_sales`) * 100000 AS `avg_japan`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of sales in Japan?",
    "evidence": "in Japan refers to region_name = 'Japan'; average number of sales = multiply(avg(num_sales), 100000) where region_name = 'Japan'",
    "idx": 1721
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t2.`genre_name` = 'Role-Playing')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many role-playing games are there?",
    "evidence": "role-playing game refers to genre_name = 'Role-Playing'",
    "idx": 1724
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t3@`game_platform`)-[has_sales_0:`has_sales`]->(t2@`region_sales`)-[sold_in_0:`sold_in`]->(t1@`region`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`game_platform_id` = t3.`id`\nAND (t2.`num_sales` * 100000 = 350000 AND t1.`region_name` = 'North America')\nRETURN t3.`release_year` AS `release_year`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the release year of the game that gained 350000 sales in North America?",
    "evidence": "gained 350000 sales refers to num_sales = 3.5; in North America refers to region_name = 'North America'",
    "idx": 1726
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t1@`platform`)\nMATCH ()-[t3:`publishes`]->(t4@`game`)\nWHERE t1.`id` = t2.`platform_id`\nAND t2.`game_publisher_id` = t3.`id`\nAND t3.`game_id` = t4.`id`\nAND (t4.`game_name` = 'Counter Force')\nRETURN t1.`platform_name` AS `platform_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which platform does the game titled 15 Days available?",
    "evidence": "platform refers to platform_name; the game titled 15 Days refers to game_name = '15 Days'",
    "idx": 1727
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t1@`platform`)\nMATCH ()-[t3:`published_by`]->()\nWHERE t1.`id` = t2.`platform_id`\nAND t2.`game_publisher_id` = t3.`id`\nAND (t2.`release_year` = 2004)\nRETURN cast (COUNT(CASE  WHEN t1.`platform_name` = 'PSP' THEN t3.`game_id` ELSE NULL END) as float) * 100 / COUNT(t3.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the games released in 2004, what is the percentage of games on PSP?",
    "evidence": "in 2004 refers to release_year = 2004; on PSP refers to platform_name = 'PSP'; percentage = divide(sum(platform_id where platform_name = 'PSP'), count(platform_id)) * 100% where release_year = 2004",
    "idx": 1729
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game_platform`)\nWHERE t.`release_year` = 1981\nRETURN COUNT(t.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games were released in 1981?",
    "evidence": "released in 1981 refers to release_year = 1981",
    "idx": 1730
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game`)\nWHERE t.`game_name` = '2Xtreme'\nRETURN t.`genre_id` AS `genre_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre ID of the '2Xtreme' game?",
    "evidence": "the '2Xtreme' game refers to game_name = '2Xtreme'",
    "idx": 1731
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t2.`genre_name` = 'Puzzle')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games are puzzle genre?",
    "evidence": "puzzle genre refers to genre_name = 'Puzzle'",
    "idx": 1737
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH ()-[t1:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`id`\nAND (t2.`publisher_name` = 'Acclaim Entertainment')\nRETURN COUNT(DISTINCT t1.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games were published by Acclaim Entertainment?",
    "evidence": "published by Acclaim Entertainment refers to publisher_name = 'Acclaim Entertainment'",
    "idx": 1739
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)-[available_on_0:`available_on`]->(t2@`platform`)\nWHERE t1.`platform_id` = t2.`id`\nAND (t2.`platform_name` = 'Wii')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games can be played on the Wii platform?",
    "evidence": "on the Wii platform refers to platform_name = 'Wii'",
    "idx": 1743
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game`)\nORDER BY char_length(t.`game_name`) DESC NULLS LAST \nRETURN t.`game_name` AS `game_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which game has the longest name?",
    "evidence": "game refers to game_name; the longest name refers to max(length(game_name))",
    "idx": 1748
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game_platform`)\nWHERE t.`release_year` = 2001\nRETURN COUNT(t.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games were released in 2001?",
    "evidence": "released in 2001 refers to release_year = 2001",
    "idx": 1749
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`region_sales`)\nRETURN sum(t.`num_sales`) * 100000 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of sales across all regions?",
    "evidence": "total number of sales = sum(num_sales)",
    "idx": 1750
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH ()-[t:`published_by`]->()\nRETURN cast (COUNT(t.`game_id`) as float) / COUNT(DISTINCT t.`publisher_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of games published by a publisher?",
    "evidence": "average number = divide(count(game_id), count(publisher_id))",
    "idx": 1751
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game_platform`)\nRETURN min(t.`release_year`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the first year a game is released?",
    "evidence": "the first year refers to min(release_year)",
    "idx": 1752
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`region_sales`)-[sold_in_0:`sold_in`]->(t2@`region`)\nWHERE t1.`region_id` = t2.`id`\nAND (t2.`region_name` = 'Europe' AND t1.`num_sales` = 0)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games do not have any sales in Europe?",
    "evidence": "do not have any sales refers to num_sales = 0; in Europe refers to region_name = 'Europe'",
    "idx": 1754
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)\nMATCH ()-[t2:`publishes`]->(t3@`game`)\nWHERE t1.`game_publisher_id` = t2.`id`\nAND t2.`game_id` = t3.`id`\nAND (t1.`release_year` = 2006)\nRETURN t3.`game_name` AS `game_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the games that were released in 2006?",
    "evidence": "game refers to game_name; released in 2006 refers to release_year = 2006",
    "idx": 1755
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t3@`game_platform`)-[has_sales_0:`has_sales`]->(t2@`region_sales`)-[sold_in_0:`sold_in`]->(t1@`region`)\nMATCH ()-[t4:`publishes`]->(t5@`game`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`game_platform_id` = t3.`id`\nAND t3.`game_publisher_id` = t4.`id`\nAND t4.`game_id` = t5.`id`\nAND (t1.`region_name` = 'Japan')\nORDER BY t2.`num_sales` DESC NULLS LAST \nRETURN t5.`game_name` AS `game_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which game has the most sales in Japan?",
    "evidence": "\nwhich game refers to game_name; most sales refers to MAX(num_sales); Japan refers to region_name = 'Japan';",
    "idx": 1759
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game`)-[belongs_to_0:`belongs_to`]->(t1@`genre`)\nWHERE t1.`id` = t2.`genre_id`\nRETURN cast (COUNT(CASE  WHEN t1.`genre_name` = 'Sports' THEN t2.`id` ELSE NULL END) as float) * 100 / COUNT(t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of games are sports?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(genre_name = 'sport'), COUNT(game_name)), 100.0); sports refers to genre_name = 'sport';",
    "idx": 1762
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`region_sales`)-[sold_in_0:`sold_in`]->(t2@`region`)\nWHERE t1.`region_id` = t2.`id`\nRETURN sum(CASE  WHEN t2.`region_name` = 'North America' THEN t1.`num_sales` ELSE 0 END) / sum(CASE  WHEN t2.`region_name` = 'Japan' THEN t1.`num_sales` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio of game sales between North America and Japan?",
    "evidence": "ratio = DIVIDE(SUM(num_sales WHERE region_name = 'North America'), SUM(num_sales WHERE region_name = 'Japan')); North America refers to region_name = 'North America'; Japan refers to region_name = 'Japan';",
    "idx": 1763
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`publisher`)\nWHERE like(t.`publisher_name`,'%Interactive%')\nRETURN COUNT(t.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many video game publishers have Interactive in their names?",
    "evidence": "publishers that have Interactive in their names refers to publisher_name LIKE '%Interactive%';",
    "idx": 1764
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t3@`game_platform`)-[has_sales_0:`has_sales`]->(t2@`region_sales`)-[sold_in_0:`sold_in`]->(t1@`region`)\nMATCH (t3@`game_platform`)-[available_on_0:`available_on`]->(t4@`platform`)\nWHERE t1.`id` = t2.`region_id`\nAND t2.`game_platform_id` = t3.`id`\nAND t3.`platform_id` = t4.`id`\nAND (t1.`region_name` = 'North America')\nORDER BY t2.`num_sales` DESC NULLS LAST \nRETURN t4.`platform_name` AS `platform_name` \nLIMIT 2",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the top 2 platforms with the most sales in North America?",
    "evidence": "platforms refers to platform_name; most sales refers to MAX(num_sales); North America refers to region_name = 'North America';",
    "idx": 1765
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t3@`game_platform`)\nMATCH (t1@`publisher`)-[t2:`publishes`]->()\nWHERE t1.`id` = t2.`publisher_id`\nAND t2.`id` = t3.`game_publisher_id`\nAND (t3.`release_year` = 2012)\nRETURN COUNT(DISTINCT t2.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games did BMG Interactive Entertainment release in 2012?",
    "evidence": "BMG Interactive Entertainment refers to publisher_name = 'BMG Interactive Entertainment'; release in 2012 refers to release_year = 2012;",
    "idx": 1766
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[t2:`published_by`]->()\nWHERE t1.`id` = t2.`game_id`\nAND (t1.`game_name` = 'Minecraft')\nRETURN COUNT(t2.`publisher_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many publishers published the Minecraft game?",
    "evidence": "Minecraft refers to game_name = 'Minecraft';",
    "idx": 1767
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->(t3@`game`)-[belongs_to_0:`belongs_to`]->(t4@`genre`)\nWHERE t1.`id` = t2.`publisher_id`\nAND t2.`game_id` = t3.`id`\nAND t3.`genre_id` = t4.`id`\nAND (t4.`genre_name` = 'Sports' AND t1.`publisher_name` = 'Nintendo')\nRETURN COUNT(t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Sports games did Nintendo publish?",
    "evidence": "Sports games refers to game_name WHERE genre_name = 'Sports'; Nintendo refers to publisher_name = 'Nintendo';",
    "idx": 1768
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t1.`game_name` = '2 Games in 1: Sonic Advance & ChuChu Rocket!')\nRETURN t2.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre of the game '2 Games in 1: Sonic Advance & ChuChu Rocket!'?",
    "evidence": "genre refers to genre_name; '2 Games in 1: Sonic Advance & ChuChu Rocket!' is a game name;",
    "idx": 1769
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t1@`platform`)\nMATCH (t3@`region_sales`)-[sold_in_0:`sold_in`]->(t4@`region`)\nWHERE t1.`id` = t2.`platform_id`\nAND t1.`id` = t3.`game_platform_id`\nAND t3.`region_id` = t4.`id`\nAND (t1.`platform_name` = 'DS' AND t4.`region_name` = 'Other' AND t3.`num_sales` > 0)\nRETURN COUNT(DISTINCT t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times did other regions make positive sales in DS platform?",
    "evidence": "other regions refers to region_name = 'Other'; positive sales refers to num_sales > 0; DS platform refers to platform_name = 'DS';",
    "idx": 1770
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->(t3@`game`)\nWHERE t1.`id` = t2.`publisher_id`\nAND t2.`game_id` = t3.`id`\nAND (t1.`publisher_name` = 'American Softworks')\nRETURN t3.`game_name` AS `game_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the games published by American Softworks?",
    "evidence": "names of the games refers to game_name; American Softworks refers to publisher_name = 'American Softworks';",
    "idx": 1771
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game`)-[belongs_to_0:`belongs_to`]->(t1@`genre`)\nWHERE t1.`id` = t2.`genre_id`\nRETURN COUNT(CASE  WHEN t1.`genre_name` = 'Strategy' THEN t2.`id` ELSE NULL END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many strategy games are there?",
    "evidence": "strategy games refers game_name WHERE genre_name = 'Strategy';",
    "idx": 1772
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[t2:`published_by`]->(t3@`publisher`)\nWHERE t1.`id` = t2.`game_id`\nAND t2.`publisher_id` = t3.`id`\nAND (t1.`game_name` = 'Overwatch')\nRETURN t3.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which publisher published Overwatch?",
    "evidence": "which publisher refers to publisher_name; Overwatch refers to game_name = 'Overwatch';",
    "idx": 1773
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`region_sales`)-[sold_in_0:`sold_in`]->(t1@`region`)\nWHERE t1.`id` = t2.`region_id`\nAND (t2.`game_platform_id` = 26 AND t1.`region_name` = 'Europe')\nRETURN t2.`num_sales` * 100000 AS `nums_eur`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of games sold in Europe for game platform ID 26?",
    "evidence": "total number of games sold = MULTIPLY(num_sales, 100000); Europe refers to region_name = 'Europe';",
    "idx": 1774
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game_platform`)\nWHERE t.`release_year` = 2001\nRETURN COUNT(t.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games were released in the year 2001?",
    "evidence": "released in the year 2001 refers to release_year = 2001;",
    "idx": 1775
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`region_sales`)\nRETURN t.`game_platform_id` AS `game_platform_id`, sum(t.`num_sales`) * 100000 AS `_col_1` \nGROUP BY game_platform_id\nORDER BY _col_1 DESC NULLS LAST \nLIMIT 3",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the three largest numbers of games sold?",
    "evidence": "3 largest numbers of games sold refers to game_name where MAX(num_sales) LIMIT 3;",
    "idx": 1776
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`game_platform`)\nORDER BY t.`release_year`  NULLS FIRST \nRETURN t.`release_year` AS `release_year` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What year were the first game released?",
    "evidence": "year the first game was released refers to MIN(release_year);",
    "idx": 1777
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`publisher`)\nWHERE like(t.`publisher_name`,'%Entertainment%')\nRETURN t.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What publishers have the word 'Entertainment' in their name?",
    "evidence": "publishers that have the word 'Entertainment' in their name refers to publisher_name LIKE '%Entertainment%';",
    "idx": 1778
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->(t3@`game`)-[belongs_to_0:`belongs_to`]->(t4@`genre`)\nWHERE t1.`id` = t2.`publisher_id`\nAND t2.`game_id` = t3.`id`\nAND t3.`genre_id` = t4.`id`\nAND (t1.`publisher_name` = 'Agatsuma Entertainment')\nRETURN t4.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What genres are the games published by 'Agatsuma Entertainment'?",
    "evidence": "genres refers to genre_name; 'Agatsuma Entertainment' refers to publisher_name = 'Agatsuma Entertainment';",
    "idx": 1783
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game`)-[belongs_to_0:`belongs_to`]->(t1@`genre`)\nWHERE t1.`id` = t2.`genre_id`\nAND (NOT t1.`genre_name` IN ['Role-Playing', 'Shooter', 'Simulation'])\nRETURN COUNT(t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games are not of the genres 'Role-Playing', 'Shooter' and 'Simulation'?",
    "evidence": "not of the genres 'Role-Playing', 'Shooter' and 'Simulation' refers to genre_name NOT IN ('Role-Playing', 'Shooter', 'Simulation');",
    "idx": 1784
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->(t3@`game`)\nWHERE t1.`id` = t2.`publisher_id`\nAND t2.`game_id` = t3.`id`\nAND (t3.`game_name` = 'Pachi-Slot Kanzen Kouryaku 3: Universal Koushiki Gaido Volume 3')\nRETURN t1.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which publisher has published the game 'Pachi-Slot Kanzen Kouryaku 3: Universal Koushiki Gaido Volume 3'?",
    "evidence": "which publisher refers to publisher_name; 'Pachi-Slot Kanzen Kouryaku 3: Universal Koushiki Gaido Volume 3' refers to game_name = 'Pachi-Slot Kanzen Kouryaku 3: Universal Koushiki Gaido Volume 3';",
    "idx": 1785
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[t2:`published_by`]->()\nMATCH (t3@`game_platform`)-[has_sales_0:`has_sales`]->(t4@`region_sales`)-[sold_in_0:`sold_in`]->(t5@`region`)\nWHERE t1.`id` = t2.`game_id`\nAND t2.`id` = t3.`game_publisher_id`\nAND t3.`id` = t4.`game_platform_id`\nAND t4.`region_id` = t5.`id`\nAND (t1.`game_name` = 'Pengo')\nRETURN t5.`region_name` AS `region_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which regions has the game 'Pengo' been sold?",
    "evidence": "which regions refers to region_name; 'Pengo' refers to game_name = 'Pengo';",
    "idx": 1786
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`publisher`)-[t2:`publishes`]->()\nWHERE t1.`id` = t2.`publisher_id`\nRETURN cast (COUNT(CASE  WHEN t1.`publisher_name` = 'Brash Entertainment' THEN t2.`game_id` ELSE NULL END) as float) * 100 / COUNT(t2.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of games published by 'Brash Entertainment'?",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(publisher_name = 'Brash Entertainment'), COUNT(game_id)), 100.0); 'Brash Entertainment' refers to publisher_name = 'Brash Entertainment';",
    "idx": 1788
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t@`region_sales`)\nWHERE t.`region_id` = 1\nRETURN sum(t.`num_sales` * 100000) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of games sold in region ID 1?",
    "evidence": "total number of games sold = MULTIPLY(SUM(num_sales), 100000);",
    "idx": 1789
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH ()-[t1:`published_by`]->(t2@`publisher`)\nMATCH ()-[t1:`publishes`]->(t3@`game`)\nWHERE t1.`publisher_id` = t2.`id`\nAND t1.`game_id` = t3.`id`\nAND (t3.`game_name` = '2002 FIFA World Cup')\nRETURN t2.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the publisher of the game 2002 FIFA World Cup?",
    "evidence": "who is the publisher refers to publisher_name; 2002 FIFA World Cup refers to game_name = '2002 FIFA World Cup';",
    "idx": 1790
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)-[available_on_0:`available_on`]->(t2@`platform`)\nMATCH ()-[t3:`publishes`]->(t4@`game`)\nWHERE t1.`platform_id` = t2.`id`\nAND t1.`game_publisher_id` = t3.`id`\nAND t3.`game_id` = t4.`id`\nAND (t4.`game_name` = '3Xtreme')\nRETURN t2.`platform_name` AS `platform_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What platform is the game 3Xtreme available on?",
    "evidence": "what platform refers to platform_name; 3Xtreme refers to game_name = '3Xtreme';",
    "idx": 1791
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game`)-[belongs_to_0:`belongs_to`]->(t2@`genre`)\nWHERE t1.`genre_id` = t2.`id`\nAND (t1.`game_name` = '2010 FIFA World Cup South Africa')\nRETURN t2.`genre_name` AS `genre_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What genre is the game 2010 FIFA World Cup South Africa?",
    "evidence": "genre refers to genre_name; 2010 FIFA World Cup South Africa refers to game_name = '2010 FIFA World Cup South Africa';",
    "idx": 1792
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t3@`game_platform`)-[has_sales_0:`has_sales`]->(t1@`region_sales`)-[sold_in_0:`sold_in`]->(t2@`region`)\nMATCH (t3@`game_platform`)-[available_on_0:`available_on`]->(t4@`platform`)\nWHERE t1.`region_id` = t2.`id`\nAND t1.`game_platform_id` = t3.`id`\nAND t3.`platform_id` = t4.`id`\nAND (t2.`region_name` = 'Japan' AND t4.`platform_name` = 'PS3')\nRETURN sum(t1.`num_sales` * 100000) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games were sold on PS3 platform in Japan?",
    "evidence": "how many games = MULTIPLY(SUM(num_sales), 100000); PS3 refers to platform_name = 'PS3'; Japan refers to region_name = 'Japan';",
    "idx": 1793
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t1@`game_platform`)\nMATCH ()-[t2:`publishes`]->(t3@`game`)\nWHERE t1.`game_publisher_id` = t2.`id`\nAND t2.`game_id` = t3.`id`\nAND (t1.`release_year` = 2007)\nRETURN t3.`game_name` AS `game_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of games that were released in 2007?",
    "evidence": "names of games refers to game_name; released in 2007 refers to release_year = 2007;",
    "idx": 1794
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH ()-[t1:`published_by`]->(t2@`publisher`)\nMATCH ()-[t1:`publishes`]->(t3@`game`)\nWHERE t1.`publisher_id` = t2.`id`\nAND t1.`game_id` = t3.`id`\nAND (t2.`publisher_name` = 'Activision')\nRETURN COUNT(DISTINCT t3.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games were published by Activision?",
    "evidence": "Activision refers to publisher_name = 'Activision';",
    "idx": 1795
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (t2@`game_platform`)-[available_on_0:`available_on`]->(t1@`platform`)\nMATCH ()-[t3:`published_by`]->()\nWHERE t1.`id` = t2.`platform_id`\nAND t2.`game_publisher_id` = t3.`id`\nAND (t1.`platform_name` = 'PS3' AND t2.`release_year` = 2010)\nRETURN COUNT(t3.`game_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In 2010, how many PS3 games were released?",
    "evidence": "in 2010 refers to release_year = 2010; PS3 refers to platform_name = 'PS3';",
    "idx": 1797
  }
]