[
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_genre_0:has_genre]->(`t1`:`genre`)\nWHERE `t1`.`genreid` = `t2`.`genreid`\nAND (`t1`.`name` = 'Rock')\nRETURN avg(`t2`.`unitprice`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average unit price of rock tracks?",
    "evidence": "",
    "idx": 2067
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_genre_0:has_genre]->(`t1`:`genre`)\nWHERE `t1`.`genreid` = `t2`.`genreid`\nAND (`t1`.`name` = 'Rock')\nRETURN avg(`t2`.`unitprice`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average unit price of tracks from the Rock genre.",
    "evidence": "",
    "idx": 2068
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`t2`:`track`)-[has_genre_0:has_genre]->(`t1`:`genre`)\nWHERE `t1`.`genreid` = `t2`.`genreid`\nAND (`t1`.`name` = 'Pop')\nRETURN MAX(`t2`.`milliseconds`) AS `_col_0`, min(`t2`.`milliseconds`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the duration of the longest and shortest pop tracks in milliseconds?",
    "evidence": "",
    "idx": 2069
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`city` = 'Edmonton'\nRETURN `employee`.`birthdate` AS `birthdate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the birth dates of employees living in Edmonton?",
    "evidence": "",
    "idx": 2071
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`city` = 'Edmonton'\nRETURN `employee`.`birthdate` AS `birthdate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the birth dates corresponding to employees who live in the city of Edmonton.",
    "evidence": "",
    "idx": 2072
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN DISTINCT (`track`.`unitprice`) AS `unitprice`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct unit prices of all tracks?",
    "evidence": "",
    "idx": 2073
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "MATCH (`track`:`track`)\nRETURN DISTINCT (`track`.`unitprice`) AS `unitprice`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct unit prices for tracks.",
    "evidence": "",
    "idx": 2074
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`album_sub0`:`album`)\nRETURN `album_sub0`.`artistid` AS `artistid`   } AS in_collect_0\nMATCH (`artist`:`artist`)\nWHERE NOT `artist`.`artistid` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many artists do not have any album?",
    "evidence": "",
    "idx": 2075
  },
  {
    "filename": "train_spider.json",
    "db_id": "chinook_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`album_sub0`:`album`)\nRETURN `album_sub0`.`artistid` AS `artistid`   } AS in_collect_0\nMATCH (`artist`:`artist`)\nWHERE NOT `artist`.`artistid` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Cound the number of artists who have not released an album.",
    "evidence": "",
    "idx": 2076
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`available_policies`:`available_policies`)\nRETURN `available_policies`.`customer_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the phone numbers.",
    "evidence": "",
    "idx": 2077
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`available_policies`:`available_policies`)\nWHERE `available_policies`.`policy_type_code` = 'Life Insurance'\nRETURN `available_policies`.`customer_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the customer phone numbers under the policy \"Life Insurance\"?",
    "evidence": "",
    "idx": 2079
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "CALL(*) {\nMATCH (`available_policies_sub0`:`available_policies`)\nWITH `available_policies_sub0`.`policy_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `policy_type_code`  LIMIT 1\n}\nMATCH (`available_policies`:`available_policies`)\nWHERE `available_policies`.`policy_type_code` = `policy_type_code`\nRETURN `available_policies`.`customer_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the customer phone numbers under the most popular policy type?",
    "evidence": "",
    "idx": 2081
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`available_policies`:`available_policies`)\nWITH `available_policies`.`policy_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 4\nRETURN _groupby_col_0 AS `policy_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the policy type used by more than 4 customers.",
    "evidence": "",
    "idx": 2083
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`settlements`:`settlements`)\nRETURN sum(`settlements`.`settlement_amount`) AS `_col_0`, avg(`settlements`.`settlement_amount`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total and average amount of settlements.",
    "evidence": "",
    "idx": 2085
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`settlements`:`settlements`)\nRETURN sum(`settlements`.`settlement_amount`) AS `_col_0`, avg(`settlements`.`settlement_amount`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the sum and average of all settlement amounts.",
    "evidence": "",
    "idx": 2086
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:holds_policy]->()\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`customer_name` = 'Dayana Robel')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many policies are listed for the customer named \"Dayana Robel\"?",
    "evidence": "",
    "idx": 2087
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:holds_policy]->()\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`customer_name` = 'Dayana Robel')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the total number of policies used by the customer named \"Dayana Robel\".",
    "evidence": "",
    "idx": 2088
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:holds_policy]->(`t3`:`available_policies`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`policy_id` = `t3`.`policy_id`\nAND (`t1`.`customer_name` = 'Dayana Robel')\nRETURN DISTINCT `t3`.`policy_type_code` AS `policy_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the policy types of the customer named \"Dayana Robel\"?",
    "evidence": "",
    "idx": 2089
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`customers`)-[t2_sub0:holds_policy]->()\nWHERE `t1_sub0`.`customer_id` = `t2_sub0`.`customer_id`\nWITH `t1_sub0`.`customer_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `customer_name`  LIMIT 1\n}\nMATCH (`t1`:`customers`)-[t2:holds_policy]->(`t3`:`available_policies`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`policy_id` = `t3`.`policy_id`\nAND (`t1`.`customer_name` = `customer_name`)\nRETURN DISTINCT `t3`.`policy_type_code` AS `policy_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the policy types of the customer that has the most policies listed?",
    "evidence": "",
    "idx": 2091
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`services`:`services`)\nRETURN `services`.`service_name` AS `service_name` ORDER BY `service_name` IS NULL DESC, `service_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the services in the alphabetical order.",
    "evidence": "",
    "idx": 2093
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`services`:`services`)\nRETURN `services`.`service_name` AS `service_name` ORDER BY `service_name` IS NULL DESC, `service_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me a list of all the service names sorted alphabetically.",
    "evidence": "",
    "idx": 2094
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`services`:`services`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the total number of available services.",
    "evidence": "",
    "idx": 2096
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:filed_fnol]->(`t3`:`services`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`service_id` = `t3`.`service_id`\nAND (`t3`.`service_name` = 'Close a policy' OR `t3`.`service_name` = 'Upgrade a policy')\nRETURN `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of customers who have used either the service \"Close a policy\" or the service \"Upgrade a policy\".",
    "evidence": "",
    "idx": 2097
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_name` =~ '(?i)(?s).*Diana.*'\nRETURN `customers`.`customer_id` AS `customer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the IDs of customers whose name contains \"Diana\".",
    "evidence": "",
    "idx": 2099
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_name` =~ '(?i)(?s).*Diana.*'\nRETURN `customers`.`customer_id` AS `customer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the IDs of customers who have \"Diana\" in part of their names?",
    "evidence": "",
    "idx": 2100
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`settlements`:`settlements`)\nRETURN MAX(`settlements`.`settlement_amount`) AS `_col_0`, min(`settlements`.`settlement_amount`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the maximum and minimum settlement amount.",
    "evidence": "",
    "idx": 2102
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`customer_id` AS `customer_id`, `customers`.`customer_name` AS `customer_name` ORDER BY `customer_id` IS NULL DESC, `customer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the customers in increasing order of IDs.",
    "evidence": "",
    "idx": 2103
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_fnol",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:holds_policy]->()\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`customer_name` =~ '(?i)(?s).*Diana.*')\nRETURN `t2`.`date_opened` AS `date_opened`, `t2`.`date_closed` AS `date_closed`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Retrieve the open and close dates of all the policies associated with the customer whose name contains \"Diana\"",
    "evidence": "",
    "idx": 2105
  },
  {
    "filename": "train_spider.json",
    "db_id": "medicine_enzyme_interaction",
    "gql_statement": "MATCH (`enzyme`:`enzyme`)\nRETURN `enzyme`.`name` AS `name` ORDER BY `name` IS NULL ASC, `name` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of enzymes in descending lexicographical order.",
    "evidence": "",
    "idx": 2109
  },
  {
    "filename": "train_spider.json",
    "db_id": "medicine_enzyme_interaction",
    "gql_statement": "MATCH (`enzyme`:`enzyme`)\nRETURN `enzyme`.`name` AS `name`, `enzyme`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names and the locations that the enzymes can make an effect.",
    "evidence": "",
    "idx": 2111
  },
  {
    "filename": "train_spider.json",
    "db_id": "medicine_enzyme_interaction",
    "gql_statement": "MATCH ()-[medicine_enzyme_interaction:interacts_with]->()\nWITH `medicine_enzyme_interaction`.`interaction_type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `interaction_type`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the most common interaction type between enzymes and medicine? And how many are there?",
    "evidence": "",
    "idx": 2125
  },
  {
    "filename": "train_spider.json",
    "db_id": "medicine_enzyme_interaction",
    "gql_statement": "MATCH ()-[medicine_enzyme_interaction:interacts_with]->()\nWITH `medicine_enzyme_interaction`.`interaction_type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `interaction_type`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the most common types of interactions between enzymes and medicine, and how many types are there?",
    "evidence": "",
    "idx": 2126
  },
  {
    "filename": "train_spider.json",
    "db_id": "medicine_enzyme_interaction",
    "gql_statement": "MATCH (`enzyme`:`enzyme`)\nWHERE `enzyme`.`name` =~ '(?i)(?s).*ALA.*'\nRETURN `enzyme`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which enzyme names have the substring \"ALA\"?",
    "evidence": "",
    "idx": 2135
  },
  {
    "filename": "train_spider.json",
    "db_id": "medicine_enzyme_interaction",
    "gql_statement": "MATCH (`enzyme`:`enzyme`)\nWHERE `enzyme`.`name` =~ '(?i)(?s).*ALA.*'\nRETURN `enzyme`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of enzymes that include the string 'ALA'?",
    "evidence": "",
    "idx": 2136
  },
  {
    "filename": "train_spider.json",
    "db_id": "medicine_enzyme_interaction",
    "gql_statement": "MATCH (`medicine`:`medicine`)\nWITH `medicine`.`trade_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `trade_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the number of medicines offered by each trade.",
    "evidence": "",
    "idx": 2137
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nORDER BY `university`.`founded` IS NULL DESC, `university`.`founded`  \nRETURN `university`.`school` AS `school`, `university`.`nickname` AS `nickname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all schools and their nicknames in the order of founded year.",
    "evidence": "",
    "idx": 2139
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`affiliation` = 'Public'\nRETURN `university`.`school` AS `school`, `university`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all public schools and their locations.",
    "evidence": "",
    "idx": 2141
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nORDER BY `university`.`enrollment` IS NULL ASC, `university`.`enrollment` DESC \nRETURN `university`.`founded` AS `founded`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the founded year for the school with the largest enrollment.",
    "evidence": "",
    "idx": 2144
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`affiliation` <> 'Public'\nRETURN `university`.`founded` AS `founded` ORDER BY `founded` IS NULL ASC, `founded` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the founded year of the newest non public school.",
    "evidence": "",
    "idx": 2145
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`basketball_match`:`basketball_match`)\nRETURN COUNT(DISTINCT `basketball_match`.`school_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of schools that have had basketball matches.",
    "evidence": "",
    "idx": 2148
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`basketball_match`:`basketball_match`)\nRETURN `basketball_match`.`acc_percent` AS `acc_percent` ORDER BY `acc_percent` IS NULL ASC, `acc_percent` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the highest acc percent across all basketball matches.",
    "evidence": "",
    "idx": 2150
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`t2`:`basketball_match`)-[belongs_to_0:belongs_to]->(`t1`:`university`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nORDER BY `t2`.`acc_percent` IS NULL DESC, `t2`.`acc_percent`  \nRETURN `t1`.`primary_conference` AS `primary_conference`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the primary conference of the school with the lowest acc percentage score.",
    "evidence": "",
    "idx": 2152
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`t2`:`basketball_match`)-[belongs_to_0:belongs_to]->(`t1`:`university`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nORDER BY `t1`.`founded` IS NULL DESC, `t1`.`founded`  \nRETURN `t2`.`team_name` AS `team_name`, `t2`.`acc_regular_season` AS `acc_regular_season`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name of the team and the acc during the regular season for the school that was founded the earliest.",
    "evidence": "",
    "idx": 2154
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`t2`:`basketball_match`)-[belongs_to_0:belongs_to]->(`t1`:`university`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nAND (`t2`.`team_name` = 'Clemson')\nRETURN `t2`.`all_games` AS `all_games`, `t1`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the location and all games score of the school that has Clemson as its team name.",
    "evidence": "",
    "idx": 2155
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`founded` < 1850\nRETURN avg(`university`.`enrollment`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the average enrollment of universities founded before 1850.",
    "evidence": "",
    "idx": 2158
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nORDER BY `university`.`founded` IS NULL DESC, `university`.`founded`  \nRETURN `university`.`enrollment` AS `enrollment`, `university`.`primary_conference` AS `primary_conference`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the enrollment and primary_conference of the oldest college.",
    "evidence": "",
    "idx": 2159
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nRETURN sum(`university`.`enrollment`) AS `_col_0`, min(`university`.`enrollment`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total and minimum enrollment of all schools?",
    "evidence": "",
    "idx": 2161
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nRETURN sum(`university`.`enrollment`) AS `_col_0`, min(`university`.`enrollment`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the total and minimum enrollments across all schools.",
    "evidence": "",
    "idx": 2162
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWITH `university`.`affiliation` AS _groupby_col_0, sum(`university`.`enrollment`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total student enrollment for different affiliation type schools.",
    "evidence": "",
    "idx": 2163
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWITH `university`.`affiliation` AS _groupby_col_0, sum(`university`.`enrollment`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total enrollments of universities of each affiliation type?",
    "evidence": "",
    "idx": 2164
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "WITH *, COLLECT { MATCH (`basketball_match_sub0`:`basketball_match`)\nRETURN `basketball_match_sub0`.`school_id` AS `school_id`   } AS in_collect_0\nMATCH (`university`:`university`)\nWHERE NOT `university`.`school_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of universities that do not participate in the baketball match.",
    "evidence": "",
    "idx": 2166
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`founded` > 1850 OR `university`.`affiliation` = 'Public'\nRETURN `university`.`school` AS `school`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the schools that were either founded after 1850 or public.",
    "evidence": "",
    "idx": 2167
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nRETURN COUNT(DISTINCT `university`.`affiliation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find how many different affiliation types there are.",
    "evidence": "",
    "idx": 2169
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nRETURN COUNT(DISTINCT `university`.`affiliation`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different affiliation types.",
    "evidence": "",
    "idx": 2170
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`location` =~ '(?i)(?s).*NY.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find how many school locations have the word 'NY'.",
    "evidence": "",
    "idx": 2171
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`location` =~ '(?i)(?s).*NY.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many universities have a location that contains NY?",
    "evidence": "",
    "idx": 2172
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "CALL(*) {\nMATCH (`university_sub0`:`university`)\nRETURN avg(`university_sub0`.`enrollment`) AS `_col_0`  \n}\nMATCH (`t2`:`basketball_match`)-[belongs_to_0:belongs_to]->(`t1`:`university`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nAND (`t1`.`enrollment` < `_col_0`)\nRETURN `t2`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the team names of the universities whose enrollments are smaller than the average enrollment size.",
    "evidence": "",
    "idx": 2173
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "CALL(*) {\nMATCH (`university_sub0`:`university`)\nRETURN avg(`university_sub0`.`enrollment`) AS `_col_0`  \n}\nMATCH (`t2`:`basketball_match`)-[belongs_to_0:belongs_to]->(`t1`:`university`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nAND (`t1`.`enrollment` < `_col_0`)\nRETURN `t2`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of teams from universities that have a below average enrollment?",
    "evidence": "",
    "idx": 2174
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`enrollment` > 20000\nWITH `university`.`affiliation` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of universities that have over a 20000 enrollment size for each affiliation type.",
    "evidence": "",
    "idx": 2175
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`founded` > 1850\nWITH `university`.`affiliation` AS _groupby_col_0, sum(`university`.`enrollment`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of students enrolled in the colleges that were founded after the year of 1850 for each affiliation type.",
    "evidence": "",
    "idx": 2177
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nWHERE `university`.`founded` > 1850\nWITH `university`.`affiliation` AS _groupby_col_0, sum(`university`.`enrollment`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `affiliation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different affiliations, and what is the total enrollment of schools founded after 1850 for each enrollment type?",
    "evidence": "",
    "idx": 2178
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`university`:`university`)\nRETURN MAX(`university`.`enrollment`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the maximum enrollment across all schools.",
    "evidence": "",
    "idx": 2180
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`basketball_match`:`basketball_match`)\nRETURN `basketball_match`.`team_id` AS `team_id`, `basketball_match`.`school_id` AS `school_id`, `basketball_match`.`team_name` AS `team_name`, `basketball_match`.`acc_regular_season` AS `acc_regular_season`, `basketball_match`.`acc_percent` AS `acc_percent`, `basketball_match`.`acc_home` AS `acc_home`, `basketball_match`.`acc_road` AS `acc_road`, `basketball_match`.`all_games` AS `all_games`, `basketball_match`.`all_games_percent` AS `all_games_percent`, `basketball_match`.`all_home` AS `all_home`, `basketball_match`.`all_road` AS `all_road`, `basketball_match`.`all_neutral` AS `all_neutral`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all information regarding the basketball match.",
    "evidence": "",
    "idx": 2181
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`basketball_match`:`basketball_match`)\nRETURN `basketball_match`.`team_id` AS `team_id`, `basketball_match`.`school_id` AS `school_id`, `basketball_match`.`team_name` AS `team_name`, `basketball_match`.`acc_regular_season` AS `acc_regular_season`, `basketball_match`.`acc_percent` AS `acc_percent`, `basketball_match`.`acc_home` AS `acc_home`, `basketball_match`.`acc_road` AS `acc_road`, `basketball_match`.`all_games` AS `all_games`, `basketball_match`.`all_games_percent` AS `all_games_percent`, `basketball_match`.`all_home` AS `all_home`, `basketball_match`.`all_road` AS `all_road`, `basketball_match`.`all_neutral` AS `all_neutral`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information about the basketball match?",
    "evidence": "",
    "idx": 2182
  },
  {
    "filename": "train_spider.json",
    "db_id": "university_basketball",
    "gql_statement": "MATCH (`basketball_match`:`basketball_match`)\nORDER BY `basketball_match`.`all_home` IS NULL ASC, `basketball_match`.`all_home` DESC \nRETURN `basketball_match`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List names of all teams in the basketball competition, ordered by all home scores in descending order.",
    "evidence": "",
    "idx": 2183
  }
]