[
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`publisher`)-[t2:publishes]->(`t3`:`game`)\nWHERE `t1`.`id` = `t2`.`publisher_id`\nAND `t2`.`game_id` = `t3`.`id`\nAND (`t3`.`game_name` = 'ModNation Racers')\nRETURN `t1`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the publisher name of the game \"ModNation Racers\".",
    "evidence": "game \"ModNation Racers\" refers to game_name = 'ModNation Racers'",
    "idx": 2506
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`region_sales`)-[sold_in_1:sold_in]->(`t1_sub0`:`region`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`region_id`\nAND (`t1_sub0`.`region_name` = 'Japan')\nRETURN `t2_sub0`.`game_platform_id` AS `game_platform_id`, MAX(`t2_sub0`.`num_sales`) AS `_col_1`  \n}\nWITH *\nRETURN `game_platform_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the id of game platform which makes the most sales in Japan.",
    "evidence": "id of game platform refers to game_platform_id; the most sales refers to max(num_sales); in Japan refers to region_name = 'Japan'",
    "idx": 2507
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[belongs_to_0:belongs_to]->(`t2`:`genre`)\nWHERE `t1`.`genre_id` = `t2`.`id`\nAND (`t1`.`game_name` = 'Resident Evil: Revelations')\nRETURN `t2`.`genre_name` AS `genre_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the genre of the game \"Resident Evil: Revelations\".",
    "evidence": "genre refers to genre_name; game \"Resident Evil: Revelations\" refers to game_name = 'Resident Evil: Revelations'",
    "idx": 2513
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`publisher`)-[t2:publishes]->()\nWHERE `t1`.`id` = `t2`.`publisher_id`\nAND (`t1`.`publisher_name` = 'Ascaron Entertainment GmbH')\nRETURN COUNT(`t2`.`game_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of games which were published by Ascaron Entertainment GmbH.",
    "evidence": "published by Ascaron Entertainment GmbH refers to publisher_name = 'Ascaron Entertainment GmbH'",
    "idx": 2515
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game_platform`)-[available_on_0:available_on]->(`t2`:`platform`)\nWHERE `t1`.`platform_id` = `t2`.`id`\nORDER BY `t1`.`release_year` IS NULL DESC, `t1`.`release_year`  \nRETURN `t2`.`platform_name` AS `platform_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the name of the earliest platform in the database.",
    "evidence": "the earliest refers to min(release_year); name of platform refers to platform_name",
    "idx": 2516
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH ()-[t1_sub0:published_by]->(`t2_sub0`:`publisher`)\nWHERE `t1_sub0`.`publisher_id` = `t2_sub0`.`id`\nWITH `t2_sub0`.`publisher_name` AS _groupby_col_0, COUNT(DISTINCT `t1_sub0`.`game_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `publisher_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which publisher published the most games?",
    "evidence": "publisher refers to publisher_name; the most games refers to max(count(publisher_id))",
    "idx": 2522
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t3_sub0`:`game_platform`)-[has_sales_1:has_sales]->(`t2_sub0`:`region_sales`)-[sold_in_1:sold_in]->(`t1_sub0`:`region`)\nMATCH (`t3_sub0`:`game_platform`)-[available_on_1:available_on]->(`t4_sub0`:`platform`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`region_id`\nAND `t2_sub0`.`game_platform_id` = `t3_sub0`.`id`\nAND `t3_sub0`.`platform_id` = `t4_sub0`.`id`\nAND (`t1_sub0`.`region_name` = 'Europe')\nORDER BY `t2_sub0`.`num_sales` IS NULL ASC, `t2_sub0`.`num_sales` DESC \nRETURN `t4_sub0`.`platform_name` AS `platform_name`, sum(`t2_sub0`.`num_sales`) AS `_col_1`  LIMIT 1\n}\nWITH *\nRETURN `platform_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which game platform is the most popular in Europe?",
    "evidence": "game platform refers to game_platform_id; the most popular refers to max(num_sales); in Europe refers to region_name = 'Europe'",
    "idx": 2527
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`game_platform`)-[available_on_1:available_on]->(`t1_sub0`:`platform`)\nMATCH ()-[t3_sub0:published_by]->()\nWHERE `t1_sub0`.`id` = `t2_sub0`.`platform_id`\nAND `t2_sub0`.`game_publisher_id` = `t3_sub0`.`id`\nAND (`t1_sub0`.`platform_name` = 'PC')\nWITH `t2_sub0`.`release_year` AS _groupby_col_0, COUNT(DISTINCT `t3_sub0`.`game_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `release_year`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `release_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which year has the most number of PC games releases?",
    "evidence": "year refers to release_year; the most number of releases refers to max(count(game_id))",
    "idx": 2528
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game`)\nWHERE `t`.`genre_id` = 2\nRETURN `t`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the game ID of games with genre ID 2.",
    "evidence": "game ID refers to game.id; genre ID 2 refers to genre_id = 2",
    "idx": 2532
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game_platform`)\nWHERE `t`.`id` >= 1 AND `t`.`id` <= 10\nRETURN `t`.`release_year` AS `release_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the release year of record ID 1 to 10.",
    "evidence": "record ID 1 to 10 refers to game.id BETWEEN 1 AND 10",
    "idx": 2533
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game_platform`)\nWHERE `t`.`platform_id` = 15\nRETURN `t`.`game_publisher_id` AS `game_publisher_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the game publisher ID of records with platform ID 15.",
    "evidence": "platform ID 15 refers to platform_id = 15",
    "idx": 2534
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game_platform`)\nWHERE `t`.`release_year` >= 2000 AND `t`.`release_year` <= 2003\nRETURN `t`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the record ID of records released between 2000 to 2003.",
    "evidence": "record ID refers to game.id; released between 2000 to 2003 refers to release_year BETWEEN 2000 AND 2003",
    "idx": 2535
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game_platform`)-[available_on_0:available_on]->(`t1`:`platform`)\nWHERE `t1`.`id` = `t2`.`platform_id`\nAND (`t2`.`release_year` = 2016)\nRETURN DISTINCT `t1`.`platform_name` AS `platform_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the names of platform where the games released in 2016 can be played on.",
    "evidence": "name of platform refers to platform_name; released in 2016 refers to release_year = 2016",
    "idx": 2537
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game_platform`)\nMATCH ()-[t2:publishes]->(`t3`:`game`)-[belongs_to_0:belongs_to]->(`t4`:`genre`)\nWHERE `t1`.`game_publisher_id` = `t2`.`id`\nAND `t2`.`game_id` = `t3`.`id`\nAND `t3`.`genre_id` = `t4`.`id`\nAND (`t1`.`release_year` >= 2000 AND `t1`.`release_year` <= 2002)\nRETURN DISTINCT `t4`.`genre_name` AS `genre_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the genre of the games released from 2000 to 2002.",
    "evidence": "genre refers to genre_name; released from 2000 to 2002 refers to release_year BETWEEN 2000 AND 2002",
    "idx": 2540
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[t2:published_by]->(`t3`:`publisher`)\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`publisher_id` = `t3`.`id`\nAND (`t3`.`publisher_name` = '3DO')\nRETURN `t1`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the name of games published by 3DO.",
    "evidence": "name of game refers to game_name; published by 3DO refers to publisher_name = '3DO'",
    "idx": 2541
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`region_sales`)-[sold_in_0:sold_in]->(`t1`:`region`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND (`t2`.`num_sales` * 100000 > 300000)\nRETURN DISTINCT `t1`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the region name where games reached 300000 sales and above.",
    "evidence": "reached 300000 sales and above refers to num_sales > 3",
    "idx": 2543
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t3_sub0`:`game_platform`)-[has_sales_1:has_sales]->(`t2_sub0`:`region_sales`)-[sold_in_1:sold_in]->(`t1_sub0`:`region`)\nMATCH ()-[t4_sub0:published_by]->(`t5_sub0`:`publisher`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`region_id`\nAND `t2_sub0`.`game_platform_id` = `t3_sub0`.`id`\nAND `t3_sub0`.`game_publisher_id` = `t4_sub0`.`id`\nAND `t4_sub0`.`publisher_id` = `t5_sub0`.`id`\nAND (`t1_sub0`.`region_name` = 'North America')\nWITH `t5_sub0`.`publisher_name` AS _groupby_col_0, sum(`t2_sub0`.`num_sales`) * 100000 AS _groupby_col_1\nRETURN _groupby_col_0 AS `publisher_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which company published the game with the most sales in North America?",
    "evidence": "company refers to publisher_name; the most sales refers to max(num_sales); in North America refers to region_name = 'North America'",
    "idx": 2544
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t3_sub0`:`game_platform`)-[has_sales_1:has_sales]->(`t2_sub0`:`region_sales`)-[sold_in_1:sold_in]->(`t1_sub0`:`region`)\nMATCH ()-[t4_sub0:publishes]->(`t5_sub0`:`game`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`region_id`\nAND `t2_sub0`.`game_platform_id` = `t3_sub0`.`id`\nAND `t3_sub0`.`game_publisher_id` = `t4_sub0`.`id`\nAND `t4_sub0`.`game_id` = `t5_sub0`.`id`\nAND (`t1_sub0`.`region_name` = 'Japan')\nORDER BY `t2_sub0`.`num_sales` IS NULL ASC, `t2_sub0`.`num_sales` DESC \nRETURN `t5_sub0`.`game_name` AS `game_name`  LIMIT 1\n}\nWITH *\nRETURN `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of the game that gained the most sales in Japan?",
    "evidence": "title of the game refers to game_name; gained the most sales refers to max(num_sales); in Japan refers to region_name = 'Japan'",
    "idx": 2548
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`region_sales`)\nWHERE `t`.`game_platform_id` = 9658\nRETURN sum(`t`.`num_sales`) * 100000 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Sum the total game sales in every region for platform ID 9658.",
    "evidence": "total game sales refers to multiply(sum(num_sales), 100000); platform ID 9658 refers to game_platform_id = 9658",
    "idx": 2552
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`publisher`)\nWHERE `t`.`publisher_name` = '1C Company'\nRETURN `t`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ID of 1C Company.",
    "evidence": "ID refers to publisher.id; 1C Company refers to publisher_name = '1C Company'",
    "idx": 2553
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`genre`)\nWHERE `t`.`id` = 3\nRETURN `t`.`genre_name` AS `genre_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the genre name of the genre ID 3.",
    "evidence": "genre ID 3 refers to genre.id = 3",
    "idx": 2554
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t`:`game_platform`)\nWHERE `t`.`release_year` = 2017\nRETURN `t`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the game IDs that were released in 2017.",
    "evidence": "game ID refers to game.id; released in 2017 refers to release_year = 2017",
    "idx": 2555
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t3`:`game_platform`)\nMATCH (`t1`:`game`)-[t2:published_by]->()\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`id` = `t3`.`game_publisher_id`\nAND (`t1`.`game_name` = 'Adventure Island')\nRETURN `t3`.`release_year` AS `release_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was the \"Adventure Island\" game released?",
    "evidence": "when refers to release_year; the \"Adventure Island\" game refers to game_name = 'Adventure Island'",
    "idx": 2556
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game_platform`)-[available_on_0:available_on]->(`t2`:`platform`)\nMATCH ()-[t3:publishes]->(`t4`:`game`)\nWHERE `t1`.`platform_id` = `t2`.`id`\nAND `t1`.`game_publisher_id` = `t3`.`id`\nAND `t3`.`game_id` = `t4`.`id`\nAND (`t2`.`platform_name` = 'SCD')\nRETURN `t4`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the games that can be played on the SCD platform.",
    "evidence": "game refers to game_name; on the SCD platform refers to platform_name = 'SCD'",
    "idx": 2558
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[t2:published_by]->(`t3`:`publisher`)\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`publisher_id` = `t3`.`id`\nAND (`t1`.`game_name` = 'Chronicles of the Sword')\nRETURN `t3`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the publisher of the Chronicles of the Sword game.",
    "evidence": "publisher refers to publisher_name; the Chronicles of the Sword game refers to game_name = 'Chronicles of the Sword'",
    "idx": 2560
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t3`:`game_platform`)-[has_sales_0:has_sales]->(`t1`:`region_sales`)-[sold_in_0:sold_in]->(`t2`:`region`)\nMATCH (`t3`:`game_platform`)-[available_on_0:available_on]->(`t4`:`platform`)\nWHERE `t1`.`region_id` = `t2`.`id`\nAND `t1`.`game_platform_id` = `t3`.`id`\nAND `t3`.`platform_id` = `t4`.`id`\nAND (`t2`.`region_name` = 'North America' AND `t4`.`platform_name` = 'PS4')\nRETURN sum(`t1`.`num_sales` * 100000) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of games sold in North America on the PS4 platform.",
    "evidence": "number of games sold refers to sum(multiply(num_sales, 100000)); in North America refers to region_name = 'North America'; on the PS4 platform refers to platform_name = 'PS4'",
    "idx": 2561
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`region_sales`)-[sold_in_1:sold_in]->(`t2_sub0`:`region`)\nWHERE `t1_sub0`.`region_id` = `t2_sub0`.`id`\nAND (`t2_sub0`.`region_name` = 'Europe')\nWITH `t1_sub0`.`game_platform_id` AS _groupby_col_0, sum(`t1_sub0`.`num_sales`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `game_platform_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `game_platform_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ID of the most popular platform in Europe.",
    "evidence": "ID refers to game_platform_id; the most popular refers to max(num_sales); in Europe refers to region_name = 'Europe'",
    "idx": 2562
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game_platform`)\nMATCH ()-[t2:publishes]->(`t3`:`game`)\nWHERE `t1`.`game_publisher_id` = `t2`.`id`\nAND `t2`.`game_id` = `t3`.`id`\nAND (`t1`.`release_year` = 2011)\nRETURN `t3`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the game released in 2011.",
    "evidence": "game refers to game_name; released in 2011 refers to release_year = 2011",
    "idx": 2563
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game_platform`)\nMATCH ()-[t2:publishes]->(`t3`:`game`)-[belongs_to_0:belongs_to]->(`t4`:`genre`)\nWHERE `t1`.`game_publisher_id` = `t2`.`id`\nAND `t2`.`game_id` = `t3`.`id`\nAND `t3`.`genre_id` = `t4`.`id`\nAND (`t4`.`genre_name` = 'Sports')\nRETURN `t3`.`game_name` AS `game_name`, `t1`.`release_year` AS `release_year`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide any five games and release year under the sports genre.",
    "evidence": "game refers to game_name; under the sports genre refers to genre_name = 'Sports'",
    "idx": 2565
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[belongs_to_0:belongs_to]->(`t2`:`genre`)\nWHERE `t1`.`genre_id` = `t2`.`id`\nAND (`t1`.`game_name` = '2Xtreme')\nRETURN `t2`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the genre of the 2Xtreme.",
    "evidence": "genre refers to genre_name; the 2Xtreme game refers to game_name = '2Xtreme'",
    "idx": 2566
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[t2:published_by]->()\nMATCH (`t3`:`game_platform`)-[available_on_0:available_on]->(`t4`:`platform`)\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`id` = `t3`.`game_publisher_id`\nAND `t3`.`platform_id` = `t4`.`id`\nAND (`t1`.`game_name` = 'Panzer Tactics')\nRETURN `t4`.`platform_name` AS `platform_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the platform where the Panzer Tactics can be played.",
    "evidence": "platform refers to platform_name; the Panzer Tactics is a game name.",
    "idx": 2567
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`region_sales`)-[sold_in_0:sold_in]->(`t2`:`region`)\nWHERE `t1`.`region_id` = `t2`.`id`\nAND (`t1`.`game_platform_id` = 9577)\nRETURN CASE WHEN avg(`t1`.`num_sales`)=0 THEN NULL ELSE (sum(CASE  WHEN `t2`.`region_name` = 'North America' THEN `t1`.`num_sales` ELSE 0 END) - avg(`t1`.`num_sales`)) * 100.0 / avg(`t1`.`num_sales`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate how many percent of sales in North America is higher than the average sale per region for platform ID 9577.",
    "evidence": "in North America refers to region_name = 'North America'; platform ID 9577 refers to game_platform_id = 9577; percent = divide(subtract(num_sales where region_name = 'North America' and game_platform_id = 9577, avg(num_sales)), avg(num_sales)) * 100%",
    "idx": 2568
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`game`)-[belongs_to_1:belongs_to]->(`t1_sub0`:`genre`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`genre_id`\nWITH `t2_sub0`.`game_name` AS _groupby_col_0, COUNT(`t2_sub0`.`id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `game_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL DESC, `_col_1`  \nLIMIT 1\n}\nWITH *\nRETURN `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the least common game genre?",
    "evidence": "the least common game genre refers to min(count(genre_id)); genre refers to genre_name",
    "idx": 2574
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`publisher`)-[t2:publishes]->(`t3`:`game`)\nWHERE `t1`.`id` = `t2`.`publisher_id`\nAND `t2`.`game_id` = `t3`.`id`\nAND (`t3`.`game_name` = 'Prism: Light the Way')\nRETURN `t1`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which is the publisher for the game \"Prism: Light the Way\"?",
    "evidence": "publisher refers to publisher_name; game \"Prism: Light the Way\" refers to game_name = 'Prism: Light the Way'",
    "idx": 2575
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game`)-[belongs_to_0:belongs_to]->(`t1`:`genre`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t2`.`game_name` = 'Mario vs. Donkey Kong')\nRETURN `t1`.`genre_name` AS `genre_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the genre of the game \"Mario vs. Donkey Kong\"?",
    "evidence": "genre refers to genre_name; game \"Mario vs. Donkey Kong\" refers to game_name = 'Mario vs. Donkey Kong'",
    "idx": 2578
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game`)-[belongs_to_0:belongs_to]->(`t1`:`genre`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t1`.`genre_name` = 'Platform')\nRETURN `t2`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the platform games.",
    "evidence": "platform game refers to genre_name = 'Platform'; game refers to game_name",
    "idx": 2580
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game_platform`)-[available_on_0:available_on]->(`t1`:`platform`)\nWHERE `t1`.`id` = `t2`.`platform_id`\nAND (`t1`.`platform_name` = 'WiiU')\nRETURN `t2`.`release_year` AS `release_year` ORDER BY `t2`.`release_year` IS NULL ASC, `t2`.`release_year` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the years that \"WiiU\" got a new game?",
    "evidence": "year refers to release_year; \"WiiU\" refers to platform_name = 'WiiU'",
    "idx": 2581
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`publisher`)-[t2:publishes]->(`t3`:`game`)\nWHERE `t1`.`id` = `t2`.`publisher_id`\nAND `t2`.`game_id` = `t3`.`id`\nAND (`t1`.`publisher_name` = 'Activision')\nRETURN `t3`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the games from the publisher \"Activision\".",
    "evidence": "games refers to game_name; \"Activision\" refers to publisher_name = 'Activision';",
    "idx": 2583
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t_sub0`:`game_platform`)\nWITH `t_sub0`.`release_year` AS _groupby_col_0, COUNT(`t_sub0`.`id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `release_year`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `release_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which year has the most number of video game releases?",
    "evidence": "year that has the most number of video game releases refers to MAX(COUNT(release_year));",
    "idx": 2587
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`game`)-[t3_sub0:published_by]->(`t4_sub0`:`publisher`)\nMATCH (`t2_sub0`:`game`)-[belongs_to_1:belongs_to]->(`t1_sub0`:`genre`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`genre_id`\nAND `t2_sub0`.`id` = `t3_sub0`.`game_id`\nAND `t3_sub0`.`publisher_id` = `t4_sub0`.`id`\nAND (`t1_sub0`.`genre_name` = 'Action')\nWITH `t4_sub0`.`publisher_name` AS _groupby_col_0, COUNT(DISTINCT `t2_sub0`.`id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `publisher_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which publisher has published the most number of Action games?",
    "evidence": "which publisher refers to publisher_name; publisher that has published the most number of Action games refers to MAX(COUNT(publisher_name)) WHERE genre_name = 'Action'; Action games refers to game_name WHERE genre_name = 'Action';",
    "idx": 2592
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t_sub0`:`game`)\nWHERE `t_sub0`.`game_name` =~ '(?i)(?s).*Box.*'\nRETURN `t_sub0`.`game_name` AS `game_name`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many games include the word 'Box' in their name?",
    "evidence": "games include the word 'Box' in their name refers to game_name = '%Box%';",
    "idx": 2601
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t2`:`game`)-[belongs_to_0:belongs_to]->(`t1`:`genre`)\nWHERE `t1`.`id` = `t2`.`genre_id`\nAND (`t1`.`genre_name` = 'Adventure')\nRETURN `t2`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the name of all adventure games.",
    "evidence": "name of games refers to game_name; adventure games refers to game_name WHERE genre_name = 'Adventure';",
    "idx": 2605
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`publisher`)-[t2:publishes]->(`t3`:`game`)\nWHERE `t1`.`id` = `t2`.`publisher_id`\nAND `t2`.`game_id` = `t3`.`id`\nAND (`t1`.`publisher_name` = 'Pioneer LDC')\nRETURN `t3`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of all games published by 'Pioneer LDC'.",
    "evidence": "name of games refers to game_name; 'Pioneer LDC' refers to publisher_name = 'Pioneer LDC';",
    "idx": 2606
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[t2:published_by]->()\nMATCH (`t3`:`game_platform`)-[available_on_0:available_on]->(`t4`:`platform`)\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`id` = `t3`.`game_publisher_id`\nAND `t3`.`platform_id` = `t4`.`id`\nAND (`t4`.`platform_name` = 'SCD')\nRETURN `t1`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the name of all the games published for the 'SCD' platform.",
    "evidence": "name of games refers to game_name;  'SCD' platform refers to platform_name = 'SCD';",
    "idx": 2607
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t1`:`game`)-[t2:published_by]->()\nMATCH (`t3`:`game_platform`)-[has_sales_0:has_sales]->(`t4`:`region_sales`)-[sold_in_0:sold_in]->(`t5`:`region`)\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`id` = `t3`.`game_publisher_id`\nAND `t3`.`id` = `t4`.`game_platform_id`\nAND `t4`.`region_id` = `t5`.`id`\nAND (`t5`.`region_name` = 'Japan')\nRETURN `t1`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of all games published in Japan.",
    "evidence": "name of games refers to game_name; Japan refers to region_name = 'Japan';",
    "idx": 2608
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`game_platform`)-[available_on_1:available_on]->(`t1_sub0`:`platform`)\nMATCH (`t3_sub0`:`region_sales`)-[sold_in_1:sold_in]->(`t4_sub0`:`region`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`platform_id`\nAND `t1_sub0`.`id` = `t3_sub0`.`game_platform_id`\nAND `t3_sub0`.`region_id` = `t4_sub0`.`id`\nWITH `t1_sub0`.`platform_name` AS _groupby_col_0, `t4_sub0`.`region_name` AS _groupby_col_1, sum(`t3_sub0`.`num_sales`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `platform_name`, _groupby_col_1 AS `region_name`, _groupby_col_2 AS `_col_2` ORDER BY `_col_2` IS NULL ASC, `_col_2` DESC \nLIMIT 1\n}\nWITH *\nRETURN `region_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate, by region, which platform has sold the most games.",
    "evidence": "region refers to region_name; platform refers to game_platform; sold the most games refers to MAX(SUM(num_sales));",
    "idx": 2611
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`publisher`)-[t2_sub0:publishes]->(`t3_sub0`:`game`)-[belongs_to_1:belongs_to]->(`t4_sub0`:`genre`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`publisher_id`\nAND `t2_sub0`.`game_id` = `t3_sub0`.`id`\nAND `t3_sub0`.`genre_id` = `t4_sub0`.`id`\nAND (`t4_sub0`.`genre_name` = 'Puzzle')\nWITH `t1_sub0`.`publisher_name` AS _groupby_col_0, COUNT(`t3_sub0`.`id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `publisher_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which publisher has published the most games in the 'Puzzle' genre?",
    "evidence": "which publisher refers to publisher_name; publisher that has published the most games refers to MAX(COUNT(publisher_name)); puzzle genre refers to genre_name = 'Puzzle';",
    "idx": 2612
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`game`)-[t2_sub0:published_by]->()\nMATCH (`t3_sub0`:`game_platform`)-[has_sales_1:has_sales]->(`t4_sub0`:`region_sales`)\nWHERE `t1_sub0`.`id` = `t2_sub0`.`game_id`\nAND `t2_sub0`.`id` = `t3_sub0`.`game_publisher_id`\nAND `t3_sub0`.`id` = `t4_sub0`.`game_platform_id`\nORDER BY `t4_sub0`.`num_sales` IS NULL DESC, `t4_sub0`.`num_sales`  \nRETURN `t1_sub0`.`game_name` AS `game_name`  LIMIT 1\n}\nWITH *\nRETURN `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which game has sold the fewest units?",
    "evidence": "which game refers to game_name; sold the fewest units refers to MIN(num_sales);",
    "idx": 2613
  },
  {
    "filename": "train.json",
    "db_id": "video_games",
    "gql_statement": "MATCH (`t3`:`game_platform`)\nMATCH (`t1`:`game`)-[t2:published_by]->()\nWHERE `t1`.`id` = `t2`.`game_id`\nAND `t2`.`id` = `t3`.`game_publisher_id`\nAND (`t3`.`release_year` = '2010')\nRETURN `t1`.`game_name` AS `game_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List by name all the games released in the year 2010.",
    "evidence": "name of the games refers to game_name; released in the year 2010 refers to release_year = 2010;",
    "idx": 2616
  }
]