[
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`organization`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t2.`country` = 'USA')\nRETURN cast (sum(CASE  WHEN t2.`city` = 'Washington' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`city`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the organizations where headquarters are in the 'USA', what is the percentage of the them are in 'Washington'?",
    "evidence": "percentage can be computed by [count(City = 'Washington') / count(all cities)] * 100%",
    "idx": 4170
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`mountain`)\nMATCH (t2@`geo_mountain`)\nWHERE t1.`name` = t2.`mountain`\nAND (t1.`name` = 'Dhaulagiri')\nRETURN t1.`height` AS `height`, t2.`province` AS `province`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the height of mountain Dhaulagiri located and in which province is it located?",
    "evidence": "",
    "idx": 4173
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`population`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nORDER BY t2.`infant_mortality` DESC NULLS LAST \nRETURN t1.`population` AS `population` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the population of the country with the highest infant mortality rate?",
    "evidence": "",
    "idx": 4175
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`politics`)\nMATCH (t2@`country`)\nWHERE t1.`country` = t2.`code`\nAND (t2.`name` = 'United States')\nRETURN t1.`independence` AS `independence`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did the United States of America attained it's Independence?",
    "evidence": "",
    "idx": 4179
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t1@`organization`)\nMATCH (t2@`country`)\nWHERE t1.`country` = t2.`code`\nAND (t2.`name` = 'Saudi Arabia')\nORDER BY t1.`established` DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the most recently founded organization in Saudi Arabia?",
    "evidence": "Saudi Arabia is a country",
    "idx": 4181
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`country`)\nMATCH (t1@`population`)\nWHERE t1.`country` = t2.`code`\nORDER BY t1.`infant_mortality` DESC NULLS LAST \nRETURN t2.`name` AS `name` \nSKIP 4\nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country has the 5th highest infant mortality rate?",
    "evidence": "",
    "idx": 4182
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`politics`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`capital` = 'Nouakchott')\nRETURN t2.`independence` AS `independence`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did the country whose capital is Nouakchott attained it's independence?",
    "evidence": "",
    "idx": 4184
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nORDER BY t1.`population`  NULLS FIRST \nRETURN t1.`name` AS `name`, t2.`gdp` AS `gdp` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the country with the smallest population, and what is its gross domestic product?",
    "evidence": "GDP refers to gross domestic product",
    "idx": 4185
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`population` >= 60000000 AND t1.`population` <= 90000000)\nORDER BY t2.`gdp` DESC NULLS LAST \nRETURN t1.`name` AS `name`, t2.`gdp` AS `gdp` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which nation, with a population ranging from 60,000,000 to 99,000,000, has the greatest gross domestic product?",
    "evidence": "GDP refers to gross domestic product; Nation and country are synonyms",
    "idx": 4186
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (t2@`economy`)\nMATCH (t1@`country`)\nWHERE t1.`code` = t2.`country`\nAND (t1.`province` = 'Distrito Federal')\nRETURN t1.`population` / t1.`area` AS `_col_0`, t2.`industry` AS `industry`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the population density of the nation whose capital city is in the Distrito Federal province, and what portion of its gross domestic product is devoted to its industries?",
    "evidence": "ation and country are synonyms; Gross domestic product = GDP; Portion of GDP devoted to industries appears in economy.Industry; Population Density = Population / Area",
    "idx": 4187
  },
  {
    "filename": "train.json",
    "db_id": "mondial_geo",
    "gql_statement": "MATCH (province@`province`)\nWHERE province.`population` < 80000\nORDER BY province.`population` / province.`area` DESC NULLS LAST \nRETURN province.`capprov` AS `capprov` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the provincial capital of the province with a population of less than 80,000 that has the highest average population per area?",
    "evidence": "Average population per area = population / area",
    "idx": 4189
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`marital_status` = 'Never-married'\nRETURN COUNT(customers.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers have never married?",
    "evidence": "MARITAL_STATUS = 'Never-married';",
    "idx": 4190
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`age` >= 13 AND customers.`age` <= 19\nRETURN COUNT(customers.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the customers, how many of them are teenagers?",
    "evidence": "teenager is a person aged between 13 and 19 years;",
    "idx": 4191
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (mailings1_2@`mailings1_2`)\nWHERE mailings1_2.`response` = 'true'\nRETURN COUNT(mailings1_2.`refid`) AS `custmoer_number`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the first 60,000 customers' responses to the incentive mailing sent by the marketing department, how many of them are considered a true response?",
    "evidence": "RESPONSE = 'true';",
    "idx": 4193
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`occupation` = 'Machine-op-inspct' AND customers.`age` > 30\nRETURN COUNT(customers.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers over 30, how many of them are Machine-op-inspcts?",
    "evidence": "over 30 refers to age > 30; OCCUPATION = 'Machine-op-inspct';",
    "idx": 4194
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`educationnum` > 11 AND customers.`sex` = 'Female'\nRETURN COUNT(customers.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female customers have an education level of over 11?",
    "evidence": "education level of 11 refers to EDUCATIONNUM = 11; SEX = 'Female';",
    "idx": 4195
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`mailings1_2`)\nWHERE t1.`id` = t2.`refid`\nAND (t1.`sex` = 'Female' AND t2.`response` = 'true')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the first 60,000 customers who sent a true response to the incentive mailing sent by the marketing department, how many of them are female?",
    "evidence": "RESPONSE = 'true'; SEX = 'Female';",
    "idx": 4196
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`sex` = 'Male' AND t2.`inhabitants_k` > 30)\nRETURN COUNT(t1.`geoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the male customers, how many of them come from a place with over 30,000 inhabitants?",
    "evidence": "SEX = 'Male', over 30,000 inhabitants refer to NHABITANTS_K > 30; place refers to GEOID;",
    "idx": 4198
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nORDER BY t2.`income_k` DESC NULLS LAST \nRETURN COUNT(t1.`id`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many customers are from the place with the highest average income per month?",
    "evidence": "place with the highest average income per month refers to GEOID where MAX(INCOME_K);",
    "idx": 4199
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`occupation` = 'Machine-op-inspct' AND t2.`inhabitants_k` > 20 AND t2.`inhabitants_k` < 30)\nRETURN COUNT(t1.`geoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers from a place with more than 20,000 and less than 30,000 inhabitants, how many of them are Machine-op-inspcts?",
    "evidence": "place with more than 20,000 and less than 30,000 inhabitants refers to GEOID where INHABITANTS_K BETWEEN 20 AND 30; OCCUPATION = 'Machine-op-inspct';",
    "idx": 4200
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`id` = 0 OR t1.`id` = 1)\nORDER BY t2.`inhabitants_k` DESC NULLS LAST \nRETURN t1.`id` AS `id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which customer come from a place with more inhabitants, customer no.0 or customer no.1?",
    "evidence": "place with more inhabitants refers to GEOID where ID = 0 OR ID = 1 and MAX(NHABITANTS_K);",
    "idx": 4201
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`mailings1_2`)\nWHERE t1.`id` = t2.`refid`\nAND (t1.`sex` = 'Male' AND t1.`marital_status` = 'Divorced' AND t2.`response` = 'true')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the first 60,000 customers who sent a true response to the incentive mailing sent by the marketing department, how many of them are divorced males?",
    "evidence": "RESPONSE = 'true'; SEX = 'Male'; MARITAL_STATUS = 'Divorced';",
    "idx": 4202
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nORDER BY t2.`inhabitants_k` DESC NULLS LAST \nRETURN DISTINCT t2.`inhabitants_k` AS `inhabitants_k`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of inhabitants of the place the most customers are from?",
    "evidence": "the most customers are from refers to GEOID where MAX(COUNT(ID)); number of inhabitants refers to INHABITANTS_K;",
    "idx": 4203
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t2.`inhabitants_k` = 25.746 AND t1.`sex` = 'Male')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers who come from the place with 25746 inhabitants, how many of them are male?",
    "evidence": "place with 44114 inhabitants refers to GEOID where INHABITANTS_K = 44.114; SEX = 'Male';",
    "idx": 4204
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`mailings1_2`)\nWHERE t1.`id` = t2.`refid`\nAND (t1.`age` >= 13 AND t1.`age` <= 19 AND t2.`response` = 'true')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the first 60,000 customers who sent a true response to the incentive mailing sent by the marketing department, how many of them are teenagers?",
    "evidence": "RESPONSE = 'true'; teenagers are people aged between 13 and 19 years;",
    "idx": 4205
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nORDER BY t2.`income_k` DESC NULLS LAST \nRETURN avg(t1.`educationnum`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average education level of customers from the place with the highest average income per month?",
    "evidence": "place with the highest average income per month refers to GEOID where MAX(INCOME_K); average education level refers to AVG(EDUCATIONNUM);",
    "idx": 4206
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`mailings1_2`)\nWHERE t1.`id` = t2.`refid`\nAND (t2.`response` = 'true')\nRETURN avg(t1.`age`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average age of first 60,000 customers who sent a true response to the incentive mailing sent by the marketing department?",
    "evidence": "RESPONSE = 'true'; AVG(age);",
    "idx": 4207
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`sex` = 'Male'\nRETURN COUNT(customers.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the customers are male?",
    "evidence": "SEX = 'Male';",
    "idx": 4208
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`age` < 30\nRETURN COUNT(customers.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of customers with an age below 30?",
    "evidence": "age below 30 refers to age < 30;",
    "idx": 4210
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (demog@`demog`)\nWHERE demog.`inhabitants_k` < 20 AND demog.`geoid` >= 20 AND demog.`geoid` <= 50\nRETURN COUNT(demog.`geoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In geographic identifier from 20 to 50, how many of them has a number of inhabitants below 20?",
    "evidence": "geographic identifier from 20 to 50 refers to GEOID BETWEEN 20 AND 50; number of inhabitants below 20 refers to INHABITANTS_K < 20;",
    "idx": 4212
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (demog@`demog`)\nWHERE demog.`geoid` = 239\nRETURN demog.`inhabitants_k` AS `inhabitants_k`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of inhabitants and income of geographic identifier 239?",
    "evidence": "geographic identifier 239 refers to GEOID = 239; number of inhabitants refers to INHABITANTS_K; income refers to INCOME_K;",
    "idx": 4213
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nORDER BY t1.`age` DESC NULLS LAST \nRETURN t1.`geoid` AS `geoid`, t2.`income_k` AS `income_k` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the geographic identifier and income of the oldest customer?",
    "evidence": "the oldest customer refers to MAX(age); geographic identifier refers to GEOID; income refers to INCOME_K;",
    "idx": 4216
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`age` >= 40 AND t1.`age` <= 60 AND t1.`marital_status` = 'Widowed' AND t1.`sex` = 'Male' AND t2.`income_k` >= 2000 AND t2.`income_k` <= 3000)\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In widowed male customers ages from 40 to 60, how many of them has an income ranges from 3000 and above?",
    "evidence": "widowed male customers ages from 40 to 60 refer to SEX = 'Male' where age BETWEEN 40 AND 60 and MARITAL_STATUS = 'Widowed'; income ranges from 3000 and above refers to INCOME_K BETWEEN 2000 AND 3000;",
    "idx": 4219
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t2.`inhabitants_k` >= 30 AND t2.`inhabitants_k` <= 40)\nRETURN DISTINCT t1.`occupation` AS `occupation`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the occupation of customers within number of inhabitants ranges of 30 to 40?",
    "evidence": "number of inhabitants ranges of 30 to 40 refers to INHABITANTS_K BETWEEN 30 AND 40;",
    "idx": 4220
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`occupation` = 'Farming-fishing' AND t1.`sex` = 'Male' AND t1.`age` >= 20 AND t1.`age` <= 30)\nRETURN t2.`inhabitants_k` AS `inhabitants_k`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of inhabitants of male customers ages from 20 to 30 years old who are farming or fishing?",
    "evidence": "male customers ages from 20 to 30 years old refer to SEX = 'Male' where age BETWEEN 20 AND 30; farming or fishing refers to OCCUPATION; number of inhabitants refers to INHABITANTS_K;",
    "idx": 4223
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`sex` = 'Female' AND t1.`age` >= 50 AND t1.`age` <= 60 AND t2.`inhabitants_k` >= 19 AND t2.`inhabitants_k` <= 24)\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In female customers ages from 50 to 60, how many of them has an number of inhabitants ranges from 19 to 24?",
    "evidence": "female customers ages from 50 to 60 refer to SEX = 'Female' where age BETWEEN 50 AND 60; number of inhabitants ranges from 19 to 24 refers to INHABITANTS_K BETWEEN 19 AND 24;",
    "idx": 4225
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`marital_status` = 'Never-married')\nRETURN cast (sum(CASE  WHEN t2.`income_k` > 2500 THEN 1.0 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In customers with marital status of never married, what is the percentage of customers with income of 2500 and above?",
    "evidence": "DIVIDE(COUNT(INCOME_K ≥ 2500 where MARITAL_STATUS = 'Never-married'), COUNT(INCOME_K where MARITAL_STATUS = 'Never-married')) as percentage;",
    "idx": 4226
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`occupation` = 'Machine-op-inspct' AND customers.`age` >= 13 AND customers.`age` <= 19\nRETURN COUNT(customers.`id`) AS `teenager_number`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many teenagers are working as Machine-op-inspct?",
    "evidence": "teenager is a person aged between 13 and 19 years; OCCUPATION = 'Machine-op-inspct';",
    "idx": 4230
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`occupation` = 'Other-service' AND t2.`inhabitants_k` > 20)\nRETURN COUNT(t2.`geoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of customers who provide other services, how many are from places where inhabitants are more than 20000?",
    "evidence": "OCCUPATION = 'Other-service'; inhabitants are more than 20000 refer to INHABITANTS_K > 20;",
    "idx": 4231
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`sex` = 'Male' AND t2.`income_k` > 3000 AND t1.`age` >= 20 AND t1.`age` <= 29)\nRETURN COUNT(t2.`geoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the male customer in their twenties, how many are from places where the average income is more than 3000?",
    "evidence": "male customer in their twenties refer to SEX = 'Male' where age BETWEEN 20 AND 29; average income is more than 3000 refers to INCOME_K > 3000;",
    "idx": 4232
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`geoid` = 24)\nRETURN cast (sum(CASE  WHEN t1.`marital_status` = 'never married' THEN 1.0 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of elderly customers who are never married in the place with geographic ID 24?",
    "evidence": "elderly customers refer to age > 65; DIVIDE(COUNT(ID where age > 65, MARITAL_STATUS = 'never married' and GEOID = 24), COUNT(ID where GEOID = 24)) as percentage;",
    "idx": 4233
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t2.`income_k` > 3000)\nRETURN cast (sum(CASE  WHEN t1.`age` >= 80 AND t1.`age` <= 89 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the customers with an average income per inhabitant above 3000, what percentage are in their eighties?",
    "evidence": "average income per inhabitant above 3000 refers to INCOME_K > 3000; eighties refer to age BETWEEN 80 AND 89; DIVIDE(COUNT(INCOME_K > 3000 and age BETWEEN 80 AND 89), COUNT(INCOME_K > 3000 )) as percentage;",
    "idx": 4234
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (mailings1_2@`mailings1_2`)\nWHERE mailings1_2.`response` = 'true'\nRETURN COUNT(mailings1_2.`refid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the customer's reference ID that has a TRUE response?",
    "evidence": "reference ID refers to REFID;",
    "idx": 4235
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`marital_status` = 'Widowed' AND customers.`age` < 50\nRETURN COUNT(customers.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of widowed customers with an age below 50?",
    "evidence": "widowed customers with an age below 50 refer to MARITAL_STATUS = 'Widowed' where age < 50;",
    "idx": 4237
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (demog@`demog`)\nWHERE demog.`income_k` < 2000 AND demog.`geoid` >= 10 AND demog.`geoid` <= 30\nRETURN COUNT(demog.`geoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In geographic identifier from 10 to 30, how many of them has an income below 2000?",
    "evidence": "GEOID BETWEEN 10 AND 30; INCOME_K < 2000;",
    "idx": 4239
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`educationnum` = 7 AND customers.`age` = 62\nRETURN DISTINCT customers.`marital_status` AS `marital_status`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the marital status of the customer ages 62 with an level of education of 7?",
    "evidence": "customer ages 62 with an level of education of 7 refer age = 62 where EDUCATIONNUM = 7;",
    "idx": 4240
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`sex` = 'Male' AND t1.`age` >= 30 AND t1.`age` <= 50 AND t2.`income_k` >= 2000 AND t2.`income_k` <= 2300)\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In male customers ages from 30 to 50, how many of them has an income ranges from 2000 to 2300?",
    "evidence": "male customers ages from 30 to 50 refer to SEX = 'Male' where age BETWEEN 30 AND 50; income ranges from 2000 to 2300 refers to INCOME_K BETWEEN 2000 AND 3000;",
    "idx": 4242
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`demog`)\nWHERE t1.`geoid` = t2.`geoid`\nAND (t1.`sex` = 'Female' AND t1.`age` >= 30 AND t1.`age` <= 55 AND t1.`occupation` = 'Machine-op-inspct')\nRETURN t2.`income_k` AS `income_k`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the income of female customers ages from 30 to 55 years old and has an occupation of machine-op-inspct?",
    "evidence": "female customers ages from 30 to 55 years old refer to SEX = 'Female' where age BETWEEN 30 AND 55; income refers to INCOME_K;",
    "idx": 4243
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (demog_sub0@`demog`)\nWHERE demog_sub0.`inhabitants_k` < 30\nRETURN collect(demog_sub0.`geoid`) AS `geoid` \n} \nMATCH (customers@`customers`)\nWHERE customers.`geoid` IN in_collect_0 AND customers.`sex` = 'Female'\nRETURN customers.`age` AS `age`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the age of female customers within the number of inhabitants below 30?",
    "evidence": "female customers within the number of inhabitants below 30 refer to SEX = 'Female' where INHABITANTS_K < 30;",
    "idx": 4245
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (t1@`customers`)\nMATCH (t2@`mailings1_2`)\nWHERE t1.`id` = t2.`refid`\nAND (t1.`occupation` = 'Handlers-cleaners' AND t1.`sex` = 'Male')\nRETURN cast (sum(CASE  WHEN t2.`response` = 'true' THEN 1.0 ELSE 0 END) as float) * 100 / COUNT(t2.`refid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In male customers with an occupation handlers or cleaners, what is the percentage of customers with a true response?",
    "evidence": "DIVIDE(COUNT(OCCUPATION = 'Handlers-cleaners', SEX = 'Male' and RESPONSE = 'true'), COUNT(OCCUPATION = 'Handlers-cleaners' and SEX = 'Male')) as percentage;",
    "idx": 4246
  },
  {
    "filename": "train.json",
    "db_id": "software_company",
    "gql_statement": "MATCH (customers@`customers`)\nWHERE customers.`age` >= 13 AND customers.`age` <= 19 AND customers.`educationnum` > 10\nRETURN cast (sum(CASE  WHEN customers.`sex` = 'Male' THEN 1 ELSE 0 END) as float) / sum(CASE  WHEN customers.`sex` = 'Female' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio of male and female among the age of teenager when the education is above 10?",
    "evidence": "ratio = DIVIDE(COUNT(SEX = 'Male' where age BETWEEN 13 AND 19 and EDUCATIONNUM > 10),COUNT(SEX = 'Female' where age BETWEEN 13 AND 19 and EDUCATIONNUM > 10));",
    "idx": 4247
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (businesses@`businesses`)\nWHERE businesses.`owner_state` = 'CA'\nRETURN COUNT(businesses.`owner_state`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants' owners are in California?",
    "evidence": "restaurants' owners in California refer to owner_state = 'CA';",
    "idx": 4254
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (inspections@`inspections`)\nWHERE inspections.`score` = 100\nRETURN COUNT(inspections.`score`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants have met all requirements in the inspection?",
    "evidence": "met all requirements in the inspection refers to score = 100;",
    "idx": 4255
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`inspections`)-[conducted_at_0:`conducted_at`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`date` = date('2014-01-14') AND t2.`name` = 'Tiramisu Kitchen')\nRETURN t1.`type` AS `type_`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the type of inspection Tiramisu Kitchen had on 2014/1/14?",
    "evidence": "Tiramisu Kitchen is the name of the business; inspection on 2014/1/14 refers to date = '2014-01-14';",
    "idx": 4257
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)-[committed_by_0:`committed_by`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`date` = date('2014-01-14') AND t2.`name` = 'Tiramisu Kitchen' AND t1.`risk_category` = 'Low Risk')\nRETURN COUNT(t1.`business_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many low risk violations were found in the inspection on 2014/1/14 for Tiramisu Kitchen?",
    "evidence": "Tiramisu Kitchen is the name of the business; inspection on 2014/1/14 refers to date = '2014-01-14'; low risk violations refer to risk_category = 'Low Risk';",
    "idx": 4258
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection",
    "gql_statement": "MATCH (t1@`violations`)-[committed_by_0:`committed_by`]->(t2@`businesses`)\nWHERE t1.`business_id` = t2.`business_id`\nAND (t1.`date` = date('2014-01-14') AND t2.`name` = 'Tiramisu Kitchen' AND t1.`risk_category` = 'Low Risk')\nRETURN t1.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the description of the low risk violation of Tiramisu Kitchen on 2014/1/14?",
    "evidence": "Tiramisu Kitchen is the name of the business; 2014/1/14 refers to date = '2014-01-14'; low risk violations refer to risk_category = 'Low Risk';",
    "idx": 4259
  }
]