[
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nORDER BY `t2`.`total_fat` IS NULL ASC, `t2`.`total_fat` DESC \nRETURN `t1`.`title` AS `title`, `t1`.`prep_min` + `t1`.`cook_min` + `t1`.`stnd_min` AS `_col_1`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the title and total time of the recipe which has the highest possibility of gaining weight.",
    "evidence": "the highest possibility of gaining weight refers to MAX(total_fat); total time refers to recipe_id, total time refers to TOTAL(prep_min, cook_min, stnd_min)",
    "idx": 6814
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nMATCH (`t3`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND `t3`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t1`.`title` = 'Tomato-Cucumber Relish')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ingredients in Tomato-Cucumber Relish.",
    "evidence": "Tomato-Cucumber Relish refers to title",
    "idx": 6816
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t3`:`nutrition`)\nMATCH (`t1`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`ingredient_id` = `t2`.`ingredient_id`\nAND `t3`.`recipe_id` = `t2`.`recipe_id`\nAND (`t2`.`max_qty` = `t2`.`min_qty`)\nORDER BY `t3`.`carbo` IS NULL ASC, `t3`.`carbo` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ingredients that are rationed in the recipe with the highest carbohydrate content.",
    "evidence": "the highest carbohydrate content refers to MAX(carbo)",
    "idx": 6818
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t2`.`iron` > 20)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the recipes which can lead to constipation.",
    "evidence": "can lead to constipation refers to iron > 20",
    "idx": 6819
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t3`:`nutrition`)\nMATCH (`t1`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`ingredient_id` = `t2`.`ingredient_id`\nAND `t3`.`recipe_id` = `t2`.`recipe_id`\nORDER BY `t3`.`vitamin_a` IS NULL ASC, `t3`.`vitamin_a` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the ingredients in the recipe with the highest vitamin that helps vision in dim light.",
    "evidence": "the highest vitamin that helps vision in dim light refers to MAX(vitamin_a)",
    "idx": 6820
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nMATCH (`t3`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND `t3`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t1`.`servings` = 7)\nRETURN `t3`.`name` AS `name`, `t2`.`max_qty` AS `max_qty`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ingredients and maximum quantities of the recipe which can serve 7 people.",
    "evidence": "can serve 7 people refers to servings = 7",
    "idx": 6821
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t1`.`source` = 'The California Tree Fruit Agreement')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`sodium` < 5 THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the recipes from The California Tree Fruit Agreement, calculate the percentage of sodium-free recipes.",
    "evidence": "The California Tree Fruit Agreement is a source; calculation = MULTIPLY(DIVIDE(COUNT(sodium BETWEEN 0 AND 5 THEN recipe_id), COUNT(recipe_id)), 100)",
    "idx": 6822
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t2`.`unit` = 'slice(s)')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ingredients which measure in slices.",
    "evidence": "slices refers to unit = 'slice(s)'",
    "idx": 6823
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nMATCH (`t3`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND `t3`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t3`.`name` = 'lima beans')\nRETURN `t1`.`title` AS `title`, `t1`.`prep_min` + `t1`.`cook_min` + `t1`.`stnd_min` AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the title and total time of the recipe which can be made with only lima beans.",
    "evidence": "total time refers to total time refers to TOTAL(prep_min, cook_min, stnd_min); lima beans is a name of an ingredient",
    "idx": 6825
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t2`.`alcohol` = 0)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of alcohol free recipes.",
    "evidence": "alcohol free refers to alcohol = 0",
    "idx": 6830
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t2`.`iron` > 20)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of recipes that can lead to constipation.",
    "evidence": "lead to constipation refers to iron > 20",
    "idx": 6833
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nMATCH (`t3`:`ingredient`)-[t2:used_in]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND `t3`.`ingredient_id` = `t2`.`ingredient_id`\nAND (`t1`.`title` = 'Apricot Yogurt Parfaits')\nRETURN `t3`.`name` AS `name`, `t3`.`category` AS `category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the ingredients of Apricot Yogurt Parfaits.",
    "evidence": "Apricot Yogurt Parfaits refers to title",
    "idx": 6836
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[t2:uses]->()\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nAND (`t2`.`max_qty` <> `t2`.`min_qty`)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify recipes with different maximum and minimum quantities.",
    "evidence": "maximum quantities refers to max_qty; minimum quantities refers to max_qty <> min_qty",
    "idx": 6837
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (`t1`:`recipe`)-[has_nutrition_0:has_nutrition]->(`t2`:`nutrition`)\nWHERE `t1`.`recipe_id` = `t2`.`recipe_id`\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`cook_min` < 20 AND `t2`.`cholestrl` = 0 THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of recipes with no cholesterol included and have a cooking time less than 20 minutes among all recipes.",
    "evidence": "no cholesterol refers to cholestrl = 0; cooking time less than 20 minutes refers to cook_min < 20; calculation = MULTIPLY(DIVIDE(COUNT(cholestrl = 0 THEN recipe_id), COUNT(recipe_id)), 100)",
    "idx": 6839
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`employee`:`employee`)\nORDER BY `employee`.`salary` IS NULL ASC, `employee`.`salary` DESC \nRETURN `employee`.`firstname` AS `firstname`, `employee`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which employee has the highest salary? Please give his or her full name.",
    "evidence": "the highest salary refers to MAX(salary); full name = firstname, lastname",
    "idx": 6840
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`gender` = 'M' AND toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`employee`.`salary`,size(`employee`.`salary`)+1+(4-1)) ELSE substring(`employee`.`salary`,4-1) END,',','')) > 70000\nRETURN `employee`.`ssn` AS `ssn`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the social security numbers of the male employees with a salary of over $70,000 a year.",
    "evidence": "social security numbers refers to ssn; male employees refers to gender = 'M'; salary of over $70,000 a year refers to salary > '70000'",
    "idx": 6842
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (`t1`.`lastname` = 'Johnson' AND `t1`.`firstname` = 'James')\nRETURN toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t1`.`salary`,size(`t1`.`salary`)+1+(4-1)) ELSE substring(`t1`.`salary`,4-1) END,',','')) - toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t2`.`minsalary`,size(`t2`.`minsalary`)+1+(4-1)) ELSE substring(`t2`.`minsalary`,4-1) END,',','')) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much higher is James Johnson's salary from the minimum salary of his title?",
    "evidence": "James Johnson is the fullname of an employee; full name = firstname, lastname; minimum salary refers to minsalary; calculation = SUBTRACT(salary, minsalary)",
    "idx": 6850
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (`t2`.`positiontitle` = 'Trainee')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of the employees who are working as a Trainee.",
    "evidence": "full name = firstname, lastname; trainees is a position title",
    "idx": 6852
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t1`.`gender` = 'M' AND `t1`.`performance` = 'Good')\nRETURN `t2`.`zipcode` AS `zipcode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the zip codes of the offices where all the male employees with a good job performance work at.",
    "evidence": "male employees refers to gender = 'M'; good job performance refers to performance = 'Good'",
    "idx": 6854
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t2`.`state` = 'CA')\nRETURN `t1`.`ssn` AS `ssn`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the social security numbers of all the employees who work in California.",
    "evidence": "social security numbers refers to ssn; California refers to state = 'CA'",
    "idx": 6855
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t1`.`salary`,size(`t1`.`salary`)+1+(4-1)) ELSE substring(`t1`.`salary`,4-1) END,',','')) > 20000 AND `t2`.`positiontitle` = 'Trainee')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees who work as a Trainee, how many of them have a salary of over &20,000 a year?",
    "evidence": "Trainee is a position title; salary of over 20,000 refers to salary > '20000'",
    "idx": 6856
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (`t2`.`positiontitle` = 'Trainee')\nRETURN avg(toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t1`.`salary`,size(`t1`.`salary`)+1+(4-1)) ELSE substring(`t1`.`salary`,4-1) END,',',''))) AS `avg`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average salary of the employees who work as a Trainee?",
    "evidence": "average = DIVIDE( SUM(salary), COUNT(positiontitle) where positiontitle = 'Trainee'; Trainee is a position title",
    "idx": 6857
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`gender` = 'F'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of female employees.",
    "evidence": "number of female employees means COUNT(gender = 'F')",
    "idx": 6858
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t1`.`firstname` = 'Jose' AND `t1`.`lastname` = 'Rodriguez')\nRETURN `t2`.`locationcity` AS `locationcity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of the city where Jose Rodriguez works.",
    "evidence": "Jose Rodriguez is the fullname of an employee; full name = firstname, lastname; name of city refers to locationcity",
    "idx": 6859
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t2`.`locationcity` = 'Miami')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees are there in the \"Miami\" office?",
    "evidence": "Miami office refers to locationcity = 'Miami'",
    "idx": 6862
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t2`.`locationcity` = 'Boston')\nORDER BY `t1`.`salary` IS NULL ASC, `t1`.`salary` DESC \nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the highest paid employee in \"Boston\"? Give the full name.",
    "evidence": "Boston refers to locationcity = 'Boston'; the highest paid employee refers to MAX(salary); full name = firstname, lastname",
    "idx": 6863
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t2`.`locationcity` = 'New York City' AND `t1`.`performance` = 'Good')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t1`.`ssn` AS `ssn`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the employee in “New York City” with a good performance? Give the social security number of the employee.",
    "evidence": "New York City refers to locationcity = 'New York City'; good performance refers to performance = 'Good'; social security number refers to ssn",
    "idx": 6864
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nMATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t3`:`position`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND `t3`.`positionid` = `t1`.`positionid`\nAND (`t3`.`positiontitle` = 'Manager')\nORDER BY `t1`.`salary` IS NULL ASC, `t1`.`salary` DESC \nRETURN `t2`.`address` AS `address`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the full address of the office of the highest paid manager.",
    "evidence": "the highest paid refers to MAX(salary); manager is a position title",
    "idx": 6867
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (`t1`.`firstname` = 'Jose' AND `t1`.`lastname` = 'Rodriguez')\nRETURN CASE WHEN toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t1`.`salary`,size(`t1`.`salary`)+1+(4-1)) ELSE substring(`t1`.`salary`,4-1) END,',',''))=0 THEN NULL ELSE 100 * (toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t2`.`maxsalary`,size(`t2`.`maxsalary`)+1+(4-1)) ELSE substring(`t2`.`maxsalary`,4-1) END,',','')) - toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t1`.`salary`,size(`t1`.`salary`)+1+(4-1)) ELSE substring(`t1`.`salary`,4-1) END,',',''))) / toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t1`.`salary`,size(`t1`.`salary`)+1+(4-1)) ELSE substring(`t1`.`salary`,4-1) END,',','')) END AS `per`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "If Jose Rodriguez tried his best, how many percentage can his salary raise without changing his position?",
    "evidence": "Jose Rodriguez is the full name of an employee; full name = firstname, lastname; calculation = DIVIDE(SUBTRACT(maxsalary, salary), salary) * 100",
    "idx": 6869
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`performance` = 'Poor' AND toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`employee`.`salary`,size(`employee`.`salary`)+1+(4-1)) ELSE substring(`employee`.`salary`,4-1) END,',','')) > 50000\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees whose performance is poor have a salary of over $50,000 per year?",
    "evidence": "performance is poor refers to performance = 'Poor'; salary of over $50,000 refers to salary > '50000'",
    "idx": 6870
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "CALL(*) {\nMATCH (`employee_sub0`:`employee`)\nRETURN MAX(toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`employee_sub0`.`salary`,size(`employee_sub0`.`salary`)+1+(4-1)) ELSE substring(`employee_sub0`.`salary`,4-1) END,',',''))) AS `_col_0`  \n}\nMATCH (`employee`:`employee`)\nWHERE toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`employee`.`salary`,size(`employee`.`salary`)+1+(4-1)) ELSE substring(`employee`.`salary`,4-1) END,',','')) = `_col_0`\nRETURN `employee`.`firstname` AS `firstname`, `employee`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the employee with the highest salary? Specify his/her full name.",
    "evidence": "the highest salary refers to MAX(salary); full name = firstname, lastname",
    "idx": 6871
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`position`:`position`)\nWHERE toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`position`.`maxsalary`,size(`position`.`maxsalary`)+1+(4-1)) ELSE substring(`position`.`maxsalary`,4-1) END,',','')) < 100000\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many positions have a maximum salary of no more than US$1000,000?",
    "evidence": "maximum salary of no more than US$1000,000 refers to maxsalary < '100000';",
    "idx": 6872
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (`t2`.`educationrequired` = '2 year degree')\nRETURN avg(toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t1`.`salary`,size(`t1`.`salary`)+1+(4-1)) ELSE substring(`t1`.`salary`,4-1) END,',',''))) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average salary of all employees with a 2 year degree position?",
    "evidence": "2 year degree refers to educationrequired = '2 year degree'; calculation = DIVIDE(SUM(salary), COUNT(positiontitle))",
    "idx": 6875
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (`t1`.`performance` = 'Poor' AND `t2`.`positiontitle` = 'Manager')\nRETURN avg(toFloat(replace(CASE WHEN 4-1 < 0 THEN substring(`t1`.`salary`,size(`t1`.`salary`)+1+(4-1)) ELSE substring(`t1`.`salary`,4-1) END,',',''))) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average salary of the worst performing managers?",
    "evidence": "the worst performing refers to performance = 'Poor'; manager is a positiontitle; average salary refers to AVG(salary)",
    "idx": 6878
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`employee`:`employee`)\nORDER BY `employee`.`salary` IS NULL DESC, `employee`.`salary`  \nRETURN `employee`.`firstname` AS `firstname`, `employee`.`lastname` AS `lastname`, `employee`.`performance` AS `performance`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the employee's full name and performance status who got the lowest in salary per year.",
    "evidence": "full name = firstname, lastname; the lowest salary refers to MIN(salary)",
    "idx": 6879
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE `location`.`state` IN ['CO', 'UT', 'CA']\nRETURN `location`.`locationcity` AS `locationcity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the location cities in the Western states.",
    "evidence": "Western states refers to state = 'CO' OR state = 'UT' OR state = 'CA'; location cities refers to locationcity",
    "idx": 6880
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`position`:`position`)\nWHERE `position`.`positiontitle` = 'Trainee'\nRETURN `position`.`maxsalary` AS `maxsalary`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the maximum salary of position \"Trainer\"?",
    "evidence": "maximum salary refers to maxsalary; Trainee is a positiontitle",
    "idx": 6883
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (`t1`.`performance` = 'Average')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t1`.`ssn` AS `ssn`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name and social security number of the account representative with average performance.",
    "evidence": "full name = firstname, lastname; social security number refers to ssn; account representative is a position title; average performance refers to performance = 'Average'",
    "idx": 6884
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (`t1`.`firstname` = 'Emily' AND `t1`.`lastname` = 'Wood')\nRETURN `t1`.`hiredate` AS `hiredate`, `t2`.`positiontitle` AS `positiontitle`, `t1`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was Emily Wood hired? Mention her position and salary.",
    "evidence": "Emily Wood is the full name of an employee; full name = firstname, lastname; when was she hired refers to hiredate",
    "idx": 6885
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nMATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t3`:`position`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND `t3`.`positionid` = `t1`.`positionid`\nAND (`t2`.`locationcity` = 'New York City')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t1`.`gender` AS `gender`, `t3`.`positiontitle` AS `positiontitle`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names, gender and positions who's location is in New York city.",
    "evidence": "full name = firstname, lastname; New York city refers to locationcity = 'New York City'",
    "idx": 6887
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t2`.`state` = 'UT')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t1`.`hiredate` AS `hiredate`, `t1`.`performance` AS `performance`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the full name, hired date and performance status of the employee whose location is in Utah state.",
    "evidence": "full name = firstname, lastname; Utah refers to state = 'UT'",
    "idx": 6888
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nMATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t3`:`position`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND `t3`.`positionid` = `t1`.`positionid`\nAND (`t3`.`positiontitle` = 'Manager' AND `t1`.`performance` = 'Poor')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t2`.`locationcity` AS `locationcity`, `t2`.`address` AS `address`, `t2`.`zipcode` AS `zipcode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees with poor performance, provide the managers' full names, location city, address and its zip code.",
    "evidence": "poor performance refers to performance = 'Poor'; full name = firstname, lastname; managers is a position title",
    "idx": 6889
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t2`:`position`)\nWHERE `t1`.`positionid` = `t2`.`positionid`\nAND (`t1`.`performance` = 'Poor' AND `t2`.`positiontitle` = 'Account Representative')\nRETURN `t2`.`educationrequired` AS `educationrequired`, `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t1`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the education required to be account representative? Mention account representative full name and salary who got poor in performance status.",
    "evidence": "account representative is a position title; full name = firstname, lastname; poor performance refers to performance = 'Poor'",
    "idx": 6890
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t1`.`ssn` = '767-74-7373')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t2`.`state` AS `state`, `t2`.`locationcity` AS `locationcity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the full name, performance status and located city of the employee who's social security number is \"767-74-7373\".",
    "evidence": "full name = firstname, lastname; ssn = '767-74-7373'",
    "idx": 6891
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_at_0:works_at]->(`t2`:`location`)\nMATCH (`t1`:`employee`)-[holds_position_0:holds_position]->(`t3`:`position`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND `t3`.`positionid` = `t1`.`positionid`\nAND (`t2`.`state` = 'CO')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t3`.`positiontitle` AS `positiontitle`, `t2`.`locationcity` AS `locationcity`, `t2`.`officephone` AS `officephone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the employees' full name, positions, located city and office phone number within Colorado state.",
    "evidence": "full name = firstname, lastname; Colorado state refers to state = 'CO'; positions refers to positiontitle; located city refers to locationcity; office phone number refers to officephone;",
    "idx": 6892
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "CALL(*) {\nMATCH (`trip_sub0`:`trip`)\nRETURN MAX(`trip_sub0`.`duration`) AS `_col_0`  \n}\nMATCH (`trip`:`trip`)\nWHERE `trip`.`duration` = `_col_0`\nRETURN `trip`.`start_station_name` AS `start_station_name`, `trip`.`end_station_name` AS `end_station_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which trip had the longest duration? State the start and end station.",
    "evidence": "start station refers to start_station_name; end station refers to end_station_name;",
    "idx": 6893
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t1`.`name` = `t2`.`end_station_name`\nAND (`t2`.`bike_id` = 13)\nORDER BY `t2`.`end_date` IS NULL ASC, `t2`.`end_date` DESC \nRETURN `t2`.`end_station_id` AS `end_station_id`, `t1`.`city` AS `city`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the final station of bike id 13. Which city was it at?",
    "evidence": "final station refers to end_station_name where MAX(end_date);",
    "idx": 6894
  }
]