[
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[written_in_0:written_in]->(`t2`:`book_language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`language_name` = 'Spanish')\nRETURN `t1`.`isbn13` AS `isbn13`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ISBN of the book published in Spanish.",
    "evidence": "\"Spanish\" is the language_name; ISBN refers to isbn13",
    "idx": 4628
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nMATCH (`t1`:`book`)-[published_by_0:published_by]->(`t4`:`publisher`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND `t4`.`publisher_id` = `t1`.`publisher_id`\nAND (`t4`.`publisher_name` = 'Abrams')\nRETURN `t3`.`author_name` AS `author_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the author's name of the books published by Abrams.",
    "evidence": "\"Abrams\" is the publisher_name; author's name refers to author_name",
    "idx": 4631
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND (`t3`.`author_name` = 'Abraham Lincoln')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN CASE WHEN `t1`.`publication_date` is not NULL THEN apoc.temporal.format(`t1`.`publication_date`,'yyyy') ELSE NULL END = '1992' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In books authored by Abraham Lincoln, what is the percentage of the books published in 1992?",
    "evidence": "\"Abraham Lincoln\" is the author_name; published in 1992 refers to publication_date LIKE '1992%'; percentage = Divide (Sum(publication_date LIKE '1992%'), Count(publication_date)) * 100",
    "idx": 4633
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "CALL(*) {\nMATCH (`book_sub0`:`book`)\nRETURN avg(`book_sub0`.`num_pages`) AS `_col_0`  \n}\nMATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (CASE WHEN `t1`.`publication_date` is not NULL THEN apoc.temporal.format(`t1`.`publication_date`,'yyyy') ELSE NULL END = '2004' AND `t1`.`num_pages` * 100 > `_col_0` * 70)\nRETURN `t1`.`title` AS `title`, `t2`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the books published in 2004, list the name of the publisher of books with number of pages greater than 70% of the average number of pages of all books.",
    "evidence": "published in 2004 refers to publication_date LIKE '2004%'; books with number of pages greater than 70% of the average number of pages refers to num_pages > Multiply(Avg(num_pages), 0.7); name of publisher refers to publisher_name",
    "idx": 4634
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`first_name` = 'Moss' AND `customer`.`last_name` = 'Zarb'\nRETURN `customer`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the contact email of Moss Zarb.",
    "evidence": "",
    "idx": 4635
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`city` = 'Dallas'\nRETURN `address`.`street_name` AS `street_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the streets in Dallas.",
    "evidence": "\"Dallas\" is the city; streets refers to street_name",
    "idx": 4636
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND (`t3`.`author_name` = 'Orson Scott Card' AND CASE WHEN `t1`.`publication_date` is not NULL THEN apoc.temporal.format(`t1`.`publication_date`,'yyyy') ELSE NULL END = '2001')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which books were released by Orson Scott Card in 2001?",
    "evidence": "\"Orson Scott Card\" is the author_name; released in 2001 refers to publication_date LIKE '2001%'; books refers to title",
    "idx": 4637
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND (`t3`.`author_name` = 'Orson Scott Card')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the number of books written by Orson Scott Card.",
    "evidence": "\"Orson Scott Card\" is the author_name",
    "idx": 4638
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND (`t1`.`num_pages` > 3000)\nRETURN `t3`.`author_name` AS `author_name`, `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the authors and titles of the books which have more than 3000 pages.",
    "evidence": "authors refers to author_name; more than 3000 pages refers to num_pages > 3000",
    "idx": 4639
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND (`t1`.`title` = 'The Prophet')\nRETURN `t3`.`author_name` AS `author_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who wrote \"The Prophet\"?",
    "evidence": "\"The Prophet\" is the title of the book: who wrote refers to author_name",
    "idx": 4640
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`book`)\nMATCH (`t1`:`order_line`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND (`t2`.`title` = 'The Prophet')\nRETURN sum(`t1`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Sum the total price of the orders for The Prophet book.",
    "evidence": "\"The Prophet\" is the title of the book: total price refers to Sum(price)",
    "idx": 4644
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`cust_order`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'Daisey' AND `t2`.`last_name` = 'Lamball' AND CASE WHEN `t1`.`order_date` is not NULL THEN apoc.temporal.format(`t1`.`order_date`,'yyyy') ELSE NULL END = '2021')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of orders by Daisey Lamball in 2021.",
    "evidence": "in 2021 refers to order_date LIKE '2021%'",
    "idx": 4645
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`order_status`)\nMATCH (`t2`:`order_history`)\nWHERE `t1`.`status_id` = `t2`.`status_id`\nAND (`t1`.`status_value` = 'Delivered' AND CASE WHEN `t2`.`status_date` is not NULL THEN apoc.temporal.format(`t2`.`status_date`,'yyyy') ELSE NULL END = '2019')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were delivered in December 2019?",
    "evidence": "delivered refers to status_value = 'Delivered'; in December 2019 refers to status_date LIKE '2019-12%'",
    "idx": 4647
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`shipping_method`)\nMATCH (`t1`:`cust_order`)\nWHERE `t1`.`shipping_method_id` = `t2`.`method_id`\nAND (CASE WHEN `t1`.`order_date` is not NULL THEN apoc.temporal.format(`t1`.`order_date`,'yyyy') ELSE NULL END = '2020')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`method_name` = 'International' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many percent of orders in 2020 used international shipping?",
    "evidence": "international shipping refers to method_name = 'International'; orders in 2020 refers to order_date = '2020%'; percentage = Divide (Sum(method_name = 'International'), Count(order_id)) * 100",
    "idx": 4648
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`author`:`author`)\nWHERE `author`.`author_name` =~ '(?i)(?s)George.*'\nRETURN `author`.`author_name` AS `author_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the authors named \"George\".",
    "evidence": "author named 'George' refers to author_name = 'George%'",
    "idx": 4649
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`book`:`book`)\nWHERE CASE WHEN `book`.`publication_date` is not NULL THEN apoc.temporal.format(`book`.`publication_date`,'yyyy') ELSE NULL END = '1995'\nRETURN `book`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of the books that were published in 1995.",
    "evidence": "published in 1995 refers to publication_date LIKE '1995%'; ; list of book refers to title",
    "idx": 4651
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`publisher`:`publisher`)\nWHERE `publisher`.`publisher_name` =~ '(?i)(?s).*book.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many publishers have the word \"book\" in their name?",
    "evidence": "publisher have the word 'book' refers to publisher_name LIKE '%book%'",
    "idx": 4652
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t2`.`publisher_name` = 'Harper Collins')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the books published by \"Harper Collins\"?",
    "evidence": "\"Harper Collins\" is the publisher_name; books refers to title",
    "idx": 4654
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`order_status`)\nMATCH (`t2`:`order_history`)\nWHERE `t1`.`status_id` = `t2`.`status_id`\nAND (`t1`.`status_value` = 'Returned' AND CASE WHEN `t2`.`status_date` is not NULL THEN apoc.temporal.format(`t2`.`status_date`,'yyyy') ELSE NULL END = '2020')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were returned in the year 2020?",
    "evidence": "returned refers to status_value = 'Returned'; in the year 2020 refers to status_date LIKE '%2020%'",
    "idx": 4655
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "CALL(*) {\nMATCH (`book_sub0`:`book`)\nRETURN avg(`book_sub0`.`num_pages`) AS `_col_0`  \n}\nMATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND (`t1`.`num_pages` < `_col_0`)\nRETURN `t3`.`author_name` AS `author_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the authors who wrote fewer pages than the average.",
    "evidence": "author refers to author_name; who wrote fewer pages than the average refers to num_pages < AVG(num_pages)",
    "idx": 4657
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`order_line`)\nMATCH (`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND (`t1`.`title` = 'Anleitung zum Zickigsein')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many customers ordered the book titled \"Anleitung zum Zickigsein\"",
    "evidence": "\"Anleitung zum Zickigsein\" is the title of the book",
    "idx": 4664
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`order_line`)\nMATCH (`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND (`t1`.`title` = 'Bite Me If You Can (Argeneau #6)')\nRETURN MAX(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the most expensive price paid by a customer for the book \"Bite Me If You Can (Argeneau #6)\"?",
    "evidence": "\"Bite Me If You Can (Argeneau #6)\" is the title of the book; most expensive price refers to Max(price)",
    "idx": 4665
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`order_line`)\nMATCH (`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nWITH `t1`.`publication_date` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_0 IS NULL DESC, _groupby_col_0  \nRETURN _groupby_col_1 AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many customers ordered the oldest book?",
    "evidence": "oldest book refers to Min(publiation_date)",
    "idx": 4666
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`book`)-[written_in_0:written_in]->(`t1`:`book_language`)\nMATCH (`t2`:`book`)-[published_by_0:published_by]->(`t3`:`publisher`)\nWHERE `t2`.`language_id` = `t1`.`language_id`\nAND `t3`.`publisher_id` = `t2`.`publisher_id`\nAND (`t1`.`language_name` = 'Spanish' AND `t3`.`publisher_name` = 'Alfaguara')\nWITH `t2`.`title` AS _groupby_col_0\nRETURN _groupby_col_0 AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the titles of the Spanish books published by Alfaguara.",
    "evidence": "\"Spanish\" is the language_name; 'Alfaguara' is the publisher_name",
    "idx": 4667
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t1`.`title` = 'The Secret Garden')\nRETURN DISTINCT `t2`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who published the book \"The Secret Garden\"?",
    "evidence": "\"The Secret Garden\" is the title of the book; who published the book refers to publisher_name",
    "idx": 4670
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nWITH `t2`.`publisher_name` AS _groupby_col_0, COUNT(`t2`.`publisher_name`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 30\nRETURN _groupby_col_0 AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of all the publishers who have published at least 30 books?",
    "evidence": "published at least 30 books refers to Count(book_id) > = 30",
    "idx": 4672
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`address`:`address`)\nRETURN `address`.`street_number` AS `street_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the last number of each street.",
    "evidence": "street refers to street_name; last number of each street refers to Substr (street_number, -1)",
    "idx": 4673
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`city` = 'Lazaro Cardenas'\nRETURN `address`.`street_number` AS `street_number`, `address`.`street_name` AS `street_name`, `address`.`city` AS `city`, `address`.`country_id` AS `country_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the complete address of customers located in Lazaro Cardenas.",
    "evidence": "complete address refers to street_number, street_name, city, country; \"Lazaro Cardenas\" is the city",
    "idx": 4674
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`book`:`book`)\nWHERE `book`.`num_pages` < 140 AND `book`.`num_pages` > 135\nRETURN `book`.`isbn13` AS `isbn13`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the ISBN13 of all the books that have less than 140 pages and more than 135.",
    "evidence": "ISBN13 refers to isbn13; less than 140 pages and more than 135 refers to num_pages > 135 AND num_pages < 140;",
    "idx": 4675
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`book`:`book`)\nORDER BY `book`.`publication_date` IS NULL DESC, `book`.`publication_date`  \nRETURN `book`.`title` AS `title`  LIMIT 6",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the title of the six books with the greatest potential value as collectibles.",
    "evidence": "greatest potential value refers to Min(publication_date)",
    "idx": 4676
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`last_name` =~ '(?i)(?s)K.*'\nRETURN `customer`.`first_name` AS `first_name`, `customer`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the full name of all customers whose last name begins with the letter K.",
    "evidence": "full name refers to first_name, last_name; last name begin with the letter 'K' refers to last_name LIKE 'K%'",
    "idx": 4678
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`order_status`)\nMATCH (`t2`:`order_history`)\nWHERE `t1`.`status_id` = `t2`.`status_id`\nAND (`t1`.`status_value` = 'Cancelled')\nRETURN `t2`.`order_id` AS `order_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify by their id all the orders that have been cancelled.",
    "evidence": "have been cancelled refers to status_value = 'cancelled'; id refers to order_id",
    "idx": 4683
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND (`t3`.`author_name` = 'Peter H. Smith')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the titles of all the books that Peter H. Smith wrote.",
    "evidence": "\"Peter H.Smit\" is the author_name",
    "idx": 4686
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`customer`)-[t2:has_address]->(`t3`:`address`)-[located_in_0:located_in]->(`t4`:`country`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t3`.`address_id` = `t2`.`address_id`\nAND `t4`.`country_id` = `t3`.`country_id`\nAND (`t1`.`first_name` = 'Ursola' AND `t1`.`last_name` = 'Purdy')\nRETURN `t3`.`street_number` AS `street_number`, `t3`.`street_name` AS `street_name`, `t3`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the full address of Ursola Purdy.",
    "evidence": "full address refers to street_number, street_name, city, country_name",
    "idx": 4692
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t1`.`title` = 'Girls\\' Night In')\nRETURN `t2`.`publisher_name` AS `publisher_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the publisher of the book Girls' Night In.",
    "evidence": "\"Girls' Night In\" is the title of the book; publisher is the publisher_name",
    "idx": 4694
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nORDER BY `t1`.`publication_date` IS NULL DESC, `t1`.`publication_date`  \nRETURN `t2`.`publisher_name` AS `publisher_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the publisher of the oldest book.",
    "evidence": "publisher refers to publisher_name;  oldest book refers to Min(publication_date)",
    "idx": 4695
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`shipping_method`:`shipping_method`)\nRETURN sum(CASE  WHEN `shipping_method`.`method_name` = 'Priority' THEN `shipping_method`.`cost` ELSE 0 END) - sum(CASE  WHEN `shipping_method`.`method_name` = 'Express' THEN `shipping_method`.`cost` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the cost difference between Priority and Express shipping methods.",
    "evidence": "\"Priority\" and \"Express\" are both method_name; cost difference = Subtract (Sum(cost where method_name = 'Express'), Sum(cost where method_name 'Priority'))",
    "idx": 4696
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`order_status`)\nMATCH (`t2`:`order_history`)\nWHERE `t1`.`status_id` = `t2`.`status_id`\nAND (`t1`.`status_value` = 'Cancelled' AND CASE WHEN `t2`.`status_date` is not NULL THEN apoc.temporal.format(`t2`.`status_date`,'yyyy') ELSE NULL END = '2022')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders have been cancelled in 2022?",
    "evidence": "cancelled refers to status_value = 'Cancelled'; in 2022 refers to SUBSTR(status_date, 1, 4) = '2022'",
    "idx": 4697
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t2`.`publisher_name` = 'BBC Audiobooks')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the books published by BBC Audiobooks.",
    "evidence": "\"BBC Audiobooks\" refers to publisher_name; books refers to title",
    "idx": 4698
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`book`:`book`)\nWHERE CASE WHEN `book`.`publication_date` is not NULL THEN apoc.temporal.format(`book`.`publication_date`,'yyyy') ELSE NULL END = '2017'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many books were published in 2017?",
    "evidence": "published in 2017 refers to Substr(publication_date,1, 4) = '2017'",
    "idx": 4699
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`book`:`book`)\nWHERE `book`.`title` = 'The Mystery in the Rocky Mountains'\nRETURN `book`.`isbn13` AS `isbn13`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the International Standard Book Number of the book The Mystery in the Rocky Mountains.",
    "evidence": "International Standard Book Number refers to isbn13; 'The Mystery in the Rocky Mountains' is the title of the book",
    "idx": 4700
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`order_status`)\nMATCH (`t2`:`order_history`)\nWHERE `t1`.`status_id` = `t2`.`status_id`\nAND (CASE WHEN `t2`.`status_date` is not NULL THEN apoc.temporal.format(`t2`.`status_date`,'yyyy') ELSE NULL END = '2022')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`status_value` = 'Returned' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all orders updated in 2022, identify the percentage that has been returned.",
    "evidence": "order updated in 2022 refers to SUBSTR(status_date, 1, 4) = '2022'; has been returned refers to status_value = 'Returned'; percentage = Divide (Count(status_value = 'Returned'), Count(status_value)) * 100",
    "idx": 4701
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`address_status`)\nMATCH ()-[t1:has_address]->()\nWHERE `t2`.`status_id` = `t1`.`status_id`\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`address_status` = 'Inactive' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all addresses provided by customers, identify the percentage that are not in use anymore.",
    "evidence": "address not in use refers to address_status = 'Inactive'; percentage = Divide (Count(address_status = 'Inactive'), Count(address_status)) * 100",
    "idx": 4702
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[t2:has_author]->(`t3`:`author`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND `t3`.`author_id` = `t2`.`author_id`\nAND (`t3`.`author_name` = 'Tom Clancy')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all books authored by Tom Clancy.",
    "evidence": "\"Tom Clancy\" is the author_name; books refers title",
    "idx": 4705
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t2`.`publisher_name` = 'ADV Manga')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all books published by ADV Manga.",
    "evidence": "\"ADV Manga\" is the publisher_name; books refers to title",
    "idx": 4708
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`customer`)-[t2:has_address]->(`t3`:`address`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t3`.`address_id` = `t2`.`address_id`\nAND (`t3`.`street_number` = '55' AND `t3`.`street_name` = 'Dorton Pass' AND `t3`.`city` = 'Huangqiao')\nRETURN DISTINCT `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the full name of the customers whose address is at 55 Dorton Pass, Huangqiao.",
    "evidence": "full name refers to first_name, last_name; '55' is the street_number, 'Dorton Pass' is the street_name; 'Huangqiao' is the city",
    "idx": 4709
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`address`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t2`.`country_id` = `t1`.`country_id`\nAND (`t2`.`country_name` = 'Poland')\nRETURN `t1`.`street_number` AS `street_number`, `t1`.`street_name` AS `street_name`, `t1`.`city` AS `city`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List 10 addresses located in Poland.",
    "evidence": "\"Polan\" is the country_name; address refers to street_number, street_name, city",
    "idx": 4711
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[written_in_0:written_in]->(`t2`:`book_language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`language_name` = 'Arabic')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all books written in Arabic.",
    "evidence": "\"Arabic\" is the language_name; book refers to title",
    "idx": 4712
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t3`:`book`)-[t1:has_author]->(`t2`:`author`)\nWHERE `t1`.`author_id` = `t2`.`author_id`\nAND `t3`.`book_id` = `t1`.`book_id`\nAND (`t2`.`author_name` = 'A.J. Ayer')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the title of books written by author A.J.Ayer.",
    "evidence": "\"A.J. Ayer\" is the author_name;",
    "idx": 4719
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`book`)-[published_by_0:published_by]->(`t2`:`publisher`)\nWHERE `t1`.`publisher_id` = `t2`.`publisher_id`\nAND (`t2`.`publisher_name` = 'Free Press' AND CASE WHEN `t1`.`publication_date` is not NULL THEN apoc.temporal.format(`t1`.`publication_date`,'yyyy') ELSE NULL END >= '1990' AND CASE WHEN `t1`.`publication_date` is not NULL THEN apoc.temporal.format(`t1`.`publication_date`,'yyyy') ELSE NULL END <= '2000')\nORDER BY `t1`.`num_pages` IS NULL ASC, `t1`.`num_pages` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the title of the book with the most number of pages that was published from 1990 to 2000 by publisher Free Press.",
    "evidence": "books with the most number of pages refers to Max(num_pages); published from 1990 to 2000 refers to SUBSTR(publication_date, 1, 4) BETWEEN '1990' AND '2000'; 'Free Press' is the publisher_name",
    "idx": 4722
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t2`:`order_line`)\nMATCH (`t1`:`book`)\nWHERE `t1`.`book_id` = `t2`.`book_id`\nAND (`t1`.`title` = 'The Servant Leader' AND CASE WHEN `t1`.`publication_date` is not NULL THEN apoc.temporal.format(`t1`.`publication_date`,'yyyy') ELSE NULL END = '2003')\nRETURN `t2`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the order price of the book \"The Servant Leader\" in 2003?",
    "evidence": "\"The Servant Leader\" is the title of the book; book in 2003 refers to SUBSTR(publication_date, 1, 4) = '2003'",
    "idx": 4723
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`order_status`)\nMATCH (`t2`:`order_history`)\nWHERE `t1`.`status_id` = `t2`.`status_id`\nAND (`t1`.`status_value` = 'Returned' AND CASE WHEN `t2`.`status_date` is not NULL THEN apoc.temporal.format(`t2`.`status_date`,'yyyy') ELSE NULL END = '2022')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders got returned in 2022?",
    "evidence": "orders got returned refers to status_value = 'Returned'; in 2022 refers to SUBSTR(status_date, 1, 4) = '2022'",
    "idx": 4725
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (`t1`:`customer`)-[t2:has_address]->(`t3`:`address`)-[located_in_0:located_in]->(`t4`:`country`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t3`.`address_id` = `t2`.`address_id`\nAND `t4`.`country_id` = `t3`.`country_id`\nAND (`t1`.`email` = 'rturbitT2@geocities.jp')\nRETURN `t4`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country does the customer with the email \"rturbitt2@geocities.jp\" from?",
    "evidence": "\"rturbitt2@geocities.jp\" is the email of customer; country refers to country_name",
    "idx": 4726
  }
]