[
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`coaches`)\nMATCH (`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid`\nAND (CASE WHEN `t2`.`games`=0 THEN NULL ELSE toFloat(`t2`.`won`) * 100 / `t2`.`games` END > 90)\nRETURN DISTINCT `t2`.`name` AS `name`, `t1`.`year` AS `year`, `t1`.`coachid` AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team(s) had 90% games won. List the coach ID for the team and year played.",
    "evidence": "team with 90% games won refers to Divide (won, games) > 0.9",
    "idx": 2064
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`awards_players`)-[awarded_to_0:awarded_to]->(`t1`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`birthstate` = 'NY' AND `t2`.`award` = 'All-Defensive First Team' AND `t2`.`year` >= 1980 AND `t2`.`year` <= 2000)\nRETURN COUNT(DISTINCT `t1`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of player who won \"All-Defensive First Team\" from 1980 - 2000 is from 'NY'.",
    "evidence": "\"All-Defensive First Team\" is the award; ' NY' is the birthState; 1980 to 2000 refers to year between 1980 and 2000; percentage = Divide (Count(playerID where birthState = 'NY'), Count(playerID)) * 100",
    "idx": 2065
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players`)\nMATCH (`t2`:`players_teams`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nWITH `t2`.`lgid` AS _groupby_col_0, `t1`.`weight` AS _groupby_col_1, `t1`.`weight` AS _groupby_col_2, MAX(`t1`.`weight`) - MAX(`t1`.`weight`) * 0.4 AS _groupby_col_3\nWHERE _groupby_col_2 = _groupby_col_3\nRETURN _groupby_col_0 AS `lgid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which league did the player who weighs 40% less than the heaviest player and whose height is 80 inches play?",
    "evidence": "weigh 40% less than the heaviest player refers to weight = Multiply(Max (weight), 0.6); league refers to lgID",
    "idx": 2075
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`coaches`:`coaches`)\nWITH `coaches`.`coachid` AS _groupby_col_0, COUNT(DISTINCT `coaches`.`tmid`) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the name of the coach who has served more than 2 NBA teams.",
    "evidence": "\"NBA\" is the lgID; server more than 2 teams refers to Count(tmID) = 2",
    "idx": 2076
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "WITH *, COLLECT { MATCH (`coaches_sub0`:`coaches`)\nWHERE `coaches_sub0`.`lgid` = 'NBA'\nWITH `coaches_sub0`.`coachid` AS _groupby_col_0, COUNT(`coaches_sub0`.`tmid`) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `coachid_1`   } AS in_collect_0\nMATCH (`coaches`:`coaches`)\nWHERE `coaches`.`lgid` = 'NBA' AND `coaches`.`post_wins` <> 0 AND `coaches`.`post_losses` <> 0 AND `coaches`.`coachid` IN in_collect_0\nORDER BY `coaches`.`post_losses` IS NULL DESC, `coaches`.`post_losses`  \nRETURN `coaches`.`coachid` AS `coachid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who have served more than 2 NBA teams, during which coach's period of coaching, a team has the least numbers of games lost in the post-season games?",
    "evidence": "served more than 2 NBA teams refers to count (tmID) > = 2; least number of game lost in post season refers to Min(post_losses)",
    "idx": 2078
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players`)\nMATCH (`t2`:`players_teams`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND ((`t1`.`pos` = 'F' OR `t1`.`pos` = 'F-C') AND `t2`.`lgid` = 'NBA')\nRETURN DISTINCT `t1`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the first name of the players from the NBA league with the forward position.",
    "evidence": "\"NBA\" is the lgID; with the forward position refers to pos = 'F' of pos = 'F-C'",
    "idx": 2080
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`player_allstar`)-[for_player_0:for_player]->(`t1`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`conference` = 'East')\nRETURN DISTINCT `t1`.`college` AS `college`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the players who belongs to the east conference, please list the name of the college they went to.",
    "evidence": "belong to the east conference refers to divID = 'EA'",
    "idx": 2082
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`coaches`:`coaches`)\nWITH `coaches`.`tmid` AS _groupby_col_0, `coaches`.`coachid` AS _groupby_col_1, `coaches`.`won` AS _groupby_col_2, `coaches`.`lost` AS _groupby_col_3, CASE WHEN (`coaches`.`won` + `coaches`.`lost`)=0 THEN NULL ELSE toFloat(`coaches`.`won`) * 100 / (`coaches`.`won` + `coaches`.`lost`) END AS _groupby_col_4\nWHERE _groupby_col_4 > 80\nRETURN _groupby_col_1 AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who are the coaches for team with winning rate of 80% and above?",
    "evidence": "winning rate of 80% and above refers to Divide (won, Sum(won, lost)) > 0.8; coaches refers to coachID",
    "idx": 2089
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`coaches`:`coaches`)\nWHERE `coaches`.`lgid` = 'NBA'\nWITH `coaches`.`coachid` AS _groupby_col_0, MAX(`coaches`.`year`) - min(`coaches`.`year`) AS _groupby_col_1\nWHERE _groupby_col_1 > 10\nRETURN _groupby_col_0 AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which coach has serviced in NBA for more than 10 years.",
    "evidence": "\"NBA\" is the lgID; coach who serviced for more than 10 years refers to coachID where Subtract (Max(year), Min(year)) > 10",
    "idx": 2090
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "CALL (*) {\nMATCH (`t3_sub0`:`awards_players`)\nMATCH (`t2_sub0`:`players_teams`)-[for_team_1:for_team]->(`t1_sub0`:`teams`)\nWHERE `t1_sub0`.`tmid` = `t2_sub0`.`tmid` AND `t1_sub0`.`year` = `t2_sub0`.`year`\nAND `t2_sub0`.`playerid` = `t3_sub0`.`playerid`\nAND (`t3_sub0`.`award` = 'Most Valuable Player')\nWITH `t1_sub0`.`name` AS _groupby_col_0, sum(`t2_sub0`.`points`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 3800\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `_col_1`  \n}\nWITH *\nRETURN COUNT(DISTINCT `name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many teams have played more than 3800 points and have player with \"Most Valuable Player\" award?",
    "evidence": "played more than 3800 points refers to Sum(points) > = 3800",
    "idx": 2091
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players`)\nMATCH (`t2`:`players_teams`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`tmid` = 'BLB')\nRETURN `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list down the last name of players from \"BLB\" team.",
    "evidence": "\"BLB\" is the tmID",
    "idx": 2093
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`awards_coaches`:`awards_coaches`)\nWHERE `awards_coaches`.`year` >= 1970 AND `awards_coaches`.`year` <= 1990\nWITH `awards_coaches`.`coachid` AS _groupby_col_0, `awards_coaches`.`award` AS _groupby_col_1, COUNT(`awards_coaches`.`award`) AS _groupby_col_2\nWHERE _groupby_col_2 = 2\nRETURN _groupby_col_0 AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the coach IDs who received the award twice from 1970 to 1990.",
    "evidence": "from 1970 to 1990 refers to year between 1970 and 1990;  received award twice refers to coachID where Count(coachID) = 2",
    "idx": 2095
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`player_allstar`)-[for_player_0:for_player]->(`t1`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`height` > 75)\nRETURN DISTINCT `t1`.`lastname` AS `lastname`, `t1`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the last names and first names of all-star players who are higher than 75 inch.",
    "evidence": "higher than 75 inch refers to height > 75",
    "idx": 2098
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players_teams`)\nMATCH (`t2`:`player_allstar`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nWITH `t1`.`tmid` AS _groupby_col_0, COUNT(DISTINCT `t1`.`playerid`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 3\nRETURN _groupby_col_0 AS `tmid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the team names which have at least 3 all-star players.",
    "evidence": "team with at least 3 all star player refers to tmID where Count(player_allstar.playerID) > = 3",
    "idx": 2102
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`players_teams`)-[for_team_1:for_team]->(`t2_sub0`:`teams`)\nWHERE `t1_sub0`.`tmid` = `t2_sub0`.`tmid` AND `t1_sub0`.`year` = `t2_sub0`.`year`\nAND (`t1_sub0`.`year` = 1937)\nWITH `t2_sub0`.`name` AS _groupby_col_0, sum(`t1_sub0`.`points`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 500\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `_col_1`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 1937, how many teams whose players got at least 500 points?",
    "evidence": "in 1937 refers to year = 1937; player got at least 500 points refers to Sum(points) > = 500",
    "idx": 2105
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`players`:`players`)\nWHERE `players`.`race` = 'B' AND `players`.`height` > 0\nORDER BY `players`.`height` IS NULL DESC, `players`.`height`  \nRETURN `players`.`firstname` AS `firstname`, `players`.`lastname` AS `lastname`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the top three shortest black players.",
    "evidence": "shortest player refers to Min(height); black players refers to race = 'B'",
    "idx": 2107
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`draft`)\nMATCH (`t2`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`firstname` = 'Alexis' AND `t1`.`lastname` = 'Ajinca' AND `t1`.`draftround` = 1)\nRETURN `t1`.`draftyear` - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How old was Alexis Ajinca when he was first drafted?",
    "evidence": "age when drafted refers to Subtract(draftYear, year(birthDate)); first drafted refers to draftYear",
    "idx": 2112
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`coaches`)\nMATCH (`t2`:`awards_coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`award` = 'ABA Coach of the Year')\nWITH `t1`.`coachid` AS _groupby_col_0, `t1`.`won` AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `coachid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the coaches who won the 'ABA Coach of the Year' award, which is the coach with the highest number of won games?",
    "evidence": "\"ABA Coach of the Year\" is the award; highest number of won games refers to Max(Count(won))",
    "idx": 2116
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`awards_coaches`:`awards_coaches`)\nWHERE `awards_coaches`.`year` >= 1950 AND `awards_coaches`.`year` <= 1970\nWITH `awards_coaches`.`coachid` AS _groupby_col_0, COUNT(`awards_coaches`.`coachid`) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 1950 to 1970, how many coaches who received more than 1 award?",
    "evidence": "from 1950 to 1970 refers to year between 1950 and 1970; more than 3 awards refers to count(award) > 3",
    "idx": 2122
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`player_allstar`)\nMATCH (`t1_sub0`:`players_teams`)\nWHERE `t1_sub0`.`playerid` = `t2_sub0`.`playerid`\nAND (`t1_sub0`.`lgid` = 'NBA')\nWITH `t1_sub0`.`tmid` AS _groupby_col_0, COUNT(DISTINCT `t1_sub0`.`playerid`) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `tmid`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many teams in the NBA which has at least 3 all-star players?",
    "evidence": "NBA refers to lgID = 'NBA'; have at least 3 all-star players refers to count(player_allstar.playerID) > 3",
    "idx": 2124
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`players`:`players`)\nWHERE `players`.`birthcountry` <> 'USA'\nRETURN `players`.`firstname` AS `firstname`, `players`.`middlename` AS `middlename`, `players`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name of players who are born outside USA.",
    "evidence": "full name refers to firstName, middleName, lastName; born outside USA refers to birthCountry ! = 'USA'",
    "idx": 2125
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`coaches`)\nMATCH (`t2`:`awards_coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t2`.`year` = 2010 AND `t2`.`award` = 'NBA Coach of the Year')\nRETURN DISTINCT `t1`.`tmid` AS `tmid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the team in which the coach won the title 'NBA Coach of the Year' in 2010.",
    "evidence": "team name refers to teams.name; won the title 'NBA Coach of the Year' refers to award = 'NBA Coach of the Year'; in 2010 refers to year = 2010",
    "idx": 2128
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`player_allstar`)-[for_player_0:for_player]->(`t1`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`ft_attempted` > 0 AND `t2`.`ft_attempted` = `t2`.`ft_made`)\nRETURN DISTINCT `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t1`.`height` AS `height`, `t1`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the first name, last name, height and weight of the players who has all free throw attempted successfully made.",
    "evidence": "all free throw attempted successfully made refers to ftAttempted > 0 and ftAttempted = ftMade",
    "idx": 2129
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`awards_players`)-[awarded_to_0:awarded_to]->(`t1`:`players`)\nWHERE `t2`.`playerid` = `t1`.`playerid`\nAND (`t2`.`award` = 'Finals MVP' AND `t2`.`year` = 2003)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`middlename` AS `middlename`, `t1`.`lastname` AS `lastname`, 2003 - toFloat(CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END) AS `_col_3`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name and age of the player when he won the \"Finals MVP\" in 2003.",
    "evidence": "full name refers to firstName, middleName, lastName; age = subtract(2003, year(birthDate)); won the \"Finals MVP\" refers to award = 'Finals MVP'; in 2003 refers to year = 2003",
    "idx": 2130
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`teams`)\nMATCH ()-[t2:beat]->()\nWHERE `t1`.`tmid` = `t2`.`tmidwinner`\nAND (`t2`.`round` = 'F' AND `t2`.`year` >= 1950 AND `t2`.`year` <= 1960)\nRETURN DISTINCT `t1`.`name` AS `name`, `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the champion (team name) and year from year 1950 to 1960.",
    "evidence": "champion refers to round = 'F'; team name refers to teams.name; from year 1950 to 1960 refers to year between 1950 and 1960",
    "idx": 2131
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "CALL(*) {\nMATCH (`awards_players_sub0`:`awards_players`)\nWHERE `awards_players_sub0`.`year` = 1970\nWITH `awards_players_sub0`.`playerid` AS _groupby_col_0, COUNT(`awards_players_sub0`.`award`) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `playerid`  LIMIT 1\n}\nMATCH (`players`:`players`)\nWHERE `players`.`playerid` = `playerid`\nRETURN `players`.`college` AS `college`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From which college was the player who won the most award in 1970.",
    "evidence": "college refers to highSchool; won the most award refers to max(count(award)); in 1970 refers to year = 1970",
    "idx": 2132
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`awards_players`)-[awarded_to_0:awarded_to]->(`t1`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`award` = 'Rookie of the Year')\nORDER BY `t1`.`birthdate` IS NULL ASC, `t1`.`birthdate` DESC \nRETURN `t1`.`firstname` AS `firstname`, `t1`.`middlename` AS `middlename`, `t1`.`lastname` AS `lastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the youngest player who ever won \"Rookie of the Year\".",
    "evidence": "player name refers to playerID; the youngest refers to max(birthDate); won \"Rookie of the Year\" refers to award = 'Rookie of the Year'",
    "idx": 2133
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players`)\nMATCH (`t2`:`draft`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`draftround` = 1 AND `t1`.`birthcountry` <> 'USA' AND `t2`.`draftyear` = 1973)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`middlename` AS `middlename`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name of players who are drafted from round 1 in 1973 but not born in USA.",
    "evidence": "full name refers to firstName, middleName, lastName; in 1973 refers to year = 1973; not born in USA refers to birthCountry <> 'USA'",
    "idx": 2134
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players_teams`)\nMATCH (`t2`:`player_allstar`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`year` = 2000)\nRETURN CASE WHEN sum(`t2`.`rebounds`)=0 THEN NULL ELSE toFloat(sum(`t2`.`o_rebounds`)) * 100 / sum(`t2`.`rebounds`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of offense rebounds from the total rebounds of the players in year 2000.",
    "evidence": "in year 2000 refers to year = 2000; percentage = divide(sum(o_rebounds), sum(rebounds)) * 100%",
    "idx": 2135
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`coaches`)\nMATCH (`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid`\nAND (CASE WHEN toFloat((`t1`.`won` + `t1`.`lost`))=0 THEN NULL ELSE toFloat(`t1`.`won`) / toFloat((`t1`.`won` + `t1`.`lost`)) END > 0.75)\nRETURN DISTINCT `t1`.`year` AS `year`, `t2`.`name` AS `name`, `t1`.`coachid` AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the year, team and coach that with winning rate of above 75%.",
    "evidence": "team refers to teams.name; coach refers to coachID; winning rate of above 75% refers to divide(won, add(won, lost)) > 0.75",
    "idx": 2136
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`coaches`)\nMATCH (`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid`\nAND (`t2`.`name` = 'Oklahoma City Thunder')\nRETURN DISTINCT `t1`.`coachid` AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the coatches of the Oklahoma City Thunder",
    "evidence": "coach refers to coachID; Oklahoma City Thunder refers to name = 'Oklahoma City Thunder'",
    "idx": 2137
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`players_teams`:`players_teams`)\nWHERE CASE WHEN `players_teams`.`drebounds`=0 THEN NULL ELSE toFloat(`players_teams`.`orebounds`) * 100 / `players_teams`.`drebounds` END <= 50 AND `players_teams`.`year` = 1990\nRETURN COUNT(`players_teams`.`playerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players, in games played in 1990, achieved 50% or less of oRebounds than dRebounds.",
    "evidence": "in 1990 refers to season_id = 1990; 50% or less of oRebounds than dRebounds refers to o_rebounds < = multiply(d_rebounds, 0.5)",
    "idx": 2138
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`teams`:`teams`)\nWHERE `teams`.`name` = 'Houston Mavericks'\nRETURN CASE WHEN sum(`teams`.`games`)=0 THEN NULL ELSE toFloat(sum(`teams`.`lost`)) * 100 / sum(`teams`.`games`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Percentage of games lost out of total games played by the Houston Mavericks",
    "evidence": "Houston Mavericks refers to name = 'Houston Mavericks'; percentage = divide(sum(lost), sum(games)) * 100%",
    "idx": 2143
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`awards_players`:`awards_players`)\nWHERE `awards_players`.`year` > 1990 AND `awards_players`.`award` = 'Most Valuable Player' AND `awards_players`.`lgid` = 'NBA'\nRETURN `awards_players`.`playerid` AS `playerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the players who received the \"Most Valuable Player\" award in the NBA league after the year of 1990, along with their IDs.",
    "evidence": "player refers to playerID; \"Most Valuable Player\" award refers to award = 'Most Valuable Player'; after the year of 1990 refers to year > 1990; ID refers to playerID",
    "idx": 2144
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`awards_coaches`:`awards_coaches`)\nWHERE `awards_coaches`.`year` = 1969\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `awards_coaches`.`award` = 'NBA Coach of the Year' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of coaches in 1969 who were awarded \"NBA Coach of the Year\"?",
    "evidence": "in 1969 refers to year = 1969; awarded \"NBA Coach of the Year\" refers to award = 'NBA Coach of the Year'; percentage = divide(count(coachID where year = 1969 and award = 'NBA Coach of the Year'), count(coachID)) * 100%",
    "idx": 2146
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`awards_players`)-[awarded_to_0:awarded_to]->(`t1`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`college` = 'Auburn')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`award` = 'All-Defensive Second Team' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of players who attended Auburn University and won an \"All-Defensive Second Team\" award?",
    "evidence": "Auburn University refers to college = 'Auburn'; won an \"All-Defensive Second Team\" award refers to award = 'All-Defensive Second Team'; percentage = divide(count(playerID where award = 'All-Defensive Second Team'), count(playerID)) where college = 'Auburn' * 100%",
    "idx": 2149
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`player_allstar`)-[for_player_0:for_player]->(`t1`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`season_id` = 1997)\nORDER BY `t2`.`steals` IS NULL ASC, `t2`.`steals` DESC \nRETURN DISTINCT `t1`.`firstname` AS `firstname`, `t1`.`middlename` AS `middlename`, `t1`.`lastname` AS `lastname`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the top five players with the most steals in the year 1997. Please give their full name.",
    "evidence": "full name refers to firstName, middleName, lastName; in the year 1997 refers to year = 1997; the most steals refers to max(steals)",
    "idx": 2150
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`player_allstar`:`player_allstar`)\nWHERE `player_allstar`.`season_id` = 1996 AND CASE WHEN `player_allstar`.`ft_attempted`=0 THEN NULL ELSE toFloat(`player_allstar`.`ft_made`) * 100 / `player_allstar`.`ft_attempted` END > 70\nRETURN `player_allstar`.`playerid` AS `playerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the NBA All-star players in 1996 season , which have more than 70% free throw rate? Please give their player id.",
    "evidence": "NBA refers to lgID = 'NBA'; in 1996 season refers to season_id = 1996; more than 70% free throw rate refers to ft_made > = 0 AND ft_attempted > 0 AND divide(ft_made, ft_attempted) > 0.7",
    "idx": 2152
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`players_teams`)\nMATCH (`t1`:`player_allstar`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`year` >= 1980 AND `t2`.`year` <= 1983 AND CASE WHEN `t1`.`three_attempted`=0 THEN NULL ELSE `t1`.`three_made` / `t1`.`three_attempted` END > 0.6)\nRETURN DISTINCT `t2`.`playerid` AS `playerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 1980 to 1983, how many of the NBA All-Star players have more than 60% three point rate?",
    "evidence": "from 1980 to 1983 refers to year BETWEEN 1980 and 1983; NBA refers to lgID = 'NBA'; more than 60% three point rate refers to divide(threeMade, threeAttempted) > 0.6",
    "idx": 2153
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`coaches`)\nMATCH (`t2`:`awards_coaches`)\nWHERE `t1`.`coachid` = `t2`.`coachid`\nAND (`t1`.`tmid` = 'STL' AND `t1`.`lgid` = 'NBA')\nRETURN DISTINCT `t2`.`coachid` AS `coachid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the NBA winning coaches, which are from STL team? Please list their coach id.",
    "evidence": "NBA refers to lgID = 'NBA'; STL team refers to tmID = 'STL'",
    "idx": 2154
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`player_allstar`)-[for_player_0:for_player]->(`t1`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`college` = 'Wake Forest' AND `t2`.`o_rebounds` > `t2`.`d_rebounds`)\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`middlename` AS `middlename`, `t1`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which player from Wake Forest college did the most offensive rebounds than defensive rebounds in the all-star? Please mention the full name of the player including the middle name if have any.",
    "evidence": "Wake Forest college refers to highSchool = 'Wake Forest college'; did the most offensive rebounds than defensive rebounds refers to max(subtract(sum(oRebounds), sum(dRebounds))); full name refers to first_name, middle_name, last_name",
    "idx": 2156
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`players_teams`:`players_teams`)\nWHERE `players_teams`.`year` = 2011\nORDER BY `players_teams`.`gp` IS NULL ASC, `players_teams`.`gp` DESC \nRETURN `players_teams`.`playerid` AS `playerid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which player had the most game presentatons in 2011 NBA season.",
    "evidence": "player refers to playerID; the most game presentations refers to max(GP); in 2020 refers to year = 2020; NBA season refers to lgID = 'NBA'",
    "idx": 2160
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players`)\nMATCH (`t2`:`players_teams`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t2`.`year` = 2003)\nWITH `t1`.`playerid` AS _groupby_col_0, `t2`.`assists` AS _groupby_col_1, avg(`t2`.`turnovers`) AS _groupby_col_2\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_2 AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many turnovers per game did the assist champion had in the 2003 NBA season?",
    "evidence": "turnovers per game = avg(turnovers); 2003 refers to year = 2003; NBA refers to lgID = 'NBA'",
    "idx": 2164
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t2`:`players_teams`)-[for_team_0:for_team]->(`t1`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nRETURN CASE WHEN COUNT(`t1`.`tmid`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN NOT `t2`.`steals` IS NULL AND `t1`.`tmid` = 'LAL' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`tmid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many percent of points were scored by NBA players who belonged to 'LAL' team and had performed steals movement.",
    "evidence": "NBA refers to lgID = 'NBA'; 'LAL' team refers to tmID = 'LAL'; performed steals movement refers to steals > 0; percent = divide(count(playerID where steals > 0), count(playerID)) where lgID = 'NBA' and tmID = 'LAL' * 100%",
    "idx": 2168
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`players_teams`)\nMATCH (`t2`:`players`)\nWHERE `t1`.`playerid` = `t2`.`playerid`\nAND (`t1`.`postgp` = 0 AND `t1`.`year` = 1988)\nORDER BY `t1`.`turnovers` IS NULL ASC, `t1`.`turnovers` DESC \nRETURN `t2`.`playerid` AS `playerid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the player id of the man who had the most turnovers whose team missed the playoffs in year 1988.",
    "evidence": "the most turnovers refers to max(turnovers); missed the playoffs refers to PostGP = 0; in year 1988 refers to year = 1988",
    "idx": 2170
  }
]