[
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`batsman_scored`:`batsman_scored`)\nWHERE `batsman_scored`.`match_id` = 336004\nORDER BY `batsman_scored`.`runs_scored` IS NULL ASC, `batsman_scored`.`runs_scored` DESC \nRETURN `batsman_scored`.`over_id` AS `over_id`, `batsman_scored`.`ball_id` AS `ball_id`, `batsman_scored`.`innings_no` AS `innings_no`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the over IDs, ball IDs, and innings numbers of the match ID \"336004\" while the batsman got the maximum scores.",
    "evidence": "over ID refers to Over_Id; ball ID refers to Ball_Id; innings number refers to Innings_No; match ID \"336004\" refers to Match_Id = 336004; batsman got the maximum scores refers to max(Runs_Scored)",
    "idx": 1271
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`ball_by_ball`:`ball_by_ball`)\nWHERE `ball_by_ball`.`over_id` = 20\nWITH `ball_by_ball`.`match_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `match_id`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe any five matches IDs that reached over ID 20.",
    "evidence": "reached over ID 20 refers to Over_Id = 20",
    "idx": 1272
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`wicket_taken`:`wicket_taken`)\nWHERE `wicket_taken`.`innings_no` = 1\nRETURN sum(CASE  WHEN `wicket_taken`.`match_id` = 548335 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players got out in the first inning of match ID \"548335\"?",
    "evidence": "got out refers to Player_Out; the first inning refers to Innings_No = 1; match ID \"548335\" refers to Match_Id = 548335",
    "idx": 1273
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE toString(`player`.`dob`) =~ '(?i)(?s)1971.*'\nRETURN `player`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the players' names who were born in 1971.",
    "evidence": "players' name refers to Player_name; born in 1971 refers to DOB LIKE '1971%'",
    "idx": 1274
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE toString(`match`.`match_date`) =~ '(?i)(?s).*2015-04-18.*'\nRETURN `match`.`match_id` AS `match_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the match IDs which were held on 18th April 2015.",
    "evidence": "on 18th April 2015 refers to DATE(Match_Date) = '2015-04-18'",
    "idx": 1275
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`wicket_taken`)-[has_out_type_0:has_out_type]->(`t2`:`out_type`)\nWHERE `t2`.`out_id` = `t1`.`kind_out`\nAND (`t2`.`out_name` = 'hit wicket')\nRETURN `t1`.`match_id` AS `match_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the match IDs which had players out by hit wickets.",
    "evidence": "had players out by hit wickets refers to Out_Name = 'hit wicket'",
    "idx": 1276
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`wicket_taken`)-[has_out_type_0:has_out_type]->(`t2`:`out_type`)\nWHERE `t2`.`out_id` = `t1`.`kind_out`\nAND (`t2`.`out_name` = 'stumped')\nRETURN sum(CASE  WHEN `t1`.`innings_no` = 2 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players got out by being stumped in the second innings of all matches?",
    "evidence": "got out by being stumped refers to Out_Name = 'stumped'; the second innings refers to Innings_No = 2",
    "idx": 1277
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t2`:`player`)\nWHERE `t2`.`player_id` = `t1`.`man_of_the_match`\nRETURN sum(CASE  WHEN `t2`.`player_name` = 'Yuvraj Singh' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times did Yuvraj Singh receive the Man of the Match award?",
    "evidence": "Yuvraj Singh refers to Player_Name = 'Yuvraj Singh'; receive the Man of the Match award refers to Player_Id = Man_of_the_Match",
    "idx": 1278
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[from_country_0:from_country]->(`t1`:`country`)\nWHERE `t2`.`country_name` = `t1`.`country_id`\nAND (toString(`t2`.`dob`) =~ '(?i)(?s)1977.*' AND `t1`.`country_name` = 'England')\nRETURN `t2`.`player_name` AS `player_name`, `t2`.`dob` AS `dob`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players who were born in 1977, provide names and birthdates of the players from England.",
    "evidence": "born in 1977 refers to DOB LIKE '1977%'; name refers to Player_Name; birthdate refers to DOB; England refers to Country_Name = 'England'",
    "idx": 1279
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t1`:`player`)\nMATCH (`t2`:`match`)-[in_season_0:in_season]->(`t3`:`season`)\nWHERE `t2`.`man_of_the_match` = `t1`.`player_id`\nAND `t3`.`season_id` = `t2`.`season_id`\nAND (`t3`.`season_year` = 2010)\nWITH `t1`.`player_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who got the Man of the Series Award in 2010?",
    "evidence": "player's name refers to Player_Name; got the Man of the Series Award refers to Man_of_the_Match = Player_Id; in 2010 refers to Season_Year = 2010",
    "idx": 1280
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[involves_team_0:involves_team]->(`t2`:`team`)\nMATCH (`t1`:`match`)-[involves_team_1:involves_team]->(`t3`:`team`)\nWHERE `t2`.`team_id` = `t1`.`team_1`\nAND `t3`.`team_id` = `t1`.`team_2`\nAND (`t2`.`team_name` = 'Chennai Super Kings' OR `t3`.`team_name` = 'Chennai Super Kings')\nRETURN CASE WHEN COUNT(`t1`.`match_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`match_winner` = 3 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`match_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the win rate of the team \"Chennai Super Kings\".",
    "evidence": "team \"Chennai Super Kings\" refers to Team_Name = 'Chennai Super Kings'; win rate = divide(count(Match_Id where Match_Winner = 3), count(Match_Id)) * 100%",
    "idx": 1281
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_bowling_style_0:has_bowling_style]->(`t2`:`bowling_style`)\nWHERE `t2`.`bowling_id` = `t1`.`bowling_skill`\nAND (`t2`.`bowling_skill` = 'Left-arm fast')\nRETURN `t1`.`player_name` AS `player_name`, `t1`.`dob` AS `dob`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names and birthdates of players who have left-arm fast skills.",
    "evidence": "player's name refers to Player_Name; birthdate refers to DOB; have left-arm fast skills refers to Bowling_skill = 'Left-arm fast'",
    "idx": 1282
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`umpire`)-[from_country_0:from_country]->(`t1`:`country`)\nWHERE `t2`.`umpire_country` = `t1`.`country_id`\nAND (`t2`.`umpire_name` = 'BR Doctrove')\nRETURN `t1`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where did BR Doctrove come from?",
    "evidence": "the country the umpire comes from refers to Country_Name; BR Doctrove refers to Umpire_Name = 'BR Doctrove'",
    "idx": 1283
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH ()-[t2:has_player]->(`t1`:`player`)\nMATCH (`t3`:`team`)-[t2:had_player]->()\nWHERE `t2`.`player_id` = `t1`.`player_id`\nAND `t3`.`team_id` = `t2`.`team_id`\nAND (`t1`.`player_name` = 'CK Kapugedera')\nRETURN `t3`.`team_name` AS `team_name`, COUNT(`t2`.`match_id`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team did CK Kapugedera belong to? How many matches did he play?",
    "evidence": "team refers to Team_Name; CK Kapugedera refers to Player_Name = 'CK Kapugedera'",
    "idx": 1284
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t3`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)-[located_in_0:located_in]->(`t1`:`city`)\nWHERE `t2`.`city_id` = `t1`.`city_id`\nAND `t3`.`venue_id` = `t2`.`venue_id`\nAND (`t1`.`city_name` = 'Mumbai')\nRETURN CASE WHEN COUNT(`t3`.`match_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`venue_name` = 'Wankhede Stadium' THEN 1 ELSE 0 END)) * 100 / COUNT(`t3`.`match_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the matches held in Mumbai, how many percent of them were held in Wankhede Stadium?",
    "evidence": "Mumbai refers to City_Name = 'Mumbai'; Wankhede Stadium refers to Venue_Name = 'Wankhede Stadium'; percent = divide(count(Match_Id where Venue_Name = 'Wankhede Stadium'), count(Match_Id)) * 100% where City_Name = 'Mumbai'",
    "idx": 1285
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`wicket_taken`)-[has_out_type_0:has_out_type]->(`t2`:`out_type`)\nWHERE `t2`.`out_id` = `t1`.`kind_out`\nAND (`t1`.`match_id` = 392187)\nRETURN CASE WHEN COUNT(`t1`.`player_out`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`out_name` = 'bowled' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`player_out`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the players out in match ID 392187, calculate the percentage of players out by bowl.",
    "evidence": "out by bowl refers to Out_Name = 'bowled'; percentage = divide(count(Player_Out where Out_Name = 'bowled'), count(Player_Out)) * 100% where Match_Id = 392187",
    "idx": 1286
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[has_toss_decision_0:has_toss_decision]->(`t2`:`toss_decision`)\nWHERE `t2`.`toss_id` = `t1`.`toss_decide`\nAND (`t1`.`match_date` >= localdatetime('2010-01-01T00:00:00') AND `t1`.`match_date` <= localdatetime('2016-12-31T00:00:00'))\nRETURN CASE WHEN COUNT(`t2`.`toss_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`toss_name` = 'field' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`toss_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many percent of the toss-winners decided to bowl first on the pitch from 2010 to 2016?",
    "evidence": "decide to bowl first refers to Toss_Name = 'field'; from 2010 to 2016 refers to Match_Date BETWEEN '2010-01-01' AND '2016-12-31'; percent = divide(count(Toss_Id where Toss_Name = 'field'), count(Toss_Id)) * 100% where Match_Date BETWEEN '2010-01-01' AND '2016-12-31'",
    "idx": 1287
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE `match`.`toss_decide` = 2\nRETURN `match`.`toss_winner` AS `toss_winner`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the ID of toss winners who decided to bat after winning the \"toss of the coin\".",
    "evidence": "decided to bat refers to Toss_Decide = 2; ID of toss winners refers to Toss_winner",
    "idx": 1288
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t2`:`player`)\nWHERE `t2`.`player_id` = `t1`.`man_of_the_match`\nAND (`t2`.`player_name` = 'BB McCullum')\nRETURN `t1`.`match_id` AS `match_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the match ID of matches that the \"man of the match\" award was given to BB McCullum.",
    "evidence": "",
    "idx": 1289
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t2`:`player`)\nWHERE `t2`.`player_id` = `t1`.`man_of_the_match`\nRETURN `t2`.`dob` AS `dob`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the DOB of players who received the \"man of the match\" award.",
    "evidence": "",
    "idx": 1290
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[toss_won_by_0:toss_won_by]->(`t2`:`team`)\nWHERE `t2`.`team_id` = `t1`.`toss_winner`\nAND (`t1`.`match_id` >= 336010 AND `t1`.`match_id` <= 336020)\nRETURN `t2`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the name of teams that won the toss of the coin from matches with ID from 336010 to 336020.",
    "evidence": "name of teams refers to Team_Name; won the toss refers to Toss_Winner; matches with ID from 336010 to 336020  refers to Match_Id BETWEEN 336010 AND 336020",
    "idx": 1291
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_by_0:won_by]->(`t2`:`team`)\nWHERE `t2`.`team_id` = `t1`.`match_winner`\nRETURN sum(CASE  WHEN `t2`.`team_name` = 'Mumbai Indians' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches have Mumbai Indians won?",
    "evidence": "Mumbai Indians refers to Team_Name = 'Mumbai Indians'; won refers to Match_Winner",
    "idx": 1292
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "CALL(*) {\nMATCH (`team_sub0`:`team`)\nWHERE `team_sub0`.`team_name` = 'Pune Warriors'\nRETURN `team_sub0`.`team_id` AS `team_id`  \n}\nMATCH (`t1`:`match`)-[involves_team_0:involves_team]->(`t2`:`team`)\nWHERE `t2`.`team_id` = `t1`.`team_2`\nAND (`t1`.`team_1` = `team_id`)\nWITH `t2`.`team_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down names of teams that have played as second team against Pune Warriors.",
    "evidence": "names of teams refers to Team_Name; second team refers to Team_2; Pune Warriors refers to Team_Name = 'Pune Warriors'",
    "idx": 1293
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_by_0:won_by]->(`t2`:`team`)\nWHERE `t2`.`team_id` = `t1`.`match_winner`\nAND (`t1`.`match_id` = 336000)\nRETURN `t2`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the team that won match ID 336000?",
    "evidence": "name of the team refers to Team_Name; won refers to Match_Winner",
    "idx": 1294
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)\nWHERE `t2`.`venue_id` = `t1`.`venue_id`\nAND (`t2`.`venue_name` = 'Brabourne Stadium')\nRETURN `t1`.`match_id` AS `match_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the match IDs that were played at Brabourne Stadium?",
    "evidence": "at Brabourne Stadium refers to Venue_Name = 'Brabourne Stadium'",
    "idx": 1295
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)\nWHERE `t2`.`venue_id` = `t1`.`venue_id`\nAND (`t1`.`season_id` = 2)\nWITH `t2`.`venue_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `venue_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the name of venues in season 2.",
    "evidence": "name of venues refers to Venue_Name; season 2 refers to Season_Id = 2",
    "idx": 1296
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`venue`)-[located_in_0:located_in]->(`t1`:`city`)\nWHERE `t2`.`city_id` = `t1`.`city_id`\nAND (`t2`.`venue_name` = 'M Chinnaswamy Stadium')\nRETURN `t1`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the city of M Chinnaswamy Stadium?",
    "evidence": "city refers to City_Name; M Chinnaswamy Stadium refers to Venue_Name = 'M Chinnaswamy Stadium'",
    "idx": 1297
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`venue`)-[located_in_0:located_in]->(`t1`:`city`)\nWHERE `t2`.`city_id` = `t1`.`city_id`\nAND (`t1`.`city_name` = 'Mumbai')\nRETURN `t2`.`venue_name` AS `venue_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all of the venues in Mumbai.",
    "evidence": "venues refers to Venue_Name; Mumbai refers to City_Name = 'Mumbai'",
    "idx": 1298
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[held_at_0:held_at]->(`t1`:`venue`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND (`t1`.`venue_name` =~ '(?i)(?s)St George.*')\nRETURN `t2`.`match_winner` AS `match_winner`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all of the winning teams' IDs that played in St George's Park.",
    "evidence": "winning teams' refers to Match_Winner; played in St George's Park refers to Venue_Name like 'St George%'",
    "idx": 1299
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`venue`)-[located_in_0:located_in]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`venue_name` =~ '(?i)(?s)St George.*')\nRETURN `t2`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Is SuperSport Park located at Centurion?",
    "evidence": "SuperSport Park refers to Venue_Name = 'SuperSport Park'; Centurion refers to City_Name = 'Centurion'",
    "idx": 1300
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND (`t1`.`team_name` = 'Deccan Chargers')\nRETURN sum(`t2`.`match_winner`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total winning match for Deccan Chargers.",
    "evidence": "winning refers to Match_Winner; Deccan Chargers refers to Team_Name = 'Deccan Chargers'",
    "idx": 1301
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`ball_by_ball`:`ball_by_ball`)\nWHERE `ball_by_ball`.`non_striker` = `ball_by_ball`.`ball_id`\nRETURN `ball_by_ball`.`ball_id` AS `ball_id` ORDER BY `ball_id` IS NULL ASC, `ball_id` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the player id of the player who was at the non-striker end for the most number of balls in the match 501219.",
    "evidence": "most number of balls refers to max(Ball_Id); match 501219 refers to Match_Id = 501219;\nplayer id also refers to non_striker or ball_id",
    "idx": 1302
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`batsman_scored`:`batsman_scored`)\nWHERE `batsman_scored`.`innings_no` = 1\nRETURN CASE WHEN sum(`batsman_scored`.`runs_scored`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN 1 < `batsman_scored`.`over_id` AND `batsman_scored`.`over_id` < 25 THEN 1 ELSE 0 END)) * 100 / sum(`batsman_scored`.`runs_scored`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average runs scored during the first half of all first innings.",
    "evidence": "first half refers to 1 < Over_Id and Over_Id < 25; average = divide(sum(Over_Id) when 1 < Over_Id and Over_Id < 25, sum(Runs_Scored)) as percentage; first innings refers to Innings_No = 1",
    "idx": 1303
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`extra_runs`:`extra_runs`)\nWHERE `extra_runs`.`innings_no` = 2\nRETURN avg(`extra_runs`.`innings_no`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the average extra runs given in the second innings of every match?",
    "evidence": "second innings refers to Innings_No = 2; average extra runs = divide(sum(Extra_Runs), count(Innings_No)) when Innings_No = 2",
    "idx": 1304
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`dob` >= localdatetime('1970-01-01T00:00:00') AND `player`.`dob` <= localdatetime('1990-12-31T00:00:00')\nORDER BY `player`.`dob` IS NULL ASC, `player`.`dob` DESC \nRETURN `player`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of the players born between 1970 and 1990 in descending order of age.",
    "evidence": "name of the players refers to Player_Name; born between 1970 and 1990 refers to DOB between '1970-01-01' and '1990-12-31'",
    "idx": 1305
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`wicket_taken`:`wicket_taken`)\nWHERE `wicket_taken`.`over_id` = 3\nRETURN sum(CASE  WHEN `wicket_taken`.`fielders` = '' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Of the wickets taken in the third overs, how many are without the involvement of fielders?",
    "evidence": "third overs refers to Over_Id = 3; without the involvement of fielders refers to Fielders = ''",
    "idx": 1306
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`umpire`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t2`.`country_id` = `t1`.`umpire_country`\nWITH `t2`.`country_id` AS _groupby_col_0, COUNT(`t1`.`umpire_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From which country does the most umpires are from? How many of them are from the mentioned country?\n",
    "evidence": "which country refers to Country_Id; most umpires refers to max(count(Umpire_Id))",
    "idx": 1307
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`wicket_taken`)-[has_out_type_0:has_out_type]->(`t2`:`out_type`)\nWHERE `t1`.`kind_out` = `t2`.`out_id`\nAND (`t2`.`out_name` = 'hit wicket')\nRETURN `t1`.`player_out` AS `player_out`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the players, how many were out by hit wicket?",
    "evidence": "out by hit wicket refers to Out_Name = 'hit wicket'",
    "idx": 1308
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`player`)-[has_batting_style_0:has_batting_style]->(`t1`:`batting_style`)\nWHERE `t1`.`batting_id` = `t2`.`batting_hand`\nRETURN CASE WHEN COUNT(`t2`.`country_name`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`batting_hand` = 'Right-hand bat' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`country_name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On average, how many players from each country bat with their right hand?",
    "evidence": "bat with their right hand refers to Batting_hand = 'Right-hand bat'; average = divide(count(Player_Id) when Batting_hand = 'Right-hand bat', count(Country_Name))",
    "idx": 1309
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_via_0:won_via]->(`t2`:`win_by`)\nWHERE `t1`.`win_type` = `t2`.`win_id`\nAND (`t2`.`win_type` = 'wickets' AND `t1`.`win_margin` < 50)\nRETURN COUNT(`t2`.`win_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the matches where the winning margin is less than fifty, how many teams won by wicket?",
    "evidence": "winning margin is less than fifty refers to Win_Margin < 50; won by wicket refers to Win_Type = 'wickets'",
    "idx": 1310
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND (`t1`.`team_1` = `t1`.`toss_winner`)\nRETURN sum(CASE  WHEN `t1`.`team_2` = `t1`.`match_winner` THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In how many venues did team 2 win the toss and lose the match?",
    "evidence": "team 2 win the toss refers to Toss_Winner = Team_2 ; lose the match refers to Match_Winner = Team_1",
    "idx": 1311
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`season`)\nMATCH (`t2`:`player`)-[from_country_0:from_country]->(`t3`:`country`)\nWHERE `t1`.`man_of_the_series` = `t2`.`player_id`\nAND `t2`.`country_name` = `t3`.`country_id`\nAND (`t1`.`season_year` = 2012)\nRETURN `t2`.`player_name` AS `player_name`, `t3`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which player became the man of the series in the year 2012? Give the name and country of this player.",
    "evidence": "year 2012 refers to Season_Year = 2012; name of player refers to Player_Name.; country of this player refers to Country_Name",
    "idx": 1312
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`season`)\nMATCH (`t2`:`player`)\nWHERE `t1`.`man_of_the_series` = `t2`.`player_id`\nAND (`t1`.`man_of_the_series` > 1)\nRETURN `t2`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the name of the player who was the man of the series more than one time.",
    "evidence": "name of the player refers to Player_Name; man of the series more than one time refers to count(Man_of_the_Series) > 1",
    "idx": 1313
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`wicket_taken`)-[has_out_type_0:has_out_type]->(`t2`:`out_type`)\nWHERE `t1`.`kind_out` = `t2`.`out_id`\nAND (`t2`.`out_name` = 'lbw')\nRETURN avg(`t1`.`player_out`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference in the average number of players out by lbw and runout in the matches?",
    "evidence": "out by lbw refers to Out_Id = 4; runout refers to Out_Id = 3; average out by lbw refers to  avg(Player_Out when Out_Id = 4); average out by runout refers to  avg(Player_Out when Out_Id = 3)",
    "idx": 1314
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`ball_by_ball`:`ball_by_ball`)\nWHERE `ball_by_ball`.`striker` = 7\nRETURN DISTINCT `ball_by_ball`.`over_id` AS `over_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify by their ID all the overs in which the player with ID 7 was on strike.",
    "evidence": "Identify by their ID all the overs refers to Over_Id; player with ID 7 was on strike refers to Striker = 7",
    "idx": 1315
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE `match`.`team_1` = `match`.`toss_winner` AND `match`.`toss_decide` = 2\nRETURN COUNT(`match`.`team_1`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many first teams chose to bat after winning the toss?",
    "evidence": "first teams refers to Team_1; chose to bat after winning the toss refers to Toss_Winner and Toss_Decide = 2",
    "idx": 1316
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nRETURN sum(CASE  WHEN toString(`match`.`match_date`) =~ '(?i)(?s)2010-03.*' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many games were played in March 2010?",
    "evidence": "were played in March 2010 refers to Match_Date = '2010-03%'",
    "idx": 1317
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`player_name` <> 'Gurkeerat Singh'\nRETURN sum(CASE  WHEN `player`.`dob` < localdatetime('1990-06-29T00:00:00') THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players are older than Gurkeerat Singh player?",
    "evidence": "older than Gurkeerat Singh player refers to DOB ! = 'Gurkeerat Singh' and DOB < '1990-06-29'",
    "idx": 1318
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t2`:`player`)\nWHERE `t1`.`man_of_the_match` = `t2`.`player_id`\nRETURN sum(CASE  WHEN `t2`.`player_name` = 'SR Watson' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times has SR Watson been named 'Man of the Match'?",
    "evidence": "",
    "idx": 1319
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->(`t3`:`match`)-[in_season_0:in_season]->(`t4`:`season`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`match_id` = `t3`.`match_id`\nAND `t3`.`season_id` = `t4`.`season_id`\nAND (`t1`.`player_name` = 'SP Narine')\nWITH `t4`.`season_year` AS _groupby_col_0, `t4`.`orange_cap` AS _groupby_col_1\nRETURN _groupby_col_0 AS `season_year`, _groupby_col_1 AS `orange_cap`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In what year did SP Narine win the Orange Cap?",
    "evidence": "year refers to Season_Year",
    "idx": 1320
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nAND (`t2`.`country_name` = 'Zimbabwea')\nRETURN `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all Zimbabwean players.",
    "evidence": "Zimbabwean refers to Country_Name = 'Zimbabwea'; players refers to Player_Name",
    "idx": 1321
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_batting_style_0:has_batting_style]->(`t2`:`batting_style`)\nWHERE `t1`.`batting_hand` = `t2`.`batting_id`\nRETURN sum(CASE  WHEN `t2`.`batting_hand` = 'Left-hand bat' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players bat with their left hands?",
    "evidence": "bat with their left hands refers to Batting_hand = 'Left-hand bat'",
    "idx": 1322
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_via_0:won_via]->(`t2`:`win_by`)\nWHERE `t1`.`win_type` = `t2`.`win_id`\nRETURN sum(CASE  WHEN `t2`.`win_type` <> 'runs' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many games were not won by runs?",
    "evidence": "not won by runs refers to Win_Type ! = 'runs'",
    "idx": 1323
  }
]