[
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'NIPS')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who are the authors at NIPS ?",
    "evidence": "",
    "idx": 915
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'NIPS')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who authored papers at NIPS ?",
    "evidence": "",
    "idx": 916
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'NIPS')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who publishes in NIPS ?",
    "evidence": "",
    "idx": 917
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'NIPS')\nRETURN DISTINCT `t1`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who has papers at NIPS ?",
    "evidence": "",
    "idx": 918
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t1`.`keyphrasename` = 'deep learning')\nWITH `t4`.`venueid` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `venueid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which venue publishes the most papers about deep learning",
    "evidence": "",
    "idx": 919
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nMATCH (`t3`:`paper`)-[t1:has_keyphrase]->()\nWHERE `t3`.`journalid` = `t2`.`journalid`\nAND `t3`.`paperid` = `t1`.`paperid`\nAND (`t2`.`journalname` = 'Cell' AND `t3`.`year` = 2015)\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many publications were added to the Cell journal this year ?",
    "evidence": "",
    "idx": 920
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t2`:`journal`)\nMATCH (`t3`:`paper`)-[t1:has_keyphrase]->()\nWHERE `t3`.`journalid` = `t2`.`journalid`\nAND `t3`.`paperid` = `t1`.`paperid`\nAND (`t2`.`journalname` = 'Cell' AND `t3`.`year` = 2015)\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many articles were published in the Cell journal in 2015 ?",
    "evidence": "",
    "idx": 921
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'ali farhadi' AND `t3`.`year` = 2016 AND `t4`.`venuename` = 'eccv')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "papers published in eccv 2016 by ali farhadi",
    "evidence": "",
    "idx": 923
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'ali farhadi' AND `t3`.`year` = 2016 AND `t4`.`venuename` = 'eccv')\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Does ali farhadi have a paper in eccv in 2016 ?",
    "evidence": "",
    "idx": 924
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'chi')\nWITH `t1`.`authorid` AS _groupby_col_0, COUNT(DISTINCT `t2`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who has published more papers in chi ?",
    "evidence": "",
    "idx": 926
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'chi')\nWITH `t1`.`authorid` AS _groupby_col_0, COUNT(DISTINCT `t2`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who has written the most papers at chi ?",
    "evidence": "",
    "idx": 927
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'chi')\nWITH `t1`.`authorid` AS _groupby_col_0, COUNT(DISTINCT `t2`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how is the most prolific author in chi ?",
    "evidence": "",
    "idx": 928
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` =~ '(?i)(?s)Ye Cao')\nWITH `t3`.`year` AS _groupby_col_0, COUNT(DISTINCT `t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "In what year did Ye Cao publish the most papers",
    "evidence": "",
    "idx": 930
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'deep learning')\nWITH `t3`.`year` AS _groupby_col_0\nRETURN DISTINCT _groupby_col_0 AS `year` ORDER BY `year` IS NULL DESC, `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "first deep learning paper",
    "evidence": "",
    "idx": 932
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t3`.`paperid` = `t4`.`citingpaperid`\nAND (`t1`.`keyphrasename` = 'parsing')\nRETURN DISTINCT `t4`.`citedpaperid` AS `citedpaperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what papers do parsing papers typically cite ?",
    "evidence": "",
    "idx": 937
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'Trophic Cascade')\nRETURN DISTINCT `t3`.`venueid` AS `venueid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "venue for Trophic Cascade",
    "evidence": "",
    "idx": 939
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'question answering' AND `t3`.`year` >= 2011)\nRETURN DISTINCT COUNT(`t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers were written on question answering in 2011 through 2016 ?",
    "evidence": "",
    "idx": 943
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t3`.`paperid` = `t4`.`citedpaperid`\nAND (`t1`.`keyphrasename` = 'NLP')\nWITH `t3`.`venueid` AS _groupby_col_0, COUNT(DISTINCT `t4`.`citingpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `venueid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the best NLP conferences ?",
    "evidence": "",
    "idx": 944
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t3`.`venuename` = 'ACL')\nRETURN DISTINCT `t2`.`paperid` AS `paperid`, `t1`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "ACL papers by author",
    "evidence": "",
    "idx": 945
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:cites]->()\nWHERE `t1`.`paperid` = `t2`.`citedpaperid`\nWITH `t2`.`citingpaperid` AS _groupby_col_0, COUNT(DISTINCT `t2`.`citedpaperid`) AS _groupby_col_1\nWHERE _groupby_col_1 > 10\nRETURN DISTINCT _groupby_col_0 AS `citingpaperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "papers with more than 10 citations",
    "evidence": "",
    "idx": 946
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t1`.`paperid` = `t2`.`paperid`\nAND (`t2`.`year` = 2015)\nRETURN DISTINCT `t1`.`authorid` AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "who wrote papers in 2015",
    "evidence": "",
    "idx": 948
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t5`:`author`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t5`.`authorid`\nAND (`t5`.`authorname` = 'Brian DeRenzi')\nWITH `t1`.`keyphrasename` AS _groupby_col_0, sum(`t3`.`numcitedby`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `keyphrasename`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what keyphrase does Brian DeRenzi write about that gets most citations ?",
    "evidence": "",
    "idx": 949
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t1`.`paperid` = `t2`.`paperid`\nWITH `t1`.`authorid` AS _groupby_col_0, COUNT(`t2`.`paperid`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 5\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "authors with at least 5 papers",
    "evidence": "",
    "idx": 951
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`year` <> 2015\nRETURN DISTINCT `paper`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "papers that were not published in the last year",
    "evidence": "",
    "idx": 952
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Michael Stonebraker' AND `t5`.`keyphrasename` = 'GIS Database')\nRETURN DISTINCT `t3`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When was Michael Stonebraker GIS Database published ?",
    "evidence": "",
    "idx": 953
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Michael Stonebraker' AND `t5`.`keyphrasename` = 'GIS Database')\nRETURN DISTINCT `t3`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When did Michael Stonebraker publish his GIS Database paper ?",
    "evidence": "",
    "idx": 954
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nMATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Michael Stonebraker' AND `t5`.`keyphrasename` = 'GIS Database')\nRETURN DISTINCT `t3`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When does Michael Stonebraker publish the GIS Database paper ?",
    "evidence": "",
    "idx": 955
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2016 AND `t2`.`venuename` = 'CVPR')\nWITH `t3`.`citedpaperid` AS _groupby_col_0, COUNT(`t3`.`citingpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the most popular paper this year in CVPR ?",
    "evidence": "",
    "idx": 957
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[t4:cites]->()\nWHERE `t3`.`paperid` = `t4`.`citedpaperid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'luke zettlemoyer')\nWITH `t3`.`year` AS _groupby_col_0, COUNT(`t4`.`citedpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many citations does luke zettlemoyer have per year",
    "evidence": "",
    "idx": 958
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'sergey levine')\nWITH `t3`.`venueid` AS _groupby_col_0, `t3`.`year` AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `venueid`, _groupby_col_1 AS `year` ORDER BY `year` IS NULL ASC, `year` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where did sergey levine publish his last paper ?",
    "evidence": "",
    "idx": 960
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t4`:`paper`)-[t1:has_keyphrase]->(`t2`:`keyphrase`)\nMATCH (`t4`:`paper`)-[t3:written_by]->()\nWHERE `t1`.`keyphraseid` = `t2`.`keyphraseid`\nAND `t4`.`paperid` = `t1`.`paperid`\nAND `t3`.`paperid` = `t4`.`paperid`\nAND (`t2`.`keyphrasename` = 'Neutralizing Antibody' AND `t4`.`year` = 2012)\nWITH `t3`.`authorid` AS _groupby_col_0, COUNT(`t4`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `authorid` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who are the prominent researchers in Neutralizing Antibody in 2012 ?",
    "evidence": "",
    "idx": 961
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t1`.`year` = 2012 AND `t2`.`venuename` = 'ACL')\nWITH `t1`.`paperid` AS _groupby_col_0, COUNT(`t3`.`citingpaperid`) AS _groupby_col_1, (`t1`.`paperid`) AS _groupby_col_2\nWHERE _groupby_col_1 > 7\nRETURN DISTINCT _groupby_col_2 AS `paperid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many ACL 2012 papers have more than 7 citations ?",
    "evidence": "",
    "idx": 962
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` =~ '(?i)(?s)Noah Smith')\nRETURN `t2`.`paperid` AS `paperid`   } AS in_collect_0\nMATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` <> 'Noah Smith' AND `t3`.`year` > 2009 AND `t2`.`paperid` IN in_collect_0)\nRETURN DISTINCT COUNT(DISTINCT `t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers has Noah Smith co-authored since 2009 ?",
    "evidence": "",
    "idx": 963
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`venue`:`venue`)\nWHERE `venue`.`venuename` = 'Neuroscience'\nRETURN DISTINCT `venue`.`venueid` AS `venueid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What venues are for Neuroscience ?",
    "evidence": "",
    "idx": 965
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'Mary Crainie')\nRETURN DISTINCT MAX(`t3`.`year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When was the last time Mary Crainie published a paper ?",
    "evidence": "",
    "idx": 966
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t4`.`venueid` = `t3`.`venueid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND `t2`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` = 'Samuel Madden' AND `t4`.`venuename` <> 'PVLDB')\nRETURN DISTINCT COUNT(DISTINCT `t3`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many papers does Samuel Madden publish outside of PVLDB area ?",
    "evidence": "",
    "idx": 967
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'Donald E Knuth')\nWITH `t3`.`journalid` AS _groupby_col_0, `t3`.`year` AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `journalid`, _groupby_col_1 AS `year` ORDER BY `year` IS NULL ASC, `year` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which journal did Donald E Knuth publish his last paper ?",
    "evidence": "",
    "idx": 968
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t2`:`paper`)-[published_in_0:published_in]->(`t3`:`venue`)\nMATCH (`t2`:`paper`)-[t1:written_by]->()\nWHERE `t3`.`venueid` = `t2`.`venueid`\nAND `t1`.`paperid` = `t2`.`paperid`\nAND (`t2`.`year` = 2010 AND `t3`.`venuename` = 'sigcse')\nRETURN DISTINCT COUNT(`t2`.`paperid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many authors published at sigcse in 2010 ?",
    "evidence": "",
    "idx": 970
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`paper`:`paper`)\nWHERE `paper`.`title` = 'A Switching Architecture For ISDN'\nRETURN DISTINCT `paper`.`title` AS `title`, `paper`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the year of publication of \" A Switching Architecture For ISDN \" ?",
    "evidence": "",
    "idx": 971
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nMATCH (`t3`:`paper`)-[published_in_0:published_in]->(`t4`:`venue`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND `t4`.`venueid` = `t3`.`venueid`\nAND (`t4`.`venuename` = 'uist')\nRETURN DISTINCT `t1`.`keyphraseid` AS `keyphraseid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what keywords are used by papers at uist",
    "evidence": "",
    "idx": 972
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:written_by]->(`t1`:`author`)\nWHERE `t2`.`authorid` = `t1`.`authorid`\nAND `t2`.`paperid` = `t3`.`paperid`\nAND (`t1`.`authorname` = 'Su-In Lee' AND `t3`.`year` < 2012)\nRETURN DISTINCT `t3`.`paperid` AS `paperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the papers written by Su-In Lee before 2012 .",
    "evidence": "",
    "idx": 973
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t2:has_keyphrase]->(`t1`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t1`.`keyphraseid`\nAND `t3`.`paperid` = `t2`.`paperid`\nAND (`t1`.`keyphrasename` = 'semantic parsing')\nWITH `t3`.`year` AS _groupby_col_0, COUNT(`t3`.`paperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year` ORDER BY `year` IS NULL ASC, `year` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "papers in semantic parsing for each year",
    "evidence": "",
    "idx": 974
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t2:cites]->()\nWHERE `t1`.`paperid` = `t2`.`citedpaperid`\nWITH `t2`.`citingpaperid` AS _groupby_col_0, COUNT(DISTINCT `t2`.`citedpaperid`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 5\nRETURN DISTINCT _groupby_col_0 AS `citingpaperid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "papers with at least 5 citations",
    "evidence": "",
    "idx": 975
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t1`:`paper`)-[t3:cites]->()\nMATCH (`t1`:`paper`)-[published_in_0:published_in]->(`t2`:`venue`)\nWHERE `t1`.`paperid` = `t3`.`citedpaperid`\nAND `t2`.`venueid` = `t1`.`venueid`\nAND (`t2`.`venuename` = 'sigcomm')\nWITH `t3`.`citedpaperid` AS _groupby_col_0, COUNT(`t3`.`citingpaperid`) AS _groupby_col_1\nRETURN DISTINCT _groupby_col_0 AS `citedpaperid`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the most cited paper at sigcomm ?",
    "evidence": "",
    "idx": 977
  },
  {
    "filename": "train_others.json",
    "db_id": "scholar",
    "gql_statement": "MATCH (`t3`:`paper`)-[t4:written_by]->(`t1`:`author`)\nMATCH ()-[t2:has_keyphrase]->(`t5`:`keyphrase`)\nWHERE `t2`.`keyphraseid` = `t5`.`keyphraseid`\nAND `t4`.`paperid` = `t2`.`paperid`\nAND `t4`.`paperid` = `t3`.`paperid`\nAND `t4`.`authorid` = `t1`.`authorid`\nAND (`t1`.`authorname` =~ '(?i)(?s)Ranjit Jhala' AND `t5`.`keyphrasename` = 'Liquid Haskell')\nRETURN DISTINCT `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of Ranjit Jhala 's Liquid Haskell paper ?",
    "evidence": "",
    "idx": 978
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`rating` > 4.5\nRETURN `business`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the businesses with more than 4.5 stars",
    "evidence": "",
    "idx": 979
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`rating` = 3.5\nRETURN `business`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all businesses with rating 3.5",
    "evidence": "",
    "idx": 980
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`user`:`user`)\nWHERE `user`.`name` = 'Michelle'\nRETURN `user`.`user_id` AS `user_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all user ids with name Michelle",
    "evidence": "",
    "idx": 981
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`name` = 'Whataburger'\nRETURN `business`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all states in which there is a Whataburger",
    "evidence": "",
    "idx": 982
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`name` = 'MGM Grand Buffet' AND `t2`.`category_name` = 'category_category_name0')\nRETURN `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all cities in which there is a restaurant called \" MGM Grand Buffet \"",
    "evidence": "",
    "idx": 983
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`rating` < 1.5\nRETURN `business`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the cities of businesses rated below 1.5",
    "evidence": "",
    "idx": 984
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`name` = 'Taj Mahal'\nRETURN `business`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all cities which has a \" Taj Mahal \" .",
    "evidence": "",
    "idx": 985
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`rating` > 3.5 AND `t2`.`category_name` = 'restaurant')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the restaurant rated more than 3.5",
    "evidence": "",
    "idx": 987
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`category`)-[category_of_0:category_of]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND (`t1`.`name` = 'Taj Mahal' AND `t2`.`category_name` = 'restaurant')\nRETURN `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find all cities which has a \" Taj Mahal \" restaurant",
    "evidence": "",
    "idx": 988
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t2`:`user`)-[t1:reviewed]->()\nWHERE `t2`.`user_id` = `t1`.`user_id`\nAND (`t2`.`name` = 'Niloofar')\nRETURN `t1`.`text` AS `text`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list all the reviews by Niloofar",
    "evidence": "",
    "idx": 989
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`user`)-[t2:reviewed]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`user_id` = `t2`.`user_id`\nAND (`t3`.`name` = 'Niloofar')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list all the businesses which have a review by Niloofar",
    "evidence": "",
    "idx": 990
  },
  {
    "filename": "train_others.json",
    "db_id": "yelp",
    "gql_statement": "MATCH (`t3`:`user`)-[t2:reviewed]->(`t1`:`business`)\nWHERE `t2`.`business_id` = `t1`.`business_id`\nAND `t3`.`user_id` = `t2`.`user_id`\nAND (`t2`.`rating` = 5 AND `t3`.`name` = 'Niloofar')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list all the businesses which Niloofar rated 5",
    "evidence": "",
    "idx": 991
  }
]