[
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[involves_team_0:involves_team]->(`t1`:`team`)\nWHERE `t1`.`team_id` = `t2`.`team_1`\nAND (`t2`.`win_margin` = 38 AND `t2`.`match_date` = localdatetime('2009-04-30T00:00:00'))\nRETURN `t1`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the teams that played in a match with the point of winning margin of 38 on April 30, 2009?",
    "evidence": "point of winning margin of 38 refers to win_margin = 38; on April 30, 2009 refers to match_date = '2009-04-30'; team refers to Team_Name;",
    "idx": 1378
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`team`)-[t2:had_player]->()\nMATCH ()-[t2:has_player]->(`t3`:`player`)\nWHERE `t1`.`team_id` = `t2`.`team_id`\nAND `t2`.`player_id` = `t3`.`player_id`\nAND (`t2`.`match_id` = 335989 AND `t3`.`player_name` = 'T Kohli')\nRETURN `t1`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the team of T Kohli in the match ID 335989.",
    "evidence": "team of T Kohli refers to player_name = 'T Kohli';",
    "idx": 1379
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t3`:`country`)\nMATCH (`t1`:`venue`)-[located_in_0:located_in]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND `t2`.`country_id` = `t3`.`country_id`\nAND (`t3`.`country_name` = 'South Africa' AND `t2`.`city_name` = 'Centurion')\nRETURN COUNT(`t1`.`venue_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many venues are located at Centurion, South Africa?",
    "evidence": "venues are located at Centurion refers to city_name = 'Centurion'; South Africa refers to country_name = 'South Africa'",
    "idx": 1380
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND (`t1`.`team_name` = 'Royal Challengers Bangalore' AND toString(`t2`.`match_date`) =~ '(?i)(?s)2012.*')\nORDER BY `t2`.`win_margin` IS NULL ASC, `t2`.`win_margin` DESC \nRETURN `t2`.`match_id` AS `match_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the matches played by Royal Challengers Bangalore, what is the match ID of the match with the highest winning margin?",
    "evidence": "Royal Challengers Bangalore refers to team_name = 'Royal Challengers Bangalore'; highest winning margin refers to MAX(win_margin)",
    "idx": 1381
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH ()-[t1:has_player]->(`t2`:`player`)\nMATCH ()-[t1:played_as]->(`t3`:`rolee`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t1`.`role_id` = `t3`.`role_id`\nAND (`t2`.`player_name` = 'K Goel' AND `t3`.`role_id` = 3)\nRETURN COUNT(`t1`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times did K Goel played as a player only?",
    "evidence": "K Goel refers to Player_Name = 'K Goel'; played as a player only refers to Role_Id = 3",
    "idx": 1382
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[held_at_0:held_at]->(`t2`:`venue`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND (`t2`.`venue_name` = 'Newlands')\nRETURN avg(`t1`.`win_margin`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average winning margin of the matches held in Newlands?",
    "evidence": "average winning margin refers to avg(win_margin); held in Newlands refers to venue_name = 'Newlands'",
    "idx": 1383
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "CALL(*) {\nMATCH (`match_sub0`:`match`)\nWHERE `match_sub0`.`match_id` = 336039\nRETURN CASE  WHEN `match_sub0`.`team_1` = `match_sub0`.`match_winner` THEN `match_sub0`.`team_2` ELSE `match_sub0`.`team_1` END AS `_col_0`  \n}\nMATCH (`team`:`team`)\nWHERE `team`.`team_id` = `_col_0`\nRETURN `team`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the losing team's name in the match ID 336039.",
    "evidence": "losing team's name refers to Team_Id NOT in \"match_winner\" column",
    "idx": 1384
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[held_at_0:held_at]->(`t1`:`venue`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND (`t2`.`match_id` = 829768)\nRETURN `t1`.`venue_name` AS `venue_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the venue for the match ID 829768?",
    "evidence": "\nvenue refers to Venue_Name",
    "idx": 1385
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[involves_team_0:involves_team]->(`t1`:`team`)\nWHERE `t1`.`team_id` = `t2`.`team_2`\nORDER BY `t2`.`win_margin` IS NULL DESC, `t2`.`win_margin`  \nRETURN `t1`.`team_name` AS `team_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the second team's name in the match with the lowest winning margin?",
    "evidence": "lowest winning margin refers to MIN(win_margin); team name refers to team_name; second team refers to team_2",
    "idx": 1386
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND (toString(`t2`.`match_date`) =~ '(?i)(?s)2013.*')\nRETURN CASE WHEN COUNT(`t2`.`match_winner`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`match_winner` = 7 THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`match_winner`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the matches in 2013, what is the percentage of winning of the team \"Mumbai Indians\"?",
    "evidence": "in 2013 refers to Match_Date like '2013%'; winning of the team \"Mumbai Indians\" refers to Match_Winner = 7; percentage refers to DIVIDE(COUNT(Match_Winner = 7), COUNT(Match_Winner))",
    "idx": 1387
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH ()-[t1:has_player]->(`t2`:`player`)\nMATCH ()-[t1:played_as]->(`t3`:`rolee`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t1`.`role_id` = `t3`.`role_id`\nAND (`t2`.`player_name` = 'SC Ganguly')\nRETURN sum(CASE  WHEN `t3`.`role_id` = 1 THEN 1 ELSE 0 END) - sum(CASE  WHEN `t3`.`role_id` > 1 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference between the number of matches where SC Ganguly played as a Captain and those matches where he played other roles?",
    "evidence": "SC Ganguly refers to Player_Name = 'SC Ganguly'; played as a Captain refers to Role_Id = 1; played other roles refers to Role_Id > 1; difference refers to SUBTRACT(COUNT(Role_Id = 1), COUNT(Role_Id > 1))",
    "idx": 1388
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`bowling_skill` > 2\nRETURN COUNT(`player`.`player_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players have the bowling skill greater than 2?",
    "evidence": "bowling skill greater than 2 refers to Bowling_skill > 2",
    "idx": 1389
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE toString(`player`.`dob`) =~ '(?i)(?s)1970.*'\nRETURN COUNT(`player`.`player_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players were born in 1970?",
    "evidence": "born in 1970 refers to DOB like '1970%';",
    "idx": 1390
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE toString(`player`.`dob`) =~ '(?i)(?s)198.*' AND `player`.`bowling_skill` = 2\nRETURN COUNT(`player`.`player_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players were born in the 80s and have bowling skill of 2?",
    "evidence": "born in the 80s refers to DOB like '198%'; have bowling skill of 2 refers to Bowling_skill = 2;",
    "idx": 1391
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE toString(`match`.`match_date`) =~ '(?i)(?s)2008-04.*'\nRETURN COUNT(`match`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches are there in April, 2008?",
    "evidence": "in April, 2008 refers to Match_date like '2008-04%'",
    "idx": 1392
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`country_id` = 3\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the city name of country ID 3?",
    "evidence": "",
    "idx": 1393
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE toString(`match`.`match_date`) =~ '(?i)(?s)2008.*' AND NOT `match`.`match_winner` IS NULL\nRETURN COUNT(`match`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many victory matches were there in 2008?",
    "evidence": "in 2008 refers to Match_Date like '2008%'",
    "idx": 1394
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'East London'\nRETURN `city`.`country_id` AS `country_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the country ID of East London.",
    "evidence": "East London refers to City_Name = 'East London'",
    "idx": 1395
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`player_name` = 'SC Ganguly'\nRETURN 2008 - toFloat(CASE WHEN `player`.`dob` is not NULL THEN apoc.temporal.format(`player`.`dob`,'yyyy') ELSE NULL END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How old is SC Ganguly in 2008?",
    "evidence": "SC Ganguly refers to Player_Name = 'SC Ganguly'; old refers to SUBTRACT(2008, strftime('%Y',DOB))",
    "idx": 1396
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_batting_style_0:has_batting_style]->(`t2`:`batting_style`)\nWHERE `t1`.`batting_hand` = `t2`.`batting_id`\nAND (`t2`.`batting_hand` = 'Left-hand bat')\nRETURN `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of players who play by the left hand.",
    "evidence": "play by the left hand refers to Batting_hand =   'Left-hand bat'",
    "idx": 1397
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nAND (`t2`.`country_name` = 'India')\nRETURN COUNT(`t1`.`player_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players are Indians?",
    "evidence": "are Indians refers to Country_Name = 'India'",
    "idx": 1398
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nAND (`t2`.`country_name` = 'England')\nRETURN `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of England players.",
    "evidence": "England players refers to Country_Name = 'England'",
    "idx": 1399
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`venue`)-[located_in_0:located_in]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t2`.`city_name` = 'Bangalore')\nRETURN `t1`.`venue_name` AS `venue_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the venue name of Bandladore?",
    "evidence": "Bandladore refers to City_Name = 'Bangalore'",
    "idx": 1400
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t3`:`batsman_scored`)\nMATCH (`t1`:`player`)-[t2:played_in]->()\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`match_id` = `t3`.`match_id`\nAND (`t3`.`runs_scored` < 3)\nWITH `t1`.`player_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of players that have run scored less than 3?",
    "evidence": "scored less than 3 refers to Runs_Scored < 3; name of player refers to Player_name;",
    "idx": 1401
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->()\nMATCH ()-[t2:played_as]->(`t3`:`rolee`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`role_id` = `t3`.`role_id`\nAND (`t1`.`player_name` = 'SC Ganguly')\nWITH `t3`.`role_desc` AS _groupby_col_0\nRETURN _groupby_col_0 AS `role_desc`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the role of SC Ganguly?",
    "evidence": "SC Ganguly refers to Player_Name = 'SC Ganguly'; role refers to Role_Desc",
    "idx": 1402
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->()\nMATCH ()-[t2:played_as]->(`t3`:`rolee`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`role_id` = `t3`.`role_id`\nAND (`t3`.`role_desc` = 'Keeper')\nWITH `t1`.`player_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of players who played as a keeper.",
    "evidence": "played as a keeper refers to Role_Desc = 'Keeper'; name of player refers to Player_Name;",
    "idx": 1403
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->()\nMATCH ()-[t2:played_for]->(`t3`:`team`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`team_id` = `t3`.`team_id`\nAND (`t3`.`team_id` = 1)\nWITH `t1`.`player_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `player_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of players in team 1?",
    "evidence": "in team 1 refers to Team_Id = 1; name of player refers to Player_Name;",
    "idx": 1404
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH ()-[t1:played_in]->(`t2`:`match`)\nMATCH ()-[t1:played_as]->(`t3`:`rolee`)\nWHERE `t1`.`match_id` = `t2`.`match_id`\nAND `t1`.`role_id` = `t3`.`role_id`\nAND (`t3`.`role_desc` = 'Captain' AND toString(`t2`.`match_date`) =~ '(?i)(?s)2008.*')\nRETURN COUNT(`t1`.`player_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players played as a captain in season year 2008?",
    "evidence": "played as a captain refers to Role_Desc = 'Captain'; in season year 2008 refers Match_Date like '2008%'",
    "idx": 1405
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_via_0:won_via]->(`t2`:`win_by`)\nWHERE `t1`.`win_type` = `t2`.`win_id`\nAND (`t1`.`match_id` = 336000)\nRETURN `t2`.`win_type` AS `win_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What type did match ID 336000 win?",
    "evidence": "type of match won refers to Win_Type",
    "idx": 1406
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nAND (`t1`.`player_name` = 'SB Joshi')\nRETURN `t2`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where did SB Joshi come from?",
    "evidence": "SB Joshi refers to Player_Name = 'SB Joshi'; where the player come from refers to Country_Name",
    "idx": 1407
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_bowling_style_0:has_bowling_style]->(`t2`:`bowling_style`)\nWHERE `t1`.`bowling_skill` = `t2`.`bowling_id`\nAND (`t2`.`bowling_skill` = 'Left-arm fast')\nRETURN COUNT(`t1`.`player_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players have left arm fast in bowling skill?",
    "evidence": "have left arm fast in bowling skill refers to Bowling_skill = 'Left-arm fast';",
    "idx": 1408
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`outcome`)\nMATCH (`t1`:`match`)\nWHERE `t1`.`outcome_type` = `t2`.`outcome_id`\nAND (`t1`.`match_id` = '392195')\nRETURN `t2`.`outcome_type` AS `outcome_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the outcome type of match ID 392195?",
    "evidence": "",
    "idx": 1409
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t3`:`city`)\nMATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nAND `t2`.`country_id` = `t3`.`country_id`\nORDER BY `t1`.`dob` IS NULL DESC, `t1`.`dob`  \nRETURN `t3`.`city_name` AS `city_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the youngest player and which city did he/she come from?",
    "evidence": "youngest player refers to MIN(DOB); city refers to City_Name",
    "idx": 1410
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)-[t3:had_player]->()\nMATCH (`t2`:`match`)-[in_season_0:in_season]->(`t4`:`season`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND `t1`.`team_id` = `t3`.`team_id`\nAND `t2`.`season_id` = `t4`.`season_id`\nAND (`t1`.`team_name` = 'Kings XI Punjab' AND `t4`.`season_year` = 2008)\nRETURN COUNT(DISTINCT `t2`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches did team Kings XI Punjab win in season year 2008?",
    "evidence": "in season year 2008 refers to Season_Year = 2008; team Kings XI Punjab refers to Team_Name = 'Kings XI Punjab'",
    "idx": 1411
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`match`)-[won_by_1:won_by]->(`t1_sub0`:`team`)-[t3_sub0:had_player]->()\nMATCH (`t2_sub0`:`match`)-[in_season_1:in_season]->(`t4_sub0`:`season`)\nWHERE `t1_sub0`.`team_id` = `t2_sub0`.`match_winner`\nAND `t1_sub0`.`team_id` = `t3_sub0`.`team_id`\nAND `t2_sub0`.`season_id` = `t4_sub0`.`season_id`\nAND (`t1_sub0`.`team_name` = 'Pune Warriors')\nWITH `t4_sub0`.`season_year` AS _groupby_col_0\nRETURN _groupby_col_0 AS `season_year`  \n}\nWITH *\nRETURN COUNT(`season_year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many seasons did Pune Warriors participate in?",
    "evidence": "Pune Warriors refers to Team_Name = 'Pune Warriors'",
    "idx": 1412
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->()\nMATCH ()-[t2:played_as]->(`t3`:`rolee`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`role_id` = `t3`.`role_id`\nAND (`t1`.`player_name` = 'R Dravid')\nWITH `t1`.`dob` AS _groupby_col_0, `t3`.`role_desc` AS _groupby_col_1\nRETURN _groupby_col_0 AS `dob`, _groupby_col_1 AS `role_desc`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What year was R Dravid born and the role he played?",
    "evidence": "R Dravid refers to Player_Name = 'R Dravid'; year born refers to DOB; role refers to Role_Desc",
    "idx": 1413
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[awarded_man_of_the_match_0:awarded_man_of_the_match]->(`t1`:`player`)\nMATCH ()-[t3:has_player]->(`t1`:`player`)\nWHERE `t1`.`player_id` = `t2`.`man_of_the_match`\nAND `t3`.`player_id` = `t1`.`player_id`\nAND (`t1`.`player_name` = 'SC Ganguly')\nRETURN COUNT(`t2`.`man_of_the_match`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times did SC Ganguly be the man of the match?",
    "evidence": "SC Ganguly refers to Player_Name = 'SC Ganguly'",
    "idx": 1414
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`match`)-[won_by_1:won_by]->(`t1_sub0`:`team`)-[t3_sub0:had_player]->()\nWHERE `t1_sub0`.`team_id` = `t2_sub0`.`match_winner`\nAND `t1_sub0`.`team_id` = `t3_sub0`.`team_id`\nAND (`t1_sub0`.`team_name` = 'Mumbai Indians' AND toString(`t2_sub0`.`match_date`) =~ '(?i)(?s)2008.*')\nWITH `t2_sub0`.`match_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `match_id`  \n}\nWITH *\nRETURN COUNT(`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches did team Mumbai Indians win in 2008?",
    "evidence": "team Mumbai Indians refers to Team_Name = 'Mumbai Indians'; in 2008 refers to Match_Date like '2008%'",
    "idx": 1415
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)-[t3:had_player]->()\nMATCH (`t2`:`match`)-[won_via_0:won_via]->(`t4`:`win_by`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND `t1`.`team_id` = `t3`.`team_id`\nAND `t2`.`win_type` = `t4`.`win_id`\nAND (`t2`.`match_id` = '335993')\nWITH `t1`.`team_name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team won by wickets in match ID 335993?",
    "evidence": "team refers to Team_Name",
    "idx": 1416
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_via_0:won_via]->(`t2`:`win_by`)\nWHERE `t1`.`win_type` = `t2`.`win_id`\nAND (`t2`.`win_type` = 'wickets')\nRETURN COUNT(`t1`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the matches that were won by wickets in all season.",
    "evidence": "won by wickets refers to Win_type = 'wickets';",
    "idx": 1417
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:played_in]->(`t3`:`match`)-[in_season_0:in_season]->(`t5`:`season`)\nMATCH ()-[t2:played_as]->(`t4`:`rolee`)\nWHERE `t1`.`player_id` = `t2`.`player_id`\nAND `t2`.`match_id` = `t3`.`match_id`\nAND `t2`.`role_id` = `t4`.`role_id`\nAND `t3`.`season_id` = `t5`.`season_id`\nAND (`t1`.`player_name` = 'W Jaffer' AND `t5`.`season_year` = 2012)\nRETURN `t4`.`role_desc` AS `role_desc`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the role of W Jaffer in season year 2012?",
    "evidence": "W Jaffer refers to Player_name = 'W Jaffer'; in season year 2012 refers to Season_Year = 2012; role refers to Role_Desc",
    "idx": 1418
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nAND (CASE WHEN `t1`.`dob` is not NULL THEN apoc.temporal.format(`t1`.`dob`,'yyyy') ELSE NULL END >= '1975' AND CASE WHEN `t1`.`dob` is not NULL THEN apoc.temporal.format(`t1`.`dob`,'yyyy') ELSE NULL END <= '1985')\nRETURN CASE WHEN COUNT(`t1`.`player_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`country_name` = 'India' THEN 1 ELSE 0 END)) / COUNT(`t1`.`player_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average of Indian players that were born between 1975 and 1985 among all players?",
    "evidence": "Indian players refers to Country_Name = 'India'; born between 1975 and 1985 refers to strftime('%Y',T1.DOB) between '1975' and '1985'; average refers to DIVIDE(COUNT(Country_Name = 'India'), COUNT(Player_Id))",
    "idx": 1419
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[has_batting_style_0:has_batting_style]->(`t2`:`batting_style`)\nWHERE `t1`.`batting_hand` = `t2`.`batting_id`\nRETURN CASE WHEN COUNT(`t1`.`player_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`batting_hand` = 'Left-hand bat' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`player_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of left hand batting style players among all players.",
    "evidence": "left hand batting style players refers to Batting_hand = 'Left-hand bat'; percentage refers to DIVIDE(COUNT(Batting_hand = 'Left-hand bat'), COUNT(Player_Id)) * 100.0",
    "idx": 1420
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`match`)-[won_via_0:won_via]->(`t2`:`win_by`)\nWHERE `t1`.`win_type` = `t2`.`win_id`\nRETURN CASE WHEN COUNT(`t1`.`win_type`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`win_type` = 1 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`win_type`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of matches that are won by runs?",
    "evidence": "won by runs refers to win_type = 1; percentage refers to DIVIDE(COUNT(win_type = 1), COUNT(Win_Type)) * 100",
    "idx": 1421
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`match`:`match`)\nWHERE `match`.`win_margin` = 7\nRETURN COUNT(`match`.`match_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many matches have 7 points of winning margin?",
    "evidence": "have 7 points of winning margin refers to win_margin = 7;",
    "idx": 1422
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE CASE WHEN `player`.`dob` is not NULL THEN apoc.temporal.format(`player`.`dob`,'yyyy') ELSE NULL END >= '1970' AND CASE WHEN `player`.`dob` is not NULL THEN apoc.temporal.format(`player`.`dob`,'yyyy') ELSE NULL END <= '1975'\nRETURN COUNT(`player`.`player_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of players born between 1970 to 1975?",
    "evidence": "born between 1970 to 1975 refers to strftime('%Y',DOB) between '1970' and '1975'",
    "idx": 1423
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND (`t2`.`win_margin` = 6 AND `t2`.`match_date` = localdatetime('2009-04-26T00:00:00'))\nRETURN `t1`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the winning team in a match held on April 26, 2009 with a winning margin of 6 points?",
    "evidence": "winning margin of 6 points refers to Win_Margin = 6; held on April 26, 2009 refers to Match_Date = '2009-04-26'",
    "idx": 1424
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)\nMATCH (`t2`:`match`)-[won_via_0:won_via]->(`t3`:`win_by`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND `t2`.`win_type` = `t3`.`win_id`\nAND (`t2`.`match_id` = 419135)\nRETURN `t1`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the match ID 419135, who won by runs?",
    "evidence": "who refers to Team_Name",
    "idx": 1425
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[held_at_0:held_at]->(`t1`:`venue`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND (`t1`.`venue_name` = 'St George\\'s Park')\nORDER BY `t2`.`win_margin` IS NULL ASC, `t2`.`win_margin` DESC \nRETURN `t2`.`match_id` AS `match_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the matches held in St. George's Park, give the match ID of the match with the highest winning margin points.",
    "evidence": "held in St. George's Park refers to Venue_Name = 'St George''s Park'; highest winning margin points refers to MAX(Win_Margin)",
    "idx": 1426
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t1`:`player`)-[from_country_0:from_country]->(`t2`:`country`)\nWHERE `t1`.`country_name` = `t2`.`country_id`\nAND (`t2`.`country_name` = 'Sri Lanka')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the players are from Sri Lanka?",
    "evidence": "from Sri Lanka refers to Country_Name = 'Sri Lanka';",
    "idx": 1427
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[held_at_0:held_at]->(`t1`:`venue`)\nMATCH (`t2`:`match`)-[won_by_0:won_by]->(`t3`:`team`)\nWHERE `t1`.`venue_id` = `t2`.`venue_id`\nAND `t2`.`match_winner` = `t3`.`team_id`\nAND (`t2`.`match_id` = 392194)\nRETURN `t1`.`venue_name` AS `venue_name`, `t3`.`team_name` AS `team_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the match's venue and winning team for the match ID 392194.",
    "evidence": "venue refers to Venue_Name; winning team refers to match_winner",
    "idx": 1429
  },
  {
    "filename": "train.json",
    "db_id": "soccer_2016",
    "gql_statement": "MATCH (`t2`:`match`)-[won_by_0:won_by]->(`t1`:`team`)\nMATCH (`t2`:`match`)-[won_via_0:won_via]->(`t3`:`win_by`)\nWHERE `t1`.`team_id` = `t2`.`match_winner`\nAND `t2`.`win_type` = `t3`.`win_id`\nAND (`t1`.`team_name` = 'Delhi Daredevils')\nRETURN CASE WHEN COUNT(`t3`.`win_type`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t3`.`win_type` = 'wickets' THEN 1 ELSE 0 END)) * 100 / COUNT(`t3`.`win_type`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the matches of Delhi Daredevils in 2009, what is the percentage of their matches won by wickets?",
    "evidence": "Delhi Daredevils refers to team_name = 'Delhi Daredevils'; in 2009 refers to Match_Date = '2009%'; won by wickets refers to Win_Type = 'wickets'; percentage refers to DIVIDE(COUNT(Win_Type = 'wickets'), COUNT(Win_Type))",
    "idx": 1430
  },
  {
    "filename": "train.json",
    "db_id": "music_tracker",
    "gql_statement": "MATCH (`t1`:`torrents`)\nMATCH (`t2`:`tags`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`tag` =~ '(?i)(?s)alternative' AND `t1`.`releasetype` = 'ep')\nRETURN `t1`.`groupname` AS `groupname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all the release titles of the \"ep's\" under the alternative tag.",
    "evidence": "release titles of the \"ep's\" refer to groupName where releaseType = 'ep';",
    "idx": 1436
  }
]