[
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`observations`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`race` = 'white' AND `t1`.`description` = 'Body Height')\nRETURN avg(`t1`.`value`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the white patients, what is the average body height of the patients?",
    "evidence": "white refers to race = 'white'; average body height = AVG(observations.VALUE WHERE observations.DESCRIPTION = 'Body Height'); body height refers to observations.DESCRIPTION = 'Body Height';",
    "idx": 1003
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`address` = '179 Sydni Roads Taunton MA 02780 US')\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the care plan needed for the patient living at 179 Sydni Roads, Taunton, MA 02780 US.",
    "evidence": "living at 179 Sydni Roads, Taunton, MA 02780 US refers to address = '179 Sydni Roads Taunton MA 02780 US';",
    "idx": 1004
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`allergies`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`first` = 'Dirk' AND `t2`.`last` = 'Langosh' AND `t2`.`ethnicity` = 'dominican')\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the allergen of the Dominican patient named Dirk Languish.",
    "evidence": "allergen refers to allergies.DESCRIPTION;",
    "idx": 1005
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[patient_0:patient]->(`t2`:`patients`)\nMATCH (`t3`:`allergies`)-[patient_1:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND `t2`.`patient` = `t3`.`patient`\nAND (`t1`.`description` = 'Asthma' AND `t3`.`description` = 'Allergy to peanuts')\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients who are allergic to peanuts have asthma?",
    "evidence": "allergic to peanuts refers to allergies.DESCRIPTION = 'Allergy to peanuts'; asthma refers to conditions.DESCRIPTION = 'Asthma';",
    "idx": 1006
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`observations`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Systolic Blood Pressure')\nORDER BY `t1`.`value` IS NULL ASC, `t1`.`value` DESC \nRETURN `t2`.`ssn` AS `ssn`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the social security number of the patient with the highest systolic blood pressure.",
    "evidence": "social security number refers to ssn; highest systolic blood pressure refers to MAX(observations.VALUE WHERE observations.DESCRIPTION = 'Systolic Blood Pressure');",
    "idx": 1007
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`ssn` = '999-15-3685')\nRETURN DISTINCT `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the care plan for the patient with social security number 999-15-3685?",
    "evidence": "social security number refers to ssn; ssn = '999-15-3685';",
    "idx": 1008
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`medications`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`reasondescription` = 'Streptococcal sore throat (disorder)')\nRETURN DISTINCT `t2`.`first` AS `first`, `t2`.`last` AS `last`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List 5 patients' name that need medication due to streptococcal sore throat disorder.",
    "evidence": "patients name = first, last; streptococcal sore throat disorder refers to medications.REASONDESCRIPTION = 'Streptococcal sore throat (disorder)';",
    "idx": 1009
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`observations`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Body Weight' AND `t1`.`units` = 'kg' AND `t1`.`value` = 61.97)\nRETURN `t2`.`first` AS `first`, `t2`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the patient with a body weight of 61.97 kg?",
    "evidence": "body weight of 61.97 kg refers to observations.DESCRIPTION = 'Body Weight' AND observations.VALUE = 61.97; observations.UNITS = 'kg'",
    "idx": 1010
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`medications`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Penicillin V Potassium 250 MG' AND `t2`.`gender` = 'M')\nRETURN DISTINCT `t2`.`birthdate` AS `birthdate`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the male patients, list down 5 birth dates of patients taking the medication \"Penicillin V Potassium 250 MG\".",
    "evidence": "male patients refers to gender = 'M'; Penicillin V Potassium 250 MG refers to medications.DESCRIPTION = 'Penicillin V Potassium 250 MG';",
    "idx": 1011
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Diabetes')\nRETURN sum(CASE  WHEN `t2`.`marital` = 'M' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t2`.`marital` = 'S' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference between the number of married patients and the number of single patients with diabetes?",
    "evidence": "difference = SUBTRACT(patients.patient WHERE marital = 'M'), COUNT(patients.patient WHERE marital = 'S') WHERE conditions.DESCRIPTION = 'Diabetes'); married patients refers to marital = 'M'; single patients refers to marital = 'S'; diabetes refers to conditions.DESCRIPTION = 'Diabetes';",
    "idx": 1012
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`customers`:`customers`)\nWITH `customers`.`country` AS _groupby_col_0, COUNT(`customers`.`customernumber`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the country and how many customers are there.",
    "evidence": "",
    "idx": 1013
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`payments`)-[is_made_by_0:is_made_by]->(`t2`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t3`:`employees`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND `t2`.`salesrepemployeenumber` = `t3`.`employeenumber`\nAND (CASE WHEN `t1`.`paymentdate` is not NULL THEN apoc.temporal.format(`t1`.`paymentdate`,'yyyy') ELSE NULL END = '2004')\nORDER BY `t1`.`amount` IS NULL ASC, `t1`.`amount` DESC \nRETURN DISTINCT `t3`.`lastname` AS `lastname`, `t3`.`firstname` AS `firstname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the sales agent of the distinct customer who paid the highest amount in the year 2004?",
    "evidence": "",
    "idx": 1014
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t3`:`orderdetails`)\nMATCH (`t2`:`orders`)-[is_placed_by_0:is_placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND `t2`.`ordernumber` = `t3`.`ordernumber`\nAND (`t1`.`customername` = 'Rovelli Gifts' AND `t2`.`status` = 'Shipped' AND CASE WHEN `t2`.`shippeddate` is not NULL THEN apoc.temporal.format(`t2`.`shippeddate`,'yyyy') ELSE NULL END = '2003')\nRETURN `t3`.`priceeach` * `t3`.`quantityordered` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the total price of the products shipped to Rovelli Gifts Distributors Ltd. between 1/1/2003 and 12/31/2003?",
    "evidence": "Mini Gifts Distributors Ltd. Is the customer name; shippedDate between '2003-01-01' and '2003-12-31'; total price = MULTIPLY(quantityOrdered, priceEach);",
    "idx": 1015
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`offices`)\nWHERE `t1`.`officecode` = `t2`.`officecode`\nAND (`t1`.`reportsto` = 1143 AND `t2`.`city` = 'NYC')\nRETURN `t1`.`employeenumber` AS `employeenumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which sales representatives in New York city whose leader is Anthony Bow with the employee number is 1143? Indicate their employee numbers.",
    "evidence": "reportsTO' is the leader of the 'employeeNumber';",
    "idx": 1017
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`payments`)-[is_made_by_0:is_made_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nORDER BY `t1`.`amount` IS NULL ASC, `t1`.`amount` DESC \nRETURN DISTINCT `t2`.`country` AS `country`, `t2`.`addressline1` AS `addressline1`, `t2`.`addressline2` AS `addressline2`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which countries do the top 5 highest paying customers in a single payment come from? Indicate their entire address.",
    "evidence": "highest paying customer refers to MAX(amount); entire address = addressLine1+addressLine2;",
    "idx": 1019
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`payments`)-[is_made_by_0:is_made_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t2`.`customername` = 'Euro+ Shopping Channel' AND CASE WHEN `t1`.`paymentdate` is not NULL THEN apoc.temporal.format(`t1`.`paymentdate`,'yyyy') ELSE NULL END = '2004')\nRETURN COUNT(`t1`.`checknumber`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many checks were issued by Euro+ Shopping Channel in the year 2004?",
    "evidence": "Euro+ Shopping Channel is a customer name; year(paymentDate) = '2004';",
    "idx": 1020
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orderdetails`)\nMATCH (`t2`:`orders`)\nWHERE `t1`.`ordernumber` = `t2`.`ordernumber`\nAND (`t1`.`quantityordered` < 30 AND CASE WHEN `t2`.`orderdate` is not NULL THEN apoc.temporal.format(`t2`.`orderdate`,'yyyy') ELSE NULL END = '2003')\nRETURN COUNT(DISTINCT `t1`.`ordernumber`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many distinct orders were there in 2003 when the quantity ordered was less than 30?",
    "evidence": "year(orderDate) = '2003'; quantityOrdered < 30;",
    "idx": 1022
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orderdetails`)\nMATCH (`t2`:`products`)\nWHERE `t1`.`productcode` = `t2`.`productcode`\nAND (`t2`.`productline` = 'Motorcycles')\nRETURN sum(`t1`.`quantityordered` * `t1`.`priceeach`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the total value of Motorcycles orders.",
    "evidence": "Motorcycle is a product line; total value = SUM(MULTIPLY(quantityOrdered, priceEach));",
    "idx": 1024
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`payments`)-[is_made_by_0:is_made_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t1`.`amount` > 50000)\nRETURN DISTINCT `t2`.`customername` AS `customername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list different customer names with the payment amount of over 50,000.",
    "evidence": "amount > 50000;",
    "idx": 1028
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`payments`)-[is_made_by_0:is_made_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t2`.`country` = 'USA')\nRETURN sum(`t1`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the total payment amount of customers who come from the USA.",
    "evidence": "USA is a country; total amount payment refers to SUM(amount);",
    "idx": 1029
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "WITH *, COLLECT { MATCH (`customers_sub0`:`customers`)\nWHERE `customers_sub0`.`creditlimit` = 0\nRETURN `customers_sub0`.`customernumber` AS `customernumber`   } AS in_collect_0\nMATCH (`payments`:`payments`)\nWHERE CASE WHEN `payments`.`paymentdate` is not NULL THEN apoc.temporal.format(`payments`.`paymentdate`,'yyyy') ELSE NULL END = '2003' AND `payments`.`customernumber` IN in_collect_0\nRETURN sum(`payments`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the total payments of customers with no credit limit in 2003?",
    "evidence": "total payment refers to SUM(amount); no credit limit refers to creditLimit = 0; year(paymentDate) = '2003';",
    "idx": 1030
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[is_placed_by_0:is_placed_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t1`.`status` = 'Cancelled')\nRETURN `t2`.`customername` AS `customername`, `t2`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the name and phone number of the customer whose order was cancelled.",
    "evidence": "cancelled order refers to status = 'Cancelled';",
    "idx": 1031
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[is_placed_by_0:is_placed_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t1`.`status` = 'Shipped' AND `t2`.`country` = 'France')\nWITH `t2`.`customernumber` AS _groupby_col_0, COUNT(`t1`.`status`) AS _groupby_col_1, COUNT(`t2`.`country`) AS _groupby_col_2\nWHERE _groupby_col_1 = 2\nRETURN _groupby_col_2 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many French customers shipped 2 orders which have been cancelled?",
    "evidence": "French is a nationality of country = 'France'; cancelled orders refers to status = 'Cancelled';",
    "idx": 1032
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t3`:`orderdetails`)\nMATCH (`t2`:`orders`)-[is_placed_by_0:is_placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND `t2`.`ordernumber` = `t3`.`ordernumber`\nAND (`t2`.`status` = 'Shipped' AND `t1`.`country` = 'Germany')\nRETURN CASE WHEN COUNT(`t2`.`ordernumber`)=0 THEN NULL ELSE sum(`t3`.`quantityordered` * `t3`.`priceeach`) / COUNT(`t2`.`ordernumber`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the average total price of shipped orders from German customers.",
    "evidence": "average total price = DIVIDE(MULTIPLY(quantityOrdered, priceEach)), COUNT(orderNumber)); German is a nationality of country = 'Germany'; shipped orders refers to status = 'Shipped';",
    "idx": 1033
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`offices`)\nWHERE `t1`.`officecode` = `t2`.`officecode`\nAND (`t2`.`city` = 'Tokyo' AND `t1`.`jobtitle` = 'Sales Rep')\nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t1`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Sales Rep who are working in Tokyo? List out email and full name of those employees.",
    "evidence": "Sales Rep is a job title; Tokyo is a city; full name = firstName+lastName;",
    "idx": 1035
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`offices`)\nWHERE `t1`.`officecode` = `t2`.`officecode`\nAND (`t1`.`reportsto` = 1002 AND `t2`.`city` = 'San Francisco')\nRETURN `t1`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the email of those who are staff of Murphy Diane whose number is 1002 and living in San Francisco",
    "evidence": "staff of refers to reportsTO; San Francisco is a city;",
    "idx": 1036
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`offices`)\nWHERE `t1`.`officecode` = `t2`.`officecode`\nAND (`t2`.`state` = 'MA' AND `t2`.`country` = 'USA')\nRETURN `t1`.`email` AS `email`, `t1`.`employeenumber` AS `employeenumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Determine the email and Code of employee who are working at United State, state MA",
    "evidence": "code of employee refers to employeeNumber; United States of America refers to country = 'USA';",
    "idx": 1037
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`offices`)\nWHERE `t1`.`officecode` = `t2`.`officecode`\nAND (`t1`.`jobtitle` =~ '(?i)(?s).*Sales Manager.*' AND `t2`.`city` = 'Sydney')\nRETURN `t1`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Sales Manager who are working in Sydney? List out their email.",
    "evidence": "Sales Manager is a job title; Sydney is a city;",
    "idx": 1038
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t2`:`employees`)-[works_in_0:works_in]->(`t3`:`offices`)\nWHERE `t1`.`salesrepemployeenumber` = `t2`.`employeenumber`\nAND `t2`.`officecode` = `t3`.`officecode`\nAND (`t3`.`country` = 'Australia' AND `t1`.`creditlimit` < 200000 AND `t2`.`jobtitle` = 'Sales Rep')\nRETURN `t2`.`email` AS `email`, `t3`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees who are living in Australia and have the credit limit under 200000? State their email address and countries where they are working.",
    "evidence": "Australia is a country; creditLimit < 20000;",
    "idx": 1039
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t2`:`employees`)\nWHERE `t1`.`salesrepemployeenumber` = `t2`.`employeenumber`\nAND (`t2`.`jobtitle` = 'Sales Rep' AND `t1`.`country` = 'UK')\nORDER BY `t1`.`creditlimit` IS NULL DESC, `t1`.`creditlimit`  \nRETURN DISTINCT `t2`.`email` AS `email`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State 10 emails of UK Sales Rep who have the lowest credit limit.",
    "evidence": "UK is a country; Sales Rep is a job title;",
    "idx": 1040
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`payments`:`payments`)\nORDER BY `payments`.`amount` IS NULL ASC, `payments`.`amount` DESC \nRETURN `payments`.`customernumber` AS `customernumber`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out 3 customer numbers who have highest amount payment",
    "evidence": "amount of payment refers to amount;",
    "idx": 1042
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`productline` = 'Motorcycles'\nRETURN `products`.`productcode` AS `productcode`, `products`.`quantityinstock` AS `quantityinstock` ORDER BY `quantityinstock` IS NULL ASC, `quantityinstock` DESC \nLIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the product code of the top five motorcycles, by descending order, the number of quantity in stock.",
    "evidence": "motorcycle is a product line;",
    "idx": 1046
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "CALL (*) {\nMATCH (`payments_sub0`:`payments`)\nWHERE CASE WHEN `payments_sub0`.`paymentdate` is not NULL THEN apoc.temporal.format(`payments_sub0`.`paymentdate`,'yyyy') ELSE NULL END >= '2003' AND CASE WHEN `payments_sub0`.`paymentdate` is not NULL THEN apoc.temporal.format(`payments_sub0`.`paymentdate`,'yyyy') ELSE NULL END <= '2004'\nWITH `payments_sub0`.`customernumber` AS _groupby_col_0, COUNT(`payments_sub0`.`customernumber`) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `customernumber`  \n}\nWITH *\nRETURN COUNT(`customernumber`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 2003 to 2004, how many customers have paid more than three times?",
    "evidence": "paymentdate BETWEEN '2003-01-01' AND '2004-12-31'; customers who have paid more than three times refers to (COUNT(customernumber)>3);",
    "idx": 1048
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`payments`)-[is_made_by_0:is_made_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t1`.`paymentdate` >= localdatetime('2003-08-01T00:00:00') AND `t1`.`paymentdate` <= localdatetime('2004-08-30T00:00:00') AND `t2`.`customername` = 'Mini Gifts Distributors Ltd.')\nRETURN `t1`.`checknumber` AS `checknumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Between 8/1/2003 and 8/30/2004, how many checks were issued by Mini Gifts Distributors Ltd.? Please list their check numbers.",
    "evidence": "paymentDate BETWEEN '2003-08-01' AND '2004-08-30'; Mini Gifts Distributors Ltd. Is a customer name;",
    "idx": 1050
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t3`:`payments`)-[is_made_by_0:is_made_by]->(`t2`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t1`:`employees`)\nWHERE `t1`.`employeenumber` = `t2`.`salesrepemployeenumber`\nAND `t2`.`customernumber` = `t3`.`customernumber`\nORDER BY `t3`.`amount` IS NULL ASC, `t3`.`amount` DESC \nRETURN `t1`.`firstname` AS `firstname`, `t1`.`lastname` AS `lastname`, `t1`.`reportsto` AS `reportsto`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the sales agent of the customer who has made the highest payment? Include the full names of employee and his/her supervisor.",
    "evidence": "payment refers to amount; full name = firstName+lastName; supervisor refers to reportsTO; 'reportsTO' is the leader of the 'employeeNumber';",
    "idx": 1052
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orderdetails`)\nMATCH (`t2`:`orders`)-[is_placed_by_0:is_placed_by]->(`t3`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t4`:`employees`)-[works_in_0:works_in]->(`t5`:`offices`)\nWHERE `t1`.`ordernumber` = `t2`.`ordernumber`\nAND `t2`.`customernumber` = `t3`.`customernumber`\nAND `t3`.`salesrepemployeenumber` = `t4`.`employeenumber`\nAND `t4`.`officecode` = `t5`.`officecode`\nAND (CASE WHEN `t2`.`orderdate` is not NULL THEN apoc.temporal.format(`t2`.`orderdate`,'yyyy') ELSE NULL END = '2005' AND `t4`.`jobtitle` = 'Sales Rep')\nORDER BY `t1`.`quantityordered` IS NULL ASC, `t1`.`quantityordered` DESC \nRETURN `t3`.`addressline1` AS `addressline1`, `t3`.`addressline2` AS `addressline2`, `t3`.`phone` AS `phone`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From which branch does the sales representative employee who made the most sales in 2005? Please indicates its full address and phone number.",
    "evidence": "orderDate between '2005-01-01' and '2005-12-31'; full address = addressLine1+addressLine2;",
    "idx": 1053
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`payments`:`payments`)\nWHERE `payments`.`paymentdate` >= localdatetime('2004-01-01T00:00:00') AND `payments`.`paymentdate` <= localdatetime('2004-06-30T00:00:00')\nRETURN avg(`payments`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average amount of payments made by customers during the first half of 2004.",
    "evidence": "average amount of payments = DIVIDE(SUM(amount), COUNT(customerNumber); first half of 2014 refers to paymentDate > = '2004-01-01' AND paymentDate < '2004-07-01;",
    "idx": 1055
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t2`:`products`)-[belongs_to_0:belongs_to]->(`t1`:`productlines`)\nWHERE `t1`.`productline` = `t2`.`productline`\nAND (`t2`.`productvendor` = 'Carousel DieCast Legends' AND `t1`.`textdescription` =~ '(?i)(?s).*perfect holiday or anniversary gift for executives.*')\nRETURN sum(`t2`.`msrp` - `t2`.`buyprice`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What profit can the seller Carousel DieCast Legends make from the sale of the product described as \"The perfect holiday or anniversary gift for executives\"?",
    "evidence": "seller and product vendor are synonyms; Carousel DieCast Legends is a product vendor; profit = SUM(SUBTRACT(msrp, buyPrice));",
    "idx": 1063
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`products`)\nMATCH (`t2`:`orderdetails`)\nWHERE `t1`.`productcode` = `t2`.`productcode`\nAND (`t1`.`productname` = '18th Century Vintage Horse Carriage')\nRETURN sum(`t2`.`quantityordered`) AS `_col_0`, CASE WHEN sum(`t2`.`quantityordered`)=0 THEN NULL ELSE sum(`t2`.`quantityordered` * `t2`.`priceeach`) / sum(`t2`.`quantityordered`) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total quantity ordered for 18th Century Vintage Horse Carriage and the average price.",
    "evidence": "18th Century Vintage Horse Carriage is a product name; average price = AVG(priceEach);",
    "idx": 1064
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t`:`orderdetails`)\nWHERE `t`.`ordernumber` = '10252'\nRETURN COUNT(`t`.`productcode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many kinds of products did order No. 10252 contain?",
    "evidence": "Products refer to productCode;",
    "idx": 1065
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t2`:`employees`)-[works_in_0:works_in]->(`t1`:`offices`)\nWHERE `t1`.`officecode` = `t2`.`officecode`\nAND (`t2`.`firstname` = 'Foon Yue' AND `t2`.`lastname` = 'Tseng')\nRETURN `t1`.`addressline1` AS `addressline1`, `t1`.`addressline2` AS `addressline2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where's Foon Yue Tseng's office located at? Give the detailed address.",
    "evidence": "Detailed address comprises addressLine1 and addressLine2;",
    "idx": 1067
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orderdetails`)\nMATCH (`t2`:`orders`)\nWHERE `t1`.`ordernumber` = `t2`.`ordernumber`\nAND (CASE WHEN `t2`.`orderdate` is not NULL THEN apoc.temporal.format(`t2`.`orderdate`,'yyyy-MM-dd') ELSE NULL END = '2005-04-08' OR CASE WHEN `t2`.`orderdate` is not NULL THEN apoc.temporal.format(`t2`.`orderdate`,'yyyy-MM-dd') ELSE NULL END = '2005-04-10')\nORDER BY `t1`.`quantityordered` * `t1`.`priceeach` IS NULL ASC, `t1`.`quantityordered` * `t1`.`priceeach` DESC \nRETURN `t2`.`orderdate` AS `orderdate`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compared with the orders happened on 2005-04-08 and two days later, which day's order had a higher value?",
    "evidence": "2005-04-08 and two days later refer to orderDate = '2005-04-08' and orderDate = '2005-04-10'; order with a higher value refers to MAX(Total price) = MULTIPLY(quantityOrdered, priceEach); ",
    "idx": 1068
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`payments`)-[is_made_by_0:is_made_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t1`.`checknumber` = 'NR157385')\nRETURN `t2`.`contactfirstname` AS `contactfirstname`, `t2`.`contactlastname` AS `contactlastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the contact name for the check \"NR157385\"?",
    "evidence": "Contact name refers to customerName;",
    "idx": 1071
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[is_placed_by_0:is_placed_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t1`.`ordernumber` = '10160')\nRETURN `t2`.`contactfirstname` AS `contactfirstname`, `t2`.`contactlastname` AS `contactlastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which customer made the order No. 10160? Give the contact name.",
    "evidence": "",
    "idx": 1072
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[is_placed_by_0:is_placed_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t1`.`ordernumber` = '10383')\nRETURN `t2`.`addressline1` AS `addressline1`, `t2`.`addressline2` AS `addressline2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where was the order No. 10383 shipped to? Show me the address.",
    "evidence": "Address comprises addressLine1 and addressLine2;",
    "idx": 1073
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`products`)\nMATCH (`t2`:`orderdetails`)\nWHERE `t1`.`productcode` = `t2`.`productcode`\nAND (`t1`.`productcode` = 'S18_3482' AND `t2`.`ordernumber` = '10108')\nRETURN CASE WHEN `t1`.`msrp`=0 THEN NULL ELSE (`t1`.`msrp` - `t2`.`priceeach`) / `t1`.`msrp` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the product No. S18_3482 in the Order No.10108, how much discount did the customer have?",
    "evidence": "DIVIDE(SUBTRACT(MSRP, priceEach)), MSRP); product No. S18_3482 refers to productCode = 'S18_3482'",
    "idx": 1077
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`employees`)-[reports_to_0:reports_to]->(`t2`:`employees`)\nWHERE `t2`.`employeenumber` = `t1`.`reportsto`\nAND (`t1`.`firstname` = 'Steve' AND `t1`.`lastname` = 'Patterson')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "To whom does Steve Patterson report? Please give his or her full name.",
    "evidence": "reportsTO' is the leader of the 'employeeNumber';",
    "idx": 1078
  }
]