[
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`category`)\nMATCH (`t1`:`film_category`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nAND (`t2`.`name` = 'Documentary')\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of documentary films.",
    "evidence": "\"Documentary\" is the name of category; number of film refers to Count(film_id)",
    "idx": 7025
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`category`)\nMATCH (`t1_sub0`:`film_category`)\nWHERE `t1_sub0`.`category_id` = `t2_sub0`.`category_id`\nWITH `t2_sub0`.`name` AS _groupby_col_0, COUNT(`t1_sub0`.`film_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of the category which has the most number of films.",
    "evidence": "category refers to name; most number of films refers to Max(Count(film_id))",
    "idx": 7026
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`inventory`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t2`.`inventory_id` = 3479)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the film for inventory No.3479.",
    "evidence": "inventory no. 3479 refers to inventory_id = '3479'; name of film refers to title",
    "idx": 7027
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nRETURN CASE WHEN sum(CASE WHEN `t1`.`country` = 'Italy' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t1`.`country` = 'India' THEN 1 ELSE 0 END)) / sum(CASE WHEN `t1`.`country` = 'Italy' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times is the number of Indian cities than Italian cities?",
    "evidence": "indian refers to country = 'India'; Italian refers to country = 'Italy'; times = Divide(Count(city where country = 'India), Count(city where country = 'Italy'))",
    "idx": 7028
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film_actor`)\nMATCH (`t2`:`actor`)\nWHERE `t1`.`actor_id` = `t2`.`actor_id`\nRETURN CASE WHEN sum(CASE WHEN `t2`.`first_name` = 'PENELOPE' AND `t2`.`last_name` = 'GUINESS' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`first_name` = 'GINA' AND `t2`.`last_name` = 'DEGENERES' THEN 1 ELSE 0 END)) * 100 / sum(CASE WHEN `t2`.`first_name` = 'PENELOPE' AND `t2`.`last_name` = 'GUINESS' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times is the number of films Gina DeGeneres acted in than Penelope Guinness?",
    "evidence": "\"Gina DeGeneres\" and \"Penelope Guinness\" are both full name of actor; times number of film = Divide (Count (film_id where first_name = 'GINA' and last_name = 'DEGENERES'), Count(film_id where first_name = 'PENELOPE' and last_name = 'GUINESS'))",
    "idx": 7029
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rating` = 'R' AND `film`.`release_year` = '2006'\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2006, how many restricted films were released?",
    "evidence": "restricted refers to rating = 'R'; release refers to release_year; in 2006 refers to release_year = 2006; film refers to title",
    "idx": 7030
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film_actor`:`film_actor`)\nWHERE `film_actor`.`film_id` = 508\nRETURN COUNT(`film_actor`.`actor_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many actors starred in the film id 508?",
    "evidence": "",
    "idx": 7031
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`title` = 'SMOOCHY CONTROL'\nRETURN `film`.`special_features` AS `special_features`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the special features for the film \"Smoochy Control\"?",
    "evidence": "\"SMOOCHY CONTROL\" is the title of film",
    "idx": 7032
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`length` > 180\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of the films that are more than 180 minutes long.",
    "evidence": "more than 180 min long refers to length > 180; name of film refers to title",
    "idx": 7033
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`payment`:`payment`)\nWHERE `payment`.`rental_id` >= 1 AND `payment`.`rental_id` <= 10\nRETURN sum(`payment`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the total rental payment for the first 10 rentals?",
    "evidence": "first 10 rental refers to rental id between 1 and 10; total rental payment refers to sum(amount)",
    "idx": 7034
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`staff`:`staff`)\nWHERE `staff`.`active` = 1\nRETURN `staff`.`first_name` AS `first_name`, `staff`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the full names of all the active employees?",
    "evidence": "active employee refers to active = 1; full name refers to first_name, last_name",
    "idx": 7035
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`store`:`store`)\nWHERE `store`.`store_id` = 2\nRETURN `store`.`manager_staff_id` AS `manager_staff_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the staff manager in store id 2?",
    "evidence": "staff manager refers to manager_staff_id",
    "idx": 7036
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`rental`:`rental`)\nWHERE `rental`.`rental_date` = localdatetime('2005-05-27T00:00:00')\nRETURN COUNT(`rental`.`rental_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many rentals were returned on 5/27/2005?",
    "evidence": "return on 5/27/2005 refers to return_date = '2005-05-27'; rental refers to rental_id",
    "idx": 7037
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`inventory`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t2`.`store_id` = 2)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of the films that can only be found in store id 2.",
    "evidence": "name of film refers to title",
    "idx": 7038
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`category`)\nMATCH (`t1`:`film_category`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nAND (`t2`.`name` = 'Horror')\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films are categorized as horror?",
    "evidence": "\"Horror\" is the name of category",
    "idx": 7039
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`actor`)\nMATCH (`t1_sub0`:`film_actor`)\nWHERE `t1_sub0`.`actor_id` = `t2_sub0`.`actor_id`\nWITH `t2_sub0`.`first_name` AS _groupby_col_0, `t2_sub0`.`last_name` AS _groupby_col_1, COUNT(`t1_sub0`.`film_id`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`, _groupby_col_2 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `first_name`, `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the actor who starred in most movies?",
    "evidence": "full name refers to first_name, last_name; actor who starred in the most movies refers to actor_id where Max(Count(film_id))",
    "idx": 7040
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND (`t1`.`country` = 'United States')\nRETURN COUNT(`t2`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cities are there in the United States?",
    "evidence": "\"United States\" is the country",
    "idx": 7041
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`customer`)\nMATCH (`t1_sub0`:`rental`)\nWHERE `t1_sub0`.`customer_id` = `t2_sub0`.`customer_id`\nWITH `t2_sub0`.`first_name` AS _groupby_col_0, `t2_sub0`.`last_name` AS _groupby_col_1, COUNT(`t1_sub0`.`rental_id`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`, _groupby_col_2 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `first_name`, `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the customer who rented the highest number of movies of all time?",
    "evidence": "full name refers to first_name, last_name; customer who rented the most film refers to Max(count(rental_id))",
    "idx": 7042
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`last_name` = 'KILMER'\nRETURN `actor`.`actor_id` AS `actor_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the actors' IDs who have \"KILMER\" as last name.",
    "evidence": "",
    "idx": 7043
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`film_sub0`:`film`)\nRETURN min(`film_sub0`.`replacement_cost`) AS `_col_0`  \n}\nMATCH (`film`:`film`)\nWHERE `film`.`replacement_cost` = `_col_0`\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the films titles with the lowest replacement cost under the general audiences rating.",
    "evidence": "lowest replacement cost refers to Min(replacement_cost); under general audience rating refers to rating = G",
    "idx": 7044
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`film_sub0`:`film`)\nRETURN MAX(`film_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`film`:`film`)\nWHERE `film`.`length` = `_col_0`\nRETURN `film`.`title` AS `title`, `film`.`description` AS `description`, `film`.`special_features` AS `special_features`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the films with the longest duration, list any five title with their descriptions and special features.",
    "evidence": "longest duration of film refers to Max(length)",
    "idx": 7045
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`rental`:`rental`)\nWHERE localdatetime.truncate('day',localdatetime(`rental`.`rental_date`)) >= localdatetime('2005-05-26T00:00:00') AND localdatetime.truncate('day',localdatetime(`rental`.`rental_date`)) <= localdatetime('2005-05-30T00:00:00')\nRETURN COUNT(DISTINCT `rental`.`rental_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films rented on 26th May, 2005 were returned on 30th May, 2005?",
    "evidence": "rented on 26th May 2005 refers to rental_date = '2005-05-26'; return on 30th May, 2005 refers to return_date = '2005-05-30'; number of rented film refers to Count (rental_id)",
    "idx": 7046
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`payment`:`payment`)\nWITH `payment`.`customer_id` AS _groupby_col_0, avg(`payment`.`amount`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average payment amount per customer.",
    "evidence": "average payment refers to AVG(amount)",
    "idx": 7047
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`staff`:`staff`)\nWHERE `staff`.`store_id` = 2\nRETURN `staff`.`first_name` AS `first_name`, `staff`.`last_name` AS `last_name`, `staff`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name and email of the staff in store ID 2?",
    "evidence": "name refers to first_name, last_name",
    "idx": 7048
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nRETURN CASE WHEN COUNT(`customer`.`customer_id`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `customer`.`active` = 0 THEN 1 ELSE 0 END)) * 100 / COUNT(`customer`.`customer_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many percent of customers were inactive?",
    "evidence": "inactive refers to active = 0; percent = Divide (Count (customer_id where active = 0), Count(customer_id)) * 100",
    "idx": 7049
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film_text`:`film_text`)\nWHERE `film_text`.`film_id` = 996\nRETURN `film_text`.`description` AS `description`, `film_text`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the description and film title of ID 996?",
    "evidence": "ID 996 refers to film_id = 996",
    "idx": 7050
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t1`.`title` = 'UNTOUCHABLES SUNRISE')\nRETURN `t2`.`name` AS `name`, CASE WHEN `t1`.`rental_duration`=0 THEN NULL ELSE `t1`.`replacement_cost` / `t1`.`rental_duration` END AS `cost`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the language of Untouchables Sunrise film and calculate its rental cost per day.",
    "evidence": "\"UNTOUCHABLES SUNRISE\" is the title of film; language refers to name; rental cost per day = Divide (rental_cost, rental_duration)",
    "idx": 7051
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`rental`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'Eleanor' AND `t2`.`last_name` = 'Hunt')\nRETURN COUNT(`t1`.`rental_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many rental IDs belong to Eleanor Hunt?",
    "evidence": "'Eleanor Hunt' is the full name of a customer; full name refers to first_name, last_name",
    "idx": 7052
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`actor`)\nMATCH (`t2`:`film_actor`)\nWHERE `t1`.`actor_id` = `t2`.`actor_id`\nRETURN CASE WHEN sum(CASE WHEN `t1`.`first_name` = 'MARY' AND `t1`.`last_name` = 'KEITEL' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat((sum(CASE WHEN `t1`.`first_name` = 'ANGELA' AND `t1`.`last_name` = 'WITHERSPOON' THEN 1 ELSE 0 END) - sum(CASE WHEN `t1`.`first_name` = 'MARY' AND `t1`.`last_name` = 'KEITEL' THEN 1 ELSE 0 END))) * 100 / sum(CASE WHEN `t1`.`first_name` = 'MARY' AND `t1`.`last_name` = 'KEITEL' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much percentage of the film did Mary Keitel perform more than Angela Witherspoon?",
    "evidence": "'Mary Keitel' AND 'Angela Witherspoon' are full name of actors; full name refers to FirstName, LastName; calculation = DIVIDE(SUBTRACT(SUM('Mary Keitel'), SUM('Angela Witherspoon')), SUM('Angela Witherspoon')) * 100",
    "idx": 7053
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`customer`)\nMATCH (`t2`:`payment`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'Diane' AND `t1`.`last_name` = 'Collins')\nRETURN sum(`t2`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total payment amount by Diane Collins.",
    "evidence": "'Diane Collins' is a full name of a customer; full name refers to first_name, last_name",
    "idx": 7054
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rental_rate` = 0.99\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films have a rental rate of 0.99?",
    "evidence": "",
    "idx": 7055
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`last_name` = 'Thomas' AND `customer`.`customer_id` < 100\nRETURN COUNT(`customer`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the customers with customer ID of 100 and below, how many of them have Thomas as their last name?",
    "evidence": "customer ID of 100 and below refers to customer_id < 100",
    "idx": 7056
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`inventory`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t2`.`store_id` = 2)\nORDER BY `t1`.`rental_rate` IS NULL ASC, `t1`.`rental_rate` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among films with store ID of 2, list the title of films with the highest rental rate.",
    "evidence": "highest rental rate refers to MAX(rental_rate)",
    "idx": 7057
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`inventory`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t1`.`title` = 'African Egg')\nRETURN `t2`.`inventory_id` AS `inventory_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the inventory ID of the film titled \"African Egg\".",
    "evidence": "'African Egg' is a title of a film",
    "idx": 7058
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`inventory`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t2`.`inventory_id` >= 20 AND `t2`.`inventory_id` <= 60 AND `t1`.`rating` = 'G')\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the film with an inventory ID between 20 to 60, how many of the films have a G rating?",
    "evidence": "G rating refers to rating = 'G'",
    "idx": 7059
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`inventory`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nORDER BY `t1`.`length` IS NULL ASC, `t1`.`length` DESC \nRETURN `t2`.`store_id` AS `store_id`, `t2`.`inventory_id` AS `inventory_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the store and inventory ID of the film with the longest duration?",
    "evidence": "the longest duration refers to MAX(length)",
    "idx": 7060
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`address_sub0`:`address`)\nWHERE `address_sub0`.`district` = 'Texas'\nRETURN min(`address_sub0`.`city_id`) AS `_col_0`  \n}\nMATCH (`address`:`address`)\nWHERE `address`.`district` = 'Texas' AND `address`.`city_id` = `_col_0`\nRETURN `address`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the address in Texas in the ascending order of city id.",
    "evidence": "'Texas' is a district",
    "idx": 7061
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE CASE WHEN `customer`.`create_date` is not NULL THEN apoc.temporal.format(`customer`.`create_date`,'yyyy') ELSE NULL END = '2006' AND `customer`.`active` = 0\nRETURN `customer`.`first_name` AS `first_name`, `customer`.`last_name` AS `last_name`, `customer`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the full name and email address of inactive customers whose record was created in 2006.",
    "evidence": "full name refers to first_name, last_name; record created in 2006 refers to create_date = 2006; inactive customers refers to active = 0",
    "idx": 7062
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN CASE WHEN COUNT(`film`.`film_id`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `film`.`rating` = 'PG-13' THEN 1 ELSE 0 END)) * 100 / COUNT(`film`.`film_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of the movies are PG-13?",
    "evidence": "PG-13 is a rating; calculation = DIVIDE(SUM(rating = PG-13), SUM(rating)) * 100",
    "idx": 7063
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nORDER BY CASE WHEN `film`.`rental_duration`=0 THEN NULL ELSE `film`.`rental_rate` / `film`.`rental_duration` END IS NULL ASC, CASE WHEN `film`.`rental_duration`=0 THEN NULL ELSE `film`.`rental_rate` / `film`.`rental_duration` END DESC \nRETURN `film`.`title` AS `title`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the top ten movies with the most price per day in descending order of price per day.",
    "evidence": "movies with the most price per day refers to MAX(rental_rate)",
    "idx": 7064
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`payment`:`payment`)\nWHERE `payment`.`customer_id` = 15\nRETURN avg(`payment`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average rent amount paid by the customer with customer id 15.",
    "evidence": "average rent amount refers to AVG(amount)",
    "idx": 7065
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`rental_sub0`:`rental`)\nRETURN avg(duration.between(`rental_sub0`.`return_date`,`rental_sub0`.`rental_date`)) AS `_col_0_1`  \n}\nMATCH (`rental`:`rental`)\nWHERE duration.between(`rental`.`return_date`,`rental`.`rental_date`) > `_col_0_1`\nRETURN COUNT(`rental`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many customers rented for an above-average period?",
    "evidence": "rented period refers to SUBTRACT(return_date, rental_date); calculation = rented period > (AVG(rented period))",
    "idx": 7066
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`category`)\nMATCH (`t1`:`film_category`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nRETURN CASE WHEN COUNT(`t2`.`category_id`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`name` = 'horror' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`category_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the movies, what percentage are horror?",
    "evidence": "horror is a name of film category; calculation = DIVIDE(COUNT('horror'), COUNT(category_id)) * 100",
    "idx": 7067
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`actor`)\nMATCH (`t1_sub0`:`film_actor`)\nWHERE `t1_sub0`.`actor_id` = `t2_sub0`.`actor_id`\nWITH `t2_sub0`.`first_name` AS _groupby_col_0, `t2_sub0`.`last_name` AS _groupby_col_1, COUNT(`t1_sub0`.`film_id`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`, _groupby_col_2 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `first_name`, `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the full name of the actor who acted in the most number of movies?",
    "evidence": "full name refers to first_name, last_name; acted in the most number of movies refers to MAX(COUNT(film_id))",
    "idx": 7068
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rating` = 'NC-17'\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the title of all the films rated as 'Adults Only'.",
    "evidence": "'Adults Only' refers to rating = 'NC-17'",
    "idx": 7069
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`last_name` = 'Kilmer'\nRETURN COUNT(`actor`.`actor_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many actors with the surname Kilmer are there?",
    "evidence": "surname means last_name;",
    "idx": 7070
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`length` > 100\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many movies have a length longer than 100?",
    "evidence": "length longer than 100 refers to length > 100",
    "idx": 7071
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`payment`:`payment`)\nWHERE toString(`payment`.`payment_date`) =~ '(?i)(?s)2005-08.*'\nRETURN sum(`payment`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many payments were made throughout the month of August 2005?",
    "evidence": "payments made refers to amount; throughout the month of August 2005 refers to payment_date like '2005-08%'",
    "idx": 7072
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`film`)\nMATCH (`t2_sub0`:`language`)\nWHERE `t1_sub0`.`language_id` = `t2_sub0`.`language_id`\nAND (CASE WHEN `t1_sub0`.`release_year` is not NULL THEN apoc.temporal.format(`t1_sub0`.`release_year`,'yyyy') ELSE NULL END = '2006')\nWITH `t1_sub0`.`language_id` AS _groupby_col_0, COUNT(`t1_sub0`.`language_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `language_id`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `language_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What language was the most used in movies released in 2006?",
    "evidence": "released in 2006 refers to release_year = 2006; the most used language refers to MAX(COUNT(language_id))",
    "idx": 7073
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`rental`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`first_name` = 'ELLA' AND `t2`.`last_name` = 'ELLA' AND localdatetime.truncate('day',localdatetime(`t1`.`rental_date`)) >= localdatetime('2005-06-01T00:00:00') AND localdatetime.truncate('day',localdatetime(`t1`.`rental_date`)) <= localdatetime('2005-06-30T00:00:00'))\nRETURN COUNT(`t1`.`rental_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many rentals did Ella Oliver hire in June 2016?",
    "evidence": "'Ella Oliver' is a full name of a customer; full name refers to first_name, last_name; rental hired in June 2016 refers to rental_date BETWEEN '2005-06-01' AND '2005-06-30'",
    "idx": 7074
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`staff`)\nMATCH (`t1`:`rental`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`first_name` = 'Jon' AND `t2`.`last_name` = 'Stephens')\nRETURN COUNT(`t1`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many different clients have rented materials from Jon Stephens?",
    "evidence": "'Jon Stephens' is a full name of a customer; full name refers to first_name, last_name;",
    "idx": 7075
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`rental`)\nMATCH (`t2`:`payment`)\nWHERE `t1`.`rental_id` = `t2`.`rental_id`\nAND (localdatetime.truncate('day',localdatetime(`t1`.`rental_date`)) = '2005-07-29%')\nRETURN sum(`t2`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total amount paid for rentals made on July 29, 2005?",
    "evidence": "July 29, 2005 refers to rental_date like '2005-07-29'",
    "idx": 7076
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`address`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (CASE  WHEN 1-1 < 0 AND 2 < 0  THEN substring(`t2`.`postal_code`,(case when size(`t2`.`postal_code`)+1+(1-1)+2 < 0 then 0 else size(`t2`.`postal_code`)+1+(1-1)+2 end),-(2))  WHEN 1-1 < 0 AND 2 >= 0  THEN substring(`t2`.`postal_code`,size(`t2`.`postal_code`)+1+(1-1),2)  WHEN 1-1 >= 0 AND 2 < 0  THEN substring(`t2`.`postal_code`,(case when 1-1+1+(2) < 0 then 0 else 1-1+1+(2) end),-(2))  ELSE substring(`t2`.`postal_code`,1-1,2) END = '76')\nRETURN `t1`.`first_name` AS `first_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the first name of the customers whose address is in the postal code that begins with 76?",
    "evidence": "postal code that begins with 76 refers to postal_code like '76%'",
    "idx": 7077
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`customer`)\nMATCH (`t1_sub0`:`rental`)\nWHERE `t1_sub0`.`customer_id` = `t2_sub0`.`customer_id`\nWITH `t2_sub0`.`first_name` AS _groupby_col_0, COUNT(`t1_sub0`.`rental_date`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `first_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the client who has the largest quantity of rented material without returning it?",
    "evidence": "name refers to first_name, last_name; without returning a rented material refers to return_date is null",
    "idx": 7078
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`rental`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`active` = 0)\nRETURN COUNT(`t2`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many non-active clients have not returned the rented material?",
    "evidence": "non-active clients refers to active = 0; not returning a rented material refers to rental_date is null",
    "idx": 7079
  }
]