[
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`hiredate` = localdatetime('2008-12-07T00:00:00')\nRETURN `employee`.`birthdate` AS `birthdate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the older production technician who was hired in 2008/12/7, what's his/her birthday?",
    "evidence": "Oldest production technician refers to MIN(BirthDate) where JobTitle = 'Production Technician'",
    "idx": 5409
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)\nMATCH (`t2`:`productmodel`)\nWHERE `t1`.`productmodelid` = `t2`.`productmodelid`\nAND (`t1`.`productid` = 793)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the product ID No.793's model name?",
    "evidence": "",
    "idx": 5410
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[businessentityaddress_sub0:has_address]->()\nWHERE `businessentityaddress_sub0`.`businessentityid` = 4\nRETURN `businessentityaddress_sub0`.`addressid` AS `addressid`   } AS in_collect_0\nMATCH (`address`:`address`)\nWHERE `address`.`addressid` IN in_collect_0\nRETURN `address`.`addressline1` AS `addressline1`, `address`.`addressline2` AS `addressline2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where is Business Entity ID No.4 located at? Give the address down to street.",
    "evidence": "Located refers to the total address of the entity that comprises city, addressline1, addressline2",
    "idx": 5411
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`billofmaterials`)\nMATCH (`t2`:`unitmeasure`)\nWHERE `t1`.`unitmeasurecode` = `t2`.`unitmeasurecode`\nAND (`t1`.`componentid` = 494 AND `t1`.`enddate` IS NULL)\nWITH `t2`.`name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the on going assembly item Component ID No. 494, what's the Unit measure for it?",
    "evidence": "On going assembly item means the assembly item haven't been finished, therefore EndDate is null",
    "idx": 5412
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`document`)\nWHERE `t1`.`owner` = `t2`.`businessentityid`\nAND (`t2`.`jobtitle` = 'Document Control Assistant' AND `t2`.`birthdate` = localdatetime('1975-12-25T00:00:00') AND `t1`.`documentsummary` IS NULL)\nRETURN COUNT(`t2`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the document Control Assistant who was born on 1975/12/25, how many private documents did he/she have?",
    "evidence": "Document Control Assistant refers to the JobTitle = 'Document Control Assistant'; born on 1975/12/25 refers to BirthDate = '1975-12-25'; private documents indicate that DocumentSummary is null",
    "idx": 5413
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productlistpricehistory`)-[price_history_for_0:price_history_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`listprice` - `t1`.`standardcost` > 21.9037 AND CASE WHEN `t2`.`startdate` is not NULL THEN apoc.temporal.format(`t2`.`startdate`,'yyyy-MM-dd') ELSE NULL END >= '2012-10-01')\nRETURN `t1`.`listprice` AS `listprice`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "To the products which could make the profit as 21.9037, what were their list price after October of 2012?",
    "evidence": "Profit as 82.41 = SUTRACT(ListPrice, StandardCost); May of 2012 refers to StartDate = '2012-05'",
    "idx": 5414
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:has_photo]->(`t1`:`productphoto`)\nWHERE `t1`.`productphotoid` = `t2`.`productphotoid`\nAND (`t2`.`productid` = 1)\nRETURN `t1`.`thumbnailphoto` AS `thumbnailphoto`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the size of the photo of product id No.1?",
    "evidence": "",
    "idx": 5415
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`password`)-[belongs_to_0:belongs_to]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`firstname` = 'Catherine' AND `t1`.`lastname` = 'Ward')\nRETURN char_length(`t2`.`passwordhash`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many letters are there in Catherine Ward's e-mail account passwords?",
    "evidence": "Catherine Ward refers to the name of BusinessEntityID; how many letters in password for the e-mail account refers to LENGTH(PasswordHash)",
    "idx": 5416
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`productreview`)-[review_for_0:review_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`reviewername` = 'Jill' AND `t2`.`name` = 'HL Mountain Pedal')\nRETURN `t1`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What rating did Jill give for HL Mountain Pedal?",
    "evidence": "Jill refers to the name of reviewer; HL Mountain Pedal refers to the name of the product",
    "idx": 5417
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`name` = 'Freewheel')\nRETURN `t1`.`lastreceiptcost` - `t1`.`standardprice` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the profit for the Freewheel?",
    "evidence": "SUBTRACT(LastReceiptCost, StandardPrice) for ProductID where name = 'Freewheel'",
    "idx": 5418
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`person`)\nMATCH (`t1`:`salesperson`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`firstname` = 'Rachel' AND `t2`.`lastname` = 'Valdez')\nRETURN `t1`.`bonus` AS `bonus`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Did Rachel Valdez complete her sales task?",
    "evidence": "Complete sales task refers to meeting sales quota; if Bonus = 0, it means this salesperson doesn't meet quota and vice versa",
    "idx": 5419
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`salestaxrate`)-[applies_to_0:applies_to]->(`t2`:`stateprovince`)\nWHERE `t1`.`stateprovinceid` = `t2`.`stateprovinceid`\nAND (`t2`.`name` = 'Quebec')\nRETURN COUNT(DISTINCT `t1`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many types of tax did the sales happen in Quebec have?",
    "evidence": "If Name = \"+\" in the value from SalesTaxRate, it means this sales are charged by multiple types of tax; Quebec refers to the name of State Province",
    "idx": 5420
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`emailaddress`)-[belongs_to_0:belongs_to]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`firstname` = 'Kevin' AND `t1`.`middlename` = 'A' AND `t1`.`lastname` = 'Wright')\nRETURN `t2`.`emailaddress` AS `emailaddress`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's Kevin A Wright's email address?",
    "evidence": "",
    "idx": 5421
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`countryregion`)\nMATCH (`t1`:`stateprovince`)\nWHERE `t1`.`countryregioncode` = `t2`.`countryregioncode`\nAND (`t2`.`name` = 'France' AND `t1`.`isonlystateprovinceflag` = 1)\nRETURN `t1`.`countryregioncode` AS `countryregioncode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the number of State Province of France that doesn't have a State Province Code?",
    "evidence": "Doesn't have a State Province Code refers to IsOnlyStateProvinceFlag = 1 where StateProvinceCode is unavailable",
    "idx": 5422
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`transactionhistory`)-[transaction_for_0:transaction_for]->(`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`name` = 'HL Road Frame - Black, 48' AND CASE WHEN `t1`.`transactiondate` is not NULL THEN apoc.temporal.format(`t1`.`transactiondate`,'yyyy-MM-dd') ELSE NULL END = '2013-07-31')\nRETURN `t1`.`transactiontype` AS `transactiontype`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What kind of transaction type for the \"HL Road Frame - Black, 48\" order happened in 2012/12/13?",
    "evidence": "Transactiontype = 'w' means 'WorkOrder'; transactiontype = 's' means 'SalesOrder'; transactiontype = 'P' means 'PurchaseOrder'; happened in refers to TransactionDate",
    "idx": 5423
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`transactionhistoryarchive`)\nMATCH (`t2`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`name` = 'LL Road Handlebars' AND CASE WHEN `t1`.`transactiondate` is not NULL THEN apoc.temporal.format(`t1`.`transactiondate`,'yyyy-MM-dd') ELSE NULL END = '2012-11-03')\nRETURN `t1`.`transactiontype` AS `transactiontype`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which type of transaction was it for the \"LL Road Handlebars\" order happened in 2012/11/3?",
    "evidence": "Transactiontype = 'w' means 'WorkOrder'; transactiontype = 's' means 'SalesOrder'; transactiontype = 'P' means 'PurchaseOrder'; happened in refers to TransactionDate",
    "idx": 5424
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`vendor`)-[is_a_0:is_a]->(`t2`:`businessentity`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`rowguid` = '33671A4E-DF2B-4879-807B-E3F930DD5C0C')\nRETURN `t1`.`creditrating` AS `creditrating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How is the Credit Rating for company whose rowguid is \"33671A4E-DF2B-4879-807B-E3F930DD5C0C\"?",
    "evidence": "CreditRating = 1 means 'Superior'; CreditRating = 2 means 'Excellent'; CreditRating = 3 means 'Above average'; CreditRating = 4 means 'Superior'; CreditRating = 5 means 'Below average'",
    "idx": 5425
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`vendor`)-[is_a_0:is_a]->(`t2`:`businessentity`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`rowguid` = '684F328D-C185-43B9-AF9A-37ACC680D2AF')\nRETURN `t1`.`preferredvendorstatus` AS `preferredvendorstatus`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the PreferredVendorStatus for the company which has the rowguid of \"684F328D-C185-43B9-AF9A-37ACC680D2AF\"?",
    "evidence": "PreferredVendorStatus = 1 means 'Do not use if another vendor is available'; CreditRating = 2 means 'Preferred over other vendors supplying the same product'",
    "idx": 5426
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`vendor`)\nMATCH ()-[t2:has_contact]->()\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`personid` = 2054)\nRETURN `t1`.`activeflag` AS `activeflag`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For person id No.2054, is his/her vendor still active?",
    "evidence": "ActiveFlag = 1 means 'Vendor no longer used'; ActiveFlag = 2 means 'Vendor is actively used",
    "idx": 5427
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`firstname` = 'Lynn' AND `t1`.`middlename` = 'N' AND `t1`.`lastname` = 'Tsoflias')\nRETURN `t2`.`jobtitle` AS `jobtitle`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's Lynn N Tsoflias's job title?",
    "evidence": "",
    "idx": 5428
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productsubcategory`)-[subcategory_of_0:subcategory_of]->(`t1`:`productcategory`)\nWHERE `t1`.`productcategoryid` = `t2`.`productcategoryid`\nAND (`t1`.`name` = 'Bikes')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the number of the sub categories for bikes?",
    "evidence": "Bike refers to the name of the product category, therefore ProductCategoryID = 1",
    "idx": 5429
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`employee`)\nMATCH (`t1`:`document`)\nWHERE `t1`.`owner` = `t2`.`businessentityid`\nAND (`t2`.`jobtitle` = 'Document Control Assistant' AND `t2`.`hiredate` = localdatetime('2009-01-22T00:00:00'))\nRETURN CASE WHEN COUNT(`t1`.`documentsummary`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN NOT `t1`.`documentsummary` IS NULL THEN 1 ELSE 0 END)) / COUNT(`t1`.`documentsummary`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the document Control Assistant who was hired on 2009/1/22, what is the percentage of private documents did he/she have?",
    "evidence": "Document Control Assistant refers  to the  JobTitle = 'Document Control Assistant'; hired on 2009/1/22 means the person's hiring date is HireDate = '2009-01-22'; private documents indicate that DocumentSummary is null; DIVIDE(COUNT(DocumentSummary is null), COUNT(DocumentSummary))*100",
    "idx": 5430
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`product`)-[t1:supplied_by]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`name` = 'HL Grip Tape')\nRETURN CASE WHEN `t1`.`standardprice`=0 THEN NULL ELSE (`t1`.`lastreceiptcost` - `t1`.`standardprice`) / `t1`.`standardprice` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is HL Grip Tape's profit ratio?",
    "evidence": "HL Grip Tape refers to the product name; DIVIDE(SUBTRACT(LastReceiptCost, StandardPrice)), (StandardPrice) as profit_ratio",
    "idx": 5431
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`billofmaterials`:`billofmaterials`)\nWHERE `billofmaterials`.`unitmeasurecode` = 'EA' AND `billofmaterials`.`bomlevel` = 2 AND `billofmaterials`.`perassemblyqty` > 10\nRETURN `billofmaterials`.`productassemblyid` AS `productassemblyid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the product assembly ID that come with unit measure code EA and BOM level of 2, at the same time have per assembly quantity of more than 10?",
    "evidence": "Per assembly quantity of more than 10 is expresses as PerAssemblyQty>10",
    "idx": 5432
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[workorderrouting:processed_at]->()\nWHERE `workorderrouting`.`actualresourcehrs` = 2\nRETURN COUNT(`workorderrouting`.`locationid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many location IDs have actual resource hours of 2?",
    "evidence": "actual resource hours of 2 refers to ActualResourceHrs = 2",
    "idx": 5433
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`billofmaterials`)\nMATCH (`t3`:`workorder`)-[t1:processed_at]->()\nWHERE `t1`.`locationid` = `t2`.`productassemblyid`\nAND `t3`.`workorderid` = `t1`.`workorderid`\nAND (`t1`.`locationid` = 40)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the stocked quantity of products manufactured from location ID 40?",
    "evidence": "Stocked quantity refers to StockedQty",
    "idx": 5434
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`billofmaterials`)\nMATCH (`t2`:`unitmeasure`)\nWHERE `t1`.`unitmeasurecode` = `t2`.`unitmeasurecode`\nAND (`t1`.`unitmeasurecode` IN ['EA', 'IN', 'OZ'])\nWITH `t2`.`name` AS _groupby_col_0, sum(`t1`.`perassemblyqty`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the total per assembly quantity for unit measure code EA, IN and OZ respectively? What are the name of these 3 code?",
    "evidence": "Pre assembly quantity refers to PerAssemblyQty",
    "idx": 5435
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "WITH *, COLLECT { MATCH (`t2_sub0`:`workorder`)-[for_product_0:for_product]->(`t1_sub0`:`product`)\nWHERE `t1_sub0`.`productid` = `t2_sub0`.`productid`\nRETURN `t1_sub0`.`productid` AS `productid_1`   } AS in_collect_0\nMATCH (`product`:`product`)\nWHERE NOT `product`.`productid` IN in_collect_0\nRETURN `product`.`productid` AS `productid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which product ID do not have any work order ID?",
    "evidence": "Do not have any work order ID means WorkOrderID is null",
    "idx": 5436
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "WITH *, COLLECT { MATCH (`transactionhistory_sub0`:`transactionhistory`)\nWHERE `transactionhistory_sub0`.`transactiontype` = 'P'\nRETURN `transactionhistory_sub0`.`productid` AS `productid_1`   } AS in_collect_0\nMATCH (`product`:`product`)\nWHERE `product`.`productid` IN in_collect_0\nRETURN `product`.`productid` AS `productid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of product purchased with transaction type P?",
    "evidence": "",
    "idx": 5437
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`jobtitle` = 'Accountant')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`middlename` AS `middlename`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the full name of accountants in the company.",
    "evidence": "Accountants refers to JobTitle = 'Accountant'; full name includes FirstName, LastName, and MiddleName",
    "idx": 5438
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`emailpromotion` = 0 AND `t1`.`gender` = 'M')\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many male employees do not wish to receive e-mail promotion?",
    "evidence": "Male refers to Gender = 'M'; employees do not wish to receive any e-mail promotions are marked as EmailPromotion = 0",
    "idx": 5440
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "WITH *, COLLECT { MATCH (`salespersonquotahistory_sub0`:`salespersonquotahistory`)\nWHERE CASE WHEN `salespersonquotahistory_sub0`.`quotadate` is not NULL THEN apoc.temporal.format(`salespersonquotahistory_sub0`.`quotadate`,'yyyy') ELSE NULL END = '2013'\nRETURN `salespersonquotahistory_sub0`.`businessentityid` AS `businessentityid_1`   } AS in_collect_0\nMATCH (`salesperson`:`salesperson`)\nWHERE `salesperson`.`businessentityid` IN in_collect_0\nORDER BY CASE WHEN `salesperson`.`salesquota`=0 THEN NULL ELSE toFloat(`salesperson`.`saleslastyear`) / `salesperson`.`salesquota` END IS NULL ASC, CASE WHEN `salesperson`.`salesquota`=0 THEN NULL ELSE toFloat(`salesperson`.`saleslastyear`) / `salesperson`.`salesquota` END DESC \nRETURN `salesperson`.`businessentityid` AS `businessentityid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the top sales person who achived highest percentage of projected sales quota in 2013?",
    "evidence": "2013 refers to QuotaDate = '2013'; DIVIDE(SalesLastYear), (SUM(SalesQuota where YEAR(QuotaDate) = 2013)) as percentage\n",
    "idx": 5441
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`persontype` = 'EM' AND `t1`.`maritalstatus` = 'M')\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the non-sales employees are married?",
    "evidence": "Married refers to MaritalStatus = 'M';  non-sales employees refer to PersonType = 'EM'",
    "idx": 5442
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`jobtitle` =~ '(?i)(?s)Production Technician.*' AND `t1`.`maritalstatus` = 'S' AND `t2`.`persontype` = 'VC')\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the Production Technicians who are single, how many of them are vendor contact?",
    "evidence": "Production Technicians refer to the  JobTitle = 'Production Technician%'; single refers to MaritalStatus = 'S'; Vendor contact refers to PersonType = 'VC'",
    "idx": 5443
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`emailpromotion` = 0)\nRETURN sum(`t1`.`sickleavehours`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total sick leave hours of employees who do not wish to receive any e-mail promotion?",
    "evidence": "Employees who do not wish to receive any e-mail promotions are marked as EmailPromotion = 0",
    "idx": 5444
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`firstname` = 'Alex' AND `t1`.`maritalstatus` = 'S' AND `t1`.`organizationlevel` = 1)\nRETURN COUNT(`t1`.`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many people with the name Alex are single and occupying organization level of 1?",
    "evidence": "Alex refers to FirstName = 'Alex'; single refers to MaritalStatus = 'S'",
    "idx": 5445
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`persontype` = 'SP')\nRETURN CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(`t1`.`vacationhours`)) / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average vacation hours taken by Sales person?",
    "evidence": "Store Contact refers PersonType = 'SC'; AVG(VacationHours",
    "idx": 5446
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`document`)\nMATCH (`t3`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`owner`\nAND `t1`.`businessentityid` = `t3`.`businessentityid`\nAND (`t2`.`title` = 'Crank Arm and Tire Maintenance')\nRETURN `t1`.`lastname` AS `lastname`, `t3`.`jobtitle` AS `jobtitle`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the last name and job title of owner for document \"Crank Arm and Tire Maintenance\".",
    "evidence": "The owner refers to BusinessEntityID",
    "idx": 5447
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`employee`)-[is_a_1:is_a]->(`t2_sub0`:`person`)\nWHERE `t1_sub0`.`businessentityid` = `t2_sub0`.`businessentityid`\nAND (`t2_sub0`.`suffix` IS NULL)\nWITH `t1_sub0`.`businessentityid` AS _groupby_col_0\nRETURN _groupby_col_0 AS `businessentityid`  \n}\nWITH *\nRETURN COUNT(`businessentityid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many employees do not have any suffix and what are their organization level?",
    "evidence": "Do not have any suffix means Suffix is null",
    "idx": 5448
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`salespersonquotahistory`)-[history_for_0:history_for]->(`t1`:`salesperson`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`territoryid` = 1 AND CASE WHEN `t2`.`quotadate` is not NULL THEN apoc.temporal.format(`t2`.`quotadate`,'yyyy') ELSE NULL END = '2013')\nRETURN DISTINCT `t1`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the sales people who achieved projected sales quota 2013, is there any person from territory ID 1? If yes, state the business entity ID.",
    "evidence": "projected sales quota refers to SalesQuota; projected sales quota in 2013 refers to year(QuotaDate) = 2013;",
    "idx": 5449
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`jobcandidate`)\nMATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t3`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t1`.`businessentityid` = `t3`.`businessentityid`\nAND (`t1`.`businessentityid` IN [212, 274])\nRETURN `t3`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who are the employees that submitted resume to Human Resource Department and got hired? State the last name.",
    "evidence": "employees that submitted resume to Human Resource Department and got hired refers to BusinessEntittyID NOT null;",
    "idx": 5450
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nMATCH (`t3`:`emailaddress`)-[belongs_to_0:belongs_to]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t2`.`businessentityid` = `t3`.`businessentityid`\nAND (`t1`.`gender` = 'F' AND `t1`.`maritalstatus` = 'S')\nRETURN `t3`.`emailaddress` AS `emailaddress`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the email address of female single employees.",
    "evidence": "female refers to Gender = 'F'; single refers to MaritalStatus = 'S';",
    "idx": 5451
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`salespersonquotahistory`)-[history_for_0:history_for]->(`t1`:`salesperson`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t1`.`businessentityid` = 275 AND CASE WHEN `t2`.`quotadate` is not NULL THEN apoc.temporal.format(`t2`.`quotadate`,'yyyy') ELSE NULL END = '2013')\nRETURN sum(`t1`.`salesquota`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the projected sales quota amount in 2013 and sales YTD amount for sales person with business entity ID 275?",
    "evidence": "projected sales quota refers to SalesQuota; projected sales quota in 2013 refers to year(QuotaDate) = 2013; projected sales quota for 2013 = SUM(SalesQuota where year(QuotaDate) = 2013);",
    "idx": 5452
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`salespersonquotahistory`)-[history_for_0:history_for]->(`t1`:`salesperson`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (CASE WHEN `t2`.`quotadate` is not NULL THEN apoc.temporal.format(`t2`.`quotadate`,'yyyy') ELSE NULL END = '2013' AND `t1`.`salesquota` < `t1`.`saleslastyear`)\nRETURN DISTINCT `t1`.`businessentityid` AS `businessentityid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the business entity ID who did not achieved projected yearly sales quota in 2013.",
    "evidence": "projected yearly sales quota refers to SalesQuota; sales quota in 2013 refers to year(QuotaDate) = 2013; person who did not achieve projected yearly sales quota refers to SalesQuota>SalesYTD;",
    "idx": 5453
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`emailpromotion` = 1)\nRETURN CASE WHEN COUNT(`t1`.`businessentityid`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`gender` = 'F' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`businessentityid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the employees who wish to receive e-mail promotion from AdventureWorks, how many percent of them are female?",
    "evidence": "female refers to Gender = 'F'; employee who wish to receive email promotion refers to EmailPromotion = 1; percentage = DIVIDE(SUM(Gender = 'F')), (sum(Gender = 'F' or Gender = 'M'))) as percentage;",
    "idx": 5454
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`employee`)-[is_a_0:is_a]->(`t2`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (`t2`.`persontype` = 'EM')\nRETURN CASE WHEN sum(CASE  WHEN `t1`.`maritalstatus` = 'S' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`maritalstatus` = 'M' THEN 1 ELSE 0 END)) * 100 / sum(CASE  WHEN `t1`.`maritalstatus` = 'S' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times is married non sales employees against single non-sales employees?",
    "evidence": "non-sales employee refers to PersonType = 'EM'; married refers to MaritalStatus = 'M'; single refers to MaritalStatus = 'S'; percentage = DIVIDE(SUM(MaritalStatus = 'M'), (SUM(MaritalStatus = 'S') as percentage;",
    "idx": 5455
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`salespersonquotahistory`)-[history_for_0:history_for]->(`t1`:`salesperson`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND (CASE WHEN `t2`.`quotadate` is not NULL THEN apoc.temporal.format(`t2`.`quotadate`,'yyyy') ELSE NULL END = '2013')\nRETURN sum(`t1`.`bonus`) AS `_col_0`, CASE WHEN sum(`t1`.`salesquota`)=0 THEN NULL ELSE toFloat(sum(`t1`.`bonus`)) * 100 / sum(`t1`.`salesquota`) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the total bonus received by sales person and what is the percentage of it against the projected yearly sales quota in 2013?",
    "evidence": "projected yearly sales quota refers to SalesQuota; projected yearly sales quota in 2013 refers to year(QuotaDate) = 2013; percentage = (MULTIPLY(DIVIDE(SUM(Bonus)), (SUM(SalesQuota))) as percentage;",
    "idx": 5456
  }
]