[
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`t1`:`products`)-[manufactured_by_0:manufactured_by]->(`t2`:`manufacturers`)\nWHERE `t1`.`manufacturer` = `t2`.`code`\nWITH `t2`.`headquarter` AS _groupby_col_0, COUNT(DISTINCT `t1`.`name`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `headquarter`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of different products that are produced by companies at different headquarter cities.",
    "evidence": "",
    "idx": 5582
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`t1_sub0`:`products`)-[manufactured_by_0:manufactured_by]->(`t2_sub0`:`manufacturers`)\nWHERE `t1_sub0`.`manufacturer` = `t2_sub0`.`code`\nAND (`t2_sub0`.`name` = 'Sony')\nRETURN `t1_sub0`.`name` AS `name`   } AS in_collect_0\nMATCH (`products`:`products`)\nWHERE NOT `products`.`name` IN in_collect_0\nRETURN COUNT(DISTINCT `products`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find number of products which Sony does not make.",
    "evidence": "",
    "idx": 5584
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`t1_sub0`:`products`)-[manufactured_by_0:manufactured_by]->(`t2_sub0`:`manufacturers`)\nWHERE `t1_sub0`.`manufacturer` = `t2_sub0`.`code`\nAND (`t2_sub0`.`name` = 'Sony')\nRETURN `t1_sub0`.`name` AS `name`   } AS in_collect_0\nMATCH (`products`:`products`)\nWHERE NOT `products`.`name` IN in_collect_0\nRETURN COUNT(DISTINCT `products`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many products are not made by Sony?",
    "evidence": "",
    "idx": 5585
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`t1`:`products`)-[manufactured_by_0:manufactured_by]->(`t2`:`manufacturers`)\nWHERE `t1`.`manufacturer` = `t2`.`code`\nWITH `t2`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of products for each manufacturer, showing the name of each company.",
    "evidence": "",
    "idx": 5586
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN `products`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Select the names of all the products in the store.",
    "evidence": "",
    "idx": 5588
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN `products`.`name` AS `name`, `products`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Select the names and the prices of all the products in the store.",
    "evidence": "",
    "idx": 5590
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`price` <= 200\nRETURN `products`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Select the name of the products with a price less than or equal to $200.",
    "evidence": "",
    "idx": 5592
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`price` >= 60 AND `products`.`price` <= 120\nRETURN `products`.`code` AS `code`, `products`.`name` AS `name`, `products`.`price` AS `price`, `products`.`manufacturer` AS `manufacturer`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all information of all the products with a price between $60 and $120.",
    "evidence": "",
    "idx": 5594
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`price` >= 60 AND `products`.`price` <= 120\nRETURN `products`.`code` AS `code`, `products`.`name` AS `name`, `products`.`price` AS `price`, `products`.`manufacturer` AS `manufacturer`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information of all the products that have a price between 60 and 120?",
    "evidence": "",
    "idx": 5595
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN avg(`products`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the average price of all the products.",
    "evidence": "",
    "idx": 5596
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`manufacturer` = 2\nRETURN avg(`products`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the average price of all products with manufacturer code equal to 2.",
    "evidence": "",
    "idx": 5598
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`price` >= 180\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the number of products with a price larger than or equal to $180.",
    "evidence": "",
    "idx": 5600
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`price` >= 180\nRETURN `products`.`name` AS `name`, `products`.`price` AS `price` ORDER BY `price` IS NULL ASC, `price` DESC, `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Select the name and price of all products with a price larger than or equal to $180, and sort first by price (in descending order), and then by name  (in ascending order).",
    "evidence": "",
    "idx": 5602
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`t1`:`products`)-[manufactured_by_0:manufactured_by]->(`t2`:`manufacturers`)\nWHERE `t1`.`manufacturer` = `t2`.`code`\nRETURN `t1`.`code` AS `code`, `t1`.`name` AS `name`, `t1`.`price` AS `price`, `t1`.`manufacturer` AS `manufacturer`, `t2`.`code` AS `code_1`, `t2`.`name` AS `name_1`, `t2`.`headquarter` AS `headquarter`, `t2`.`founder` AS `founder`, `t2`.`revenue` AS `revenue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Select all the data from the products and each product's manufacturer.",
    "evidence": "",
    "idx": 5604
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`t1`:`products`)-[manufactured_by_0:manufactured_by]->(`t2`:`manufacturers`)\nWHERE `t1`.`manufacturer` = `t2`.`code`\nRETURN `t1`.`code` AS `code`, `t1`.`name` AS `name`, `t1`.`price` AS `price`, `t1`.`manufacturer` AS `manufacturer`, `t2`.`code` AS `code_1`, `t2`.`name` AS `name_1`, `t2`.`headquarter` AS `headquarter`, `t2`.`founder` AS `founder`, `t2`.`revenue` AS `revenue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the product data, as well as  each product's manufacturer?",
    "evidence": "",
    "idx": 5605
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nWITH `products`.`manufacturer` AS _groupby_col_0, avg(`products`.`price`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `manufacturer`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Select the average price of each manufacturer's products, showing only the manufacturer's code.",
    "evidence": "",
    "idx": 5606
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`t1`:`products`)-[manufactured_by_0:manufactured_by]->(`t2`:`manufacturers`)\nWHERE `t1`.`manufacturer` = `t2`.`code`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`price`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average prices of products, grouped by manufacturer name?",
    "evidence": "",
    "idx": 5609
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`t1`:`products`)-[manufactured_by_0:manufactured_by]->(`t2`:`manufacturers`)\nWHERE `t1`.`manufacturer` = `t2`.`code`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`price`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 150\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Select the names of manufacturer whose products have an average price higher than or equal to $150.",
    "evidence": "",
    "idx": 5610
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`t1`:`products`)-[manufactured_by_0:manufactured_by]->(`t2`:`manufacturers`)\nWHERE `t1`.`manufacturer` = `t2`.`code`\nWITH `t2`.`name` AS _groupby_col_0, avg(`t1`.`price`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 150\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and average prices of products for manufacturers whose products cost on average 150 or more?",
    "evidence": "",
    "idx": 5611
  },
  {
    "filename": "train_spider.json",
    "db_id": "manufactory_1",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN `products`.`name` AS `name`, `products`.`price` AS `price` ORDER BY `price` IS NULL DESC, `price`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Select the name and price of the cheapest product.",
    "evidence": "",
    "idx": 5612
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`problem_log`:`problem_log`)\nORDER BY `problem_log`.`log_entry_date` IS NULL ASC, `problem_log`.`log_entry_date` DESC \nRETURN `problem_log`.`problem_log_id` AS `problem_log_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which problem log was created most recently? Give me the log id.",
    "evidence": "",
    "idx": 5615
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`problem_log`:`problem_log`)\nORDER BY `problem_log`.`log_entry_date` IS NULL DESC, `problem_log`.`log_entry_date`  \nRETURN `problem_log`.`problem_log_id` AS `problem_log_id`, `problem_log`.`problem_id` AS `problem_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the oldest log id and its corresponding problem id.",
    "evidence": "",
    "idx": 5617
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`problem_log`:`problem_log`)\nWHERE `problem_log`.`problem_id` = 10\nRETURN `problem_log`.`problem_log_id` AS `problem_log_id`, `problem_log`.`log_entry_date` AS `log_entry_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the ids and dates of the logs for the problem whose id is 10.",
    "evidence": "",
    "idx": 5618
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`problem_log`:`problem_log`)\nRETURN `problem_log`.`problem_log_id` AS `problem_log_id`, `problem_log`.`log_entry_description` AS `log_entry_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the log ids and their descriptions from the problem logs.",
    "evidence": "",
    "idx": 5620
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t2`:`problem_log`)-[assigned_to_0:assigned_to]->(`t1`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`assigned_to_staff_id`\nAND (`t2`.`problem_id` = 1)\nRETURN DISTINCT `t1`.`staff_first_name` AS `staff_first_name`, `t1`.`staff_last_name` AS `staff_last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the first and last names of all distinct staff members who are assigned to the problem whose id is 1.",
    "evidence": "",
    "idx": 5622
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t2`:`problem_log`)-[assigned_to_0:assigned_to]->(`t1`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`assigned_to_staff_id`\nAND (`t1`.`staff_first_name` = 'Rylan' AND `t1`.`staff_last_name` = 'Homenick')\nRETURN DISTINCT `t2`.`problem_id` AS `problem_id`, `t2`.`problem_log_id` AS `problem_log_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the problem id and log id which are assigned to the staff named Rylan Homenick.",
    "evidence": "",
    "idx": 5624
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t2`:`problems`)-[for_product_0:for_product]->(`t1`:`product`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t1`.`product_name` = 'voluptatem')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many problems did the product called \"voluptatem\" have in record?",
    "evidence": "",
    "idx": 5627
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t2`:`problems`)-[for_product_0:for_product]->(`t1`:`product`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nWITH `t1`.`product_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `product_name` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many problems does the product with the most problems have? List the number of the problems and product name.",
    "evidence": "",
    "idx": 5628
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t1`:`problems`)-[staff_involvement_0:staff_involvement]->(`t2`:`staff`)\nWHERE `t1`.`reported_by_staff_id` = `t2`.`staff_id`\nAND (`t2`.`staff_first_name` = 'Christop')\nRETURN `t1`.`problem_description` AS `problem_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me a list of descriptions of the problems that are reported by the staff whose first name is Christop.",
    "evidence": "",
    "idx": 5630
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t1`:`problems`)-[staff_involvement_0:staff_involvement]->(`t2`:`staff`)\nWHERE `t1`.`reported_by_staff_id` = `t2`.`staff_id`\nAND (`t2`.`staff_last_name` = 'Bosco')\nRETURN `t1`.`problem_id` AS `problem_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the ids of the problems that are reported by the staff whose last name is Bosco.",
    "evidence": "",
    "idx": 5632
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`problems`:`problems`)\nWHERE `problems`.`date_problem_reported` > '1978-06-26'\nRETURN `problems`.`problem_id` AS `problem_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the ids of the problems reported after 1978-06-26.",
    "evidence": "",
    "idx": 5635
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`problems`:`problems`)\nWHERE `problems`.`date_problem_reported` < '1978-06-26'\nRETURN `problems`.`problem_id` AS `problem_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which problems are reported before 1978-06-26? Give me the ids of the problems.",
    "evidence": "",
    "idx": 5637
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t1`:`problems`)-[for_product_0:for_product]->(`t2`:`product`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nWITH `t2`.`product_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `product_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each product with some problems, list the count of problems and the product id.",
    "evidence": "",
    "idx": 5639
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t1`:`problems`)-[for_product_0:for_product]->(`t2`:`product`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t1`.`date_problem_reported` > '1986-11-13')\nWITH `t2`.`product_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `product_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the products that have problems reported after 1986-11-13? Give me the product id and the count of problems reported after 1986-11-13.",
    "evidence": "",
    "idx": 5641
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`product`:`product`)\nRETURN DISTINCT `product`.`product_name` AS `product_name` ORDER BY `product_name` IS NULL DESC, `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort all the distinct product names in alphabetical order.",
    "evidence": "",
    "idx": 5643
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`product`:`product`)\nORDER BY `product`.`product_id` IS NULL DESC, `product`.`product_id`  \nRETURN DISTINCT `product`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the distinct product names ordered by product id?",
    "evidence": "",
    "idx": 5644
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`product`:`product`)\nORDER BY `product`.`product_id` IS NULL DESC, `product`.`product_id`  \nRETURN DISTINCT `product`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the list of distinct product names sorted by product id?",
    "evidence": "",
    "idx": 5645
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t1`:`problems`)-[staff_involvement_0:staff_involvement]->(`t2`:`staff`)\nWHERE `t1`.`reported_by_staff_id` = `t2`.`staff_id`\nAND (`t2`.`staff_first_name` = 'Dameon' AND `t2`.`staff_last_name` = 'Frami')\nRETURN `t1`.`product_id` AS `product_id`   \nUNION DISTINCT\nMATCH (`t1`:`problems`)-[staff_involvement_1:staff_involvement]->(`t2`:`staff`)\nWHERE `t1`.`reported_by_staff_id` = `t2`.`staff_id`\nAND (`t2`.`staff_first_name` = 'Jolie' AND `t2`.`staff_last_name` = 'Weber')\nRETURN `t1`.`product_id` AS `product_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the id of problems reported by the staff named Dameon Frami or Jolie Weber?",
    "evidence": "",
    "idx": 5646
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "CALL(*) {\nMATCH (`t3`:`problems`)-[staff_involvement_1:staff_involvement]->(`t4`:`staff`)\nWHERE `t3`.`reported_by_staff_id` = `t4`.`staff_id`\nAND (`t4`.`staff_first_name` = 'Lysanne' AND `t4`.`staff_last_name` = 'Turcotte')\nRETURN min(`t3`.`date_problem_reported`) AS `_col_0`  \n}\nMATCH (`t1`:`problems`)-[staff_involvement_0:staff_involvement]->(`t2`:`staff`)\nWHERE `t1`.`reported_by_staff_id` = `t2`.`staff_id`\nAND (`t1`.`date_problem_reported` < `_col_0`)\nRETURN `t1`.`problem_id` AS `problem_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of the problems reported before the date of any problem reported by Lysanne Turcotte?",
    "evidence": "",
    "idx": 5648
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "CALL(*) {\nMATCH (`t3`:`problems`)-[staff_involvement_1:staff_involvement]->(`t4`:`staff`)\nWHERE `t3`.`reported_by_staff_id` = `t4`.`staff_id`\nAND (`t4`.`staff_first_name` = 'Rylan' AND `t4`.`staff_last_name` = 'Homenick')\nRETURN MAX(`t3`.`date_problem_reported`) AS `_col_0`  \n}\nMATCH (`t1`:`problems`)-[staff_involvement_0:staff_involvement]->(`t2`:`staff`)\nWHERE `t1`.`reported_by_staff_id` = `t2`.`staff_id`\nAND (`t1`.`date_problem_reported` > `_col_0`)\nRETURN `t1`.`problem_id` AS `problem_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of the problems reported after the date of any problems reported by Rylan Homenick?",
    "evidence": "",
    "idx": 5650
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t1`:`problems`)-[for_product_0:for_product]->(`t2`:`product`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t2`.`product_name` = 'voluptatem' AND `t1`.`date_problem_reported` > '1995')\nRETURN `t1`.`problem_id` AS `problem_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the ids of the problems from the product \"voluptatem\" that are reported after 1995?",
    "evidence": "",
    "idx": 5652
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_software_problems",
    "gql_statement": "MATCH (`t1`:`problems`)-[for_product_0:for_product]->(`t2`:`product`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t2`.`product_name` = 'voluptatem' AND `t1`.`date_problem_reported` > '1995')\nRETURN `t1`.`problem_id` AS `problem_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of the problems that are from the product \"voluptatem\" and are reported after 1995?",
    "evidence": "",
    "idx": 5653
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "CALL(*) {\nMATCH (`branch_sub0`:`branch`)\nRETURN avg(toFloat(`branch_sub0`.`membership_amount`)) AS `_col_0_1`  \n}\nMATCH (`branch`:`branch`)\nWHERE `branch`.`membership_amount` > `_col_0_1`\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many branches where have more than average number of memberships are there?",
    "evidence": "",
    "idx": 5654
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "CALL(*) {\nMATCH (`branch_sub0`:`branch`)\nRETURN avg(toFloat(`branch_sub0`.`membership_amount`)) AS `_col_0_1`  \n}\nMATCH (`branch`:`branch`)\nWHERE `branch`.`membership_amount` > `_col_0_1`\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of branches that have more than the average number of memberships?",
    "evidence": "",
    "idx": 5655
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`branch`:`branch`)\nORDER BY `branch`.`open_year` IS NULL DESC, `branch`.`open_year`  \nRETURN `branch`.`name` AS `name`, `branch`.`address_road` AS `address_road`, `branch`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show name, address road, and city for all branches sorted by open year.",
    "evidence": "",
    "idx": 5656
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`branch`:`branch`)\nWHERE `branch`.`membership_amount` >= '100'\nRETURN DISTINCT `branch`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all distinct city where branches with at least 100 memberships are located.",
    "evidence": "",
    "idx": 5660
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`branch`:`branch`)\nWITH `branch`.`open_year` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `open_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all open years when at least two shops are opened.",
    "evidence": "",
    "idx": 5662
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`branch`:`branch`)\nWHERE `branch`.`open_year` = '2011' OR `branch`.`city` = 'London'\nRETURN min(`branch`.`membership_amount`) AS `_col_0`, MAX(`branch`.`membership_amount`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show minimum and maximum amount of memberships for all branches opened in 2011 or located at city London.",
    "evidence": "",
    "idx": 5664
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`branch`:`branch`)\nWHERE `branch`.`open_year` < '2010'\nWITH `branch`.`city` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `city`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the city and the number of branches opened before 2010 for each city.",
    "evidence": "",
    "idx": 5666
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`member`:`member`)\nORDER BY `member`.`level` IS NULL ASC, `member`.`level` DESC \nRETURN `member`.`card_number` AS `card_number`, `member`.`name` AS `name`, `member`.`hometown` AS `hometown`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show card number, name, and hometown for all members in a descending order of level.",
    "evidence": "",
    "idx": 5670
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`t3`:`member`)-[t1:associated_with]->(`t2`:`branch`)\nWHERE `t1`.`branch_id` = `t2`.`branch_id`\nAND `t1`.`member_id` = `t3`.`member_id`\nORDER BY `t1`.`register_year` IS NULL DESC, `t1`.`register_year`  \nRETURN `t3`.`name` AS `name`, `t2`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all member names and registered branch names sorted by register year.",
    "evidence": "",
    "idx": 5672
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`t3`:`member`)-[t1:associated_with]->(`t2`:`branch`)\nWHERE `t1`.`branch_id` = `t2`.`branch_id`\nAND `t1`.`member_id` = `t3`.`member_id`\nORDER BY `t1`.`register_year` IS NULL DESC, `t1`.`register_year`  \nRETURN `t3`.`name` AS `name`, `t2`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the members and branches at which they are registered sorted by year of registration?",
    "evidence": "",
    "idx": 5673
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[membership_register_branch_sub0:associated_with]->()\nRETURN `membership_register_branch_sub0`.`member_id` AS `member_id`   } AS in_collect_0\nMATCH (`member`:`member`)\nWHERE NOT `member`.`member_id` IN in_collect_0\nRETURN `member`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show member names without any registered branch.",
    "evidence": "",
    "idx": 5674
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[membership_register_branch_sub0:associated_with]->()\nRETURN `membership_register_branch_sub0`.`branch_id` AS `branch_id`   } AS in_collect_0\nMATCH (`branch`:`branch`)\nWHERE NOT `branch`.`branch_id` IN in_collect_0\nRETURN `branch`.`name` AS `name`, `branch`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the branch name and city without any registered members.",
    "evidence": "",
    "idx": 5676
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`t2`:`member`)-[t1:associated_with]->()\nWHERE `t1`.`member_id` = `t2`.`member_id`\nAND (`t1`.`register_year` = '2016')\nRETURN `t2`.`name` AS `name`, `t2`.`hometown` AS `hometown`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the member name and hometown who registered a branch in 2016.",
    "evidence": "",
    "idx": 5678
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`branch`:`branch`)\nWHERE `branch`.`open_year` = '2001' AND `branch`.`membership_amount` > '100'\nRETURN `branch`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all city with a branch opened in 2001 and a branch with more than 100 membership.",
    "evidence": "",
    "idx": 5680
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH ()-[t1:associated_with]->(`t2`:`branch`)\nWHERE `t1`.`branch_id` = `t2`.`branch_id`\nAND (`t2`.`city` = 'London' AND `t1`.`year` = '2018')\nRETURN sum(`t1`.`total_pounds`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the sum of total pounds of purchase in year 2018 for all branches in London?",
    "evidence": "",
    "idx": 5682
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH ()-[t1:associated_with]->(`t2`:`branch`)\nWHERE `t1`.`branch_id` = `t2`.`branch_id`\nAND (`t2`.`city` = 'London' AND `t1`.`year` = '2018')\nRETURN sum(`t1`.`total_pounds`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many total pounds were purchased in the year 2018 at all London branches?",
    "evidence": "",
    "idx": 5683
  },
  {
    "filename": "train_spider.json",
    "db_id": "shop_membership",
    "gql_statement": "MATCH (`member`:`member`)\nWHERE `member`.`hometown` =~ '(?i)(?s).*Kentucky.*'\nRETURN `member`.`card_number` AS `card_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list the card number of all members whose hometown address includes word \"Kentucky\".",
    "evidence": "",
    "idx": 5686
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students in total.",
    "evidence": "",
    "idx": 5688
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN MAX(`student`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the maximum age of all the students.",
    "evidence": "",
    "idx": 5694
  }
]