[
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`draft`)\nMATCH (t2@`awards_players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`award` = 'Rookie of the Year' AND t1.`draftyear` = 1971 AND t1.`draftround` = 2)\nRETURN t1.`playerid` AS `playerid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which player selected by Portland in 2nd draftRound won Rookie of the Year in 1971?",
    "evidence": "2nd draftRound refers to draftRound = 2; won Rookie of the Year refers to award = 'Rookie of the Year'; in 1971 refers to draftYear = 1971",
    "idx": 1420
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`season_id` = 1973 AND t1.`race` = 'B')\nRETURN COUNT(DISTINCT t1.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many All Star players who played in the 1973 season were black?",
    "evidence": "1973 season refers to season_id = 1973; black refers to race = 'B'",
    "idx": 1421
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`teams`)\nMATCH ()-[t1:`beat_1`]->()\nWHERE t1.`tmidwinner` = t2.`tmid`\nAND (t1.`year` = 1947 AND t1.`round` = 'QF' AND t2.`d_pts` = 3513)\nRETURN t2.`tmid` AS `tmid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which winning team in the 1947 playoff quarterfinals managed to score 3,513 defensive points that same year?",
    "evidence": "team refers to tmID; quarterfinal refers to round = 'QF'; score 3,513 defensive points refers to d_pts > = 3513",
    "idx": 1422
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players`)\nMATCH (t2@`players_teams`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`tmid` = 'LAL' AND t2.`year` >= 1975 AND t2.`year` <= 1980 AND t1.`playerid` = 'abdulka01')\nRETURN COUNT(DISTINCT t2.`year`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times between 1975 and 1980 did the player abdulka01 play for LAL?",
    "evidence": "between 1975 and 1980 refers to year between 1975 and 1980; player abdulka01 refers to playerID = 'abdulka01'; play for LAL refers to tmID = 'LAL'",
    "idx": 1425
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`awards_players`)-[awarded_to_1_0:`awarded_to_1`]->(t2@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`year` = 2010 AND t2.`hscity` = 'Chicago')\nRETURN COUNT(t1.`award`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many awards were given out in 2010 to players who attended high school in Chicago?",
    "evidence": "in 2010 refers to year = 2010; attended high school in Chicago refers to college = 'Chicago'",
    "idx": 1428
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`awards_players`)-[awarded_to_1_0:`awarded_to_1`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`year` = 1990 AND t2.`award` = 'Finals MVP')\nRETURN t1.`college` AS `college`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the university that was drafted from the player who won the NBA Finals MVP in 1990?",
    "evidence": "name of the university refers to highSchool; NBA refers to lgID = 'NBA'; Finals MVP refers to award = 'Finals MVP'; in 1990 refers to year = 1990",
    "idx": 1431
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`awards_coaches`)\nMATCH (t1@`coaches`)\nWHERE t1.`coachid` = t2.`coachid`\nAND (t1.`tmid` = 'CHI' AND t2.`award` = 'NBA Coach of the Year')\nRETURN COUNT(DISTINCT t2.`coachid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times have coaches who were from CHI been awarded as NBA Coach of the Year?",
    "evidence": "CHI refers to tmID = 'CHI'; awarded Coach of the Year refers to award = 'Coach of the Year'; NBA refers to lgID = 'NBA'",
    "idx": 1434
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players`)\nMATCH (t2@`players_teams`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`birthcity` = 'Atlanta')\nORDER BY t2.`blocks` DESC NULLS LAST \nRETURN t1.`firstname` AS `firstname`, t1.`lastname` AS `lastname`, t2.`tmid` AS `tmid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Find the full name of the player born in Atlanta and have the highest number of blocks. Also, in which team did this player perform the most number of blocks?",
    "evidence": "full name refers to first_name, middle_name, last_name; born in Atlanta refers to birthCity = 'Atlanta'; the highest number of blocks refers to max(blocks); team refers to tmID",
    "idx": 1436
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`teams`)\nMATCH ()-[t2:`beat_1`]->()\nWHERE t1.`tmid` = t2.`tmidloser` AND t1.`year` = t2.`year`\nAND (t1.`rank` < 5 AND t2.`lgidloser` > '2' AND t2.`year` >= 1980 AND t2.`year` <= 2000)\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "State the name of teams ranked first five or more times and lost a league two or more times between 1980 and 2000?",
    "evidence": "name of team refers to teams.name; between 1980 and 2000 refers to year between 1980 and 2000; ranked first five or more times refers to count(rank = 1) > = 5; lost a league two or more times refers to lost > 2",
    "idx": 1437
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (players_teams@`players_teams`)\nWHERE players_teams.`year` >= 1991 AND players_teams.`year` <= 2000\nORDER BY cast (players_teams.`points` as float) / players_teams.`minutes` DESC NULLS LAST \nRETURN players_teams.`tmid` AS `tmid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Player from which team has the highest point per minute in NBA from 1991 to 2000?",
    "evidence": "team refers to tmID; the highest point per minute refers to max(divide(points, minutes)); NBA refers to lgID = 'NBA'; from 1991 to 2000 refers to year BETWEEN 1991 AND 2000",
    "idx": 1438
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`draft`)\nMATCH (t2@`player_allstar`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`draftyear` = 1996 AND t1.`draftround` = 1)\nRETURN COUNT(t2.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many first round draft player in 1996 NBA draft became an All-Star?",
    "evidence": "first round refers to round = 1; in 1996 refers to year = 1996; NBA refers to lgID = 'NBA'",
    "idx": 1440
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`awards_players`)\nMATCH (t1@`players_teams`)-[for_team_0:`for_team`]->(t3@`teams`)\nWHERE t1.`playerid` = t2.`playerid`\nAND t1.`tmid` = t3.`tmid` AND t1.`year` = t3.`year`\nAND (t2.`year` = 1997 AND t2.`award` = 'Finals MVP')\nRETURN DISTINCT t3.`tmid` AS `tmid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which team did the MVP of 1997 NBA season play in?",
    "evidence": "team refers to tmID; MVP refers to award like '%MVP'; 1997 refers to year = 1997; NBA refers to lgID = 'NBA'",
    "idx": 1441
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`teams`)\nMATCH ()-[t2:`beat_1`]->()\nWHERE t1.`tmid` = t2.`tmidloser` AND t1.`year` = t2.`year`\nAND (t2.`year` = 2001)\nORDER BY t1.`o_fgm` DESC NULLS LAST \nRETURN t2.`w` AS `w` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many games did team of the scoring champion win in 2001 NBA season?",
    "evidence": "the scoring champion refers to max(won); 2001 refers to year = 2001; NBA refers to lgID = 'NBA'",
    "idx": 1442
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`player_allstar`)\nMATCH (t2@`awards_players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`first_name` = 'Ray' AND t1.`last_name` = 'Allen')\nRETURN COUNT(t1.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of NBA titles that Ray Allen has won throughout his NBA career?",
    "evidence": "NBA refers to lgID = 'NBA'",
    "idx": 1443
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`draft`)\nMATCH (t1@`teams`)\nWHERE t1.`tmid` = t2.`tmid`\nAND (t2.`draftround` = 1 AND t2.`draftyear` = 2003)\nRETURN (cast (sum(CASE  WHEN t1.`year` = 2004 THEN t1.`won` ELSE 0 END) as float) / sum(CASE  WHEN t1.`year` = 2004 THEN t1.`won` + t1.`lost` ELSE 0 END)) - (cast (sum(CASE  WHEN t1.`year` = 2003 THEN t1.`won` ELSE 0 END) as float) / sum(CASE  WHEN t1.`year` = 2003 THEN t1.`won` + t1.`lost` ELSE 0 END)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much did the win rate increase for the team after getting the No.1 NBA draft pick in the 2003 season than previous season?",
    "evidence": "No.1 draft pick refers to draftRound = 1; in the 2003 season refers to draftyear = 2003; increase = subtract(divide(sum(won), add(sum(won), sum(lost))) where draftyear = 2004, divide(sum(won), add(sum(won), sum(lost))) where draftyear = 2003)",
    "idx": 1444
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`teams`)\nMATCH (t1@`awards_coaches`)\nWHERE t1.`year` = t2.`year`\nAND (t1.`year` >= 1971 AND t1.`year` <= 1975 AND t1.`award` = 'NBA Coach of the Year' AND t2.`tmid` = 'POR')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the coaches who won the 'NBA coach of the year' award from 1971 - 1975, how many of them were in 'POR' team?",
    "evidence": "the 'NBA coach of the year' award refers to award = 'NBA coach of the year'; from 1971 - 1975 refers to year between 1971 and 1975; 'POR' team refers to tmID = 'POR'",
    "idx": 1445
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players`)\nMATCH (t2@`players_teams`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`year` = 1996 AND t2.`postgp` = 0)\nORDER BY t2.`steals` DESC NULLS LAST \nRETURN t1.`playerid` AS `playerid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the name of the player in 1996 who had the most steals that didn't play in the playoffs?",
    "evidence": "name of the player refers to first_name, middle_name, last_name; in 1996 refers to year = 1996; the most steals refers to max(steals); didn't play in the playoffs refers to playoff = null",
    "idx": 1447
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players_teams`)-[for_team_0:`for_team`]->(t2@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`year`\nAND (t1.`postgp` = 0 AND t1.`year` = 2000)\nORDER BY cast (t2.`won` as float) / (t2.`won` + t2.`lost`) DESC NULLS LAST \nRETURN t2.`tmid` AS `tmid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which NBA team that didn't play in playoffs had the most winning rate in the 2000 NBA regular season?",
    "evidence": "NBA refers to lgID = 'NBA'; didn't play in the playoffs refers to PostGP = 0; 2000 refers to year = 2000; the most winning rate refers to max(divide(won, add(won, lost)))",
    "idx": 1449
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players_teams`)-[for_team_0:`for_team`]->(t2@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`year`\nAND (t1.`year` = 1998 AND t1.`postgp` = 0)\nORDER BY t1.`points` DESC NULLS LAST \nRETURN t2.`tmid` AS `tmid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which non-playoffs team had the most points in the regular season in the year 1998?",
    "evidence": "non-playoff refers to PostGP = 0; in the year 1998 refers to year = 1998; the most points refers to max(o_pts)",
    "idx": 1450
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players_teams`)-[for_team_0:`for_team`]->(t2@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`year`\nAND (t1.`postgp` = 0)\nORDER BY t2.`won` DESC NULLS LAST \nRETURN t2.`tmid` AS `tmid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the full name of the team that won the most games in 2001 but didn't make the playoffs?",
    "evidence": "full name of the team refers to teams.name; in 2001 refers to year = 2001; didn't make the playoffs refers to PostGP = 0; won the most games refers to max(won)",
    "idx": 1451
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players_teams`)-[for_team_0:`for_team`]->(t2@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`year`\nAND (t1.`postgp` = 0 AND t1.`year` = 1997)\nORDER BY t1.`rebounds` DESC NULLS LAST \nRETURN t2.`tmid` AS `tmid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which team that didn't play in playoffs had the most total rebounds in the year 1997?",
    "evidence": "didn't play in playoffs refers to PostGP = 0; in the year 1997 refers to year = 1997; the most total rebounds refers to max(o_tmRebound)",
    "idx": 1452
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`draft`)-[drafted_by_0:`drafted_by`]->(t2@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`draftyear` = t2.`year`\nAND (t1.`draftround` = 1 AND t1.`draftselection` = 6 AND t1.`draftyear` = 1976)\nRETURN t2.`tmid` AS `tmid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the player who was drafted in the 1st round, 6th position in 1976, which team did he play in that year?",
    "evidence": "drafted in the 1st round refers to draftRound = 1; 6th position refers to draftSelection = 6; in 1976 refers to year = 1976; team refers to tmID",
    "idx": 1453
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`draft`)-[drafted_by_0:`drafted_by`]->(t2@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`draftyear` = t2.`year`\nAND (t1.`draftround` = 1 AND t1.`draftselection` = 12 AND t1.`draftyear` = 1998)\nRETURN t2.`homewon` AS `homewon`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the year 1998, how many home wins did the team which had the 1st round, 12th pick have that year?",
    "evidence": "in 1998 refers to year = 1998; 1st round refers to draftRound = 1; 12th pick refers to draftSelection = 12; home win refers to homeWon",
    "idx": 1454
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nORDER BY t2.`rebounds` DESC NULLS LAST \nRETURN t1.`weight` AS `weight`, t1.`height` AS `height` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the player who had the most rebounds throughout his allstar appearances, what was his weight and height?",
    "evidence": "the most rebounds refers to max(rebounds)",
    "idx": 1455
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`player_allstar`)-[for_player_0:`for_player`]->(t2@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nORDER BY t1.`rebounds` DESC NULLS LAST \nRETURN t2.`highschool` AS `highschool` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Where was the high school of the player who had the most rebounds in the NBA allstar history?",
    "evidence": "the most rebounds refers to max(rebounds)",
    "idx": 1456
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t3@`players`)\nMATCH (t2@`players_teams`)-[for_team_0:`for_team`]->(t1@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`year`\nAND t2.`playerid` = t3.`playerid`\nAND (t3.`pos` = 'F-G' AND t2.`lgid` = 'NBA')\nORDER BY t3.`birthdate` DESC NULLS LAST \nRETURN t1.`tmid` AS `tmid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which team did the youngest player who could be in F-G position play in the NBA?",
    "evidence": "team refers to tmID; the youngest refers to max(year); F-G position refers to pos like '%F'; NBA refers to lgID = 'NBA'",
    "idx": 1458
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (works@`works`)\nWHERE works.`date` < 1602\nRETURN COUNT(works.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of Shakespeare's works were finished before the year 1602?",
    "evidence": "finished before the year 1602 refers to Date < 1602",
    "idx": 1462
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t2.`act` = 1 AND t1.`title` = 'Twelfth Night')\nRETURN COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many scenes are there in Act 1 in Twelfth Night?",
    "evidence": "Twelfth Night refers to Title = 'Twelfth Night'",
    "idx": 1463
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t1.`title` = 'Twelfth Night' AND t2.`act` = 1 AND t2.`scene` = 2)\nRETURN t2.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the description of Act 1, Scene 2 in Twelfth Night?",
    "evidence": "Twelfth Night refers to Title = 'Twelfth Night'",
    "idx": 1464
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t1.`title` = 'Twelfth Night')\nRETURN sum(CASE WHEN t2.`act` = 1 THEN 1 ELSE 0 END) - sum(CASE WHEN t2.`act` = 5 THEN 1 ELSE 0 END) AS `more`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many more scenes are there in Act 1 than in Act 5 in Twelfth Night?",
    "evidence": "in Twelfth Night refers to Title = 'Twelfth Night'; How many more scenes = subtract(sum(Act = 1), sum(Act = 5))",
    "idx": 1465
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`paragraphs`)\nMATCH (t2@`characters`)\nWHERE t1.`character_id` = t2.`id`\nAND (t2.`charname` = 'Lord Abergavenny')\nRETURN sum(t1.`paragraphnum`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many paragraphs contain the character Lord Abergavenny?",
    "evidence": "Lord Abergavenny refers to CharName = 'Lord Abergavenny'",
    "idx": 1466
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t2.`description` = 'OLIVIA’S house.' AND t1.`title` = 'Twelfth Night')\nRETURN COUNT(t2.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For how many times has the scene \"OLIVIA’S house.\" appeared in Twelfth Night?",
    "evidence": "\"OLIVIA’S house.\"  refers to chapters.Description = 'OLIVIA’S house.'; Twelfth Night refers to Title = 'Twelfth Night'",
    "idx": 1468
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t1.`title` = 'Twelfth Night')\nRETURN sum(t2.`scene`) / COUNT(t2.`act`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many scenes are there on average in one act in Twelfth Night?",
    "evidence": "Twelfth Night refers to Title = 'Twelfth Night'; average scene = divide(sum(Scene), count(Act))",
    "idx": 1469
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (works@`works`)\nWHERE works.`genretype` = 'Comedy'\nRETURN COUNT(works.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many comedies did Shakespeare create?",
    "evidence": "comedies refers to GenreType = 'Comedy'",
    "idx": 1470
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (works@`works`)\nWHERE works.`genretype` = 'Poem'\nRETURN min(works.`date`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did Shakespeare write the first poem?",
    "evidence": "first poem refers to GenreType = 'Poem' and Date = 'min'",
    "idx": 1471
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t1.`title` = 'King John')\nRETURN COUNT(t2.`scene`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many scenes are there in King John?",
    "evidence": "King John refers to Title = 'King John'",
    "idx": 1475
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t2@`paragraphs`)\nMATCH (t1@`characters`)\nWHERE t1.`id` = t2.`character_id`\nAND (t1.`charname` = 'Demetrius')\nRETURN COUNT(DISTINCT t2.`chapter_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many chapters does the character Demetrius show in the story?",
    "evidence": "character Demetrius refers to CharName = 'Demetrius'",
    "idx": 1476
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (characters@`characters`)\nWHERE characters.`description` = 'servant to Timon'\nRETURN COUNT(characters.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many \"servant to Timon\" characters are there?",
    "evidence": "servant to Timon refers to characters.Description = 'servant to Timon'",
    "idx": 1478
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "CALL {\nMATCH (works_sub0@`works`)\nRETURN min(works_sub0.`date`) AS `_col_0` \n}\nMATCH (works@`works`)\nWHERE works.`date` = _col_0\nRETURN works.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the first ever work of William Shakespeare?",
    "evidence": "first ever work refers to min(Date)",
    "idx": 1479
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (works@`works`)\nWHERE works.`genretype` = 'Poem'\nRETURN COUNT(works.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many poems did Shakespeare write?",
    "evidence": "poems refers to GenreType = 'Poem'",
    "idx": 1480
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (chapters@`chapters`)\nWHERE chapters.`work_id` = 7 AND chapters.`act` = 1\nRETURN COUNT(chapters.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many scenes are there in work id 7, act 1?",
    "evidence": "",
    "idx": 1481
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (works@`works`)\nWHERE works.`genretype` = 'Tragedy' AND works.`date` >= 1500 AND works.`date` <= 1599\nRETURN COUNT(works.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In the year 1500s, how many tragedies did Shakespeare write?",
    "evidence": "year 1500s refers to Date between 1500 and 1599; tragedies refers to GenreType = 'Tragedy'",
    "idx": 1482
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (characters@`characters`)\nWHERE characters.`description` = 'Daughter to Capulet'\nRETURN characters.`charname` AS `charname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the daughter of Capulet?",
    "evidence": "daughter of Capulet refers to characters.Description = 'Daughter to Capulet'",
    "idx": 1483
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`chapters`)\nMATCH (t2@`works`)\nWHERE t1.`work_id` = t2.`id`\nAND (t1.`act` = 1)\nORDER BY t1.`scene` DESC NULLS LAST \nRETURN t2.`longtitle` AS `longtitle` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the long title of the work with the highest number of scenes in act 1?",
    "evidence": "highest number of scenes refers to max(count(Scene))",
    "idx": 1485
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`paragraphs`)\nMATCH (t2@`chapters`)\nWHERE t1.`chapter_id` = t2.`id`\nORDER BY t1.`paragraphnum` DESC NULLS LAST \nRETURN t2.`description` AS `description` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the description of the chapter with the longest number of paragraphs?",
    "evidence": "chapter with the longest number of paragraphs refers to max(ParagraphNum)",
    "idx": 1486
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t1.`longtitle` = 'Twelfth Night, Or What You Will' AND t2.`scene` = 2 AND t2.`act` = 2)\nRETURN t2.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In \"Twelfth Night, Or What You Will\", what is the description of the chapter in 2nd scene, Act 2?",
    "evidence": "\"Twelfth Night, Or What You Will\"  refers to LongTitle = 'Twelfth Night, Or What You Will'; 2nd scene refers to Scene = 2",
    "idx": 1487
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`paragraphs`)\nMATCH (t2@`chapters`)\nWHERE t1.`chapter_id` = t2.`id`\nAND (t1.`paragraphnum` < 150)\nRETURN DISTINCT t2.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the descriptions of the short chapters?",
    "evidence": "short chapters refers to ParagraphNum < 150",
    "idx": 1488
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`paragraphs`)\nMATCH (t2@`chapters`)\nWHERE t1.`chapter_id` = t2.`id`\nAND (t2.`act` = 1)\nORDER BY t2.`scene` DESC NULLS LAST \nRETURN t1.`paragraphnum` AS `paragraphnum` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many paragraphs are there in the chapter with the highest amount of scenes in act 1?",
    "evidence": "How many paragraphs refers to ParagraphNum; highest amount of scenes refers to max(count(Scene))",
    "idx": 1490
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t2.`act` = 1 AND t2.`scene` < 2 AND t1.`genretype` = 'History')\nRETURN COUNT(DISTINCT t2.`work_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the history works written by Shakespeare, how many works whose 1st acts have no more than 2 scenes?",
    "evidence": "history refers to GenreType = 'History' ; 1st acts  refers to Act = 1; no more than 2 scenes refers to count(Scene) < 2",
    "idx": 1493
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t1.`title` = 'Sonnets')\nRETURN sum(DISTINCT t2.`act`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many acts are there in Sonnets?",
    "evidence": "Sonnets refers to Title = 'Sonnets'",
    "idx": 1494
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t2.`act` = 1)\nRETURN DISTINCT t1.`title` AS `title`, t1.`genretype` AS `genretype`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the titles and genres of the one-act works of Shakespeare?",
    "evidence": "one-act works refers to count(Act) = 1; genre refers to GenreType\n",
    "idx": 1495
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t2@`paragraphs`)\nMATCH (t1@`characters`)\nWHERE t1.`id` = t2.`character_id`\nAND (t1.`charname` = 'Sir Richard Ratcliff')\nRETURN MAX(t2.`paragraphnum`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many paragraphs are there in the longest chapter where Sir Richard Ratcliff appeared?",
    "evidence": "longest chapter refers to max(ParagraphNum); Sir Richard Ratcliff  refers to CharName = 'Sir Richard Ratcliff'",
    "idx": 1496
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t2.`act` = 1 AND t2.`scene` = 1 AND t1.`title` = 'A Lover\\'s Complaint')\nRETURN t2.`description` AS `description`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In \"A Lover's Complaint\", what is the description of Act 1, Scene 1?",
    "evidence": "\"A Lover's Complaint\" refers to Title = 'A Lover''s Complaint'",
    "idx": 1497
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t2.`scene` = 154)\nRETURN t1.`date` AS `date`, t1.`id` AS `id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "When did Shakespeare create his work that has 154 scenes?",
    "evidence": "When refers to Date; has 154 scenes refers to count(Scene) = 154",
    "idx": 1498
  },
  {
    "filename": "train.json",
    "db_id": "shakespeare",
    "gql_statement": "MATCH (t1@`works`)\nMATCH (t2@`chapters`)\nWHERE t1.`id` = t2.`work_id`\nAND (t1.`genretype` = 'Comedy')\nRETURN cast (sum(t2.`scene`) as float) / COUNT(t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On average, how many scenes are there in each of the comedy works written by Shakespeare?",
    "evidence": "comedy refers to GenreType = 'Comedy'; average = divide(sum(count(Scene)), count(work.id))",
    "idx": 1499
  }
]