[
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`year` = 1961 AND `t2`.`region` = 'Latin America & Caribbean' AND `t1`.`indicatorname` = 'Agricultural land (% of land area)')\nRETURN CASE WHEN COUNT(`t2`.`countrycode`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`value` > 50 THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`countrycode`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What portion of the nations in Latin America and the Caribbean had more than 50% of their land used for agriculture in 1961?",
    "evidence": "portion = divide(count(CountryName where Year = '1961' and Value>50), count(CountryName))*100%; nations in Latin America and the Caribbean refers to region = 'Latin America & Caribbean';  more than 50% of their land used for agriculture refers to value where indicatorname = 'Agricultural land (% of land area)'>50; in 1961 refers to Year = '1961'",
    "idx": 1597
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`incomegroup` = 'Low income' AND `country`.`region` = 'South Asia'\nRETURN `country`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the full names of the countries in South Asia that belongs to the low income group?",
    "evidence": "full name refers to longname; the countries in South Asia refer to region = 'South Asia'; belongs to the low income group refers to incomegroup = 'Low income'",
    "idx": 1598
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`countryname` = 'Brazil' AND `indicators`.`indicatorname` = 'Mobile cellular subscriptions'\nRETURN DISTINCT `indicators`.`indicatorcode` AS `indicatorcode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the indicator code for Mobile Cellular Subscriptions of Brazil?",
    "evidence": "Mobile Cellular Subscriptions refers to indicatorname = 'Mobile cellular subscriptions'; Brazil refers to CountryName = 'Brazil'",
    "idx": 1599
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`region` = 'Europe & Central Asia' AND `country`.`currencyunit` = 'Danish krone'\nRETURN COUNT(`country`.`longname`) AS `_col_0`   \nUNION DISTINCT\nMATCH (`country`:`country`)\nWHERE `country`.`currencyunit` = 'Danish krone' AND `country`.`region` = 'Europe & Central Asia'\nRETURN `country`.`longname` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries in Europe & Central Asia uses Danish krone as its currency? List the full names of those coutnries.",
    "evidence": "countries in Europe & Central Asia refer to region = 'Europe & Central Asia'; uses Danish krone refers to currencyunit = 'Danish krone'; full name refers to longname",
    "idx": 1600
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`indicatorname` = 'Rural population (% of total population)'\nRETURN `indicators`.`countryname` AS `countryname`, MAX(`indicators`.`value`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the country with the highest percentage of rural population in the overall total population? Indicate the rural population percentage of total population.",
    "evidence": "the highest percentage of rural population in the overall total population refers to max(value where indicatorname = 'Rural population (% of total population)')",
    "idx": 1601
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`latestpopulationcensus` = '2011'\nRETURN COUNT(`country`.`longname`) AS `_col_0`   \nUNION ALL\nMATCH (`country`:`country`)\nWHERE `country`.`latestpopulationcensus` = '2011'\nRETURN `country`.`longname` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries have a latest population census in 2011? Indicate their full names.",
    "evidence": "have a latest population census in 2011 refers to LatestPopulationCensus = '2011'; full name refers to LongName",
    "idx": 1602
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`indicators`:`indicators`)\nWHERE `indicators`.`indicatorname` = 'Agricultural land (sq. km)' AND `indicators`.`year` = 1968 AND `indicators`.`countryname` = 'Italy'\nRETURN `indicators`.`value` AS `value`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the agricultural land area in sq. km of Italy in 1968?",
    "evidence": "agricultural land area in sq. km refers value where indicatorname = 'Agricultural land (sq. km)'; Italy refers to countryname = 'Italy'; in 1968 refers to year = '1968'",
    "idx": 1603
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`region` = 'Sub-Saharan Africa' AND `t1`.`indicatorname` = 'Out-of-school children of primary school age, female (number)')\nRETURN MAX(`t1`.`value`) AS `_col_0`, `t1`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In Sub-Saharan Africa, how many female out-of-school children of primary school age are there in the country with the higest number of female out-of-school children of primary school age? Indicate the year of when it was recorded.",
    "evidence": "in Sub-Saharan Africa refers to Region = 'Sub-Saharan Africa'; the higest number of female out-of-school children of primary school age refers to max(value where IndicatorName = 'Out-of-school children of primary school age, female (number)')",
    "idx": 1604
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nMATCH ()-[t3:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND `t2`.`countrycode` = `t3`.`countrycode`\nAND (`t2`.`indicatorname` = 'Number of infant deaths' AND `t1`.`longname` = 'Islamic State of Afghanistan' AND `t2`.`year` = 1965)\nRETURN DISTINCT `t3`.`seriescode` AS `seriescode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the series code for number of infant deaths in year 1965 for the country whose full name is Islamic State of Afghanistan?",
    "evidence": "number of infant deaths refers to IndicatorName = 'Number of infant deaths'; in year 1965 refers to Year = '1965'; full name is Islamic State of Afghanistan refers to LongName = 'Islamic State of Afghanistan'",
    "idx": 1605
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`region` = 'Middle East & North Africa' AND `t2`.`systemofnationalaccounts` = 'Country uses the 1968 System of National Accounts methodology.' AND `t1`.`indicatorname` = 'CO2 emissions FROM solid fuel consumption (kt)')\nRETURN COUNT(DISTINCT `t1`.`countrycode`) AS `_col_0`   \nUNION DISTINCT\nCALL (*) {\nMATCH (`t2_sub0`:`country`)-[has_indicator_2:has_indicator]->(`t1_sub0`:`indicators`)\nWHERE `t1_sub0`.`countrycode` = `t2_sub0`.`countrycode`\nAND (`t2_sub0`.`region` = 'Middle East & North Africa' AND `t2_sub0`.`systemofnationalaccounts` = 'Country uses the 1968 System of National Accounts methodology.' AND `t1_sub0`.`indicatorname` = 'CO2 emissions FROM solid fuel consumption (kt)')\nWITH `t1_sub0`.`countryname` AS _groupby_col_0, sum(`t1_sub0`.`value`) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `countryname`  LIMIT 1\n}\nWITH *\nRETURN `countryname` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the countries who uses the 1968 System of National Accounts methodology, how many are in the Middle East & North Africa? Name the country with the highest CO2 emissions from solid fuel consumption in kiloton.",
    "evidence": "uses the 1968 System of National Accounts methodology refers to SystemOfNationalAccounts = '1968 System of National Accounts methodology'; in the Middle East & North Africa refers to Region = 'Middle East & North Africa'; the highest CO2 emissions from solid fuel consumption in kiloton refers to max(value where IndicatorName = 'CO2 emissions from solid fuel consumption (kt)')",
    "idx": 1606
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`year` = 1960 AND `t2`.`longname` = 'Republic of Albania')\nRETURN DISTINCT `t1`.`indicatorcode` AS `indicatorcode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the indicator codes for the Republic of Albania in the year 1960?",
    "evidence": "the Republic of Albania refers to LongName = 'Republic of Albania'; in the year 1960 refers to Year = '1960'",
    "idx": 1607
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`indicatorname` = 'Cereal production (metric tons)' AND `t2`.`value` = 6140000 AND `t2`.`year` = 1966)\nRETURN `t1`.`lendingcategory` AS `lendingcategory`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the lending category of the country with a cereal production of 6140000 metric tons for the year 1966?",
    "evidence": "cereal production of 6140000 metric tons refers value where IndicatorName = 'Cereal production (metric tons)'> 6140000; the year 1966 refers to Year = '1966'",
    "idx": 1608
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`indicatorname` = 'Population in largest city' AND `t1`.`year` >= 1960 AND `t1`.`year` < 1980)\nRETURN `t2`.`countrycode` AS `countrycode`, `t2`.`region` AS `region` ORDER BY `t2`.`region` IS NULL ASC, `t2`.`region` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country has the highest population in largest city for 19 consecutive years starting from 1960? Indicate the region to which the country is located.",
    "evidence": "the highest population in largest city refers to max(value where IndicatorName = 'Population in largest city'); for 19 consecutive years starting from 1960 refers to Year BETWEEN'1960' and '1979'",
    "idx": 1609
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`indicatorname` = 'CO2 emissions (kt)' AND `t1`.`year` >= 1975 AND `t1`.`year` < 1981 AND `t1`.`countrycode` = 'WLD' AND `t2`.`specialnotes` = 'World aggregate.')\nRETURN sum(`t1`.`value`) AS `_col_0`, `t1`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 1975 to 1980, how much is the total amount CO2 emmission in kiloton of the the world? Indicate which year the world recorded its highest CO2 emmissions.",
    "evidence": "from 1975 to 1980 refers to Year between 1975 and 1980; the total amount CO2 emmission in kiloton of the the world refers to sum(value where IndicatorName like 'CO2%'); the world recorded its highest CO2 emmissions refers to max(value where IndicatorName like 'CO2%')",
    "idx": 1610
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`indicatorname` = 'Air transport, passengers carried' AND `t1`.`year` >= 1970 AND `t1`.`year` < 1981 AND `t1`.`countryname` = 'Bulgaria')\nRETURN avg(`t1`.`value`) AS `_col_0`, `t2`.`systemoftrade` AS `systemoftrade`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of passengers carried via air transport per year by Bulgaria between 1970 to 1980? Indicate the country's system of trade.",
    "evidence": "average number refers to avg(value); passengers carried via air transport per year refers to value where IndicatorName = 'Air transport, passengers carried'; by Bulgaria refers to CountryName = 'Bulgaria'; between 1970 to 1980 refers to Year between 1970 and 1980",
    "idx": 1611
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`shortname` = 'Angola'\nRETURN `country`.`latesthouseholdsurvey` AS `latesthouseholdsurvey`, `country`.`pppsurveyyear` AS `pppsurveyyear`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the lastest household survey in Angola and when did it take place?",
    "evidence": "in Angola refers to ShortName = 'Angola'; when refers to PppSurveyYear",
    "idx": 1612
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`vitalregistrationcomplete` = 'Yes' AND `country`.`region` = 'North America'\nRETURN COUNT(`country`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries in the North America Region has completed the vital registration?",
    "evidence": "has completed the vital registration refers to VitalRegistrationComplete = 'Yes'",
    "idx": 1613
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`alpha2code` = '1A' AND `t2`.`indicatorname` = 'Adolescent fertility rate (births per 1,000 women ages 15-19)')\nRETURN `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which years does the country whose Alpha2Code is 1A have a result of the indicator Adolescent fertility rate?",
    "evidence": "indicator Adolescent fertility rate refers to IndicatorName = 'Adolescent fertility rate (births per 1,000 women ages 15-19)'\n\n",
    "idx": 1614
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`indicatorname` = 'Arms exports (SIPRI trend indicator values)' AND `t2`.`year` = 1960 AND `t2`.`value` = 3000000)\nRETURN `t1`.`longname` AS `longname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the long name of the country that got 3000000 on the indicator Arms exports in 1960?",
    "evidence": "long name refers to CountryName; got 3000000 on the indicator Arms exports refers to value where IndicatorName = 'Arms exports (SIPRI trend indicator values)' = 3000000; in 1960 refers to Year = 1960",
    "idx": 1615
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`indicatorname` = 'Rural population' AND `t2`.`year` = 1960)\nRETURN `t1`.`alpha2code` AS `alpha2code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the Alpha2Codes of all the countries that have an indicator on Rural population in 1960.",
    "evidence": "in 1960 refers to year = '1960'",
    "idx": 1616
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "CALL(*) {\nMATCH (`indicators_sub0`:`indicators`)\nWHERE `indicators_sub0`.`indicatorname` = 'Adolescent fertility rate (births per 1,000 women ages 15-19)' AND `indicators_sub0`.`year` = 1960\nRETURN `indicators_sub0`.`value` AS `value` ORDER BY `value` IS NULL ASC, `value` DESC \nLIMIT 1\n}\nMATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`value` = `value`)\nRETURN DISTINCT `t1`.`countrycode` AS `countrycode`, `t1`.`specialnotes` AS `specialnotes`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country's indicator for Adolescent fertility rate is the highest in 1960, please give its special notes.",
    "evidence": "indicator for Adolescent fertility rate is the highest refers to max(value where IndicatorName = 'Adolescent fertility rate (births per 1,000 women ages 15-19)'); in 1960 refers to year = '1960'",
    "idx": 1617
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`country`)-[has_indicator_0:has_indicator]->(`t2_sub0`:`indicators`)\nWHERE `t1_sub0`.`countrycode` = `t2_sub0`.`countrycode`\nAND (`t1_sub0`.`alpha2code` = '1A' AND `t2_sub0`.`indicatorname` = 'Adolescent fertility rate (births per 1,000 women ages 15-19)' AND `t2_sub0`.`year` = 1961)\nRETURN `t2_sub0`.`value` AS `value`  \n}\nCALL(*) {\nMATCH (`t1_sub0`:`country`)-[has_indicator_1:has_indicator]->(`t2_sub0`:`indicators`)\nWHERE `t1_sub0`.`countrycode` = `t2_sub0`.`countrycode`\nAND (`t1_sub0`.`alpha2code` = '1A' AND `t2_sub0`.`indicatorname` = 'Adolescent fertility rate (births per 1,000 women ages 15-19)' AND `t2_sub0`.`year` = 1960)\nRETURN `t2_sub0`.`value` AS `value_1`  \n}\nWITH *\nRETURN `value` - `value_1` AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "By how much did the indicator on Adolescent fertility rate increase from 1960 to 1961 in the country whose Alpha2Code is 1A?",
    "evidence": "by how much = subtract(sum(value where Year = 1961), sum(value where Year = 1960)); indicator on Adolescent fertility rate refers to IndicatorName = 'Adolescent fertility rate (births per 1,000 women ages 15-19)%'",
    "idx": 1618
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->()\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t2`.`seriescode` = 'SP.ADO.TFRT' AND `t1`.`shortname` = 'Australia')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the note for Australia on the indicator SP.ADO.TFRT?",
    "evidence": "note refers to Description; for Australia refers to ShortName = 'Australia'; indicator SP.ADO.TFRT refers to Seriescode = 'SP.ADO.TFRT'",
    "idx": 1619
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->(`t3`:`series`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND `t2`.`seriescode` = `t3`.`seriescode`\nAND (`t1`.`shortname` = 'Aruba' AND `t3`.`topic` = 'Environment: Energy production & use')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the notes for Aruba on the indicators under the topic of Environment: Energy production & use.",
    "evidence": "note refers to Description; for Aruba refers to ShortName = 'Aruba'",
    "idx": 1620
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->(`t3`:`series`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND `t2`.`seriescode` = `t3`.`seriescode`\nAND (`t3`.`seriescode` = 'BX.KLT.DINV.CD.WD')\nRETURN `t1`.`shortname` AS `shortname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which countries have notes on the indicator BX.KLT.DINV.CD.WD?",
    "evidence": "indicator BX.KLT.DINV.CD.WD refers to Seriescode = 'BX.KLT.DINV.CD.WD'",
    "idx": 1621
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[t2:note]->(`t3`:`series`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND `t2`.`seriescode` = `t3`.`seriescode`\nAND (`t3`.`indicatorname` = 'Inflation, consumer prices (annual %)')\nRETURN `t1`.`region` AS `region`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the country that has notes on the indicator Inflation, consumer prices, in which region is it in?",
    "evidence": "indicator Inflation, consumer prices refers to IndicatorName = 'Inflation, consumer prices (annual %)'",
    "idx": 1622
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH ()-[t1:note]->(`t2`:`series`)\nWHERE `t1`.`seriescode` = `t2`.`seriescode`\nAND (`t2`.`indicatorname` = 'Stocks traded, turnover ratio of domestic shares (%)')\nRETURN COUNT(`t1`.`countrycode`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries have notes on the indicator Stocks traded, turnover ratio of domestic shares?",
    "evidence": "indicator Stocks traded, turnover ratio of domestic shares refers to IndicatorName = 'Stocks traded, turnover ratio of domestic shares (%)'",
    "idx": 1623
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`series`)\nMATCH (`t3`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`indicatorname` = `t2`.`indicatorname`\nAND `t1`.`countrycode` = `t3`.`countrycode`\nAND (`t3`.`shortname` = 'Arab World' AND `t1`.`value` = 133 AND `t1`.`year` = 1960)\nRETURN `t2`.`aggregationmethod` AS `aggregationmethod`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the agregation method for the indicator whose value is 133 in 1960 for the Arab World?",
    "evidence": "in 1960 refers to Year = 1960; for the Arab World refers to CountryName = 'Arab World'",
    "idx": 1624
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t2`:`series`)\nMATCH (`t3`:`country`)-[has_indicator_0:has_indicator]->(`t1`:`indicators`)\nWHERE `t1`.`indicatorname` = `t2`.`indicatorname`\nAND `t1`.`countrycode` = `t3`.`countrycode`\nAND (`t2`.`longdefinition` = 'Adolescent fertility rate is the number of births per 1,000 women ages 15-19.' AND `t3`.`shortname` = 'Arab World' AND `t1`.`year` = 1960)\nRETURN `t1`.`value` AS `value`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the value of the indicator whose long definition is \"Adolescent fertility rate is the number of births per 1,000 women ages 15-19.\" for the Arab World in 1960?",
    "evidence": "in 1960 refers to Year = 1960; for the Arab World refers to CountryName = 'Arab World'",
    "idx": 1625
  },
  {
    "filename": "train.json",
    "db_id": "world_development_indicators",
    "gql_statement": "MATCH (`t1`:`country`)-[has_indicator_0:has_indicator]->(`t2`:`indicators`)\nWHERE `t1`.`countrycode` = `t2`.`countrycode`\nAND (`t1`.`alpha2code` = '1A' AND `t2`.`indicatorname` = 'Adolescent fertility rate (births per 1,000 women ages 15-19)')\nRETURN CASE WHEN COUNT(`t2`.`year`)=0 THEN NULL ELSE toFloat(sum(`t2`.`value`)) * 100 / COUNT(`t2`.`year`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average value of Adolescent fertility rate in the country whose Alpha2Code is 1A?",
    "evidence": "average value = AVG(Value) where IndicatorName = 'Adolescent fertility rate (births per 1,000 women ages 15-19)'",
    "idx": 1626
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies2directors`)\nMATCH (`t1`:`u2base`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`rating` > '4')\nRETURN DISTINCT `t2`.`directorid` AS `directorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the different director IDs of the movies whose user rating is more than 4.",
    "evidence": "",
    "idx": 1627
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies`)\nMATCH (`t1`:`u2base`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t2`.`country` = 'other' AND `t2`.`isenglish` = 'F')\nRETURN DISTINCT `t1`.`movieid` AS `movieid`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the top 5 movies from other countries which to language is not in English.",
    "evidence": "not in English can be represented by isEnglish = 'F'",
    "idx": 1633
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t1`:`movies2directors`)\nMATCH (`t2`:`movies2actors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`genre` = 'Action')\nRETURN `t2`.`actorid` AS `actorid`, `t1`.`directorid` AS `directorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list down the ID of actors and directors in action movies.",
    "evidence": "",
    "idx": 1636
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t1`:`movies`)\nMATCH (`t2`:`movies2directors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`year` = 4 AND `t1`.`isenglish` = 'T')\nRETURN `t2`.`genre` AS `genre`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the genre of the movies that are the newest and is in English.",
    "evidence": "Year contains relative value, higher year value refers to newer date; Year = 4 refers to newest date, Year = 1 refer to oldest date; In English means isEnglish = T",
    "idx": 1641
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies`)\nMATCH (`t1`:`u2base`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t2`.`year` = 4 AND `t1`.`rating` = '1')\nRETURN DISTINCT `t1`.`movieid` AS `movieid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list different IDs of movies that are the newest and have gotten the lowest rating.",
    "evidence": "Year contains relative value, higer year value refers to newer date; Year = 4 refers to newest date, Year = 1 refer to oldest date; Lowest rating = 1",
    "idx": 1645
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies2directors`)\nMATCH (`t1`:`directors`)\nWHERE `t1`.`directorid` = `t2`.`directorid`\nAND (`t1`.`avg_revenue` = 4)\nRETURN `t2`.`genre` AS `genre`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the genre of the movies that are directed by the directors with the highest level of average revenue.",
    "evidence": "",
    "idx": 1648
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies2directors`)\nMATCH (`t1`:`u2base`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`rating` = '1' AND `t2`.`genre` = 'Horror')\nRETURN `t1`.`movieid` AS `movieid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all horror films that have a rating of 1.",
    "evidence": "",
    "idx": 1653
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t1`:`movies`)\nMATCH (`t2`:`movies2directors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`country` = 'France')\nRETURN `t2`.`directorid` AS `directorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the IDs of all the directors who worked on French films.",
    "evidence": "France is a country",
    "idx": 1654
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies2directors`)\nMATCH (`t1`:`movies2actors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`movieid` = 1949144)\nRETURN `t1`.`actorid` AS `actorid`, `t2`.`directorid` AS `directorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the cast and the director of the movie with the id 1949144.",
    "evidence": "",
    "idx": 1656
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t2`:`movies`)\nMATCH (`t1`:`movies2actors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t2`.`year` = 4)\nRETURN `t1`.`actorid` AS `actorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the actor IDs whose movies have the newest published date.",
    "evidence": "Year contains relative value, higher year value refers to newer date; Year = 4 refers to newest date",
    "idx": 1658
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t1`:`movies`)\nMATCH (`t2`:`movies2actors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`runningtime` = 2 AND `t1`.`isenglish` = 'T')\nRETURN `t2`.`actorid` AS `actorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who are cast members in an English movie which has a running time equal to 2? Please list their IDs.",
    "evidence": "isEnglish = 'T' means English movie",
    "idx": 1659
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t1`:`movies`)\nMATCH (`t2`:`movies2actors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`country` = 'France')\nWITH `t2`.`actorid` AS _groupby_col_0, COUNT(`t1`.`movieid`) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `actorid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which actor has acted in at least 2 French films? Please list their IDs.",
    "evidence": "France is a country",
    "idx": 1660
  },
  {
    "filename": "train.json",
    "db_id": "movielens",
    "gql_statement": "MATCH (`t1`:`movies`)\nMATCH (`t2`:`movies2actors`)\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`year` = 1 AND `t2`.`cast_num` = 0)\nRETURN DISTINCT `t1`.`movieid` AS `movieid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list movie IDs which has the oldest publication date and the cast numbers are zero.",
    "evidence": "Year contains relative value, higher year value refers to newer date; Year = 1 refer to oldest date",
    "idx": 1662
  }
]