[
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`season` = 2021 AND t1.`ftr` = 'H')\nRETURN CASE  WHEN COUNT(CASE  WHEN t1.`hometeam` = 'Augsburg' THEN 1 ELSE NULL END) - COUNT(CASE  WHEN t1.`hometeam` = ' Mainz' THEN 1 ELSE NULL END) > 0 THEN 'Augsburg' ELSE 'Mainz' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which team had more home victories in the 2021 season's matches of the Bundesliga division, Augsburg or Mainz?",
    "evidence": "Bundesliga is the name of division; more home victories refer to MAX(FTR = 'H)'; Augsburg and Mainz are names of teams and refer to HomeTeam;",
    "idx": 1346
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Bundesliga' AND t1.`season` = 2021)\nORDER BY t1.`fthg` DESC NULLS LAST \nRETURN t1.`hometeam` AS `hometeam` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which team had the most final-time home-team goals in the 2021 season's matches of the Bundesliga division?",
    "evidence": "Bundesliga is the name of division; the most final-time home-team goals refers to MAX(FTHG);",
    "idx": 1347
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t2.`name` = 'Bundesliga' AND t1.`season` = 2021)\nRETURN sum(t1.`fthg`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many final-time home-team goals were there in total in all the matches of the Bundesliga division in the 2021 season?",
    "evidence": "Bundesliga is the name of division; final-time home-team goals refers to FTHG;",
    "idx": 1348
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (t1@`matchs`)-[in_division_0:`in_division`]->(t2@`divisions`)\nWHERE t1.`div` = t2.`division`\nAND (t1.`season` = 2021 AND t1.`awayteam` = 'Club Brugge' OR t1.`hometeam` = 'Club Brugge')\nRETURN cast (COUNT(CASE  WHEN t1.`ftr` = 'H' THEN 1 ELSE NULL END) + COUNT(CASE  WHEN t1.`ftr` = 'A' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t1.`ftr`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What's the winning rate of Club Brugge in the 2021 Premier League?",
    "evidence": "Premier League is name of division; season = 2021; Club Brugge is name of team; Club Brugge wins implies HomeTeam = 'Club Brugge' and FTR = 'H' and AwayTeam = 'Club Brugge' and FTR = 'A'; DIVIDE(SUM(COUNT(FTR = 'H' where HomeTeam = 'Club Brugge', name = 'Premier League', season = 2021), COUNT(FTR = 'A'where AwayTeam = 'Club Brugge', name = 'Premier League', season = 2021)), COUNT(Div where name = 'Premier League', season = 2021));",
    "idx": 1349
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (teams@`teams`)\nRETURN cast (sum(CASE  WHEN teams.`rank` = 1 THEN 1 ELSE 0 END) as float) * 100 / COUNT(teams.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of the teams who had post season (playoff) were ranked number 1?",
    "evidence": "had post season (play off) refers to playoff is not null; percentage = Divide (Count(Team where rank = 1, Count(Team))) * 100",
    "idx": 1354
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`player_allstar`)-[for_player_0:`for_player`]->(t2@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`blocks` = 2 AND t1.`conference` = 'West' AND t1.`season_id` = 2006)\nRETURN t2.`namenick` AS `namenick`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the nickname of the NBA player whose team competed in the Western Conference in the season 2006 and who had a total of two blocks?",
    "evidence": "completed in the Western conference refers to conference = 'West'; in season 2006 refers to season_id = 2006; total of two blocks refers to blocks = 2; nickname refers to nameNick",
    "idx": 1362
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`teams`)\nMATCH ()-[t1:`beat_1`]->()\nWHERE t1.`tmidwinner` = t2.`tmid`\nAND (t1.`round` = 'DSF' AND t1.`tmidloser` = 'HSM')\nORDER BY t2.`rank`  NULLS FIRST \nRETURN t2.`year` AS `year` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In what year did the only team to beat the Houston in the final round of postseason series games earn its lowest ranking?",
    "evidence": "beat the Huston refers to tmIDLoser = 'HSM';  in final round of post season refers to round = 'DSF'",
    "idx": 1363
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`season_id` = 1985)\nORDER BY t2.`assists` DESC NULLS LAST \nRETURN t1.`birthdate` AS `birthdate` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the birth date of the player with the most assists during the 1985 All-Star season?",
    "evidence": "most assist refers to Max(assists); in 1985 All Star season refers to season_id = 1985",
    "idx": 1364
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`birthcity` = 'Winter Haven' AND t2.`season_id` >= 1980 AND t2.`season_id` <= 1989 AND t2.`minutes` = 12)\nRETURN DISTINCT t1.`firstname` AS `firstname`, t1.`middlename` AS `middlename`, t1.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which player, born in Winter Haven, played 12 minutes per season during the 1980s in the All-Stars?",
    "evidence": "born in Winter Haven refers to birthCity = 'Winter Haven'; during the 1980s in All-Stars refers to season_id = 1980; played in 12 minutes  per season refers to minutes = 12",
    "idx": 1365
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`conference` = 'East' AND t2.`minutes` <= 5 AND t1.`college` = 'Illinois')\nRETURN COUNT(DISTINCT t1.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of all the All-star players who played in the Eastern Conference for no more than 5 minutes, how many went to Illinois College?",
    "evidence": "Eastern conference refers to conference = 'East'; no more than 5 minutes refers to minutes < 5",
    "idx": 1366
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (player_allstar@`player_allstar`)\nWHERE cast (player_allstar.`d_rebounds` as float) * 100 / player_allstar.`rebounds` > 75 AND player_allstar.`season_id` >= 1990 AND player_allstar.`season_id` <= 2007\nRETURN COUNT(DISTINCT player_allstar.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Between the years 1990 and 2007, of the total rebounds achieved by each player, how many managed to exceed 75% of defensive rebounds?",
    "evidence": "the year 1990 and 2007 refers to year BETWEEN 1990 AND 2007; exceed 75% of defensive rebounds refers to Divide (dRebounds, rebounds) * 100 > 75",
    "idx": 1367
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (coaches@`coaches`)\nWHERE coaches.`coachid` = 'costela01'\nORDER BY cast (coaches.`won` as float) / (coaches.`won` + coaches.`lost`) DESC NULLS LAST \nRETURN coaches.`year` AS `year` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "in which year costela01 obtained the best balance of games won as a coach?",
    "evidence": "\"costela01\" is the coachID; best balance of game won refers to Max(Divide(won, Sum(won, lost)))",
    "idx": 1368
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`birthcity` = 'Brooklyn' AND like(t1.`namenick`,'%Superman%'))\nRETURN sum(t2.`minutes`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many total minutes has the Brooklyn-born player, known by the name of Superman, played during all of his NBA All-Star seasons?",
    "evidence": "\"Brooklyn\" is the birthCity of player; known by the name of Superman refers to nameNick like '%Superman%'; total minutes refers to Sum(minutes)",
    "idx": 1369
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`teams`)\nMATCH ()-[t1:`beat_1`]->()\nWHERE t1.`tmidwinner` = t2.`tmid`\nAND (t2.`won` > 60 AND t1.`year` = 1996 AND t1.`round` = 'CSF' AND t1.`tmidloser` = 'LAL')\nRETURN DISTINCT t2.`tmid` AS `tmid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which winning team in the final round of the postseason series games against the LAL won more than 60 games in the NBA league during the year 1996?",
    "evidence": "final round of post season refers to round = 'CSF'; won against LAL refers to tmIDLoser = 'LAL'; in the NBA league refers to lgID = 'NBA'; won more than 60 games refers to won > 60",
    "idx": 1370
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (coaches@`coaches`)\nORDER BY coaches.`post_wins` DESC NULLS LAST \nRETURN coaches.`coachid` AS `coachid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the coach during whose period of coaching, a team has the most numbers of games won in the post-season games?",
    "evidence": "the most number of game won in post season refers to Max(post_wins); coach refers to coachID",
    "idx": 1371
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players`)\nMATCH (t2@`players_teams`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`lgid` = 'ABA' AND (t1.`pos` = 'C' OR t1.`pos` = 'F-C'))\nRETURN COUNT(DISTINCT t1.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players from the ABA league, how many of them have the center position?",
    "evidence": "\"ABA\" is the lgID; center position refers to pos =   'C' or pos = 'F-C'; players refers to playerID",
    "idx": 1372
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`hscity` = 'Chicago' AND t2.`conference` = 'West')\nRETURN COUNT(DISTINCT t1.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players who went to high school in Chicago, how many of them belongs to the west conference?",
    "evidence": "high school in Chicago refers to hsCity = 'Chicago'; belong to the west conference refers to divID = 'WE'",
    "idx": 1374
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players`)\nMATCH (t2@`players_teams`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`birthcity` = 'Spencer' AND t2.`lgid` = 'NBL')\nRETURN COUNT(DISTINCT t1.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players from the NBL league, how many of them were born in Spencer?",
    "evidence": "\"NBL\" is the lgID; 'Spencer' is the birthCity",
    "idx": 1376
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`awards_players`)-[awarded_to_1_0:`awarded_to_1`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`award` = 'Most Valuable Player' AND t1.`birthcity` = 'Houston')\nRETURN COUNT(DISTINCT t1.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players born in Whitestone, how many of them have won the MVP?",
    "evidence": "\"Whitestone\" is the birthCity of the player; won the MVP refers to award = 'Most Valuable Player'",
    "idx": 1377
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`awards_players`)-[awarded_to_1_0:`awarded_to_1`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`award` = 'Rookie of the Year')\nORDER BY t1.`height` DESC NULLS LAST \nRETURN t1.`height` AS `height` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players who have won the award of Rookie of the year, what is the height of the tallest player?",
    "evidence": "\"Rookie of the Year\" is the award; tallest player refers to Max(height)",
    "idx": 1378
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`awards_players`)-[awarded_to_1_0:`awarded_to_1`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`award` = 'Rookie of the Year')\nRETURN avg(t1.`weight`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average weight of the players who have won the award of Rookie of the year?",
    "evidence": "\"Rookie of the Year\" is the award; average weight = Divide (Sum(weight), Count(playerID))",
    "idx": 1379
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`awards_players`)-[awarded_to_1_0:`awarded_to_1`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`award` = 'Most Valuable Player' AND t1.`birthcity` = 'New York')\nRETURN avg(t1.`height`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the players that went to high school in New York and have won the MVP, what is their average height?",
    "evidence": "high school in New York refers to highSchool like '%New York%'; won the MVP refers to award = 'Most Valuable Player'; average height = Divide (Sum(height), Count(playerID))",
    "idx": 1380
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (teams@`teams`)\nWHERE cast (teams.`won` as float) * 100 / (teams.`won` + teams.`lost`) < 50\nRETURN teams.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which teams have winning rate less than 50%?",
    "evidence": "team with winning rate less than 50% refers to Divide (won, Sum(won, lost)) < 0.5",
    "idx": 1381
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players`)\nMATCH (t2@`players_teams`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`tmid` = 'AFS')\nORDER BY t1.`height` DESC NULLS LAST \nRETURN t1.`firstname` AS `firstname`, t1.`middlename` AS `middlename`, t1.`lastname` AS `lastname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which player from \"AFS\" team has the tallest height?",
    "evidence": "\"AFS\" is the tmID; tallest height refers to Max(height)",
    "idx": 1382
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (awards_coaches@`awards_coaches`)\nWHERE awards_coaches.`year` >= 1962 AND awards_coaches.`year` <= 1975\nRETURN COUNT(DISTINCT awards_coaches.`coachid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From 1962 to 1975, how many coaches received the award?",
    "evidence": "from 1960 to 1975 refers to year between 1960 and 1975",
    "idx": 1384
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (awards_coaches_sub0@`awards_coaches`)\nWHERE awards_coaches_sub0.`year` >= 1962 AND awards_coaches_sub0.`year` <= 2011 AND awards_coaches_sub0.`award` = 'NBA Coach of the Year'\nRETURN collect(awards_coaches_sub0.`coachid`) AS `coachid` \n} \nMATCH (awards_coaches@`awards_coaches`)\nWHERE awards_coaches.`year` >= 1962 AND awards_coaches.`year` <= 2011 AND awards_coaches.`award` = 'ABA Coach of the Year' AND awards_coaches.`coachid` IN in_collect_0\nRETURN COUNT(DISTINCT awards_coaches.`coachid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From 1962 to 2011, how many coaches received both NBA and ABA awards?",
    "evidence": "from 1962 to 2011 refers to year between 1960 and 2011; received both NBA and ABA award refers to coachID where award LIKE 'NBA%' and 'ABA%'",
    "idx": 1385
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`season_id` = 1975)\nRETURN avg(t2.`points`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In 1975, what was the average point of all-star players coming from the USA?",
    "evidence": "in 1975 refers to season_id = 1975; coming from USA refers to birthCountry = 'USA'; average point refers to Divide (Sum(points), Count(playerID))",
    "idx": 1386
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`college` = 'UCLA')\nRETURN min(t1.`weight`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the minimum weight of all-star players coming from UCLA college?",
    "evidence": "minimum weight refers to Min(weight)",
    "idx": 1388
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`birthcountry` = 'USA')\nRETURN MAX(t1.`weight`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the maximum weight of USA all-star players?",
    "evidence": "\"USA\" is the birthCountry of player;  maximum weight refers to Max(weight)",
    "idx": 1389
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (awards_players@`awards_players`)\nWHERE awards_players.`year` >= 1969 AND awards_players.`year` <= 2010 AND awards_players.`award` = 'Rookie of the Year'\nRETURN COUNT(awards_players.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many players received Rookie of the Year award from 1969 to 2010?",
    "evidence": "from 1969 to 2010 refers to year BETWEEN 1969 and 2010; 'Rookie of the Year' is the award",
    "idx": 1390
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`players_teams`)-[for_team_0:`for_team`]->(t1@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`year`\nAND (t1.`year` >= 1950 AND t1.`year` <= 1970 AND t1.`rank` = 1)\nRETURN MAX(t2.`points`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From 1950 to 1970, what is the maximum point of players whose teams were ranked 1?",
    "evidence": "from 1950 to 1970 refers to year between 1950 and 1970; team with rank 1 refers to rank = 1; maximum point refers to Max(points)",
    "idx": 1391
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`players_teams`)-[for_team_0:`for_team`]->(t1@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`year`\nAND (t1.`rank` = 3 AND t1.`year` >= 1937 AND t1.`year` <= 1940)\nORDER BY t2.`points` DESC NULLS LAST \nRETURN DISTINCT t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the teams that were ranked 3 from 1937 to 1940, what is the team name whose players had the highest point?",
    "evidence": "from 1937 to 1940 refers to year between 1937 and 1940; player with highest point refers to Max(points)",
    "idx": 1392
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players_teams`)-[for_team_0:`for_team`]->(t2@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`year`\nAND (cast (t2.`won` as float) * 100 / cast (t2.`games` as float) > 75 AND t1.`year` = 1990)\nRETURN COUNT(DISTINCT t1.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In 1990, how many players whose teams had the winning rate of more than 75%?",
    "evidence": "in 1990 refers to year = 1990; winning rate of more than 75% refers to Divide(won, games) > 0.75",
    "idx": 1393
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (draft@`draft`)\nWHERE draft.`firstname` = 'Joe' AND draft.`draftyear` = 1970\nRETURN COUNT(DISTINCT draft.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many players with the first name Joe were drafted in 1970?",
    "evidence": "drafted in 1970 refers to draftYear = 1970",
    "idx": 1395
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (player_allstar@`player_allstar`)\nWHERE player_allstar.`first_name` = 'George' AND player_allstar.`last_name` = 'Mikan' AND player_allstar.`season_id` >= 1951 AND player_allstar.`season_id` <= 1953\nRETURN COUNT(player_allstar.`fg_made`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many field goals did George Mikan make overall between 1951 and 1953?",
    "evidence": "between 1951 and 1953 refers to season_id; field goal refers to fg_made",
    "idx": 1396
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (players@`players`)\nRETURN min(cast (players.`weight` as float) / (players.`height` * players.`height`)) AS `_col_0`, MAX(cast (players.`weight` as float) / (players.`height` * players.`height`)) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the basketball players' BMI ranges?",
    "evidence": "BMI = Multiply(Divide(weight, Multiply(height, height)), 703)",
    "idx": 1397
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (teams@`teams`)\nORDER BY cast (teams.`homewon` as float) / (teams.`homewon` + teams.`homelost`) DESC NULLS LAST \nRETURN teams.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the team with the highest home lost rate?",
    "evidence": "highest home lost rate = Max(Divide(homelost, Sum(homeWon, homeLost)))",
    "idx": 1398
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nRETURN avg(cast (t1.`weight` as float) / (t1.`height` * t1.`height`)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average BMI of an All-star player?",
    "evidence": "average BMI refers to AVG (Multiply(Divide(weight, Multiply(height, height)), 703))",
    "idx": 1399
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "CALL {\nMATCH (teams_sub0@`teams`)\nWHERE teams_sub0.`lgid` = 'ABA' AND teams_sub0.`year` = 1972\nRETURN teams_sub0.`year` AS `year`, teams_sub0.`lgid` AS `lgid`, teams_sub0.`tmid` AS `tmid`, teams_sub0.`franchid` AS `franchid`, teams_sub0.`confid` AS `confid`, teams_sub0.`divid` AS `divid`, teams_sub0.`rank` AS `rank`, teams_sub0.`confrank` AS `confrank`, teams_sub0.`playoff` AS `playoff`, teams_sub0.`name` AS `name`, teams_sub0.`o_fgm` AS `o_fgm`, teams_sub0.`o_ftm` AS `o_ftm`, teams_sub0.`o_pts` AS `o_pts`, teams_sub0.`d_pts` AS `d_pts`, teams_sub0.`homewon` AS `homewon`, teams_sub0.`homelost` AS `homelost`, teams_sub0.`awaywon` AS `awaywon`, teams_sub0.`awaylost` AS `awaylost`, teams_sub0.`won` AS `won`, teams_sub0.`lost` AS `lost`, teams_sub0.`games` AS `games`, teams_sub0.`arena` AS `arena` \n}\nMATCH (t1@`teams`)\nWHERE t1.`tmid` = tmid\nAND (t1.`lgid` = 'ABA' AND t1.`year` = 1973)\nORDER BY (cast (t1.`won` as float) / (t1.`won` + t1.`lost`) - (cast (won as float) / (won + lost))) DESC NULLS LAST \nRETURN t1.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the team with the fastest growth in winning rate in the 'ABA' league from 1972 to 1973?",
    "evidence": "\"ABA\" is the lgID; from 1972 to 1973 refers to year = 1972 and year = 1973; team with the fastest growth in winning rate = Max(Subtract(Divide(won where year = 1973, Sum(won, lost)),Divide(won where year = 1972, Sum(won, lost))))",
    "idx": 1400
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`conference` = 'East')\nRETURN avg(DISTINCT t1.`height`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average height of an East conference All-star player?",
    "evidence": "average height refers to avg(height)",
    "idx": 1401
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t3@`awards_coaches`)-[awarded_to_2_0:`awarded_to_2`]->(t2@`coaches`)-[is_coaches_0:`is_coaches`]->(t1@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`year`\nAND t2.`coachid` = t3.`coachid` AND t2.`year` = t3.`year`\nAND (t3.`year` = 1992 AND t3.`award` = 'NBA Coach of the Year')\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the team that the 'NBA Coach of the Year' 1992 winner coached?",
    "evidence": "\"NBA Coach of the Year\" is the award; in 1992 refers to year = 1992;",
    "idx": 1402
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`players`)\nMATCH (t2@`players_teams`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t2.`year` = 1973)\nORDER BY cast (t2.`fgmade` as float) / t2.`fgattempted` DESC NULLS LAST \nRETURN t1.`firstname` AS `firstname`, t1.`lastname` AS `lastname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the first and last name of the player with the highest field goal made rate in 1973?",
    "evidence": "in 1973 refers to year = 1973; player with highest field goal made refers to Max(Divide(fgMade, fgAttempted))",
    "idx": 1403
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`draft`)-[drafted_by_0:`drafted_by`]->(t1@`teams`)\nWHERE t1.`tmid` = t2.`tmid` AND t1.`year` = t2.`draftyear`\nAND (t2.`firstname` = 'Mike' AND t2.`lastname` = 'Lynn')\nRETURN t1.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the team that selected Mike Lynn?",
    "evidence": "full name refers to teams.name",
    "idx": 1404
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t1@`awards_players`)-[awarded_to_1_0:`awarded_to_1`]->(t2@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`award` = 'Most Improved Player' AND t2.`birthcountry` = 'USA' AND t1.`year` >= 1985 AND t1.`year` <= 1990)\nRETURN COUNT(DISTINCT t2.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the Most improved Players awarded from 1985-1990, how many player whose country is USA?",
    "evidence": "the Most improved Player refers to award = 'Most Improved Player'; from 1985-1990 refers to year between 1985 and 1990; country is USA refers to birthCountry = 'USA'",
    "idx": 1405
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (t2@`player_allstar`)-[for_player_0:`for_player`]->(t1@`players`)\nWHERE t1.`playerid` = t2.`playerid`\nAND (t1.`college` = 'California')\nRETURN DISTINCT t1.`firstname` AS `firstname`, t1.`lastname` AS `lastname`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Please list out the first name and last name of player who attended California college and have been selected as all stars?",
    "evidence": "California college refers to college = 'California'",
    "idx": 1406
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (awards_players@`awards_players`)\nWHERE awards_players.`year` >= 1969 AND awards_players.`year` <= 1975 AND awards_players.`award` = 'Most Valuable Player'\nRETURN COUNT(DISTINCT awards_players.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many players received Most Valuable Player award from 1969 to 1975?",
    "evidence": "Most Valuable Player award refers to award = 'Most Valuable Player'; from 1969 to 1975 refers to year between 1969 and 1975",
    "idx": 1407
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (coaches@`coaches`)\nWHERE coaches.`year` = 1988\nORDER BY coaches.`won` - coaches.`lost` DESC NULLS LAST \nRETURN coaches.`coachid` AS `coachid` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which coach has the most 'won' than 'lost' in year '1988'?",
    "evidence": "in year '1988' refers to year = 1988; the most 'won' than 'lost' refers to max(subtract(won, lost))",
    "idx": 1409
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (player_allstar@`player_allstar`)\nWHERE player_allstar.`season_id` >= 2000 AND player_allstar.`season_id` <= 2005 AND player_allstar.`steals` <= 10\nRETURN COUNT(DISTINCT player_allstar.`playerid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many players did not get more than 10 steals between the years 2000 and 2005?",
    "evidence": "did not get more than 10 steals refers to count(steals) < = 10; between the years 2000 and 2005 refers to season_id between 2000 and 2005",
    "idx": 1419
  }
]