[
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`tips`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`tip_length` = 'Medium' AND `t2`.`likes` = 3)\nRETURN `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which city is the business that got a \"medium\" length tip with \"3\" likes located in?",
    "evidence": "medium length tip refers to tip_length = 'Medium';",
    "idx": 3011
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`attributes`)\nMATCH (`t1`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t1`.`business_id` = 11825 AND `t2`.`attribute_name` = 'parking_lot')\nRETURN `t1`.`attribute_value` AS `attribute_value`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Does Yelp business No.\"11825\" have a \"parking lot\"?",
    "evidence": "business No.\"11825\" refers to business_id = '12476'; have a \"parking lot\" refers to attribute_value = 'parking_lot'",
    "idx": 3013
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`attributes`)\nMATCH (`t1`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t1`.`business_id` = 12476 AND `t2`.`attribute_name` = 'payment_types_mastercard')\nRETURN `t1`.`attribute_value` AS `attribute_value`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Is the payment in mastercard possible for the Yelp business No.\"12476\"?",
    "evidence": "Yelp business No.\"12476\" refers to business_id = '12476'; payment in mastercard refers to attribute_value = 'payment_types_mastercard'",
    "idx": 3014
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`categories`)\nMATCH (`t1`:`business_categories`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nRETURN CASE WHEN sum(CASE  WHEN `t2`.`category_name` = 'Men\\'s Clothing' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`category_name` = 'Women\\'s Clothing' THEN 1 ELSE 0 END)) / sum(CASE  WHEN `t2`.`category_name` = 'Men\\'s Clothing' THEN 1 ELSE 0 END) END AS `times`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times is the number of \"Women's Clothing\" Yelp businesses to \"Men's Clothing\"?",
    "evidence": "\"Women's Clothing\" Yelp businesses refers to  category_name = 'Women''s Clothing'; \"Men's Clothing\" refers to category_name = 'Men''s Clothing'; times refers to DIVIDE(COUNT(category_name = 'Women''s Clothing'), COUNT(category_name = 'Men''s Clothing'))",
    "idx": 3016
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`state` = 'CA' AND `business`.`active` = 'true'\nRETURN `business`.`business_id` AS `business_id`, `business`.`active` AS `active`, `business`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the ID, active status and city of the business which are in CA state.",
    "evidence": "the ID refers to business_id; active status refers to active; active = 'true' means the business is still running; active = 'false' means the business is closed or not running now",
    "idx": 3017
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nRETURN CASE WHEN COUNT(`business`.`business_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `business`.`active` = 'true' THEN 1 ELSE 0 END)) * 100 / COUNT(`business`.`business_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of running business among all business.",
    "evidence": "running business refers to active = 'true'; percentage refers to DIVIDE(COUNT(active = 'true'), COUNT(business_id)) * 100%",
    "idx": 3018
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`attributes`:`attributes`)\nWHERE `attributes`.`attribute_name` =~ '(?i)(?s)music.*'\nRETURN `attributes`.`attribute_id` AS `attribute_id`, `attributes`.`attribute_name` AS `attribute_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all attribute names, list down the ID and attribute name which start with \"music\".",
    "evidence": "attribute name which start with \"music\" refers to attribute_name LIKE 'music%'",
    "idx": 3019
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users_compliments`:`users_compliments`)\nRETURN CASE WHEN COUNT(`users_compliments`.`user_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `users_compliments`.`number_of_compliments` = 'Low' THEN 1 ELSE 0 END)) * 100 / COUNT(`users_compliments`.`user_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Based on all user compliments, find the percentage of low number of compliments on all compliments ID.",
    "evidence": "low number of compliments refers to number_of_compliments = 'Low'; percentage refers to DIVIDE(COUNT(number_of_compliments = 'Low'), COUNT(user_id)) * 100",
    "idx": 3020
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`reviews`:`reviews`)\nWHERE `reviews`.`review_votes_cool` = 'Uber'\nRETURN `reviews`.`business_id` AS `business_id`, `reviews`.`user_id` AS `user_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the business ID and user ID who got uber for cool votes.",
    "evidence": "got uber for cool votes refers to review_votes_cool = 'Uber'",
    "idx": 3021
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`tips`)\nMATCH (`t1`:`users`)\nWHERE `t1`.`user_id` = `t2`.`user_id`\nAND (`t1`.`user_yelping_since_year` = 2004 AND `t1`.`user_fans` = 'High')\nRETURN `t1`.`user_id` AS `user_id`, `t2`.`business_id` AS `business_id`, `t2`.`tip_length` AS `tip_length`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the user ID, business ID and tips length of who started using Yelp since 2004 and had high followers.",
    "evidence": "started using Yelp since 2004 refers to user_yelping_since_year = '2004'; had high followers refers to user_fans = 'High'",
    "idx": 3022
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`attributes`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nRETURN CASE WHEN COUNT(`t1`.`attribute_name`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`attribute_name` = 'Accepts Credit Cards' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`attribute_name`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of business with attribute name of \"Accepts Credit Cards\".",
    "evidence": "percentage refers to DIVIDE(COUNT(attribute_name = 'Accepts Credit Cards'), COUNT(business_id))*100%",
    "idx": 3023
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`reviews`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`city` = 'San Tan Valley' AND `t1`.`active` = 'false' AND `t2`.`review_stars` = 5)\nRETURN `t2`.`user_id` AS `user_id`, `t2`.`review_length` AS `review_length`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the stopped businesses in San Tan Valley city, list down the user ID and review length of who had great experience.",
    "evidence": "stop businesses refers to active = 'false'; great experience refers to review_stars = 5\n\n",
    "idx": 3024
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`business_categories`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nRETURN sum(CASE  WHEN `t1`.`category_name` = 'Men\\'s Clothing' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t1`.`category_name` = 'Women\\'s Clothing' THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compare the number of business between the category of \"Men's Clothing\" and \"Women's Clothing\".",
    "evidence": "category of \"Men's Clothing\" refers to category_name = 'Men''s Clothing'; \"Women's Clothing\" refers to category_name = 'Women''s Clothing'",
    "idx": 3025
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business_hours`:`business_hours`)\nWHERE `business_hours`.`closing_time` = '8PM'\nRETURN DISTINCT `business_hours`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the businesses that closed at 8PM.",
    "evidence": "closed at 8PM refers to closing_time = '8PM';",
    "idx": 3026
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_yelping_since_year` = 2012 AND `users`.`user_average_stars` < '3'\nRETURN `users`.`user_id` AS `user_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the users with average star less than 3 stars in 2012",
    "evidence": "average star less than 3 stars refers to user_average_stars < 3; in 2012 refers to user_yelping_since_year = 2012",
    "idx": 3029
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nRETURN CASE WHEN COUNT(`business`.`stars`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `business`.`stars` = 5 THEN 1 ELSE 0 END)) * 100 / COUNT(`business`.`stars`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the percentage of 5 stars rated business.",
    "evidence": "percentage refers to DIVIDE(COUNT(stars = 5), COUNT(business_id)) * 100%",
    "idx": 3030
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`reviews`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`city` = 'Phoenix')\nRETURN CASE WHEN COUNT(`t1`.`business_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`review_votes_funny` = 'Low' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`business_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Based on business in Phoenix, calculate the percentage of business with low funny votes.",
    "evidence": "in Chandelier refers to city = 'Chandelier'; percentage = divide(count(business_id where review_votes_funny = 'Low'), count(business_id)); business with low funny votes refers to review_votes_funny = 'Low'",
    "idx": 3034
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` = 'Gilbert' AND `business`.`active` = 'true' AND `business`.`review_count` = 'High'\nORDER BY `business`.`stars` IS NULL ASC, `business`.`stars` DESC \nRETURN `business`.`business_id` AS `business_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the most popular and appealing active business in Gilbert based on users' reviews.",
    "evidence": "most popular and appealing refers to review_count = 'High' and max(stars); active business refers to active = 'true'; in Gilbert refers to city = 'Gilbert'",
    "idx": 3040
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` = 'Avondale' AND `business`.`active` = 'false'\nRETURN CASE WHEN COUNT(`business`.`stars`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `business`.`stars` > 3 THEN 1 ELSE 0 END)) * 100 / COUNT(`business`.`stars`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all closed businesses in Avondale, AZ what percent have obtained a 'wonderful experience' rating of the business.",
    "evidence": "closed business refers to active = 'false'; in Avondale refers to city = 'Avondale'; 'wonderful experience' rating refers to stars > 3; percentage = divide(count(business_id where stars > 3), count(business_id))*100%",
    "idx": 3041
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`reviews`:`reviews`)\nWHERE `reviews`.`review_stars` = 5\nRETURN CASE WHEN COUNT(`reviews`.`review_length`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `reviews`.`review_length` = 'Long' THEN 1 ELSE 0 END)) * 100 / COUNT(`reviews`.`review_length`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the percent of long reviews among all 5-star reviews given to businesses by the Yelp users.",
    "evidence": "percentage = divide(count(business_id where review_length = 'Long' and review_stars = 5), count(business_id)) * 100%; long reviews refers to review_length = 'Long'; 5-star review refers to review_stars = 5",
    "idx": 3043
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_average_stars` >= '4'\nRETURN CASE WHEN COUNT(`users`.`user_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `users`.`user_fans` = 'None' THEN 1 ELSE 0 END)) * 100 / COUNT(`users`.`user_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the users with the average ratings of at least 4 and above of all reviews, calculate the percent that have no fans or followers.",
    "evidence": "average ratings of at least 4 refers to user_average_stars > = 4; no fans or followers refers to user_fans = 'None'; percentage = divide(count(user_id where user_average_stars > = 4 and user_fans = 'None'), sum(user_id where user_average_stars > = 4))*100%",
    "idx": 3044
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_average_stars` = '5'\nORDER BY `users`.`user_yelping_since_year` IS NULL DESC, `users`.`user_yelping_since_year`  \nRETURN `users`.`user_id` AS `user_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the Yelp user with the average 5-star rating of all reviews who has been yelping the longest.",
    "evidence": "Yelp user refers to user_id; average 5-star rating refers to user_average_stars = 5; yelping the longest refers to min(user_yelping_since_year)",
    "idx": 3046
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`compliments`)\nMATCH (`t2`:`users_compliments`)\nWHERE `t1`.`compliment_id` = `t2`.`compliment_id`\nAND (`t2`.`number_of_compliments` = 'High')\nRETURN CASE WHEN COUNT(`t2`.`user_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`compliment_type` = 'cute' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`user_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the users who received the high number of compliments, what percent received the 'cute' type of compliment.",
    "evidence": "high number of compliments refers to number_of_compliments = 'High'; percentage = divide(count(user_id where compliment_type = 'cute'), count(user_id))*100%",
    "idx": 3047
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business_attributes`:`business_attributes`)\nWHERE `business_attributes`.`attribute_value` IN ['none', 'no', 'false']\nRETURN COUNT(`business_attributes`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the number of businesses that have no any attribute.",
    "evidence": "have no attribute refers to attribute_value in( 'none', 'no', 'false')",
    "idx": 3048
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`reviews`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`review_length` = 'Medium')\nRETURN DISTINCT `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out city name of businesses which have medium length of review.",
    "evidence": "medium length of review refers to review_length = 'Medium'",
    "idx": 3050
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`users`)\nMATCH (`t2`:`users_compliments`)\nWHERE `t1`.`user_id` = `t2`.`user_id`\nAND (`t2`.`number_of_compliments` = 'High' AND `t1`.`user_fans` = 'Medium')\nRETURN COUNT(`t1`.`user_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the users whose fan is medium, how many users received high compliments from other users.",
    "evidence": "is medium refers to user_fans = 'Medium'; high compliments refers to number_of_compliments = 'High'",
    "idx": 3053
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`business`)\nMATCH (`t1`:`business_attributes`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t1`.`attribute_value` = 'full_bar')\nRETURN COUNT(`t1`.`business_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the businesses with average rating, how many business has attribute of full_bar.",
    "evidence": "average rating refers to avg(stars); attribute of full_bar refers to attribute_value = 'full_bar'",
    "idx": 3056
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`business_hours`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`opening_time` = '1AM')\nRETURN DISTINCT `t1`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the state of businesses which have opening time at 1AM.",
    "evidence": "state refers to city",
    "idx": 3057
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`business_categories`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nAND (`t2`.`business_id` = 5)\nRETURN `t1`.`category_name` AS `category_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the category name of business id 5.",
    "evidence": "",
    "idx": 3058
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`compliments`)\nMATCH (`t2`:`users_compliments`)\nWHERE `t1`.`compliment_id` = `t2`.`compliment_id`\nAND (`t1`.`compliment_type` = 'photos')\nRETURN `t2`.`user_id` AS `user_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the user id that has compliment type of photos.",
    "evidence": "compliment type of photos refers to compliment_type = 'photos'",
    "idx": 3059
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`tips`)\nMATCH (`t2`:`users`)\nWHERE `t1`.`user_id` = `t2`.`user_id`\nRETURN CASE WHEN COUNT(`t1`.`tip_length`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`tip_length` = 'Medium' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`tip_length`) END AS `_col_0`, `t2`.`user_yelping_since_year` AS `user_yelping_since_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of medium tip length in the list. List out the time when users of medium tip length join Yelp.",
    "evidence": "medium tip length refers to tip_length = 'Medium'; percentage = divide(count(tips where tip_length = 'Medium'), count(tips))*100%; the time when users join Yelp refers to user_yelping_since_year",
    "idx": 3060
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`business`)\nMATCH (`t2`:`business_hours`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nAND (`t2`.`closing_time` = '12AM')\nRETURN DISTINCT `t1`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the state of businesses which have closing time at 12AM.",
    "evidence": "state refers to city",
    "idx": 3061
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business_hours`:`business_hours`)\nORDER BY toFloat(`business_hours`.`closing_time`) - toFloat(`business_hours`.`opening_time`) IS NULL DESC, toFloat(`business_hours`.`closing_time`) - toFloat(`business_hours`.`opening_time`)  \nRETURN `business_hours`.`business_id` AS `business_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which business ID have the shortest business operating hours?",
    "evidence": "the shortest business operating hours refer to MIN(SUBTRACT(closing_time, opening_time));",
    "idx": 3065
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business_hours`:`business_hours`)\nWHERE `business_hours`.`day_id` >= 1 AND `business_hours`.`day_id` < 8 AND `business_hours`.`opening_time` = `business_hours`.`closing_time`\nRETURN DISTINCT `business_hours`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find out which business ID are opened all the time.",
    "evidence": "opened all the time refers to Business_Hours where day_id BETWEEN 1 and 7 and opening_time = closing_time;",
    "idx": 3066
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`users`)\nMATCH (`t1`:`reviews`)\nWHERE `t1`.`user_id` = `t2`.`user_id`\nAND (`t1`.`review_votes_funny` = 'Uber' AND `t1`.`review_votes_useful` = 'Uber' AND `t1`.`review_votes_cool` = 'Uber')\nRETURN COUNT(`t2`.`user_id`) AS `user_ids`, `t2`.`user_average_stars` AS `user_average_stars`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many users manage to get uber votes for all of the review category? Find out what are the user average star.",
    "evidence": "users refer to user_id; uber votes for all of the review category refer to review_votes_funny = 'uber' AND review_votes_useful = 'uber' AND review_votes_cool = 'uber';",
    "idx": 3067
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business_hours`:`business_hours`)\nWHERE `business_hours`.`day_id` = 6 AND `business_hours`.`opening_time` = '10AM'\nRETURN DISTINCT `business_hours`.`business_id` AS `business_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide business ids with opening hours 10AM on Saturday.",
    "evidence": "opening hours 10AM on Saturday refer to Business_Hours where opening_time = '10AM' and day_id = 6;",
    "idx": 3073
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business_hours`:`business_hours`)\nWHERE `business_hours`.`opening_time` = '8AM' AND `business_hours`.`closing_time` = '6PM'\nRETURN DISTINCT `business_hours`.`day_id` AS `day_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the business id and days which are opened from 8AM to 6PM.",
    "evidence": "opened from 8AM to 6PM refers to Business_Hours where opening_time = '8AM' and closing_time = '6PM'; days refer to day_id;",
    "idx": 3074
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`city` = 'Cave Creek' AND `business`.`active` = 'true'\nRETURN sum(CASE  WHEN `business`.`review_count` = 'High' THEN 1 ELSE 0 END) AS `high`, sum(CASE  WHEN `business`.`review_count` = 'Medium' THEN 1 ELSE 0 END) AS `medium`, sum(CASE  WHEN `business`.`review_count` = 'Low' THEN 1 ELSE 0 END) AS `low`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the number of running business with each review count in Cave Creek city.",
    "evidence": "number of running business refers to COUNT(business_id) where active = 'true'; each review count includes review_count = 'High', review_count = 'Medium', review_count = 'Low';",
    "idx": 3076
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`users`:`users`)\nWHERE `users`.`user_yelping_since_year` >= 2005 AND `users`.`user_yelping_since_year` <= 2015\nRETURN avg(`users`.`user_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the yearly average user who started using Yelp from the year of 2005 to 2014.",
    "evidence": "avg(user_id) where user_yelping_since_year BETWEEN '2005' AND '2014';",
    "idx": 3077
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`review_count` = 'Low'\nRETURN CASE WHEN sum(CASE  WHEN `business`.`active` = 'false' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `business`.`active` = 'true' THEN 1 ELSE 0 END)) / sum(CASE  WHEN `business`.`active` = 'false' THEN 1 ELSE 0 END) END AS `radio`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the active and inactive ratio of the business with the review count of low.",
    "evidence": "DIVIDE(COUNT(business_id where review_count = 'Low' and active = 'true'), COUNT(business_id where review_count = 'Low' and active = 'false'));",
    "idx": 3078
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`elite`:`elite`)\nWHERE `elite`.`year_id` = 2006\nRETURN `elite`.`user_id` AS `user_id`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List any five of user ID who became elite user in 2006.",
    "evidence": "year_id = '2006';",
    "idx": 3079
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`categories`:`categories`)\nWHERE `categories`.`category_name` =~ '(?i)(?s)P.*'\nRETURN `categories`.`category_id` AS `category_id`, `categories`.`category_name` AS `category_name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the any five of ID and name of category that starts with alphabet \"P\".",
    "evidence": "category that starts with alphabet \"P\" refers to category_name like 'P%';",
    "idx": 3080
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`reviews`:`reviews`)\nWHERE `reviews`.`business_id` = 15 AND `reviews`.`review_length` = 'Medium'\nRETURN `reviews`.`user_id` AS `user_id`, `reviews`.`review_stars` AS `review_stars`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the list of user ID along with review star of which has the review length of medium with business ID of 35.",
    "evidence": ";",
    "idx": 3081
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`attributes`)\nMATCH (`t2`:`business_attributes`)\nWHERE `t1`.`attribute_id` = `t2`.`attribute_id`\nAND (`t1`.`attribute_name` = 'payment_types_visa')\nRETURN `t2`.`business_id` AS `business_id`, `t2`.`attribute_value` AS `attribute_value`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the business ID and attribute value of the attribute name of \"payment_types_visa\".",
    "evidence": "",
    "idx": 3082
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`users`)\nMATCH (`t1`:`reviews`)\nWHERE `t1`.`user_id` = `t2`.`user_id`\nAND (`t1`.`business_id` = 143 AND `t1`.`review_stars` = 5)\nRETURN `t2`.`user_id` AS `user_id`, `t2`.`user_yelping_since_year` AS `user_yelping_since_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the user ID and their year of joining Yelp who had great experience on business ID 143.",
    "evidence": "year of joining Yelp refers to user_yelping_since_year; great experience refers to Reviews where review_stars = 5;",
    "idx": 3083
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`tips`)\nMATCH (`t2`:`reviews`)\nWHERE `t1`.`business_id` = `t2`.`business_id`\nORDER BY `t1`.`likes` IS NULL ASC, `t1`.`likes` DESC \nRETURN `t1`.`user_id` AS `user_id`, `t1`.`business_id` AS `business_id`, `t2`.`review_length` AS `review_length`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the user ID, business ID with review length of the business which received the most likes in tips.",
    "evidence": "business which received the most likes refers to business_id where MAX(likes);",
    "idx": 3084
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t1`:`days`)\nMATCH (`t2`:`business_hours`)\nWHERE `t1`.`day_id` = `t2`.`day_id`\nAND (`t1`.`day_of_week` = 'Sunday')\nRETURN CASE WHEN COUNT(`t1`.`day_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`opening_time` = '9AM' AND `t2`.`closing_time` = '9PM' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`day_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of business which opened on Sunday from 9AM to 9PM based on the number of business opened on Sunday.",
    "evidence": "Sunday refers to day_of_week = 'Sunday' where day_id = 1; opened from 9AM to 9PM refers to Business_Hours where opening_time = '9AM' and closing_time = '9PM'; DIVIDE(COUNT(opening_time = '9AM' and closing_time = '9PM' and day_of_week = 'Sunday'), COUNT(opening_time = NOT NULL and closing_time = NOT NULL and day_of_week = 'Sunday')) as percentage;",
    "idx": 3085
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`t2`:`reviews`)\nMATCH (`t1`:`users`)\nWHERE `t1`.`user_id` = `t2`.`user_id`\nAND (`t1`.`user_yelping_since_year` = 2004 AND `t1`.`user_average_stars` = '5')\nRETURN `t2`.`user_id` AS `user_id`, `t2`.`review_length` AS `review_length`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Within the user who joined Yelp in 2004, explore the user ID with average star of 5 and it's review length on the business.",
    "evidence": "user who joined Yelp in 2004 refers to user_id where user_yelping_since_year = 2014; user_average_stars = 5;",
    "idx": 3086
  },
  {
    "filename": "train.json",
    "db_id": "public_review_platform",
    "gql_statement": "MATCH (`business`:`business`)\nWHERE `business`.`active` = 'true'\nRETURN sum(CASE  WHEN `business`.`city` = 'Glendale' THEN 1 ELSE 0 END) - sum(CASE  WHEN `business`.`city` = 'Mesa' THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference between running business in Glendale City and Mesa City.",
    "evidence": "running business refers to business where active = 'true';",
    "idx": 3087
  }
]