[
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE NOT `employees`.`first_name` =~ '(?i)(?s).*M.*'\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`hire_date` AS `hire_date`, `employees`.`salary` AS `salary`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full name, hire date, salary, and department id for employees without the letter M in their first name?",
    "evidence": "",
    "idx": 4084
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE NOT `employees`.`first_name` =~ '(?i)(?s).*M.*'\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`hire_date` AS `hire_date`, `employees`.`salary` AS `salary`, `employees`.`department_id` AS `department_id` ORDER BY `department_id` IS NULL DESC, `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full name, hire data, salary and department id for employees without the letter M in their first name, ordered by ascending department id?",
    "evidence": "",
    "idx": 4086
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`salary` >= 8000 AND `employees`.`salary` <= 12000\nRETURN `employees`.`phone_number` AS `phone_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the phone numbers of employees with salaries between 8000 and 12000.",
    "evidence": "",
    "idx": 4088
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`salary` >= 8000 AND `employees`.`salary` <= 12000 AND `employees`.`commission_pct` <> 'null' OR `employees`.`department_id` <> 40\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display all the information of employees whose salary is in the range of 8000 and 12000 and commission is not null or department number does not equal to 40.",
    "evidence": "",
    "idx": 4089
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`commission_pct` = 'null'\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full name (first and last name) and salary for all employees who does not have any value for commission?",
    "evidence": "",
    "idx": 4091
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` =~ '(?i)(?s).*m'\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Display the first and last name, and salary for those employees whose first name is ending with the letter m.",
    "evidence": "",
    "idx": 4093
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`hire_date` >= localdatetime('2007-11-05T00:00:00') AND `employees`.`hire_date` <= localdatetime('2009-07-05T00:00:00')\nRETURN `employees`.`job_id` AS `job_id`, `employees`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find job id and date of hire for those employees who was hired between November 5th, 2007 and July 5th, 2009.",
    "evidence": "",
    "idx": 4095
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`manager_id` <> 'null'\nRETURN `employees`.`salary` AS `salary`, `employees`.`manager_id` AS `manager_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the salary and manager number for those employees who is working under a manager.",
    "evidence": "",
    "idx": 4099
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`manager_id` <> 'null'\nRETURN `employees`.`salary` AS `salary`, `employees`.`manager_id` AS `manager_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the salaries and manager ids for employees who have managers?",
    "evidence": "",
    "idx": 4100
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`hire_date` < localdatetime('2002-06-21T00:00:00')\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display all the details from Employees table for those employees who was hired before 2002-06-21.",
    "evidence": "",
    "idx": 4101
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`hire_date` < localdatetime('2002-06-21T00:00:00')\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information about employees hired before June 21, 2002?",
    "evidence": "",
    "idx": 4102
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` =~ '(?i)(?s).*D.*' OR `employees`.`first_name` =~ '(?i)(?s).*S.*'\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id` ORDER BY `employees`.`salary` IS NULL ASC, `employees`.`salary` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display all the information for all employees who have the letters D or S in their first name and also arrange the result in descending order by salary.",
    "evidence": "",
    "idx": 4103
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`first_name` =~ '(?i)(?s).*D.*' OR `employees`.`first_name` =~ '(?i)(?s).*S.*'\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id` ORDER BY `employees`.`salary` IS NULL ASC, `employees`.`salary` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information about employees with D or S in their first name, ordered by salary descending?",
    "evidence": "",
    "idx": 4104
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`hire_date` > localdatetime('1987-09-07T00:00:00')\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display those employees who joined after 7th September, 1987.",
    "evidence": "",
    "idx": 4105
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`hire_date` > localdatetime('1987-09-07T00:00:00')\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which employees were hired after September 7th, 1987?",
    "evidence": "",
    "idx": 4106
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`jobs`:`jobs`)\nWHERE `jobs`.`min_salary` > 9000\nRETURN `jobs`.`job_title` AS `job_title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the job title of jobs which minimum salary is greater than 9000.",
    "evidence": "",
    "idx": 4107
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`jobs`:`jobs`)\nWHERE `jobs`.`max_salary` >= 12000 AND `jobs`.`max_salary` <= 18000\nRETURN `jobs`.`job_title` AS `job_title`, `jobs`.`max_salary` - `jobs`.`min_salary` AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display job Title, the difference between minimum and maximum salaries for those jobs which max salary within the range 12000 to 18000.",
    "evidence": "",
    "idx": 4109
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`jobs`:`jobs`)\nWHERE `jobs`.`max_salary` >= 12000 AND `jobs`.`max_salary` <= 18000\nRETURN `jobs`.`job_title` AS `job_title`, `jobs`.`max_salary` - `jobs`.`min_salary` AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the job titles, and range of salaries for jobs with maximum salary between 12000 and 18000?",
    "evidence": "",
    "idx": 4110
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`commission_pct` = 'null' AND `employees`.`salary` >= 7000 AND `employees`.`salary` <= 12000 AND `employees`.`department_id` = 50\nRETURN `employees`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the emails of the employees who have no commission percentage and salary within the range 7000 to 12000 and works in that department which number is 50.",
    "evidence": "",
    "idx": 4111
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`commission_pct` = 'null' AND `employees`.`salary` >= 7000 AND `employees`.`salary` <= 12000 AND `employees`.`department_id` = 50\nRETURN `employees`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the emails of employees with null commission, salary between 7000 and 12000, and who work in department 50?",
    "evidence": "",
    "idx": 4112
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWITH `employees`.`department_id` AS _groupby_col_0, COUNT(`employees`.`commission_pct`) AS _groupby_col_1\nWHERE _groupby_col_1 > 10\nRETURN _groupby_col_0 AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display those departments where more than ten employees work who got a commission percentage.",
    "evidence": "",
    "idx": 4115
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWITH `employees`.`department_id` AS _groupby_col_0, `employees`.`manager_id` AS _groupby_col_1, COUNT(`employees`.`employee_id`) AS _groupby_col_2\nWHERE _groupby_col_2 >= 4\nRETURN DISTINCT _groupby_col_0 AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the ids of the departments where any manager is managing 4 or more employees.",
    "evidence": "",
    "idx": 4117
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWHERE `employees`.`commission_pct` <> 'null'\nWITH `employees`.`department_id` AS _groupby_col_0, avg(`employees`.`salary`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `department_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the average salary of employees for each department who gets a commission percentage.",
    "evidence": "",
    "idx": 4119
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`locations`:`locations`)\nWITH `locations`.`country_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the country ID and number of cities for each country.",
    "evidence": "",
    "idx": 4121
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nMATCH (`t3`:`locations`)-[located_in_0:located_in]->(`t4`:`countries`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nAND `t3`.`country_id` = `t4`.`country_id`\nRETURN `t1`.`employee_id` AS `employee_id`, `t4`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find employee with ID and name of the country presently where (s)he is working.",
    "evidence": "",
    "idx": 4125
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nMATCH (`t3`:`locations`)-[located_in_0:located_in]->(`t4`:`countries`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND `t2`.`location_id` = `t3`.`location_id`\nAND `t3`.`country_id` = `t4`.`country_id`\nRETURN `t1`.`employee_id` AS `employee_id`, `t4`.`country_name` AS `country_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the employee ids and the names of the countries in which they work?",
    "evidence": "",
    "idx": 4126
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nWITH `t2`.`department_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `department_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the department name and number of employees in each of the department.",
    "evidence": "",
    "idx": 4127
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t2`:`employees`)-[t1:has_job]->()\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`salary` >= 12000)\nRETURN `t1`.`employee_id` AS `employee_id`, `t1`.`start_date` AS `start_date`, `t1`.`end_date` AS `end_date`, `t1`.`job_id` AS `job_id`, `t1`.`department_id` AS `department_id`, `t2`.`employee_id` AS `employee_id_1`, `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`, `t2`.`email` AS `email`, `t2`.`phone_number` AS `phone_number`, `t2`.`hire_date` AS `hire_date`, `t2`.`job_id` AS `job_id_1`, `t2`.`salary` AS `salary`, `t2`.`commission_pct` AS `commission_pct`, `t2`.`manager_id` AS `manager_id`, `t2`.`department_id` AS `department_id_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Can you return all detailed info of jobs which was done by any of the employees who is presently earning a salary on and above 12000?",
    "evidence": "",
    "idx": 4129
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t2`:`employees`)-[t1:has_job]->()\nWHERE `t1`.`employee_id` = `t2`.`employee_id`\nAND (`t2`.`salary` >= 12000)\nRETURN `t1`.`employee_id` AS `employee_id`, `t1`.`start_date` AS `start_date`, `t1`.`end_date` AS `end_date`, `t1`.`job_id` AS `job_id`, `t1`.`department_id` AS `department_id`, `t2`.`employee_id` AS `employee_id_1`, `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`, `t2`.`email` AS `email`, `t2`.`phone_number` AS `phone_number`, `t2`.`hire_date` AS `hire_date`, `t2`.`job_id` AS `job_id_1`, `t2`.`salary` AS `salary`, `t2`.`commission_pct` AS `commission_pct`, `t2`.`manager_id` AS `manager_id`, `t2`.`department_id` AS `department_id_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the job history info done by employees earning a salary greater than or equal to 12000?",
    "evidence": "",
    "idx": 4130
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[has_job_0:has_job]->(`t2`:`jobs`)\nWHERE `t1`.`job_id` = `t2`.`job_id`\nWITH `t2`.`job_title` AS _groupby_col_0, avg(`t1`.`salary`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `job_title`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display job title and average salary of employees.",
    "evidence": "",
    "idx": 4131
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[has_job_0:has_job]->(`t2`:`jobs`)\nWHERE `t1`.`job_id` = `t2`.`job_id`\nWITH `t2`.`job_title` AS _groupby_col_0, avg(`t1`.`salary`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `job_title`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average salary for each job title?",
    "evidence": "",
    "idx": 4132
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`employee_id` = 163\nRETURN `employees_sub0`.`salary` AS `salary`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` > `salary`\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the full name ( first name and last name ) for those employees who gets more salary than the employee whose id is 163?",
    "evidence": "",
    "idx": 4133
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`employee_id` = 163\nRETURN `employees_sub0`.`salary` AS `salary`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` > `salary`\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Provide the full names of employees earning more than the employee with id 163.",
    "evidence": "",
    "idx": 4134
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWITH `employees`.`department_id` AS _groupby_col_0, min(`employees`.`salary`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return the smallest salary for every departments.",
    "evidence": "",
    "idx": 4135
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`employees_sub0`:`employees`)\nWITH `employees_sub0`.`department_id` AS _groupby_col_0, min(`employees_sub0`.`salary`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`   } AS in_collect_0\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` IN in_collect_0\nRETURN `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name and last name and department id for those employees who earn such amount of salary which is the smallest salary of any of the departments.",
    "evidence": "",
    "idx": 4137
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nRETURN avg(`employees_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` > `_col_0`\nRETURN `employees`.`employee_id` AS `employee_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the employee id for all employees who earn more than the average salary.",
    "evidence": "",
    "idx": 4139
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`first_name` = 'Payam'\nRETURN `employees_sub0`.`employee_id` AS `employee_id_1`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`manager_id` = `employee_id_1`\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the employee id and salary of all employees who report to Payam (first name).",
    "evidence": "",
    "idx": 4141
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nWHERE `employees_sub0`.`first_name` = 'Payam'\nRETURN `employees_sub0`.`employee_id` AS `employee_id_1`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`manager_id` = `employee_id_1`\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the employee ids of employees who report to Payam, and what are their salaries?",
    "evidence": "",
    "idx": 4142
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nRETURN DISTINCT `t2`.`department_name` AS `department_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the name of all departments that do actually have one or more employees assigned to them.",
    "evidence": "",
    "idx": 4143
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND (`t1`.`employee_id` = `t2`.`manager_id`)\nRETURN DISTINCT `t1`.`employee_id` AS `employee_id`, `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t1`.`email` AS `email`, `t1`.`phone_number` AS `phone_number`, `t1`.`hire_date` AS `hire_date`, `t1`.`job_id` AS `job_id`, `t1`.`salary` AS `salary`, `t1`.`commission_pct` AS `commission_pct`, `t1`.`manager_id` AS `manager_id`, `t1`.`department_id` AS `department_id`, `t2`.`department_id` AS `department_id_1`, `t2`.`department_name` AS `department_name`, `t2`.`manager_id` AS `manager_id_1`, `t2`.`location_id` AS `location_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "get the details of employees who manage a department.",
    "evidence": "",
    "idx": 4145
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND (`t1`.`employee_id` = `t2`.`manager_id`)\nRETURN DISTINCT `t1`.`employee_id` AS `employee_id`, `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t1`.`email` AS `email`, `t1`.`phone_number` AS `phone_number`, `t1`.`hire_date` AS `hire_date`, `t1`.`job_id` AS `job_id`, `t1`.`salary` AS `salary`, `t1`.`commission_pct` AS `commission_pct`, `t1`.`manager_id` AS `manager_id`, `t1`.`department_id` AS `department_id`, `t2`.`department_id` AS `department_id_1`, `t2`.`department_name` AS `department_name`, `t2`.`manager_id` AS `manager_id_1`, `t2`.`location_id` AS `location_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information regarding employees who are managers?",
    "evidence": "",
    "idx": 4146
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`employees`:`employees`)\nWITH `employees`.`job_id` AS _groupby_col_0, avg(`employees`.`salary`) AS _groupby_col_1\nWHERE _groupby_col_1 > 8000\nRETURN _groupby_col_0 AS `job_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the job ID for those jobs which average salary is above 8000.",
    "evidence": "",
    "idx": 4153
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[has_job_0:has_job]->(`t2`:`jobs`)\nWHERE `t1`.`job_id` = `t2`.`job_id`\nAND (`t1`.`department_id` = 80)\nRETURN `t1`.`employee_id` AS `employee_id`, `t2`.`job_title` AS `job_title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display the employee ID and job name for all those jobs in department 80.",
    "evidence": "",
    "idx": 4155
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`departments`)\nWHERE `t1`.`department_id` = `t2`.`department_id`\nAND (`t2`.`department_name` = 'Finance')\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`job_id` AS `job_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the first name and job id for all employees in the Finance department.",
    "evidence": "",
    "idx": 4158
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nRETURN min(`employees_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` >= `_col_0` AND `employees`.`salary` <= 2500\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "display all the information of the employees whose salary if within the range of smallest salary and 2500.",
    "evidence": "",
    "idx": 4159
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nRETURN min(`employees_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`employees`:`employees`)\nWHERE `employees`.`salary` >= `_col_0` AND `employees`.`salary` <= 2500\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is all the information regarding employees with salaries above the minimum and under 2500?",
    "evidence": "",
    "idx": 4160
  },
  {
    "filename": "train_spider.json",
    "db_id": "hr_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`departments_sub0`:`departments`)\nWHERE `departments_sub0`.`manager_id` >= 100 AND `departments_sub0`.`manager_id` <= 200\nRETURN `departments_sub0`.`department_id` AS `department_id_1`   } AS in_collect_0\nMATCH (`employees`:`employees`)\nWHERE NOT `employees`.`department_id` IN in_collect_0\nRETURN `employees`.`employee_id` AS `employee_id`, `employees`.`first_name` AS `first_name`, `employees`.`last_name` AS `last_name`, `employees`.`email` AS `email`, `employees`.`phone_number` AS `phone_number`, `employees`.`hire_date` AS `hire_date`, `employees`.`job_id` AS `job_id`, `employees`.`salary` AS `salary`, `employees`.`commission_pct` AS `commission_pct`, `employees`.`manager_id` AS `manager_id`, `employees`.`department_id` AS `department_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the ids of the employees who does not work in those departments where some employees works whose manager id within the range 100 and 200.",
    "evidence": "",
    "idx": 4161
  }
]