[
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`production`)-[produced_in_0:produced_in]->(`t2`:`country`)\nWHERE `t1`.`country` = `t2`.`origin`\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`country` = 'USA' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of cars that belong to the USA.",
    "evidence": "belong to the USA refers to country = 'USA'; percentage = divide(count(ID where country = 'USA'), count(ID)) * 100%",
    "idx": 2327
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`production`)-[has_car_data_0:has_car_data]->(`t2`:`data`)\nWHERE `t2`.`id` = `t1`.`id`\nAND (`t1`.`model_year` >= 1971 AND `t1`.`model_year` <= 1980)\nRETURN CASE WHEN 9=0 THEN NULL ELSE toFloat(COUNT(`t1`.`id`)) / 9 END AS `_col_0`   \nUNION ALL\nMATCH (`t1`:`production`)-[has_car_data_1:has_car_data]->(`t2`:`data`)\nWHERE `t2`.`id` = `t1`.`id`\nAND (`t1`.`model_year` >= 1971 AND `t1`.`model_year` <= 1980 AND `t2`.`weight` < 1800)\nRETURN DISTINCT `t2`.`car_name` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average production rate per year from 1971 to 1980. Among them, name the cars with a weight of fewer than 1800 lbs.",
    "evidence": "from 1971 to 1980 refers to model_year between 1971 and 1980; average production rate per year = divide(count(ID where model_year between 1971 and 1980), 9); car's name refers to car_name; a weight of fewer than 1800 lbs refers to weight < 1800",
    "idx": 2328
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`model` = 70)\nRETURN avg(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average price of model 70 cars?",
    "evidence": "model 70 refers to model = 70; average price = avg(price) where model = 70",
    "idx": 2329
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'chevrolet vega 2300')\nRETURN `t2`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the price of Chevrolet Vega 2300?",
    "evidence": "Chevrolet Vega 2300 refers to car_name = 'chevrolet vega 2300'",
    "idx": 2330
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t1`.`car_name` = 'chevy c20')\nRETURN `t3`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country does Chevy C20 come from?",
    "evidence": "Chevy C20 refers to car_name = 'chevy c20'",
    "idx": 2331
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[has_price_0:has_price]->(`t3`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`id` = `t2`.`id`\nAND (`t1`.`car_name` =~ '(?i)(?s)ford.*' AND `t2`.`model_year` >= 1970 AND `t2`.`model_year` <= 1980)\nRETURN DISTINCT `t3`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the price of Ford cars from model 1970 to 1980.",
    "evidence": "Ford cars refers to car_name LIKE 'ford%'; from model 1970 to 1980 refers to model_year BETWEEN 1970 AND 1980",
    "idx": 2332
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`model_year` = '1975')\nORDER BY `t1`.`mpg` IS NULL ASC, `t1`.`mpg` DESC \nRETURN `t1`.`car_name` AS `car_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which is the most fuel efficient car in 1975?",
    "evidence": "car's name refers to car_name; the most fuel efficient refers to max(mpg); in 1975 refers to model_year = 1975",
    "idx": 2333
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t1`.`mpg` IS NULL ASC, `t1`.`mpg` DESC, `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t1`.`car_name` AS `car_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which car consumes fuel the most and has the highest price?",
    "evidence": "consumes fuel the most refers to min(mpg); has the highest price refers to max(price)",
    "idx": 2334
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t3`.`country` = 'USA' AND `t1`.`acceleration` < 12)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many American cars have an acceleration time of less than 12 seconds?",
    "evidence": "American car refers to country = 'USA'; an acceleration time of less than 12 seconds refers to acceleration < 12",
    "idx": 2335
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t3`.`country` = 'Japan' AND `t1`.`weight` > 2000)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Japanese cars weigh more than 2000 lbs?",
    "evidence": "Japanese car refers to country = 'Japan'; weigh more than 2000 lbs refers to weight > 2000",
    "idx": 2336
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t1`:`data`)-[has_price_0:has_price]->(`t2`:`price`)\nWHERE `t1`.`id` = `t2`.`id`\nORDER BY `t2`.`price` IS NULL ASC, `t2`.`price` DESC \nRETURN `t1`.`car_name` AS `car_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of the most expensive car.",
    "evidence": "car's name refers to car_name; the most expensive refers to max(price)",
    "idx": 2337
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`car_name` = 'buick skylark 320')\nRETURN `t2`.`model_year` AS `model_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What years did the Buick Skylark 320 get in production?",
    "evidence": "year refers to model_year; Buick Skylark 320 refers to car_name = 'buick skylark 320'",
    "idx": 2338
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)-[has_price_0:has_price]->(`t4`:`price`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND `t4`.`id` = `t1`.`id`\nAND (`t2`.`model_year` = 1970)\nORDER BY `t4`.`price` IS NULL ASC, `t4`.`price` DESC \nRETURN `t3`.`country` AS `country`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country produced the most expensive car in 1970?",
    "evidence": "the most expensive refers to max(price); in 1970 refers to model_year = 1970",
    "idx": 2339
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`horsepower` > 200 AND `t2`.`model_year` = 1975)\nRETURN COUNT(`t2`.`model_year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cars with horsepower greater than 200 were produced in 1975?",
    "evidence": "horsepower greater than 200 refers to horsepower > 200; in 1975 refers to model_year = 1975",
    "idx": 2340
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t3`.`country` = 'USA' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of American cars among all cars.",
    "evidence": "American car refers to country = 'USA'; percentage = divide(count(ID where country = 'USA'), count(ID)) * 100%",
    "idx": 2341
  },
  {
    "filename": "train.json",
    "db_id": "cars",
    "gql_statement": "MATCH (`t2`:`production`)-[has_car_data_0:has_car_data]->(`t1`:`data`)\nMATCH (`t2`:`production`)-[produced_in_0:produced_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`id`\nAND `t3`.`origin` = `t2`.`country`\nAND (`t2`.`model_year` >= 1975 AND `t2`.`model_year` <= 1980 AND `t1`.`cylinders` = 4 AND `t3`.`country` = 'Japan')\nRETURN avg(`t1`.`weight`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average weight of Japanese cars with 4 cylinders that were produced from 1975 to 1980?",
    "evidence": "Japanese car refers to country = 'Japan'; with 4 cylinders refers to cylinders = 4; produced from 1975 to 1980 refers to model_year BETWEEN 1975 AND 1980; average weight = avg(weight)",
    "idx": 2342
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`donations`:`donations`)\nWHERE toString(`donations`.`donation_timestamp`) =~ '(?i)(?s)2012.*'\nRETURN sum(`donations`.`donation_total`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total amount of donations in 2012.",
    "evidence": "total amount of donations refers to sum(donation_total); 2012 refers to donation_timestamp LIKE'2012%'",
    "idx": 2343
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`donations`:`donations`)\nWHERE toString(`donations`.`donation_timestamp`) =~ '(?i)(?s)2011.*' AND `donations`.`via_giving_page` = 't' AND `donations`.`for_honoree` = 't'\nRETURN sum(`donations`.`donation_total`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total amount of donations made in 2011 for an honoree with payment via campaign page.",
    "evidence": "total amount refers to sum(donation_total); 2011 refers to donation_timestamp LIKE'2011%'; honoree refers to for_honoree = 't'; via campaign page refers to via_giving_page = 't'",
    "idx": 2344
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`donations`:`donations`)\nWHERE `donations`.`is_teacher_acct` = 'f'\nRETURN `donations`.`donor_acctid` AS `donor_acctid`, CASE WHEN `donations`.`donation_total`=0 THEN NULL ELSE `donations`.`donation_optional_support` / `donations`.`donation_total` END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For each donation not from a teacher, state the donor account id and calculate the percentage of donation given for optional support.",
    "evidence": "not from a teacher refers to is_teacher_acct = 'f'; donor account id refers to donor_acctid; percentage of donation = divide(donation_optional_support, donation_total)*100%",
    "idx": 2345
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`projects`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`primary_focus_subject` = 'Literacy')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all the project titles whereby project materials are intended mainly for literary.",
    "evidence": "intended mainly for literary refers to primary_focus_subject = 'Literacy'",
    "idx": 2346
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`projects`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`poverty_level` =~ '(?i)(?s)highest.*')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the project titles meant for school whereby 65% of the students are on reduced lunch.",
    "evidence": "65% of the students are on reduced lunch refers to poverty_level = 'highest poverty'",
    "idx": 2347
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`projects`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`title` = 'Toot Your Flute!')\nRETURN `t2`.`primary_focus_subject` AS `primary_focus_subject`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For project titled 'Toot Your Flute!', what is the main subject of the project materials intended for? Name the other projects with the similar focus.",
    "evidence": "main subject refers to primary_focus_subject",
    "idx": 2348
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`donations`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`donation_message` =~ '(?i)(?s)Donation on behalf of Matt Carpenter because I\\'m a strong believer in education.')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the project titles created by teacher who acquired a doctor degree.",
    "evidence": "teacher who acquired a doctor degree refers to teacher_prefix = 'Dr.'",
    "idx": 2349
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`projects`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`students_reached` = 320)\nRETURN `t1`.`title` AS `title`, `t2`.`total_price_excluding_optional_support` AS `total_price_excluding_optional_support`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the project in which 320 students will be impacted if the project is funded? Name the project and state the project cost.",
    "evidence": "320 students will be impacted refers to students_reached = 320; name the project refers to title; project cost refers tp total_price_excluding_optional_support",
    "idx": 2350
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`donations`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`donor_city` = 'Texas City')\nRETURN `t2`.`donation_message` AS `donation_message`, `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all donors from Texas City, list their donation message and name of the project they donated to.",
    "evidence": "from Texas City refers to donor_city = 'Texas City'; name of the project refers title",
    "idx": 2351
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t3`:`essays`)\nMATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND `t2`.`projectid` = `t3`.`projectid`\nAND (`t3`.`title` = 'Lights, Camera, Action!')\nRETURN `t1`.`vendor_name` AS `vendor_name`, `t1`.`item_name` AS `item_name`, `t1`.`item_unit_price` AS `item_unit_price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the vendors who provide resources for project 'Lights, Camera, Action!'. List all the item names and unit price for each.",
    "evidence": "project 'Lights, Camera, Action!' refers to title = 'Lights, Camera, Action!'",
    "idx": 2352
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`projects`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`teacher_ny_teaching_fellow` = 't')\nRETURN `t1`.`title` AS `title`, `t1`.`short_description` AS `short_description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name and describe all projects created by New York teachers.",
    "evidence": "project name refers to title; describe refers to short_description; New York teachers refers to teacher_ny_teaching_fellow = 't'",
    "idx": 2354
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`essays`)\nMATCH (`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`students_reached` >= 600 AND `t1`.`poverty_level` =~ '(?i)(?s)moderate poverty')\nRETURN DISTINCT `t2`.`title` AS `title`, `t1`.`total_price_excluding_optional_support` AS `total_price_excluding_optional_support`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "If funded, which are the projects that could impact at least 600 students for a school with moderate level of poverty? Name the projects and state the project cost.",
    "evidence": "impact at least 600 students refers to students_reached > = 600; moderate level of poverty refers to poverty_level = 'moderate poverty'; project name refers to title; project cost refers to total_price_excluding_optional_support",
    "idx": 2355
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`projects`:`projects`)\nORDER BY `projects`.`total_price_including_optional_support` IS NULL ASC, `projects`.`total_price_including_optional_support` DESC \nRETURN `projects`.`projectid` AS `projectid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which project have the highest total price including optional support? Indicate the project id.",
    "evidence": "highest total price including optional support refers to max(total_price_including_optional_support)",
    "idx": 2359
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "CALL(*) {\nMATCH (`donations_sub0`:`donations`)\nWITH `donations_sub0`.`donor_state` AS _groupby_col_0, sum(`donations_sub0`.`donation_total`) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `donor_state_1`  LIMIT 1\n}\nMATCH (`donations`:`donations`)\nWHERE `donations`.`for_honoree` = 't' AND `donations`.`payment_included_campaign_gift_card` = 't' AND `donations`.`payment_method` = 'paypal' AND `donations`.`donor_state` = `donor_state_1`\nRETURN DISTINCT `donations`.`donor_state` AS `donor_state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which state have the highest number of PayPal donations for an honoree whose portion of a donation included corporate sponsored giftcard?",
    "evidence": "which state refers to donor_state; highest number refers to max(count(donor_state)); PayPal donations refers to payment_method = 'paypal'; for an honoree refers to for_honoree = 't'; included corporate sponsored giftcard refers to payment_included_campaign_gift_card = 't'",
    "idx": 2360
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`donations`:`donations`)\nRETURN `donations`.`donationid` AS `donationid`, `donations`.`donation_total` AS `donation_total` ORDER BY `donation_total` IS NULL ASC, `donation_total` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the largest donor by amount? Give the donation id and the total amount of the donation.",
    "evidence": "largest donor by amount refers to max(donation_total); total amount of the donation refers to donation_total",
    "idx": 2361
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nORDER BY `t2`.`total_price_including_optional_support` - `t2`.`total_price_excluding_optional_support` IS NULL ASC, `t2`.`total_price_including_optional_support` - `t2`.`total_price_excluding_optional_support` DESC \nRETURN `t1`.`projectid` AS `projectid`, `t1`.`item_name` AS `item_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the id of the project that has the highest optional tip? Indicate the names of the resources that were requested.",
    "evidence": "highest optional tip refers to subtract(total_price_including_optional_support, total_price_excluding_optional_support); names of the resources refers to item_name",
    "idx": 2362
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`projectid` = 'd6ef27c07c30c81f0c16c32b6acfa2ff')\nRETURN DISTINCT `t1`.`item_name` AS `item_name`, `t1`.`item_quantity` AS `item_quantity`, `t2`.`teacher_prefix` AS `teacher_prefix`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What were the resources that were requested by the teacher for project \"d6ef27c07c30c81f0c16c32b6acfa2ff\"? Indicate the quantities as well and whether or not the teacher acquired P.h.D or doctor degree.",
    "evidence": "resources that were requested refers to item_name; project \"d6ef27c07c30c81f0c16c32b6acfa2ff\" refers to projectid = 'd6ef27c07c30c81f0c16c32b6acfa2ff'; quantities refers to item_quantity; teacher_prefix = 'Dr. ' refers to teacher acquired P.h.D or doctor degree",
    "idx": 2363
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`essays`)\nMATCH (`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`title` = 'Recording Rockin\\' Readers')\nRETURN sum(`t1`.`total_price_including_optional_support`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total price including optional support received by the teacher who posted the essay titled \"Recording Rockin' Readers\"?",
    "evidence": "",
    "idx": 2364
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`essays`)\nMATCH (`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`title` = 'Smile for the Camera!!!')\nRETURN `t1`.`school_latitude` AS `school_latitude`, `t1`.`school_longitude` AS `school_longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the latitude and longitude of the school where the teacher who wrote \"Smile for the Camera!!!\" teaches?",
    "evidence": "wrote \"Smile for the Camera!!!\" refers to title = 'Smile for the Camera!!!'; latitude refers to school_latitude; longitude refers to school_longitude",
    "idx": 2365
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)\nMATCH (`t3`:`essays`)\nWHERE `t1`.`projectid` = `t3`.`projectid`\nAND (`t3`.`title` = 'iMath')\nRETURN DISTINCT `t1`.`vendor_name` AS `vendor_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the vendor that supplies resources to the project \"iMath\"?",
    "evidence": "project \"iMath\" refers to title = 'iMath'",
    "idx": 2366
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nORDER BY `t1`.`item_quantity` IS NULL ASC, `t1`.`item_quantity` DESC \nRETURN `t2`.`date_posted` AS `date_posted`, `t2`.`grade_level` AS `grade_level`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was the project with the highest quantity went live on the site? Indicate the grade level for which the project materials are intended.",
    "evidence": "project with the highest quantity refers to max(item_quantity)",
    "idx": 2367
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`essays`)\nMATCH (`t3`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND `t2`.`projectid` = `t3`.`projectid`\nAND (`t1`.`title` = 'Recording Rockin\\' Readers')\nRETURN avg(`t3`.`donation_to_project`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average amount of donations by people who donated in the project \"Recording Rockin' Readers\"",
    "evidence": "average amount of donations = divide(sum(donation_to_project), count(donor_acctid)); project \"Recording Rockin' Readers\" refers to title = 'Recording Rockin' Readers'",
    "idx": 2368
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`essays`)\nMATCH (`t3`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND `t2`.`projectid` = `t3`.`projectid`\nORDER BY `t3`.`donation_to_project` IS NULL ASC, `t3`.`donation_to_project` DESC \nRETURN `t1`.`title` AS `title`, `t3`.`donor_acctid` AS `donor_acctid`, CASE WHEN `t2`.`total_price_excluding_optional_support`=0 THEN NULL ELSE toFloat(`t3`.`donation_to_project`) / `t2`.`total_price_excluding_optional_support` END AS `_col_2`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the essay title of the project that have the highest total price excluding optional support and who is the biggest donor? Identify the donor and calculate how many percent did he/she donated in the project.",
    "evidence": "highest total price excluding optional support refers to max(total_price_excluding_optional_support); who refers to donor_acctid; percent = divide(donation_to_project, total_price_excluding_optional_support)*100%",
    "idx": 2369
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`essays`)\nMATCH (`t3`:`donations`)-[donated_to_0:donated_to]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND `t2`.`projectid` = `t3`.`projectid`\nAND (`t2`.`school_city` =~ '(?i)(?s)Chicago')\nRETURN `t1`.`title` AS `title`, `t3`.`donor_acctid` AS `donor_acctid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the title of all projects located in Chicago along with the ID of the donor.",
    "evidence": "in Chicago refers to school_city = 'Chicago'; ID of the donor refers to donor_acctid",
    "idx": 2374
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`projects`)\nMATCH (`t1`:`essays`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`teacher_prefix` =~ '(?i)(?s)Dr.' AND `t2`.`students_reached` > 300)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which projects created by teachers with Doctor Degree where the project have more than 300 students involved. List down the title of the project.",
    "evidence": "eachers with Doctor Degree refers to teacher_prefix = 'Dr.'; more than 300 students involved refers to students_reached > 300",
    "idx": 2375
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`primary_focus_subject` =~ '(?i)(?s)Literacy')\nRETURN DISTINCT `t1`.`vendor_name` AS `vendor_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of vendor that supplies book resources to all school with literacy subject as their primary focus.",
    "evidence": "literacy subject as primary focus refers to primary_focus_subject = 'Literacy'",
    "idx": 2376
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`resources`:`resources`)\nWHERE `resources`.`vendor_name` = 'Lakeshore Learning Materials'\nRETURN DISTINCT `resources`.`project_resource_type` AS `project_resource_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the types of resources that the vendor Lakeshore Learning Materials has provided for the projects.",
    "evidence": "Lakeshore Learning Materials is vendor_name; type of resources refers to project_resource_type;",
    "idx": 2380
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t2`.`poverty_level` = 'highest poverty')\nRETURN `t1`.`vendor_name` AS `vendor_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the vendor providing resources for the projects of a school with the highest poverty level.",
    "evidence": "highest poverty level refers to poverty_level = 'highest poverty';",
    "idx": 2384
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t1`:`resources`)-[requested_for_0:requested_for]->(`t2`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`vendor_name` = 'Lakeshore Learning Materials')\nORDER BY `t2`.`fulfillment_labor_materials` IS NULL ASC, `t2`.`fulfillment_labor_materials` DESC \nRETURN `t2`.`schoolid` AS `schoolid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Of the projects whose resources are provided by the vendor Lakeshore Learning Materials, the school of which project has the highest cost of labor fulfillment? Please give its school ID.",
    "evidence": "Lakeshore Learning Materials is vendor_name; highest cost of labor fulfillment refers to Max(fulfillment_labor_materials);",
    "idx": 2385
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`donations`)-[donated_to_0:donated_to]->(`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`school_city` = 'Brooklyn' AND `t1`.`school_magnet` = 't')\nRETURN `t2`.`donation_message` AS `donation_message`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the donation messages of the donations for the projects created by a teacher working in a public magnet school in Brooklyn.",
    "evidence": "school in Brooklyn refers to school_city = 'Brooklyn'; public magnet refers to school_magnet = 't';",
    "idx": 2388
  },
  {
    "filename": "train.json",
    "db_id": "donor",
    "gql_statement": "MATCH (`t2`:`donations`)-[donated_to_0:donated_to]->(`t1`:`projects`)\nWHERE `t1`.`projectid` = `t2`.`projectid`\nAND (`t1`.`primary_focus_area` = 'Literacy & Language')\nORDER BY `t2`.`donation_total` IS NULL ASC, `t2`.`donation_total` DESC \nRETURN `t2`.`donor_acctid` AS `donor_acctid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which donor has donated the most for a project whose main subject area is Literacy & Language? Please give his or her ID.",
    "evidence": "main subject area refers to primary_focus_area = 'Literacy & Language'; donated the most refers to Max(donation_total);",
    "idx": 2390
  }
]