[
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`prefix` = 'Mrs.' AND `t1`.`first` = 'Annabelle' AND `t1`.`last` = 'Pouros' AND `t2`.`start` = localdatetime('1970-12-19T00:00:00') AND `t2`.`description` = 'Leucovorin 100 MG Injection')\nRETURN `t2`.`reasondescription` AS `reasondescription`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Why did Mrs. Annabelle Pouros take leucovorin 100 mg injection on 1970/12/19? State the reason.",
    "evidence": "reason why take leucovorin 100 mg injection refers to REASONDESCRIPTION where DESCRIPTION = 'Leucovorin 100 MG Injection'; on 1970/12/19 refers to START = '1970-12-19';",
    "idx": 873
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[prevalence_0:prevalence]->(`t1`:`all_prevalences`)\nWHERE lower(`t1`.`item`) = lower(`t2`.`description`)\nAND (`t2`.`code` = '64859006')\nRETURN DISTINCT `t1`.`prevalence percentage` AS `prevalence percentage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the prevalence percentage of condition no. 64859006?",
    "evidence": "condition no. 64859006 refers to conditions where CODE = '64859006';",
    "idx": 874
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[prevalence_0:prevalence]->(`t1`:`all_prevalences`)\nWHERE lower(`t1`.`item`) = lower(`t2`.`description`)\nAND (`t2`.`code` = '368581000119106')\nRETURN DISTINCT `t1`.`prevalence rate` AS `prevalence rate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the prevalence rate of condition no. 368581000119106.",
    "evidence": "condition no. 368581000119106 refers to conditions where CODE = '368581000119106';",
    "idx": 875
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`procedures`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`prefix` = 'Ms.' AND `t1`.`first` = 'Jacquelyn' AND `t1`.`last` = 'Shanahan' AND `t2`.`date` = localdatetime('2009-08-09T00:00:00'))\nRETURN DISTINCT `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the procedure description of Ms. Jacquelyn Shanahan on 2009/8/9.",
    "evidence": "on 2009/8/9 refers to DATE = '2009-08-09';",
    "idx": 876
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)\nMATCH (`t2`:`claims`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`prefix` = 'Ms.' AND `t1`.`first` = 'Abbie' AND `t1`.`last` = 'Cole' AND `t2`.`billableperiod` >= localdatetime('2010-12-31T00:00:00') AND `t2`.`billableperiod` <= localdatetime('2012-01-01T00:00:00'))\nRETURN COUNT(`t2`.`billableperiod`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of claims did Ms. Abbie Cole have in the year of 2011.",
    "evidence": "in the year of 2011 refers to BILLABLEPERIOD between '2010-12-31' and '2012-01-01';",
    "idx": 877
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`allergies`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`prefix` = 'Mrs.' AND `t1`.`first` = 'Saundra' AND `t1`.`last` = 'Monahan')\nRETURN COUNT(DISTINCT `t2`.`code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many allergies does Mrs. Saundra Monahan have?",
    "evidence": "allergies refer to PATIENT from allergies;",
    "idx": 878
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)\nMATCH (`t2`:`claims`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`billableperiod` = localdatetime('1947-09-11T00:00:00'))\nRETURN `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of the patient who had a claim on 1947/9/11.",
    "evidence": "name of the patient implies full name and refers to first, last; on 1947/9/11 refers to BILLABLEPERIOD = '1947-09-11';",
    "idx": 879
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`prefix` = 'Mr.' AND `t1`.`first` = 'Hubert' AND `t1`.`last` = 'Baumbach' AND `t2`.`date` = localdatetime('2008-10-25T00:00:00'))\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the encounter of Mr. Hubert Baumbach on 2008/10/25.",
    "evidence": "encounter refers to DESCRIPTION from encounters; on 2008/10/25 refers to DATE = '2008-10-25';",
    "idx": 880
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Keven' AND `t1`.`last` = 'Kuhn' AND `t2`.`start` = localdatetime('2016-09-24T00:00:00') AND `t2`.`stop` = localdatetime('2016-10-10T00:00:00'))\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What kind of condition did Keven Kuhn have from 2016/9/24 to 2016/10/10? Describe the condition.",
    "evidence": "kind of condition refers to DESCRIPTION from conditions; from 2016/9/24 to 2016/10/10 refers to START = '2016-09-24' and STOP = '2016-10-10';",
    "idx": 881
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`procedures`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`prefix` = 'Mrs.' AND `t1`.`first` = 'Ira' AND `t1`.`last` = 'Deckow' AND `t2`.`description` = 'Standard pregnancy test')\nRETURN `t2`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did Mrs. Ira Deckow have the standard pregnancy test?",
    "evidence": "standard pregnancy test refers to DESCRIPTION = 'Standard pregnancy test' from procedures;",
    "idx": 882
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`allergies`:`allergies`)\nWHERE NOT `allergies`.`stop` IS NULL\nWITH `allergies`.`patient` AS _groupby_col_0\nORDER BY CASE  WHEN CASE  WHEN -2-1 < 0 AND 1 < 0  THEN substring(`allergies`.`stop`,(case when size(`allergies`.`stop`)+1+(-2-1)+1 < 0 then 0 else size(`allergies`.`stop`)+1+(-2-1)+1 end),-(1))  WHEN -2-1 < 0 AND 1 >= 0  THEN substring(`allergies`.`stop`,size(`allergies`.`stop`)+1+(-2-1),1)  WHEN -2-1 >= 0 AND 1 < 0  THEN substring(`allergies`.`stop`,(case when -2-1+1+(1) < 0 then 0 else -2-1+1+(1) end),-(1))  ELSE substring(`allergies`.`stop`,-2-1,1) END <> '9' THEN toFloat(CASE WHEN char_length(`allergies`.`stop`) - 1-1 < 0 THEN substring(`allergies`.`stop`,size(`allergies`.`stop`)+1+(char_length(`allergies`.`stop`) - 1-1)) ELSE substring(`allergies`.`stop`,char_length(`allergies`.`stop`) - 1-1) END) + 2000  END - CASE  WHEN CASE  WHEN -2-1 < 0 AND 1 < 0  THEN substring(`allergies`.`start`,(case when size(`allergies`.`start`)+1+(-2-1)+1 < 0 then 0 else size(`allergies`.`start`)+1+(-2-1)+1 end),-(1))  WHEN -2-1 < 0 AND 1 >= 0  THEN substring(`allergies`.`start`,size(`allergies`.`start`)+1+(-2-1),1)  WHEN -2-1 >= 0 AND 1 < 0  THEN substring(`allergies`.`start`,(case when -2-1+1+(1) < 0 then 0 else -2-1+1+(1) end),-(1))  ELSE substring(`allergies`.`start`,-2-1,1) END = '9' THEN toFloat(CASE WHEN char_length(`allergies`.`start`) - 1-1 < 0 THEN substring(`allergies`.`start`,size(`allergies`.`start`)+1+(char_length(`allergies`.`start`) - 1-1)) ELSE substring(`allergies`.`start`,char_length(`allergies`.`start`) - 1-1) END) + 1900 ELSE toFloat(CASE WHEN char_length(`allergies`.`start`) - 1-1 < 0 THEN substring(`allergies`.`start`,size(`allergies`.`start`)+1+(char_length(`allergies`.`start`) - 1-1)) ELSE substring(`allergies`.`start`,char_length(`allergies`.`start`) - 1-1) END) + 2000 END IS NULL DESC, CASE  WHEN CASE  WHEN -2-1 < 0 AND 1 < 0  THEN substring(`allergies`.`stop`,(case when size(`allergies`.`stop`)+1+(-2-1)+1 < 0 then 0 else size(`allergies`.`stop`)+1+(-2-1)+1 end),-(1))  WHEN -2-1 < 0 AND 1 >= 0  THEN substring(`allergies`.`stop`,size(`allergies`.`stop`)+1+(-2-1),1)  WHEN -2-1 >= 0 AND 1 < 0  THEN substring(`allergies`.`stop`,(case when -2-1+1+(1) < 0 then 0 else -2-1+1+(1) end),-(1))  ELSE substring(`allergies`.`stop`,-2-1,1) END <> '9' THEN toFloat(CASE WHEN char_length(`allergies`.`stop`) - 1-1 < 0 THEN substring(`allergies`.`stop`,size(`allergies`.`stop`)+1+(char_length(`allergies`.`stop`) - 1-1)) ELSE substring(`allergies`.`stop`,char_length(`allergies`.`stop`) - 1-1) END) + 2000  END - CASE  WHEN CASE  WHEN -2-1 < 0 AND 1 < 0  THEN substring(`allergies`.`start`,(case when size(`allergies`.`start`)+1+(-2-1)+1 < 0 then 0 else size(`allergies`.`start`)+1+(-2-1)+1 end),-(1))  WHEN -2-1 < 0 AND 1 >= 0  THEN substring(`allergies`.`start`,size(`allergies`.`start`)+1+(-2-1),1)  WHEN -2-1 >= 0 AND 1 < 0  THEN substring(`allergies`.`start`,(case when -2-1+1+(1) < 0 then 0 else -2-1+1+(1) end),-(1))  ELSE substring(`allergies`.`start`,-2-1,1) END = '9' THEN toFloat(CASE WHEN char_length(`allergies`.`start`) - 1-1 < 0 THEN substring(`allergies`.`start`,size(`allergies`.`start`)+1+(char_length(`allergies`.`start`) - 1-1)) ELSE substring(`allergies`.`start`,char_length(`allergies`.`start`) - 1-1) END) + 1900 ELSE toFloat(CASE WHEN char_length(`allergies`.`start`) - 1-1 < 0 THEN substring(`allergies`.`start`,size(`allergies`.`start`)+1+(char_length(`allergies`.`start`) - 1-1)) ELSE substring(`allergies`.`start`,char_length(`allergies`.`start`) - 1-1) END) + 2000 END  \nRETURN _groupby_col_0 AS `patient`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the id of the patient who has the longest allergy period?",
    "evidence": "id of the patient refers to PATIENT from allergies where STOP is not null; the longest allergy period refers to MAX(SUBTRACT((SUBSTR(STOP, - 2, 1)! = '9' then substr(STOP, length(STOP) - 1) + 2000 end), (SUBSTR(START, - 2, 1) = '9' then substr(START, length(START) - 1) + 1900 else substr(START, length(START) - 1) + 2000 end)));\n",
    "idx": 883
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`conditions`:`conditions`)\nWHERE `conditions`.`description` = 'Diabetes' AND CASE WHEN `conditions`.`start` is not NULL THEN apoc.temporal.format(`conditions`.`start`,'yyyy') ELSE NULL END = '1988'\nRETURN COUNT(`conditions`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients have diabetes that started in 1988?",
    "evidence": "diabetes that started in 1988 refers to DESCRIPTION = 'Diabetes' from conditions and START like '1988%';",
    "idx": 884
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`allergies`:`allergies`)\nWHERE `allergies`.`description` = 'Allergy to eggs'\nRETURN COUNT(`allergies`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients are allergic to eggs?",
    "evidence": "allergic to eggs refer to DESCRIPTION = 'Allergy to eggs' from allergies;",
    "idx": 885
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "CALL(*) {\nMATCH (`conditions_sub0`:`conditions`)\nWHERE `conditions_sub0`.`description` = 'Hypertension'\nRETURN MAX(`conditions_sub0`.`start`) AS `_col_0`  \n}\nMATCH (`conditions`:`conditions`)\nWHERE `conditions`.`start` = `_col_0`\nRETURN `conditions`.`patient` AS `patient`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the id of the patient whose hypertension started most recently?",
    "evidence": "id of the patient refers to PATIENT from conditions;  hypertension refers to DESCRIPTION = 'Hypertension'; most recently refers to MAX(START);",
    "idx": 886
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`observations`:`observations`)\nWHERE `observations`.`description` = 'Body Height' AND `observations`.`units` = 'cm'\nORDER BY `observations`.`value` IS NULL ASC, `observations`.`value` DESC \nRETURN `observations`.`patient` AS `patient`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is/are the ids of the tallest patient/s?",
    "evidence": "id of the tallest patient/s refers to PATIENT from observations where MAX(DESCRIPTION = 'Body Height');",
    "idx": 887
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Ibuprofen 200 MG Oral Tablet' AND `t1`.`ethnicity` = 'dominican' AND CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END = '2016' AND toFloat(CASE WHEN `t2`.`stop` is not NULL THEN apoc.temporal.format(`t2`.`stop`,'MM') ELSE NULL END) - toFloat(CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'MM') ELSE NULL END) = 1)\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the patients that started taking Ibuprofen 200mg Oral Tablet in 2016, how many Dominican patients stopped taking the medicine after exactly one month?",
    "evidence": "Ibuprofen 200mg Oral Tablet refers to DESCRIPTION = 'Ibuprofen 200 MG Oral Tablet' from medications; started in 2016 refers to START like '2016%'; Dominican patients refer to ethnicity = 'dominican'; stopped taking the medicine after exactly one month refers to SUBTRACT(strftime('%m', STOP), strftime('%m', START)) = 1;",
    "idx": 888
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Pneumonia' AND CASE WHEN `t1`.`birthdate` is not NULL THEN apoc.temporal.format(`t1`.`birthdate`,'yyyy') ELSE NULL END =~ '(?i)(?s)192.*')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the patients born in 1920s had pneumonia?",
    "evidence": "patients born in 1920s refer to patient where birthdate like '192%'; pneumonia refers to DESCRIPTION = 'Pneumonia' from conditions;",
    "idx": 889
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Yaz 28 Day Pack' AND CASE WHEN `t2`.`start` is not NULL THEN apoc.temporal.format(`t2`.`start`,'yyyy') ELSE NULL END = '2011')\nRETURN DISTINCT `t1`.`first` AS `first`, `t1`.`last` AS `last`, `t1`.`suffix` AS `suffix`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the full names of the patients who started taking Yaz 28 Day Pack in 2011?",
    "evidence": "full name refers to first, last; Yaz 28 Day Pack refers to DESCRIPTION = 'Yaz 28 Day Pack' from medications; started taking in 2011 refers to START like '2011%';",
    "idx": 890
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`patients`)-[t2:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`race` = 'black' AND `t2`.`description` = 'DTaP' AND CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy') ELSE NULL END = '2013')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Black patients were immunized with DTaP in 2013?",
    "evidence": "Black patients refer to patient where race = 'black'; immunized with DTaP refers to DESCRIPTION = 'DTaP' from immunizations; in 2013 refers to DATE like '2013%';",
    "idx": 891
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[prevalence_0:prevalence]->(`t1`:`all_prevalences`)\nWHERE lower(`t1`.`item`) = lower(`t2`.`description`)\nORDER BY `t1`.`prevalence rate` IS NULL ASC, `t1`.`prevalence rate` DESC \nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many patients have the most prevalent conditions?",
    "evidence": "the most prevalent conditions refer to MAX(PREVALENCE RATE);",
    "idx": 892
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[prevalence_0:prevalence]->(`t2`:`all_prevalences`)\nWHERE lower(`t2`.`item`) = lower(`t1`.`description`)\nAND (`t2`.`prevalence percentage` = toFloat(18.8))\nRETURN DISTINCT `t1`.`patient` AS `patient`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ids of all the patients with condition that has a prevalence percentage of 18.8%.",
    "evidence": "ids of the patients refer to PATIENT from conditions; condition that has a prevalence percentage of 18.8% refers to PREVALENCE PERCENTAGE = 18.8;",
    "idx": 893
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Tyree' AND `t1`.`last` = 'Eichmann')\nRETURN COUNT(DISTINCT `t2`.`description`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many conditions did Tyree Eichmann have?",
    "evidence": "conditions refer to DESCRIPTION from conditions;",
    "idx": 894
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)\nMATCH ()-[t1:received_immunization]->()\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'meningococcal MCV4P' AND `t2`.`description` = 'Viral sinusitis (disorder)')\nRETURN COUNT(DISTINCT `t1`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the patients who were immunized with meningococcal MCV4P, how many have viral sinusitis disorder after getting the immunization?",
    "evidence": "immunized with meningococcal MCV4P refers to DESCRIPTION = 'meningococcal MCV4P' from immunizations; viral sinusitis disorder refers to DESCRIPTION = 'Viral sinusitis (disorder)' from conditions;",
    "idx": 895
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`gender` = 'F' AND `t1`.`description` = 'Prediabetes')\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the patients with prediabetes, how many are female?",
    "evidence": "patients with prediabetes refer to PATIENT from conditions where DESCRIPTION = 'Prediabetes'; female refers to gender = 'F';",
    "idx": 896
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Body Mass Index' AND `t2`.`units` = 'kg/m2')\nORDER BY `t2`.`value` IS NULL DESC, `t2`.`value`  \nRETURN `t1`.`first` AS `first`, `t1`.`last` AS `last`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the patient's full name with the lowest body mass index in kg/m2.",
    "evidence": "full name refers to first, last; the lowest body mass index in kg/m2 refers to DESCRIPTION = Body Mass Index from observations where MIN(VALUE) and UNITS = 'kg/m2';",
    "idx": 897
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`first` = 'Giovanni' AND `t2`.`last` = 'Russel' AND `t1`.`description` = 'Hypertension')\nRETURN toFloat(CASE WHEN `t2`.`deathdate` is not NULL THEN apoc.temporal.format(`t2`.`deathdate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) AS `age`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the age of the patient with hypertension named Giovanni Russel?",
    "evidence": "age refers to SUBTRACT(strftime('%Y', deathdate), strftime('%Y', birthdate)); hypertension refers to conditions where DESCRIPTION = 'Hypertension';",
    "idx": 898
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`medications`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'oxaliplatin 5 MG/ML [Eloxatin]' AND `t2`.`race` = 'asian' AND `t2`.`gender` = 'F')\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Asian female patients take oxaliplatin 5 MG/ML [Eloxatin]?",
    "evidence": "female refers to gender = 'F'; oxaliplatin 5 MG/ML [Eloxatin] refers to medications where DESCRIPTION = 'oxaliplatin 5 MG/ML [Eloxatin]';",
    "idx": 899
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Stroke' AND `t2`.`deathdate` IS NULL)\nRETURN COUNT(DISTINCT `t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count all of the living patients that had a stroke.",
    "evidence": "if deathdate is null, it means this patient is still alive or living; stroke refers to conditions where DESCRIPTION = 'Stroke';",
    "idx": 900
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`allergies`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Allergy to peanuts' AND `t2`.`race` = 'asian')\nRETURN COUNT(`t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of Asian patients who are allergic to peanuts?",
    "evidence": "Asian refers to race like 'asian%'; allergic to peanuts refers to allergies where DESCRIPTION = 'Allergy to peanuts'; \n",
    "idx": 901
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`observations`)-[patient_0:patient]->(`t2`:`patients`)\nMATCH (`t3`:`conditions`)-[patient_1:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND `t2`.`patient` = `t3`.`patient`\nAND (`t3`.`description` = 'Hypertension' AND `t1`.`description` = 'Diastolic Blood Pressure')\nRETURN avg(`t1`.`value`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the patients with hypertension, what is the average of their diastolic blood pressure?",
    "evidence": "hypertension refers to conditions where DESCRIPTION = 'Hypertension'; average diastolic blood pressure refers to AVG(VALUE) where DESCRIPTION = 'Diastolic Blood Pressure' from observations;",
    "idx": 902
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`medications`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`ssn` = '999-94-3751')\nRETURN `t1`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the medicine prescribed for the patient with social security number 999-94-3751?",
    "evidence": "medicine prescribed refers to DESCRIPTION from medications; social security number 999-94-3751 refers to ssn = '999-94-3751';",
    "idx": 903
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`allergies`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Allergy to grass pollen' AND `t2`.`ethnicity` = 'irish' AND `t2`.`gender` = 'F')\nRETURN `t2`.`ssn` AS `ssn`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the social security number of the female Irish patient allergic to grass pollen.",
    "evidence": "social security number refers to ssn; female refers to gender = 'F'; Irish refers to ethnicity = 'irish'; allergic to grass pollen refers to allergies where DESCRIPTION = 'Allergy to grass pollen';",
    "idx": 904
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`careplans`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`code` = 315043002)\nRETURN `t2`.`first` AS `first`, `t2`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the patient involved in the care plan with code 311791003?",
    "evidence": "",
    "idx": 905
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (NOT `t2`.`deathdate` IS NULL)\nORDER BY toFloat(CASE WHEN `t2`.`deathdate` is not NULL THEN apoc.temporal.format(`t2`.`deathdate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) IS NULL ASC, toFloat(CASE WHEN `t2`.`deathdate` is not NULL THEN apoc.temporal.format(`t2`.`deathdate`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END) DESC \nRETURN `t1`.`description` AS `description`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the patients that died, what is the condition of the oldest patient?",
    "evidence": "if deathdate is not null, it means this patient died; condition refers to DESCRIPTION from conditions; the oldest patient refers to MAX(SUBTRACT(strftime('%Y', deathdate), strftime('%Y', birthdate)));",
    "idx": 906
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[prevalence_0:prevalence]->(`t1`:`all_prevalences`)\nWHERE `t1`.`item` = `t2`.`description`\nORDER BY `t1`.`occurrences` IS NULL ASC, `t1`.`occurrences` DESC \nRETURN `t2`.`code` AS `code`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the code of the prevalent disease with the highest occurrences?",
    "evidence": "",
    "idx": 907
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Glucose' AND `t1`.`address` = '365 Della Crossroad Suite 202 Deerfield MA 01342 US')\nRETURN DISTINCT `t2`.`description` AS `description`, `t2`.`value` AS `value`, `t2`.`units` AS `units`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the glucose level of the patient that lives at 365 Della Crossroad Suite 202, Deerfield, MA 01342 US?",
    "evidence": "glucose level refers to VALUE, UNITS where DESCRIPTION = 'Glucose' from observations; lives at 365 Della Crossroad Suite 202, Deerfield, MA 01342 US refers to address = '365 Della Crossroad Suite 202 Deerfield MA 01342 US';",
    "idx": 908
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t1`:`conditions`)-[patient_0:patient]->(`t2`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`description` = 'Acute bronchitis (disorder)')\nRETURN CASE WHEN COUNT(`t2`.`gender`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`gender` = 'F' AND `t2`.`race` = 'asian' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`gender`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the patients with acute bronchitis, what is the percentage of Asian women?",
    "evidence": "DIVIDE(COUNT(PATIENT where gender = 'F' and race = 'asian'), COUNT(PATIENT)) as percentage where DESCRIPTION = 'Acute bronchitis (disorder)' ;",
    "idx": 909
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`encounters`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Major' AND `t1`.`last` = 'D\\'Amore')\nRETURN COUNT(`t2`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of encounters for Major D'Amore.",
    "evidence": "",
    "idx": 910
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`procedures`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Emmy' AND `t1`.`last` = 'Waelchi')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the procedures received by Emmy Waelchi.",
    "evidence": "procedures refer to DESCRIPTION from procedures;",
    "idx": 911
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`procedures`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Extraction of wisdom tooth')\nRETURN `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the patients' full names who received the extraction of wisdom tooth.",
    "evidence": "patient's full name refers to first, last; extraction of wisdom tooth refers to DESCRIPTION = 'Extraction of wisdom tooth' from procedures;",
    "idx": 912
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`description` = 'Body Weight')\nRETURN `t2`.`description` AS `description`, `t2`.`value` AS `value`, `t2`.`units` AS `units`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the body weight of Elly Koss in every observation.",
    "evidence": "body weight VALUE and UNITS where DESCRIPTION = 'Body Weight' from observations;",
    "idx": 913
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`allergies`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Allergy to soya')\nRETURN `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the patients who had an allergy to soy.",
    "evidence": "allergy to soy refers to allergies where DESCRIPTION = 'Allergy to soya';",
    "idx": 914
  }
]