[
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "MATCH (`item`:`item`)\nRETURN `item`.`i_id` AS `i_id`, `item`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all information in the item table.",
    "evidence": "",
    "idx": 2714
  },
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[review_sub0:reviews]->()\nRETURN `review_sub0`.`i_id` AS `i_id`   } AS in_collect_0\nMATCH (`item`:`item`)\nWHERE NOT `item`.`i_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of items that did not receive any review.",
    "evidence": "",
    "idx": 2721
  },
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[review_sub0:reviews]->()\nRETURN `review_sub0`.`u_id` AS `u_id`   } AS in_collect_0\nMATCH (`useracct`:`useracct`)\nWHERE NOT `useracct`.`u_id` IN in_collect_0\nRETURN `useracct`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of users who did not leave any review.",
    "evidence": "",
    "idx": 2722
  },
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "MATCH (`item`:`item`)\nRETURN `item`.`title` AS `title` ORDER BY `title` IS NULL DESC, `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the titles of all items in alphabetic order .",
    "evidence": "",
    "idx": 2726
  },
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "MATCH (`t1`:`useracct`)-[t2:reviews]->()\nWHERE `t1`.`u_id` = `t2`.`u_id`\nORDER BY `t2`.`rating` IS NULL ASC, `t2`.`rating` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the user who gave the highest rating.",
    "evidence": "",
    "idx": 2727
  },
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "MATCH (`t1`:`useracct`)-[t2:trusts]->()\nWHERE `t1`.`u_id` = `t2`.`target_u_id`\nORDER BY `t2`.`trust` IS NULL DESC, `t2`.`trust`  \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the target user with the lowest trust score.",
    "evidence": "",
    "idx": 2728
  },
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[review_sub0:reviews]->()\nRETURN `review_sub0`.`i_id` AS `i_id`   } AS in_collect_0\nMATCH (`item`:`item`)\nWHERE NOT `item`.`i_id` IN in_collect_0\nRETURN `item`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the items that did not receive any review.",
    "evidence": "",
    "idx": 2729
  },
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[review_sub0:reviews]->()\nRETURN `review_sub0`.`u_id` AS `u_id`   } AS in_collect_0\nMATCH (`useracct`:`useracct`)\nWHERE NOT `useracct`.`u_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of users who did not write any review.",
    "evidence": "",
    "idx": 2731
  },
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[review_sub0:reviews]->()\nRETURN `review_sub0`.`i_id` AS `i_id`   } AS in_collect_0\nMATCH (`item`:`item`)\nWHERE NOT `item`.`i_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of items without any review.",
    "evidence": "",
    "idx": 2732
  },
  {
    "filename": "train_spider.json",
    "db_id": "riding_club",
    "gql_statement": "MATCH (`player`:`player`)\nORDER BY `player`.`votes` IS NULL DESC, `player`.`votes`  \nRETURN `player`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of players in ascending order of votes.",
    "evidence": "",
    "idx": 2734
  },
  {
    "filename": "train_spider.json",
    "db_id": "riding_club",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`occupation` <> 'Researcher'\nRETURN `player`.`player_name` AS `player_name`, `player`.`residence` AS `residence`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name and residence for players whose occupation is not \"Researcher\".",
    "evidence": "",
    "idx": 2736
  },
  {
    "filename": "train_spider.json",
    "db_id": "riding_club",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`residence` = 'Brandon' OR `player`.`residence` = 'Birtle'\nRETURN `player`.`sponsor_name` AS `sponsor_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of sponsors of players whose residence is either \"Brandon\" or \"Birtle\".",
    "evidence": "",
    "idx": 2737
  },
  {
    "filename": "train_spider.json",
    "db_id": "riding_club",
    "gql_statement": "MATCH (`player`:`player`)\nWITH `player`.`occupation` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `occupation`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different occupations along with the number of players in each occupation.",
    "evidence": "",
    "idx": 2739
  },
  {
    "filename": "train_spider.json",
    "db_id": "riding_club",
    "gql_statement": "MATCH (`player`:`player`)\nWITH `player`.`residence` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `residence`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the residences that have at least two players.",
    "evidence": "",
    "idx": 2740
  },
  {
    "filename": "train_spider.json",
    "db_id": "riding_club",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[player_coach_sub0:coached_by]->()\nRETURN `player_coach_sub0`.`player_id` AS `player_id`   } AS in_collect_0\nMATCH (`player`:`player`)\nWHERE NOT `player`.`player_id` IN in_collect_0\nRETURN `player`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of players that do not have coaches.",
    "evidence": "",
    "idx": 2745
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`gymnast`:`gymnast`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of gymnasts.",
    "evidence": "",
    "idx": 2747
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`gymnast`:`gymnast`)\nRETURN `gymnast`.`total_points` AS `total_points` ORDER BY `total_points` IS NULL ASC, `total_points` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the total points of gymnasts in descending order.",
    "evidence": "",
    "idx": 2748
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`gymnast`:`gymnast`)\nORDER BY `gymnast`.`floor_exercise_points` IS NULL ASC, `gymnast`.`floor_exercise_points` DESC \nRETURN `gymnast`.`total_points` AS `total_points`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the total points of gymnasts in descending order of floor exercise points.",
    "evidence": "",
    "idx": 2750
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`gymnast`:`gymnast`)\nRETURN avg(`gymnast`.`horizontal_bar_points`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the average horizontal bar points across all gymnasts.",
    "evidence": "",
    "idx": 2753
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`people`:`people`)\nRETURN `people`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of people, ordered alphabetically.",
    "evidence": "",
    "idx": 2755
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`t1`:`gymnast`)-[is_a_0:is_a]->(`t2`:`people`)\nWHERE `t1`.`gymnast_id` = `t2`.`people_id`\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of the gymnasts.",
    "evidence": "",
    "idx": 2757
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`t1`:`gymnast`)-[is_a_0:is_a]->(`t2`:`people`)\nWHERE `t1`.`gymnast_id` = `t2`.`people_id`\nAND (`t2`.`hometown` <> 'Santo Domingo')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of gymnasts whose hometown is not \"Santo Domingo\"?",
    "evidence": "",
    "idx": 2758
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`t1`:`gymnast`)-[is_a_0:is_a]->(`t2`:`people`)\nWHERE `t1`.`gymnast_id` = `t2`.`people_id`\nAND (`t2`.`hometown` <> 'Santo Domingo')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of gymnasts who did not grow up in Santo Domingo.",
    "evidence": "",
    "idx": 2759
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`people`:`people`)\nORDER BY `people`.`height` IS NULL ASC, `people`.`height` DESC \nRETURN `people`.`age` AS `age`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the age of the person with the greatest height.",
    "evidence": "",
    "idx": 2761
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`people`:`people`)\nORDER BY `people`.`age` IS NULL ASC, `people`.`age` DESC \nRETURN `people`.`name` AS `name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of the top 5 oldest people.",
    "evidence": "",
    "idx": 2762
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`t1`:`gymnast`)-[is_a_0:is_a]->(`t2`:`people`)\nWHERE `t1`.`gymnast_id` = `t2`.`people_id`\nORDER BY `t2`.`age` IS NULL DESC, `t2`.`age`  \nRETURN `t1`.`total_points` AS `total_points`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the total points of the gymnast with the lowest age.",
    "evidence": "",
    "idx": 2765
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`t1`:`gymnast`)-[is_a_0:is_a]->(`t2`:`people`)\nWHERE `t1`.`gymnast_id` = `t2`.`people_id`\nRETURN avg(`t2`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the average age across all gymnasts.",
    "evidence": "",
    "idx": 2767
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`t1`:`gymnast`)-[is_a_0:is_a]->(`t2`:`people`)\nWHERE `t1`.`gymnast_id` = `t2`.`people_id`\nAND (`t1`.`total_points` > 57.5)\nRETURN DISTINCT `t2`.`hometown` AS `hometown`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the different hometowns of gymnasts that have a total point score of above 57.5.",
    "evidence": "",
    "idx": 2769
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`t1`:`gymnast`)-[is_a_0:is_a]->(`t2`:`people`)\nWHERE `t1`.`gymnast_id` = `t2`.`people_id`\nWITH `t2`.`hometown` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `hometown`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the hometowns from which two or more gymnasts are from.",
    "evidence": "",
    "idx": 2773
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`t1`:`gymnast`)-[is_a_0:is_a]->(`t2`:`people`)\nWHERE `t1`.`gymnast_id` = `t2`.`people_id`\nORDER BY `t2`.`height` IS NULL DESC, `t2`.`height`  \nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of gymnasts in ascending order by their heights.",
    "evidence": "",
    "idx": 2774
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`people`:`people`)\nRETURN COUNT(DISTINCT `people`.`hometown`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different hometowns of these people.",
    "evidence": "",
    "idx": 2777
  },
  {
    "filename": "train_spider.json",
    "db_id": "gymnast",
    "gql_statement": "MATCH (`t1`:`gymnast`)-[is_a_0:is_a]->(`t2`:`people`)\nWHERE `t1`.`gymnast_id` = `t2`.`people_id`\nORDER BY `t1`.`total_points` IS NULL ASC, `t1`.`total_points` DESC \nRETURN `t2`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ages of gymnasts in descending order of total points.",
    "evidence": "",
    "idx": 2778
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`savings`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND (`t1`.`name` <> 'Brown')\nRETURN sum(`t2`.`balance`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total savings balance of all accounts except the account with name ‘Brown’.",
    "evidence": "",
    "idx": 2780
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`savings`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND (`t1`.`name` <> 'Brown')\nRETURN sum(`t2`.`balance`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total balance of savings accounts not belonging to someone with the name Brown?",
    "evidence": "",
    "idx": 2781
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of accounts.",
    "evidence": "",
    "idx": 2783
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`checking`:`checking`)\nRETURN sum(`checking`.`balance`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total checking balance in all accounts?",
    "evidence": "",
    "idx": 2784
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`checking`:`checking`)\nRETURN sum(`checking`.`balance`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total balance across checking accounts.",
    "evidence": "",
    "idx": 2785
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`checking`:`checking`)\nRETURN avg(`checking`.`balance`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average checking balance.",
    "evidence": "",
    "idx": 2786
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "CALL(*) {\nMATCH (`savings_sub0`:`savings`)\nRETURN avg(`savings_sub0`.`balance`) AS `_col_0_1`  \n}\nMATCH (`savings`:`savings`)\nWHERE `savings`.`balance` > `_col_0_1`\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of accounts with a savings balance that is higher than the average savings balance.",
    "evidence": "",
    "idx": 2789
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "CALL(*) {\nMATCH (`checking_sub0`:`checking`)\nRETURN MAX(`checking_sub0`.`balance`) AS `_col_0`  \n}\nMATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND (`t2`.`balance` < `_col_0`)\nRETURN `t1`.`custid` AS `custid`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and id of accounts whose checking balance is below the maximum checking balance.",
    "evidence": "",
    "idx": 2790
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "CALL(*) {\nMATCH (`checking_sub0`:`checking`)\nRETURN MAX(`checking_sub0`.`balance`) AS `_col_0`  \n}\nMATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND (`t2`.`balance` < `_col_0`)\nRETURN `t1`.`custid` AS `custid`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the customer id and name corresponding to accounts with a checking balance less than the largest checking balance?",
    "evidence": "",
    "idx": 2791
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND (`t1`.`name` =~ '(?i)(?s).*ee.*')\nRETURN `t2`.`balance` AS `balance`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the checking balance of the account whose owner’s name contains the substring ‘ee’?",
    "evidence": "",
    "idx": 2792
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND (`t1`.`name` =~ '(?i)(?s).*ee.*')\nRETURN `t2`.`balance` AS `balance`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the balance of the checking account belonging to an owner whose name contains 'ee'.",
    "evidence": "",
    "idx": 2793
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nAND (`t1`.`name` = 'Brown')\nRETURN `t2`.`balance` AS `balance`, `t3`.`balance` AS `balance_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the checking balance and saving balance in the Brown’s account.",
    "evidence": "",
    "idx": 2794
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nAND (`t1`.`name` = 'Brown')\nRETURN `t2`.`balance` AS `balance`, `t3`.`balance` AS `balance_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the checking and savings balances in accounts belonging to Brown?",
    "evidence": "",
    "idx": 2795
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN `accounts`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all customers’ names in the alphabetical order.",
    "evidence": "",
    "idx": 2796
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nORDER BY `t2`.`balance` + `t3`.`balance` IS NULL DESC, `t2`.`balance` + `t3`.`balance`  \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of account that has the lowest total checking and saving balance.",
    "evidence": "",
    "idx": 2798
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nORDER BY `t2`.`balance` + `t3`.`balance` IS NULL DESC, `t2`.`balance` + `t3`.`balance`  \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name corresponding to the accoung with the lowest sum of checking and savings balances?",
    "evidence": "",
    "idx": 2799
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t1`.`name` AS `name`, `t2`.`balance` AS `balance` ORDER BY `t3`.`balance` IS NULL DESC, `t3`.`balance`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and checking balance of the account with the lowest savings balance.",
    "evidence": "",
    "idx": 2800
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t1`.`name` AS `name`, `t2`.`balance` AS `balance` ORDER BY `t3`.`balance` IS NULL DESC, `t3`.`balance`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and balances of checking accounts belonging to the customer with the lowest savings balance?",
    "evidence": "",
    "idx": 2801
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of checking accounts for each account name.",
    "evidence": "",
    "idx": 2802
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`savings`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nWITH `t1`.`name` AS _groupby_col_0, sum(`t2`.`balance`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total saving balance for each account name.",
    "evidence": "",
    "idx": 2804
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`savings`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nWITH `t1`.`name` AS _groupby_col_0, sum(`t2`.`balance`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of customers with accounts, and what are the total savings balances for each?",
    "evidence": "",
    "idx": 2805
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "CALL(*) {\nMATCH (`checking_sub0`:`checking`)\nRETURN avg(`checking_sub0`.`balance`) AS `_col_0`  \n}\nMATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND (`t2`.`balance` < `_col_0`)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of accounts whose checking balance is below the average checking balance.",
    "evidence": "",
    "idx": 2806
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "CALL(*) {\nMATCH (`checking_sub0`:`checking`)\nRETURN avg(`checking_sub0`.`balance`) AS `_col_0`  \n}\nMATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND (`t2`.`balance` < `_col_0`)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of customers with checking balances lower than the average checking balance?",
    "evidence": "",
    "idx": 2807
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t3`.`balance` AS `balance` ORDER BY `t2`.`balance` IS NULL ASC, `t2`.`balance` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the saving balance of the account with the highest checking balance.",
    "evidence": "",
    "idx": 2808
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t3`.`balance` AS `balance` ORDER BY `t2`.`balance` IS NULL ASC, `t2`.`balance` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the savings balance of the account belonging to the customer with the highest checking balance?",
    "evidence": "",
    "idx": 2809
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t1`:`checking`)\nMATCH (`t2`:`savings`)\nWHERE `t1`.`custid` = `t2`.`custid`\nRETURN `t1`.`balance` + `t2`.`balance` AS `_col_0` ORDER BY `t1`.`balance` + `t2`.`balance` IS NULL DESC, `t1`.`balance` + `t2`.`balance`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total checking and saving balance of all accounts sorted by the total balance in ascending order.",
    "evidence": "",
    "idx": 2810
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t1`:`checking`)\nMATCH (`t2`:`savings`)\nWHERE `t1`.`custid` = `t2`.`custid`\nRETURN `t1`.`balance` + `t2`.`balance` AS `_col_0` ORDER BY `t1`.`balance` + `t2`.`balance` IS NULL DESC, `t1`.`balance` + `t2`.`balance`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the sum of checking and savings balances for all customers, ordered by the total balance?",
    "evidence": "",
    "idx": 2811
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t2`.`balance` AS `balance`, `t1`.`name` AS `name` ORDER BY `t3`.`balance` IS NULL DESC, `t3`.`balance`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and checking balance of the account with the lowest saving balance.",
    "evidence": "",
    "idx": 2812
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t2`.`balance` AS `balance`, `t1`.`name` AS `name` ORDER BY `t3`.`balance` IS NULL DESC, `t3`.`balance`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name and checking balance of the account which has the lowest savings balance?",
    "evidence": "",
    "idx": 2813
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t2`.`balance` AS `balance`, `t3`.`balance` AS `balance_1`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, checking balance and saving balance of all accounts in the bank.",
    "evidence": "",
    "idx": 2814
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t2`.`balance` AS `balance`, `t3`.`balance` AS `balance_1`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names, checking balances, and savings balances for all customers?",
    "evidence": "",
    "idx": 2815
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t2`.`balance` AS `balance`, `t3`.`balance` AS `balance_1`, `t1`.`name` AS `name` ORDER BY `t2`.`balance` + `t3`.`balance` IS NULL ASC, `t2`.`balance` + `t3`.`balance` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, checking balance and savings balance of all accounts in the bank sorted by their total checking and savings balance in descending order.",
    "evidence": "",
    "idx": 2816
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nRETURN `t2`.`balance` AS `balance`, `t3`.`balance` AS `balance_1`, `t1`.`name` AS `name` ORDER BY `t2`.`balance` + `t3`.`balance` IS NULL ASC, `t2`.`balance` + `t3`.`balance` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names, checking balances, and savings balances of customers, ordered by the total of checking and savings balances descending?",
    "evidence": "",
    "idx": 2817
  }
]