[
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`film`)-[has_language_0:has_language]->(`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t1`.`title` = 'AIRPORT POLLOCK')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which language does the film AIRPORT POLLOCK use? List the language name.",
    "evidence": "",
    "idx": 3745
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`film`)-[has_language_0:has_language]->(`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t1`.`title` = 'AIRPORT POLLOCK')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the language that the film 'AIRPORT POLLOCK' is in?",
    "evidence": "",
    "idx": 3746
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`store`:`store`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of stores.",
    "evidence": "",
    "idx": 3748
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN COUNT(DISTINCT `film`.`rating`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many kinds of different ratings are listed?",
    "evidence": "",
    "idx": 3749
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN COUNT(DISTINCT `film`.`rating`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different film ratings.",
    "evidence": "",
    "idx": 3750
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`special_features` =~ '(?i)(?s).*Deleted Scenes.*'\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which movies have 'Deleted Scenes' as a substring in the special feature?",
    "evidence": "",
    "idx": 3751
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`special_features` =~ '(?i)(?s).*Deleted Scenes.*'\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the titles of films that include 'Deleted Scenes' in their special feature section.",
    "evidence": "",
    "idx": 3752
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH ()-[inventory:stocked_in]->()\nWHERE `inventory`.`store_id` = 1\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many items in inventory does store 1 have?",
    "evidence": "",
    "idx": 3753
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`payment`:`payment`)\nRETURN `payment`.`payment_date` AS `payment_date` ORDER BY `payment_date` IS NULL DESC, `payment_date`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When did the first payment happen?",
    "evidence": "",
    "idx": 3755
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`payment`:`payment`)\nRETURN `payment`.`payment_date` AS `payment_date` ORDER BY `payment_date` IS NULL DESC, `payment_date`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What was the date of the earliest payment?",
    "evidence": "",
    "idx": 3756
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`customer`)-[has_address_0:has_address]->(`t2`:`address`)\nWHERE `t2`.`address_id` = `t1`.`address_id`\nAND (`t1`.`first_name` = 'LINDA')\nRETURN `t2`.`address` AS `address`, `t1`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where does the customer with the first name Linda live? And what is her email?",
    "evidence": "",
    "idx": 3757
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t2`:`rental`)-[rented_by_0:rented_by]->(`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nORDER BY `t2`.`rental_date` IS NULL DESC, `t2`.`rental_date`  \nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name and the last name of the customer who made the earliest rental?",
    "evidence": "",
    "idx": 3759
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t2`:`rental`)-[handled_by_0:handled_by]->(`t1`:`staff`)\nMATCH (`t2`:`rental`)-[rented_by_0:rented_by]->(`t3`:`customer`)\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND `t2`.`customer_id` = `t3`.`customer_id`\nAND (`t3`.`first_name` = 'APRIL' AND `t3`.`last_name` = 'BURNS')\nRETURN DISTINCT `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the full name of the staff member who has rented a film to a customer with the first name April and the last name Burns?",
    "evidence": "",
    "idx": 3761
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`payment`:`payment`)\nRETURN `payment`.`amount` AS `amount` ORDER BY `amount` IS NULL ASC, `amount` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the largest payment amount?",
    "evidence": "",
    "idx": 3763
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`payment`:`payment`)\nRETURN `payment`.`amount` AS `amount` ORDER BY `amount` IS NULL ASC, `amount` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the amount of the largest payment.",
    "evidence": "",
    "idx": 3764
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`staff`)-[has_address_0:has_address]->(`t2`:`address`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`first_name` = 'Elsa')\nRETURN `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where does the staff member with the first name Elsa live?",
    "evidence": "",
    "idx": 3765
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "MATCH (`t1`:`staff`)-[has_address_0:has_address]->(`t2`:`address`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`first_name` = 'Elsa')\nRETURN `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the address of the staff member who has the first name Elsa.",
    "evidence": "",
    "idx": 3766
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`rental_sub0`:`rental`)\nWHERE `rental_sub0`.`rental_date` > localdatetime('2005-08-23T02:06:01')\nRETURN `rental_sub0`.`customer_id` AS `customer_id`   } AS in_collect_0\nMATCH (`customer`:`customer`)\nWHERE NOT `customer`.`customer_id` IN in_collect_0\nRETURN `customer`.`first_name` AS `first_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names of customers who have not rented any films after '2005-08-23 02:06:01'?",
    "evidence": "",
    "idx": 3767
  },
  {
    "filename": "train_spider.json",
    "db_id": "sakila_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`rental_sub0`:`rental`)\nWHERE `rental_sub0`.`rental_date` > localdatetime('2005-08-23T02:06:01')\nRETURN `rental_sub0`.`customer_id` AS `customer_id`   } AS in_collect_0\nMATCH (`customer`:`customer`)\nWHERE NOT `customer`.`customer_id` IN in_collect_0\nRETURN `customer`.`first_name` AS `first_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the first names of customers who did not rented a film after the date '2005-08-23 02:06:01'.",
    "evidence": "",
    "idx": 3768
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of bank branches.",
    "evidence": "",
    "idx": 3770
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nRETURN sum(`bank`.`no_of_customers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of customers across banks?",
    "evidence": "",
    "idx": 3772
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nWHERE `bank`.`city` = 'New York City'\nRETURN sum(`bank`.`no_of_customers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of customers in the banks at New York City.",
    "evidence": "",
    "idx": 3773
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nWHERE `bank`.`city` = 'New York City'\nRETURN sum(`bank`.`no_of_customers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of customers who use banks in New York City?",
    "evidence": "",
    "idx": 3774
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nWHERE `bank`.`state` = 'Utah'\nRETURN avg(`bank`.`no_of_customers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average number of customers in all banks of Utah state.",
    "evidence": "",
    "idx": 3775
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nRETURN avg(`bank`.`no_of_customers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average number of customers cross all banks.",
    "evidence": "",
    "idx": 3777
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nWHERE `bank`.`bname` = 'morningside'\nRETURN `bank`.`city` AS `city`, `bank`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the city and state of the bank branch named morningside.",
    "evidence": "",
    "idx": 3779
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nWHERE `bank`.`state` = 'New York'\nRETURN `bank`.`bname` AS `bname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the branch names of banks in the New York state.",
    "evidence": "",
    "idx": 3781
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nORDER BY `customer`.`acc_bal` IS NULL DESC, `customer`.`acc_bal`  \nRETURN `customer`.`cust_name` AS `cust_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of all customers sorted by their account balance in ascending order.",
    "evidence": "",
    "idx": 3783
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`no_of_loans` = 0\nRETURN `customer`.`state` AS `state`, `customer`.`acc_type` AS `acc_type`, `customer`.`credit_score` AS `credit_score`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the state, account type, and credit score of the customer whose number of loan is 0.",
    "evidence": "",
    "idx": 3785
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nRETURN COUNT(DISTINCT `bank`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of different cities which banks are located at.",
    "evidence": "",
    "idx": 3787
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nRETURN COUNT(DISTINCT `bank`.`state`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of different states which banks are located at.",
    "evidence": "",
    "idx": 3789
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nRETURN COUNT(DISTINCT `customer`.`acc_type`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different account types.",
    "evidence": "",
    "idx": 3792
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`cust_name` =~ '(?i)(?s).*a.*'\nRETURN `customer`.`cust_name` AS `cust_name`, `customer`.`acc_bal` AS `acc_bal`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and account balance of the customer whose name includes the letter ‘a’.",
    "evidence": "",
    "idx": 3793
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`state` = 'Utah' OR `customer`.`state` = 'Texas'\nRETURN sum(`customer`.`acc_bal`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total account balance of each customer from Utah or Texas.",
    "evidence": "",
    "idx": 3795
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`state` = 'Utah' OR `customer`.`state` = 'Texas'\nRETURN sum(`customer`.`acc_bal`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total account balances for each customer from Utah or Texas?",
    "evidence": "",
    "idx": 3796
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "CALL(*) {\nMATCH (`customer_sub0`:`customer`)\nRETURN avg(`customer_sub0`.`credit_score`) AS `_col_0`  \n}\nMATCH (`customer`:`customer`)\nWHERE `customer`.`credit_score` < `_col_0`\nRETURN `customer`.`cust_name` AS `cust_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of customers whose credit score is below the average credit scores of all customers.",
    "evidence": "",
    "idx": 3797
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`bank`:`bank`)\nORDER BY `bank`.`no_of_customers` IS NULL ASC, `bank`.`no_of_customers` DESC \nRETURN `bank`.`bname` AS `bname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the branch name of the bank that has the most number of customers.",
    "evidence": "",
    "idx": 3799
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nORDER BY `customer`.`credit_score` IS NULL DESC, `customer`.`credit_score`  \nRETURN `customer`.`cust_name` AS `cust_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of customer who has the lowest credit score.",
    "evidence": "",
    "idx": 3801
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nORDER BY `customer`.`credit_score` IS NULL ASC, `customer`.`credit_score` DESC \nRETURN `customer`.`cust_name` AS `cust_name`, `customer`.`acc_type` AS `acc_type`, `customer`.`acc_bal` AS `acc_bal`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, account type, and account balance of the customer who has the highest credit score.",
    "evidence": "",
    "idx": 3803
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`credit_score` < 50\nWITH `customer`.`acc_type` AS _groupby_col_0, avg(`customer`.`acc_bal`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `acc_type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each account type, find the average account balance of customers with credit score lower than 50.",
    "evidence": "",
    "idx": 3805
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`credit_score` > 100\nWITH `customer`.`state` AS _groupby_col_0, sum(`customer`.`acc_bal`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `state`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each state, find the total account balance of customers whose credit score is above 100.",
    "evidence": "",
    "idx": 3807
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`credit_score` > 100\nWITH `customer`.`state` AS _groupby_col_0, sum(`customer`.`acc_bal`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `state`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total account balance for customers with a credit score of above 100 for the different states?",
    "evidence": "",
    "idx": 3808
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH ()-[t2:has_loan]->(`t1`:`bank`)\nWHERE `t1`.`branch_id` = `t2`.`branch_id`\nWITH `t1`.`bname` AS _groupby_col_0, sum(`t2`.`amount`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `bname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the different bank branches, and what are their total loan amounts?",
    "evidence": "",
    "idx": 3810
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`t1`:`customer`)-[t2:has_loan]->()\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nWITH `t1`.`cust_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `cust_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of customers who have more than one loan.",
    "evidence": "",
    "idx": 3811
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`t1`:`customer`)-[t2:has_loan]->()\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nRETURN DISTINCT `t1`.`cust_name` AS `cust_name`, `t1`.`credit_score` AS `credit_score`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and credit score of the customers who have some loans.",
    "evidence": "",
    "idx": 3815
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`t1`:`customer`)-[t2:has_loan]->()\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t2`.`amount` > 3000)\nRETURN `t1`.`cust_name` AS `cust_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the the name of the customers who have a loan with amount more than 3000.",
    "evidence": "",
    "idx": 3817
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH (`t3`:`customer`)-[t1:has_loan]->(`t2`:`bank`)\nWHERE `t1`.`branch_id` = `t2`.`branch_id`\nAND `t1`.`cust_id` = `t3`.`cust_id`\nAND (`t3`.`credit_score` < 100)\nRETURN `t2`.`bname` AS `bname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of bank branches that have provided a loan to any customer whose credit score is below 100.",
    "evidence": "",
    "idx": 3821
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "MATCH ()-[t2:has_loan]->(`t1`:`bank`)\nWHERE `t1`.`branch_id` = `t2`.`branch_id`\nAND (`t1`.`state` = 'New York')\nRETURN sum(`t2`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of money loaned by banks in New York state?",
    "evidence": "",
    "idx": 3824
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[loan_sub0:has_loan]->()\nRETURN `loan_sub0`.`cust_id` AS `cust_id`   } AS in_collect_0\nMATCH (`customer`:`customer`)\nWHERE `customer`.`cust_id` IN in_collect_0\nRETURN avg(`customer`.`credit_score`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average credit score of the customers who have some loan.",
    "evidence": "",
    "idx": 3825
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[loan_sub0:has_loan]->()\nRETURN `loan_sub0`.`cust_id` AS `cust_id`   } AS in_collect_0\nMATCH (`customer`:`customer`)\nWHERE `customer`.`cust_id` IN in_collect_0\nRETURN avg(`customer`.`credit_score`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average credit score for customers who have taken a loan?",
    "evidence": "",
    "idx": 3826
  },
  {
    "filename": "train_spider.json",
    "db_id": "loan_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[loan_sub0:has_loan]->()\nRETURN `loan_sub0`.`cust_id` AS `cust_id`   } AS in_collect_0\nMATCH (`customer`:`customer`)\nWHERE NOT `customer`.`cust_id` IN in_collect_0\nRETURN avg(`customer`.`credit_score`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average credit score of the customers who do not have any loan.",
    "evidence": "",
    "idx": 3827
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`detention`:`detention`)\nRETURN DISTINCT `detention`.`detention_type_code` AS `detention_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return all distinct detention type codes.",
    "evidence": "",
    "idx": 3833
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`behavior_incident`:`behavior_incident`)\nWHERE `behavior_incident`.`incident_type_code` = 'NOISE'\nRETURN `behavior_incident`.`date_incident_start` AS `date_incident_start`, `behavior_incident`.`date_incident_end` AS `date_incident_end`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the start and end dates for incidents with incident type code \"NOISE\"?",
    "evidence": "",
    "idx": 3834
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`detention`:`detention`)\nRETURN `detention`.`detention_summary` AS `detention_summary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return all detention summaries.",
    "evidence": "",
    "idx": 3835
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`students`:`students`)\nRETURN `students`.`cell_mobile_number` AS `cell_mobile_number`, `students`.`email_address` AS `email_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the cell phone number and email address for all students.",
    "evidence": "",
    "idx": 3836
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`students`:`students`)\nWHERE `students`.`first_name` = 'Emma' AND `students`.`last_name` = 'Rohan'\nRETURN `students`.`email_address` AS `email_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the email of the student with first name \"Emma\" and last name \"Rohan\"?",
    "evidence": "",
    "idx": 3837
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`teachers`:`teachers`)\nWHERE `teachers`.`last_name` = 'Medhurst'\nRETURN `teachers`.`gender` AS `gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the gender of the teacher with last name \"Medhurst\"?",
    "evidence": "",
    "idx": 3839
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`ref_incident_type`:`ref_incident_type`)\nWHERE `ref_incident_type`.`incident_type_code` = 'VIOLENCE'\nRETURN `ref_incident_type`.`incident_type_description` AS `incident_type_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the incident type description for the incident type with code \"VIOLENCE\"?",
    "evidence": "",
    "idx": 3840
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`teachers`:`teachers`)\nWHERE `teachers`.`email_address` =~ '(?i)(?s).*man.*'\nRETURN `teachers`.`first_name` AS `first_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of teachers whose email address contains the word \"man\".",
    "evidence": "",
    "idx": 3842
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nRETURN `addresses`.`city` AS `city` ORDER BY `city` IS NULL DESC, `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all cities of addresses in alphabetical order.",
    "evidence": "",
    "idx": 3844
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`teachers`:`teachers`)\nRETURN `teachers`.`first_name` AS `first_name`, `teachers`.`last_name` AS `last_name` ORDER BY `last_name` IS NULL DESC, `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names and last names of teachers in alphabetical order of last name.",
    "evidence": "",
    "idx": 3845
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`t2`:`teachers`)-[t1:wrote_assessment_note]->()\nWHERE `t1`.`teacher_id` = `t2`.`teacher_id`\nAND (`t2`.`last_name` = 'Schuster')\nRETURN `t1`.`text_of_notes` AS `text_of_notes`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the texts of assessment notes for teachers with last name \"Schuster\".",
    "evidence": "",
    "idx": 3848
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`t1`:`behavior_incident`)-[involves_student_0:involves_student]->(`t2`:`students`)\nWHERE `t1`.`student_id` = `t2`.`student_id`\nAND (`t2`.`last_name` = 'Fahey')\nRETURN `t1`.`date_incident_start` AS `date_incident_start`, `t1`.`date_incident_end` AS `date_incident_end`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the start and end dates of behavior incidents of students with last name \"Fahey\".",
    "evidence": "",
    "idx": 3849
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`t1`:`detention`)-[supervised_by_0:supervised_by]->(`t2`:`teachers`)\nWHERE `t1`.`teacher_id` = `t2`.`teacher_id`\nAND (`t2`.`last_name` = 'Schultz')\nRETURN `t1`.`datetime_detention_start` AS `datetime_detention_start`, `t1`.`datetime_detention_end` AS `datetime_detention_end`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the start and end dates of detentions of teachers with last name \"Schultz\".",
    "evidence": "",
    "idx": 3850
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH ()-[t2:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`state_province_county` = 'Texas')\nRETURN `t2`.`monthly_rental` AS `monthly_rental`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the monthly rentals of student addresses in Texas state?",
    "evidence": "",
    "idx": 3853
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`t2`:`students`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`state_province_county` = 'Wisconsin')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names and last names of students with address in Wisconsin state?",
    "evidence": "",
    "idx": 3854
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`t2`:`teachers`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`first_name` = 'Lyla')\nRETURN `t1`.`zip_postcode` AS `zip_postcode`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the zip code of the address where the teacher with first name \"Lyla\" lives?",
    "evidence": "",
    "idx": 3855
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "MATCH (`t2`:`teachers`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`zip_postcode` = '918')\nRETURN `t2`.`email_address` AS `email_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the email addresses of teachers whose address has zip code \"918\"?",
    "evidence": "",
    "idx": 3856
  },
  {
    "filename": "train_spider.json",
    "db_id": "behavior_monitoring",
    "gql_statement": "WITH *, COLLECT { MATCH (`behavior_incident_sub0`:`behavior_incident`)\nRETURN `behavior_incident_sub0`.`student_id` AS `student_id`   } AS in_collect_0\nMATCH (`students`:`students`)\nWHERE NOT `students`.`student_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students are not involved in any behavior incident?",
    "evidence": "",
    "idx": 3857
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`t2`:`assets`)-[covered_by_0:covered_by]->(`t1`:`maintenance_contracts`)\nWHERE `t1`.`maintenance_contract_id` = `t2`.`maintenance_contract_id`\nWITH `t1`.`maintenance_contract_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `maintenance_contract_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many assets does each maintenance contract contain? List the number and the contract id.",
    "evidence": "",
    "idx": 3858
  }
]