[
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`t1`:`policies`)-[belongs_to_0:belongs_to]->(`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`policy_type_code` = 'Deputy')\nRETURN DISTINCT `t2`.`customer_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the customers who have an deputy policy.",
    "evidence": "",
    "idx": 2596
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`t1`:`policies`)-[belongs_to_0:belongs_to]->(`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`policy_type_code` = 'Deputy' OR `t1`.`policy_type_code` = 'Uniform')\nRETURN DISTINCT `t2`.`customer_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of customers who either have an deputy policy or uniformed policy.",
    "evidence": "",
    "idx": 2598
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`customer_details` AS `customer_details`   \nUNION DISTINCT\nMATCH (`staff`:`staff`)\nRETURN `staff`.`staff_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all the customers and staff members.",
    "evidence": "",
    "idx": 2600
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`customer_details` AS `customer_details`   \nUNION DISTINCT\nMATCH (`staff`:`staff`)\nRETURN `staff`.`staff_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the customers and staff members?",
    "evidence": "",
    "idx": 2601
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`policies`:`policies`)\nWITH `policies`.`policy_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `policy_type_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of records of each policy type and its type code.",
    "evidence": "",
    "idx": 2602
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`claims_processing_stages`:`claims_processing_stages`)\nWHERE `claims_processing_stages`.`claim_status_name` = 'Open'\nRETURN `claims_processing_stages`.`claim_status_description` AS `claim_status_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the description of the claim status \"Open\"?",
    "evidence": "",
    "idx": 2604
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "CALL(*) {\nMATCH (`policies_sub0`:`policies`)\nRETURN MAX(`policies_sub0`.`start_date`) AS `_col_0`  \n}\nMATCH (`t1`:`policies`)-[belongs_to_0:belongs_to]->(`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`start_date` = `_col_0`)\nRETURN `t2`.`customer_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which customer is associated with the latest policy?",
    "evidence": "",
    "idx": 2608
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of accounts.",
    "evidence": "",
    "idx": 2610
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN COUNT(DISTINCT `accounts`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customers who have an account.",
    "evidence": "",
    "idx": 2613
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nRETURN `accounts`.`account_id` AS `account_id`, `accounts`.`date_account_opened` AS `date_account_opened`, `accounts`.`account_name` AS `account_name`, `accounts`.`other_account_details` AS `other_account_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the id, the date of account opened, the account name, and other account detail for all accounts.",
    "evidence": "",
    "idx": 2614
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`t1`:`accounts`)-[owned_by_0:owned_by]->(`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`customer_first_name` = 'Meaghan')\nRETURN `t1`.`account_id` AS `account_id`, `t1`.`date_account_opened` AS `date_account_opened`, `t1`.`account_name` AS `account_name`, `t1`.`other_account_details` AS `other_account_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the id, the account name, and other account details for all accounts by the customer with first name 'Meaghan'.",
    "evidence": "",
    "idx": 2616
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`t1`:`accounts`)-[owned_by_0:owned_by]->(`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`customer_first_name` = 'Meaghan' AND `t2`.`customer_last_name` = 'Keeling')\nRETURN `t1`.`account_name` AS `account_name`, `t1`.`other_account_details` AS `other_account_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the account name and other account detail for all accounts by the customer with first name Meaghan and last name Keeling.",
    "evidence": "",
    "idx": 2618
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`t1`:`accounts`)-[owned_by_0:owned_by]->(`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`account_name` = '900')\nRETURN `t2`.`customer_first_name` AS `customer_first_name`, `t2`.`customer_last_name` AS `customer_last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the first name and last name for the customer with account name 900.",
    "evidence": "",
    "idx": 2620
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "WITH *, COLLECT { MATCH (`accounts_sub0`:`accounts`)\nRETURN `accounts_sub0`.`customer_id` AS `customer_id`   } AS in_collect_0\nMATCH (`customers`:`customers`)\nWHERE NOT `customers`.`customer_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customers who do not have an account.",
    "evidence": "",
    "idx": 2623
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`t2`:`accounts`)-[owned_by_0:owned_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nRETURN DISTINCT `t1`.`customer_first_name` AS `customer_first_name`, `t1`.`customer_last_name` AS `customer_last_name`, `t1`.`phone_number` AS `phone_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the unique first names, last names, and phone numbers for all customers with any account.",
    "evidence": "",
    "idx": 2624
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`accounts`:`accounts`)\nWITH `accounts`.`customer_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `customer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many accounts does each customer have? List the number and customer id.",
    "evidence": "",
    "idx": 2626
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of customers.",
    "evidence": "",
    "idx": 2628
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customers.",
    "evidence": "",
    "idx": 2629
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`customers`:`customers`)\nWITH `customers`.`gender` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `gender`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of customers for each gender.",
    "evidence": "",
    "idx": 2630
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH ()-[financial_transactions:has_transaction]->()\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many transactions do we have?",
    "evidence": "",
    "idx": 2632
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`t2`:`accounts`)-[t1:has_transaction]->()\nWHERE `t1`.`account_id` = `t2`.`account_id`\nAND (`t2`.`account_name` = '337')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many transaction does account with name 337 have?",
    "evidence": "",
    "idx": 2636
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`t2`:`accounts`)-[t1:has_transaction]->()\nWHERE `t1`.`account_id` = `t2`.`account_id`\nAND (`t2`.`account_name` = '337')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of financial transactions that the account with the name 337 has.",
    "evidence": "",
    "idx": 2637
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH ()-[financial_transactions:has_transaction]->()\nRETURN avg(`financial_transactions`.`transaction_amount`) AS `_col_0`, min(`financial_transactions`.`transaction_amount`) AS `_col_1`, MAX(`financial_transactions`.`transaction_amount`) AS `_col_2`, sum(`financial_transactions`.`transaction_amount`) AS `_col_3`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average, minimum, maximum, and total transaction amount?",
    "evidence": "",
    "idx": 2638
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "CALL(*) {\nMATCH ()-[financial_transactions_sub0:has_transaction]->()\nRETURN avg(`financial_transactions_sub0`.`transaction_amount`) AS `_col_0`  \n}\nMATCH ()-[financial_transactions:has_transaction]->()\nWHERE `financial_transactions`.`transaction_amount` > `_col_0`\nRETURN `financial_transactions`.`transaction_id` AS `transaction_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids for transactions that have an amount greater than the average amount of a transaction?",
    "evidence": "",
    "idx": 2641
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH ()-[financial_transactions:has_transaction]->()\nWITH `financial_transactions`.`transaction_type` AS _groupby_col_0, sum(`financial_transactions`.`transaction_amount`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `transaction_type`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are total transaction amounts for each transaction type?",
    "evidence": "",
    "idx": 2643
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN DISTINCT `products`.`product_size` AS `product_size`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all product sizes.",
    "evidence": "",
    "idx": 2644
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN DISTINCT `products`.`product_color` AS `product_color`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all product colors.",
    "evidence": "",
    "idx": 2646
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH ()-[financial_transactions:has_transaction]->()\nWITH `financial_transactions`.`invoice_number` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `invoice_number`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many transactions correspond to each invoice number?",
    "evidence": "",
    "idx": 2649
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of invoices.",
    "evidence": "",
    "idx": 2651
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`t1`:`invoices`)-[generated_from_0:generated_from]->(`t2`:`orders`)\nWHERE `t1`.`order_id` = `t2`.`order_id`\nRETURN `t1`.`invoice_date` AS `invoice_date`, `t1`.`order_id` AS `order_id`, `t2`.`order_details` AS `order_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show invoice dates and order id and details for all invoices.",
    "evidence": "",
    "idx": 2652
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWITH `invoices`.`order_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `order_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the order ids and the number of invoices for each order.",
    "evidence": "",
    "idx": 2654
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "MATCH (`t3`:`orders`)-[t1:contains]->(`t2`:`products`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t3`.`order_id` = `t1`.`order_id`\nWITH `t2`.`product_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `product_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all product names and the number of customers having an order on each product.",
    "evidence": "",
    "idx": 2660
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[order_items_sub0:contains]->()\nRETURN `order_items_sub0`.`product_id` AS `product_id`   } AS in_collect_0\nMATCH (`products`:`products`)\nWHERE NOT `products`.`product_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many products were not included in any order?",
    "evidence": "",
    "idx": 2664
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_invoices",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[order_items_sub0:contains]->()\nRETURN `order_items_sub0`.`product_id` AS `product_id`   } AS in_collect_0\nMATCH (`products`:`products`)\nWHERE NOT `products`.`product_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of products that were never ordered.",
    "evidence": "",
    "idx": 2665
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`church`:`church`)\nRETURN `church`.`name` AS `name`, `church`.`open_date` AS `open_date`, `church`.`organized_by` AS `organized_by`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name, open date, and organizer for all churches.",
    "evidence": "",
    "idx": 2667
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`church`:`church`)\nORDER BY `church`.`open_date` IS NULL ASC, `church`.`open_date` DESC \nRETURN `church`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all church names in descending order of opening date.",
    "evidence": "",
    "idx": 2668
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`church`:`church`)\nWITH `church`.`open_date` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `open_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the opening year in whcih at least two churches opened.",
    "evidence": "",
    "idx": 2669
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`church`:`church`)\nWHERE `church`.`open_date` >= 1830 AND `church`.`open_date` <= 1840\nRETURN `church`.`organized_by` AS `organized_by`, `church`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the organizer and name for churches that opened between 1830 and 1840.",
    "evidence": "",
    "idx": 2670
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`church`:`church`)\nWITH `church`.`open_date` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `open_date`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all opening years and the number of churches that opened in that year.",
    "evidence": "",
    "idx": 2671
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`church`:`church`)\nRETURN `church`.`name` AS `name`, `church`.`open_date` AS `open_date` ORDER BY `open_date` IS NULL ASC, `open_date` DESC \nLIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and opening year for three churches that opened most recently.",
    "evidence": "",
    "idx": 2672
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`people`:`people`)\nRETURN min(`people`.`age`) AS `_col_0`, MAX(`people`.`age`) AS `_col_1`, avg(`people`.`age`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the minimum, maximum, and average age for all people.",
    "evidence": "",
    "idx": 2674
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "CALL(*) {\nMATCH (`people_sub0`:`people`)\nRETURN avg(`people_sub0`.`age`) AS `_col_0`  \n}\nMATCH (`people`:`people`)\nWHERE `people`.`age` < `_col_0`\nRETURN `people`.`name` AS `name`, `people`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and country for all people whose age is smaller than the average.",
    "evidence": "",
    "idx": 2675
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:married_at]->()\nMATCH (`t3`:`people`)-[t1:married_at]->()\nWHERE `t1`.`male_id` = `t2`.`people_id`\nAND `t1`.`female_id` = `t3`.`people_id`\nAND (`t1`.`year` > 2014)\nRETURN `t2`.`name` AS `name`, `t3`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the pair of male and female names in all weddings after year 2014",
    "evidence": "",
    "idx": 2676
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[wedding_sub0:married_at]->()\nRETURN `wedding_sub0`.`male_id` AS `male_id`   } AS in_collect_0\nMATCH (`people`:`people`)\nWHERE `people`.`is_male` = 'T' AND NOT `people`.`people_id` IN in_collect_0\nRETURN `people`.`name` AS `name`, `people`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and age for all male people who don't have a wedding.",
    "evidence": "",
    "idx": 2677
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:married_at]->()\nWHERE `t1`.`female_id` = `t2`.`people_id`\nAND (`t1`.`year` = 2016 AND `t2`.`is_male` = 'F' AND `t2`.`country` = 'Canada')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names for all females from Canada having a wedding in year 2016.",
    "evidence": "",
    "idx": 2678
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH ()-[wedding:married_at]->()\nWHERE `wedding`.`year` = 2016\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many weddings are there in year 2016?",
    "evidence": "",
    "idx": 2679
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`t2`:`people`)-[t1:married_at]->(`t4`:`church`)\nMATCH (`t3`:`people`)-[t1:married_at]->()\nWHERE `t1`.`male_id` = `t2`.`people_id`\nAND `t1`.`female_id` = `t3`.`people_id`\nAND `t4`.`church_id` = `t1`.`church_id`\nAND (`t2`.`age` > 30 OR `t3`.`age` > 30)\nRETURN `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the church names for the weddings of all people older than 30.",
    "evidence": "",
    "idx": 2680
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH (`people`:`people`)\nWITH `people`.`country` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `country`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all countries and the number of people from each country.",
    "evidence": "",
    "idx": 2681
  },
  {
    "filename": "train_spider.json",
    "db_id": "wedding",
    "gql_statement": "MATCH ()-[wedding:married_at]->()\nWHERE `wedding`.`year` = 2016\nRETURN COUNT(DISTINCT `wedding`.`church_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many churches have a wedding in year 2016?",
    "evidence": "",
    "idx": 2682
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`artist`:`artist`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of artists.",
    "evidence": "",
    "idx": 2684
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`artist`:`artist`)\nORDER BY `artist`.`year_join` IS NULL DESC, `artist`.`year_join`  \nRETURN `artist`.`name` AS `name`, `artist`.`age` AS `age`, `artist`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all artist name, age, and country ordered by the yeared they joined.",
    "evidence": "",
    "idx": 2685
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`artist`:`artist`)\nRETURN DISTINCT `artist`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the different countries for artists.",
    "evidence": "",
    "idx": 2688
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`artist`:`artist`)\nWHERE `artist`.`country` <> 'United States'\nRETURN `artist`.`name` AS `name`, `artist`.`year_join` AS `year_join`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all artist names and the year joined who are not from United States.",
    "evidence": "",
    "idx": 2689
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`artist`:`artist`)\nWHERE `artist`.`country` <> 'United States'\nRETURN `artist`.`name` AS `name`, `artist`.`year_join` AS `year_join`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and year of joining for artists that do not have the country \"United States\"?",
    "evidence": "",
    "idx": 2690
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`artist`:`artist`)\nWHERE `artist`.`age` > 46 AND `artist`.`year_join` > 1990\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of artists who are older than 46 and joined after 1990.",
    "evidence": "",
    "idx": 2692
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`artist`:`artist`)\nWHERE `artist`.`country` = 'United States'\nRETURN avg(`artist`.`age`) AS `_col_0`, min(`artist`.`age`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average and minimum age of all artists from United States.",
    "evidence": "",
    "idx": 2693
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`artist`:`artist`)\nWHERE `artist`.`country` = 'United States'\nRETURN avg(`artist`.`age`) AS `_col_0`, min(`artist`.`age`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the average and minimum ages across artists from the United States.",
    "evidence": "",
    "idx": 2694
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`artist`:`artist`)\nORDER BY `artist`.`year_join` IS NULL ASC, `artist`.`year_join` DESC \nRETURN `artist`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name of the artist who has the latest join year.",
    "evidence": "",
    "idx": 2696
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`exhibition`:`exhibition`)\nWHERE `exhibition`.`year` >= 2005\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of exhibitions that happened in or after 2005.",
    "evidence": "",
    "idx": 2698
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`exhibition`:`exhibition`)\nWHERE `exhibition`.`ticket_price` < 15\nRETURN `exhibition`.`theme` AS `theme`, `exhibition`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show theme and year for all exhibitions with ticket prices lower than 15.",
    "evidence": "",
    "idx": 2699
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "WITH *, COLLECT { MATCH (`exhibition_sub0`:`exhibition`)\nRETURN `exhibition_sub0`.`artist_id` AS `artist_id`   } AS in_collect_0\nMATCH (`artist`:`artist`)\nWHERE NOT `artist`.`artist_id` IN in_collect_0\nRETURN `artist`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names for artists without any exhibition.",
    "evidence": "",
    "idx": 2701
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "CALL(*) {\nMATCH (`exhibition_sub0`:`exhibition`)\nRETURN avg(`exhibition_sub0`.`ticket_price`) AS `_col_0`  \n}\nMATCH (`t1`:`exhibition`)-[created_by_0:created_by]->(`t2`:`artist`)\nWHERE `t1`.`artist_id` = `t2`.`artist_id`\nAND (`t1`.`ticket_price` > `_col_0`)\nRETURN `t1`.`theme` AS `theme`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the theme and artist name for the exhibition with a ticket price higher than the average?",
    "evidence": "",
    "idx": 2703
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`exhibition`:`exhibition`)\nWHERE `exhibition`.`year` < 2009\nRETURN avg(`exhibition`.`ticket_price`) AS `_col_0`, min(`exhibition`.`ticket_price`) AS `_col_1`, MAX(`exhibition`.`ticket_price`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average, minimum, and maximum ticket prices for exhibitions for all years before 2009.",
    "evidence": "",
    "idx": 2705
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`exhibition`:`exhibition`)\nWHERE `exhibition`.`year` < 2009\nRETURN avg(`exhibition`.`ticket_price`) AS `_col_0`, min(`exhibition`.`ticket_price`) AS `_col_1`, MAX(`exhibition`.`ticket_price`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average, minimum, and maximum ticket prices for exhibitions that happened prior to 2009?",
    "evidence": "",
    "idx": 2706
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`exhibition`:`exhibition`)\nORDER BY `exhibition`.`ticket_price` IS NULL ASC, `exhibition`.`ticket_price` DESC \nRETURN `exhibition`.`theme` AS `theme`, `exhibition`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show theme and year for all exhibitions in an descending order of ticket price.",
    "evidence": "",
    "idx": 2707
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`t1`:`exhibition_record`)-[record_of_0:record_of]->(`t2`:`exhibition`)\nWHERE `t1`.`exhibition_id` = `t2`.`exhibition_id`\nAND (`t2`.`year` = 2004)\nRETURN `t2`.`theme` AS `theme`, `t1`.`date` AS `date`, `t1`.`attendance` AS `attendance`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the themes, dates, and attendance for exhibitions that happened in 2004.",
    "evidence": "",
    "idx": 2710
  },
  {
    "filename": "train_spider.json",
    "db_id": "theme_gallery",
    "gql_statement": "MATCH (`t1`:`exhibition_record`)-[record_of_0:record_of]->(`t2`:`exhibition`)\nWHERE `t1`.`exhibition_id` = `t2`.`exhibition_id`\nAND (`t1`.`attendance` > 100 OR `t2`.`ticket_price` < 10)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of exhibitions that have had an attendnance of over 100 or a ticket prices under 10.",
    "evidence": "",
    "idx": 2712
  },
  {
    "filename": "train_spider.json",
    "db_id": "epinions_1",
    "gql_statement": "MATCH (`item`:`item`)\nWHERE `item`.`title` = 'orange'\nRETURN `item`.`i_id` AS `i_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id of the item whose title is \"orange\".",
    "evidence": "",
    "idx": 2713
  }
]