[
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t1`:`course`)-[instructed_by_0:instructed_by]->(`t2`:`faculty`)\nWHERE `t1`.`instructor` = `t2`.`facid`\nAND (`t1`.`cname` = 'COMPUTER LITERACY')\nRETURN `t2`.`fname` AS `fname`, `t2`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name and last name of the instructor of course that has course name",
    "evidence": "",
    "idx": 5084
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t1`:`course`)-[offered_by_0:offered_by]->(`t2`:`department`)\nWHERE `t1`.`dno` = `t2`.`dno`\nAND (`t1`.`cname` = 'INTRODUCTION TO COMPUTER SCIENCE')\nRETURN `t2`.`dname` AS `dname`, `t2`.`room` AS `room`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the department name and room of the course INTRODUCTION TO COMPUTER SCIENCE.",
    "evidence": "",
    "idx": 5086
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`gradeconversion`)\nMATCH (`t3`:`student`)-[t1:enrolled_in]->()\nWHERE `t1`.`grade` = `t2`.`lettergrade` AND `t1`.`stuid` = `t3`.`stuid`\nRETURN `t3`.`fname` AS `fname`, `t3`.`lname` AS `lname`, `t2`.`gradepoint` AS `gradepoint`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the student first and last names and grade points of all enrollments.",
    "evidence": "",
    "idx": 5088
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`gradeconversion`)\nMATCH (`t3`:`student`)-[t1:enrolled_in]->()\nWHERE `t1`.`grade` = `t2`.`lettergrade` AND `t1`.`stuid` = `t3`.`stuid`\nRETURN `t3`.`fname` AS `fname`, `t3`.`lname` AS `lname`, `t2`.`gradepoint` AS `gradepoint`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the full names and gradepoints for all enrollments?",
    "evidence": "",
    "idx": 5089
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`gradeconversion`)\nMATCH (`t3`:`student`)-[t1:enrolled_in]->()\nWHERE `t1`.`grade` = `t2`.`lettergrade` AND `t1`.`stuid` = `t3`.`stuid`\nAND (`t2`.`gradepoint` >= 3.8)\nRETURN DISTINCT `t3`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct student first names of all students that have grade point at least 3.8 in one course.",
    "evidence": "",
    "idx": 5090
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`gradeconversion`)\nMATCH (`t3`:`student`)-[t1:enrolled_in]->()\nWHERE `t1`.`grade` = `t2`.`lettergrade` AND `t1`.`stuid` = `t3`.`stuid`\nAND (`t2`.`gradepoint` >= 3.8)\nRETURN DISTINCT `t3`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct first names for students with a grade point of 3.8 or above in at least one course?",
    "evidence": "",
    "idx": 5091
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t1`:`faculty`)-[t2:member_of]->()\nWHERE `t1`.`facid` = `t2`.`facid`\nAND (`t2`.`dno` = 520)\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the full names of faculties who are members of department with department number 520.",
    "evidence": "",
    "idx": 5092
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`student`)-[t1:minor_in]->()\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t1`.`dno` = 140)\nRETURN `t2`.`fname` AS `fname`, `t2`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names and last names of the students that minor in the department with DNO 140.",
    "evidence": "",
    "idx": 5094
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`faculty`)-[t3:member_of]->(`t1`:`department`)\nWHERE `t1`.`dno` = `t3`.`dno`\nAND `t2`.`facid` = `t3`.`facid`\nAND (`t1`.`dname` = 'Computer Science')\nRETURN `t2`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of faculties who are members of computer science department.",
    "evidence": "",
    "idx": 5096
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`gradeconversion`)\nMATCH (`t3`:`student`)-[t1:enrolled_in]->()\nWHERE `t1`.`grade` = `t2`.`lettergrade` AND `t1`.`stuid` = `t3`.`stuid`\nAND (`t3`.`lname` = 'Smith')\nRETURN avg(`t2`.`gradepoint`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average grade point of student whose last name is Smith.",
    "evidence": "",
    "idx": 5098
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`gradeconversion`)\nMATCH (`t3`:`student`)-[t1:enrolled_in]->()\nWHERE `t1`.`grade` = `t2`.`lettergrade` AND `t1`.`stuid` = `t3`.`stuid`\nAND (`t3`.`lname` = 'Smith')\nRETURN avg(`t2`.`gradepoint`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average gradepoint for students with the last name Smith?",
    "evidence": "",
    "idx": 5099
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`gradeconversion`)\nMATCH (`t3`:`student`)-[t1:enrolled_in]->()\nWHERE `t1`.`grade` = `t2`.`lettergrade` AND `t1`.`stuid` = `t3`.`stuid`\nAND (`t3`.`city_code` = 'NYC')\nRETURN MAX(`t2`.`gradepoint`) AS `_col_0`, min(`t2`.`gradepoint`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum and minimum grade point of students who live in NYC?",
    "evidence": "",
    "idx": 5100
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`t2`:`gradeconversion`)\nMATCH (`t3`:`student`)-[t1:enrolled_in]->()\nWHERE `t1`.`grade` = `t2`.`lettergrade` AND `t1`.`stuid` = `t3`.`stuid`\nAND (`t3`.`city_code` = 'NYC')\nRETURN MAX(`t2`.`gradepoint`) AS `_col_0`, min(`t2`.`gradepoint`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the maximum and minimum gradepoints for students living in NYC?",
    "evidence": "",
    "idx": 5101
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`course`:`course`)\nWHERE `course`.`credits` = 3\nRETURN `course`.`cname` AS `cname`   \nUNION DISTINCT\nMATCH (`course`:`course`)\nWHERE `course`.`credits` = 1 AND `course`.`hours` = 4\nRETURN `course`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of courses that have either 3 credits or 1 credit but 4 hours.",
    "evidence": "",
    "idx": 5102
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "MATCH (`department`:`department`)\nWHERE `department`.`division` = 'AS'\nRETURN `department`.`dname` AS `dname`   \nUNION DISTINCT\nMATCH (`department`:`department`)\nWHERE `department`.`division` = 'EN' AND `department`.`building` = 'NEB'\nRETURN `department`.`dname` AS `dname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of departments that are either in division AS or in division EN and in Building NEB.",
    "evidence": "",
    "idx": 5104
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[enrolled_in_sub0:enrolled_in]->()\nRETURN `enrolled_in_sub0`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE NOT `student`.`stuid` IN in_collect_0\nRETURN `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name of students not enrolled in any course.",
    "evidence": "",
    "idx": 5106
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_3",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[enrolled_in_sub0:enrolled_in]->()\nRETURN `enrolled_in_sub0`.`stuid` AS `stuid`   } AS in_collect_0\nMATCH (`student`:`student`)\nWHERE NOT `student`.`stuid` IN in_collect_0\nRETURN `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names of all students that are not enrolled in courses?",
    "evidence": "",
    "idx": 5107
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH ()-[product_suppliers:supplied_by]->()\nORDER BY `product_suppliers`.`total_amount_purchased` IS NULL ASC, `product_suppliers`.`total_amount_purchased` DESC \nRETURN `product_suppliers`.`product_id` AS `product_id`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of the top three products that were purchased in the largest amount?",
    "evidence": "",
    "idx": 5108
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`products`:`products`)\nORDER BY `products`.`product_price` IS NULL DESC, `products`.`product_price`  \nRETURN `products`.`product_id` AS `product_id`, `products`.`product_type_code` AS `product_type_code`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the id and product type of the product with the lowest price.",
    "evidence": "",
    "idx": 5111
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN COUNT(DISTINCT `products`.`product_type_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of different product types.",
    "evidence": "",
    "idx": 5112
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN COUNT(DISTINCT `products`.`product_type_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of distinct product types.",
    "evidence": "",
    "idx": 5113
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t1`:`staff`)-[t2:assigned_to]->()\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`job_title_code` = 'Department Manager')\nRETURN `t1`.`staff_id` AS `staff_id`, `t1`.`staff_gender` AS `staff_gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the staff ids and genders for any staff with the title Department Manager.",
    "evidence": "",
    "idx": 5117
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t1`:`department_stores`)-[part_of_chain_0:part_of_chain]->(`t2`:`department_store_chain`)\nWHERE `t1`.`dept_store_chain_id` = `t2`.`dept_store_chain_id`\nAND (`t2`.`dept_store_chain_name` = 'South')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of stores the chain South has.",
    "evidence": "",
    "idx": 5123
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t1`:`staff`)-[t2:assigned_to]->()\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nORDER BY `t2`.`date_assigned_to` IS NULL ASC, `t2`.`date_assigned_to` DESC \nRETURN `t1`.`staff_name` AS `staff_name`, `t2`.`job_title_code` AS `job_title_code`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name and job title of the staff with the latest date assigned.",
    "evidence": "",
    "idx": 5125
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t2`:`products`)-[t1:supplied_by]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t1`.`supplier_id` = 3)\nRETURN `t2`.`product_type_code` AS `product_type_code`, `t2`.`product_name` AS `product_name`, `t2`.`product_price` AS `product_price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the product type, name and price for all the products supplied by supplier id 3.",
    "evidence": "",
    "idx": 5126
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t2`:`customer_orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`order_status_code` = 'Pending')\nORDER BY `t2`.`customer_id` IS NULL DESC, `t2`.`customer_id`  \nRETURN DISTINCT `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the distinct name of customers whose order status is Pending, in the order of customer id.",
    "evidence": "",
    "idx": 5128
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t2`:`customer_orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`order_status_code` = 'Pending')\nORDER BY `t2`.`customer_id` IS NULL DESC, `t2`.`customer_id`  \nRETURN DISTINCT `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct names of customers with an order status of Pending, sorted by customer id?",
    "evidence": "",
    "idx": 5129
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "CALL(*) {\nMATCH (`products_sub0`:`products`)\nRETURN avg(`products_sub0`.`product_price`) AS `_col_0`  \n}\nMATCH (`t2`:`products`)-[t1:supplied_by]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t1`.`supplier_id` = 2 AND `t2`.`product_price` > `_col_0`)\nRETURN `t1`.`product_id` AS `product_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return ids of all the products that are supplied by supplier id 2 and are more expensive than the average price of all products.",
    "evidence": "",
    "idx": 5130
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "CALL(*) {\nMATCH (`products_sub0`:`products`)\nRETURN avg(`products_sub0`.`product_price`) AS `_col_0`  \n}\nMATCH (`t2`:`products`)-[t1:supplied_by]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t1`.`supplier_id` = 2 AND `t2`.`product_price` > `_col_0`)\nRETURN `t1`.`product_id` AS `product_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of products from the supplier with id 2, which are more expensive than the average price across all products?",
    "evidence": "",
    "idx": 5131
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`products`:`products`)\nWITH `products`.`product_type_code` AS _groupby_col_0, MAX(`products`.`product_price`) AS _groupby_col_1, min(`products`.`product_price`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `product_type_code`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each product type, return the maximum and minimum price.",
    "evidence": "",
    "idx": 5132
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "CALL(*) {\nMATCH (`products_sub0`:`products`)\nRETURN avg(`products_sub0`.`product_price`) AS `_col_0`  \n}\nMATCH (`products`:`products`)\nWITH `products`.`product_type_code` AS _groupby_col_0, avg(`products`.`product_price`) AS _groupby_col_1\n,_col_0 AS _groupby_col_2\nWHERE _groupby_col_1 > `_col_0`\nRETURN _groupby_col_0 AS `product_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the product type whose average price is higher than the average price of all products.",
    "evidence": "",
    "idx": 5134
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "CALL(*) {\nMATCH (`products_sub0`:`products`)\nRETURN avg(`products_sub0`.`product_price`) AS `_col_0`  \n}\nMATCH (`products`:`products`)\nWITH `products`.`product_type_code` AS _groupby_col_0, avg(`products`.`product_price`) AS _groupby_col_1\n,_col_0 AS _groupby_col_2\nWHERE _groupby_col_1 > `_col_0`\nRETURN _groupby_col_0 AS `product_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the code of the product type with an average price higher than the average price of all products?",
    "evidence": "",
    "idx": 5135
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t1`:`staff`)-[t2:assigned_to]->()\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nORDER BY duration.between(`t2`.`date_assigned_to`,`t2`.`date_assigned_from`) IS NULL DESC, duration.between(`t2`.`date_assigned_to`,`t2`.`date_assigned_from`)  \nRETURN `t1`.`staff_id` AS `staff_id`, `t1`.`staff_name` AS `staff_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id and name of the staff who has been assigned for the shortest period.",
    "evidence": "",
    "idx": 5136
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t1`:`staff`)-[t2:assigned_to]->()\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nORDER BY duration.between(`t2`.`date_assigned_to`,`t2`.`date_assigned_from`) IS NULL DESC, duration.between(`t2`.`date_assigned_to`,`t2`.`date_assigned_from`)  \nRETURN `t1`.`staff_id` AS `staff_id`, `t1`.`staff_name` AS `staff_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id and name of the staff who has been assigned for the least amount of time?",
    "evidence": "",
    "idx": 5137
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_price` >= 600 AND `products`.`product_price` <= 700\nRETURN `products`.`product_name` AS `product_name`, `products`.`product_id` AS `product_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names and ids of all products whose price is between 600 and 700.",
    "evidence": "",
    "idx": 5138
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "CALL(*) {\nMATCH (`customer_orders`:`customer_orders`)\nWHERE `customer_orders`.`order_status_code` = 'Cancelled'\nRETURN min(`customer_orders`.`order_date`) AS `_col_0`  \n}\nMATCH (`customer_orders`:`customer_orders`)\nWHERE `customer_orders`.`order_date` > `_col_0`\nRETURN DISTINCT `customer_orders`.`customer_id` AS `customer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the ids of all distinct customers who made order after some orders that were Cancelled.",
    "evidence": "",
    "idx": 5140
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "CALL(*) {\nMATCH (`customer_orders`:`customer_orders`)\nWHERE `customer_orders`.`order_status_code` = 'Cancelled'\nRETURN min(`customer_orders`.`order_date`) AS `_col_0`  \n}\nMATCH (`customer_orders`:`customer_orders`)\nWHERE `customer_orders`.`order_date` > `_col_0`\nRETURN DISTINCT `customer_orders`.`customer_id` AS `customer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct ids of customers who made an order after any order that was Cancelled?",
    "evidence": "",
    "idx": 5141
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "CALL(*) {\nMATCH ()-[staff_department_assignments_sub0:assigned_to]->()\nWHERE `staff_department_assignments_sub0`.`job_title_code` = 'Clerical Staff'\nRETURN MAX(`staff_department_assignments_sub0`.`date_assigned_to`) AS `_col_0`  \n}\nMATCH ()-[staff_department_assignments:assigned_to]->()\nWHERE `staff_department_assignments`.`date_assigned_to` < `_col_0`\nRETURN `staff_department_assignments`.`staff_id` AS `staff_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is id of the staff who had a Staff Department Assignment earlier than any Clerical Staff?",
    "evidence": "",
    "idx": 5142
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_address` =~ '(?i)(?s).*TN.*'\nRETURN `customers`.`customer_name` AS `customer_name`, `customers`.`customer_id` AS `customer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and ids of customers whose address contains TN?",
    "evidence": "",
    "idx": 5144
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t1`:`staff`)-[t2:assigned_to]->()\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`date_assigned_from` =~ '(?i)(?s)2016.*')\nRETURN `t1`.`staff_name` AS `staff_name`, `t1`.`staff_gender` AS `staff_gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name and gender of the staff who was assigned in 2016.",
    "evidence": "",
    "idx": 5146
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t1`:`staff`)-[t2:assigned_to]->()\nWHERE `t1`.`staff_id` = `t2`.`staff_id`\nAND (`t2`.`date_assigned_from` =~ '(?i)(?s)2016.*')\nRETURN `t1`.`staff_name` AS `staff_name`, `t1`.`staff_gender` AS `staff_gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and genders of staff who were assigned in 2016?",
    "evidence": "",
    "idx": 5147
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t1`:`suppliers`)-[t2:has_address]->(`t3`:`addresses`)\nWHERE `t1`.`supplier_id` = `t2`.`supplier_id`\nAND `t2`.`address_id` = `t3`.`address_id`\nORDER BY `t3`.`address_details` IS NULL DESC, `t3`.`address_details`  \nRETURN `t1`.`supplier_name` AS `supplier_name`, `t1`.`supplier_phone` AS `supplier_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name and phone number of all suppliers in the alphabetical order of their addresses.",
    "evidence": "",
    "idx": 5148
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`customer_phone` AS `customer_phone`   \nUNION DISTINCT\nMATCH (`suppliers`:`suppliers`)\nRETURN `suppliers`.`supplier_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the phone numbers of all customers and suppliers.",
    "evidence": "",
    "idx": 5150
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`customer_phone` AS `customer_phone`   \nUNION DISTINCT\nMATCH (`suppliers`:`suppliers`)\nRETURN `suppliers`.`supplier_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the phone numbers for all customers and suppliers.",
    "evidence": "",
    "idx": 5151
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_price` < 600 OR `products`.`product_price` > 900\nRETURN `products`.`product_id` AS `product_id`, `products`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the ids and names of products with price lower than 600 or higher than 900.",
    "evidence": "",
    "idx": 5153
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH ()-[product_suppliers:supplied_by]->()\nWITH `product_suppliers`.`supplier_id` AS _groupby_col_0, avg(toFloat(`product_suppliers`.`total_amount_purchased`)) > 50000 AS _groupby_col_1, avg(toFloat(`product_suppliers`.`total_amount_purchased`)) < 30000 AS _groupby_col_2\nWHERE _groupby_col_1 OR _groupby_col_2\nRETURN _groupby_col_0 AS `supplier_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of suppliers which have an average amount purchased of above 50000 or below 30000?",
    "evidence": "",
    "idx": 5155
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN MAX(`customers`.`customer_code`) AS `_col_0`, min(`customers`.`customer_code`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the maximum and minimum customer codes.",
    "evidence": "",
    "idx": 5159
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t2`:`customer_orders`)-[t3:contains_product]->(`t4`:`products`)\nMATCH (`t2`:`customer_orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`order_id` = `t3`.`order_id`\nAND `t3`.`product_id` = `t4`.`product_id`\nAND (`t4`.`product_name` = 'keyboard')\nRETURN DISTINCT `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all the distinct customers who bought a keyboard.",
    "evidence": "",
    "idx": 5160
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t2`:`customer_orders`)-[t3:contains_product]->(`t4`:`products`)\nMATCH (`t2`:`customer_orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`order_id` = `t3`.`order_id`\nAND `t3`.`product_id` = `t4`.`product_id`\nAND (`t4`.`product_name` = 'keyboard')\nRETURN DISTINCT `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct names of customers who have purchased a keyboard?",
    "evidence": "",
    "idx": 5161
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`t3`:`products`)-[t2:supplied_by]->(`t1`:`suppliers`)\nWHERE `t1`.`supplier_id` = `t2`.`supplier_id`\nAND `t2`.`product_id` = `t3`.`product_id`\nAND (`t3`.`product_name` = 'red jeans')\nRETURN DISTINCT `t1`.`supplier_name` AS `supplier_name`, `t1`.`supplier_phone` AS `supplier_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names and phone numbers of all the distinct suppliers who supply red jeans.",
    "evidence": "",
    "idx": 5162
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`products`:`products`)\nWITH `products`.`product_type_code` AS _groupby_col_0, MAX(`products`.`product_price`) AS _groupby_col_1, min(`products`.`product_price`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `product_type_code` ORDER BY `product_type_code` IS NULL DESC, `product_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the maximum and minimum product prices for each product type, grouped and ordered by product type.",
    "evidence": "",
    "idx": 5165
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`customer_orders`:`customer_orders`)\nWHERE `customer_orders`.`order_status_code` = 'Cancelled'\nORDER BY `customer_orders`.`order_date` IS NULL DESC, `customer_orders`.`order_date`  \nRETURN `customer_orders`.`order_id` AS `order_id`, `customer_orders`.`customer_id` AS `customer_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the order id, customer id for orders in Cancelled status, ordered by their order dates.",
    "evidence": "",
    "idx": 5166
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_address` =~ '(?i)(?s).*WY.*' AND `customers`.`payment_method_code` <> 'Credit Card'\nRETURN `customers`.`customer_id` AS `customer_id`, `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the id and name of customers whose address contains WY state and do not use credit card for payment.",
    "evidence": "",
    "idx": 5168
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_address` =~ '(?i)(?s).*WY.*' AND `customers`.`payment_method_code` <> 'Credit Card'\nRETURN `customers`.`customer_id` AS `customer_id`, `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids and names of customers with addressed that contain WY and who do not use a credit card for payment?",
    "evidence": "",
    "idx": 5169
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_type_code` = 'Clothes'\nRETURN avg(`products`.`product_price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average price of all product clothes.",
    "evidence": "",
    "idx": 5170
  },
  {
    "filename": "train_spider.json",
    "db_id": "department_store",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_type_code` = 'Hardware'\nORDER BY `products`.`product_price` IS NULL ASC, `products`.`product_price` DESC \nRETURN `products`.`product_name` AS `product_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the most expensive hardware product.",
    "evidence": "",
    "idx": 5172
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`aircraft`:`aircraft`)\nRETURN `aircraft`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the description of all aircrafts.",
    "evidence": "",
    "idx": 5176
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`airport`:`airport`)\nWHERE `airport`.`airport_name` = 'London Heathrow'\nRETURN `airport`.`international_passengers` AS `international_passengers`, `airport`.`domestic_passengers` AS `domestic_passengers`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the number of international and domestic passengers of the airport named London \"Heathrow\"?",
    "evidence": "",
    "idx": 5180
  },
  {
    "filename": "train_spider.json",
    "db_id": "aircraft",
    "gql_statement": "MATCH (`airport`:`airport`)\nWHERE `airport`.`airport_name` =~ '(?i)(?s).*London.*'\nRETURN sum(`airport`.`domestic_passengers`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total number of Domestic Passengers of airports that contain the word \"London\".",
    "evidence": "",
    "idx": 5182
  }
]