[
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nAND (`t2`.`balance` > `t3`.`balance`)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of accounts whose checking balance is higher than corresponding saving balance.",
    "evidence": "",
    "idx": 2818
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nAND (`t2`.`balance` > `t3`.`balance`)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of customers with a higher checking balance than savings balance?",
    "evidence": "",
    "idx": 2819
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nAND (`t3`.`balance` < `t2`.`balance`)\nRETURN `t1`.`name` AS `name`, `t3`.`balance` + `t2`.`balance` AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and total checking and savings balance of the accounts whose savings balance is lower than corresponding checking balance.",
    "evidence": "",
    "idx": 2820
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`checking`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nMATCH (`t3`:`savings`)-[belongs_to_1:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nAND `t1`.`custid` = `t3`.`custid`\nAND (`t3`.`balance` < `t2`.`balance`)\nRETURN `t1`.`name` AS `name`, `t3`.`balance` + `t2`.`balance` AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of customers who have a savings balance lower than their checking balance, and what is the total of their checking and savings balances?",
    "evidence": "",
    "idx": 2821
  },
  {
    "filename": "train_spider.json",
    "db_id": "small_bank_1",
    "gql_statement": "MATCH (`t2`:`savings`)-[belongs_to_0:belongs_to]->(`t1`:`accounts`)\nWHERE `t1`.`custid` = `t2`.`custid`\nRETURN `t1`.`name` AS `name`, `t2`.`balance` AS `balance` ORDER BY `t2`.`balance` IS NULL ASC, `t2`.`balance` DESC \nLIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and savings balance of the top 3 accounts with the highest saving balance sorted by savings balance in descending order.",
    "evidence": "",
    "idx": 2822
  },
  {
    "filename": "train_spider.json",
    "db_id": "browser_web",
    "gql_statement": "MATCH (`browser`:`browser`)\nORDER BY `browser`.`market_share` IS NULL ASC, `browser`.`market_share` DESC \nRETURN `browser`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of browsers in descending order by market share.",
    "evidence": "",
    "idx": 2825
  },
  {
    "filename": "train_spider.json",
    "db_id": "browser_web",
    "gql_statement": "MATCH (`browser`:`browser`)\nRETURN `browser`.`id` AS `id`, `browser`.`name` AS `name`, `browser`.`market_share` AS `market_share`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the ids, names and market shares of all browsers.",
    "evidence": "",
    "idx": 2826
  },
  {
    "filename": "train_spider.json",
    "db_id": "browser_web",
    "gql_statement": "MATCH (`browser`:`browser`)\nRETURN MAX(`browser`.`market_share`) AS `_col_0`, min(`browser`.`market_share`) AS `_col_1`, avg(`browser`.`market_share`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum, minimum and average market share of the listed browsers?",
    "evidence": "",
    "idx": 2827
  },
  {
    "filename": "train_spider.json",
    "db_id": "browser_web",
    "gql_statement": "MATCH (`web_client_accelerator`:`web_client_accelerator`)\nWHERE `web_client_accelerator`.`name` =~ '(?i)(?s).*Opera.*'\nRETURN `web_client_accelerator`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which accelerator name contains substring \"Opera\"?",
    "evidence": "",
    "idx": 2835
  },
  {
    "filename": "train_spider.json",
    "db_id": "browser_web",
    "gql_statement": "MATCH (`web_client_accelerator`:`web_client_accelerator`)\nWITH `web_client_accelerator`.`operating_system` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `operating_system`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of web accelerators used for each Operating system.",
    "evidence": "",
    "idx": 2836
  },
  {
    "filename": "train_spider.json",
    "db_id": "browser_web",
    "gql_statement": "MATCH (`t3`:`web_client_accelerator`)-[t1:compatible_with]->(`t2`:`browser`)\nWHERE `t1`.`browser_id` = `t2`.`id`\nAND `t1`.`accelerator_id` = `t3`.`id`\nORDER BY `t1`.`compatible_since_year` IS NULL ASC, `t1`.`compatible_since_year` DESC \nRETURN `t2`.`name` AS `name`, `t3`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me names of all compatible browsers and accelerators in the descending order of compatible year",
    "evidence": "",
    "idx": 2837
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`wrestler`:`wrestler`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of wrestlers.",
    "evidence": "",
    "idx": 2839
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`wrestler`:`wrestler`)\nORDER BY `wrestler`.`days_held` IS NULL ASC, `wrestler`.`days_held` DESC \nRETURN `wrestler`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of wrestlers in descending order of days held.",
    "evidence": "",
    "idx": 2840
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`wrestler`:`wrestler`)\nORDER BY `wrestler`.`days_held` IS NULL DESC, `wrestler`.`days_held`  \nRETURN `wrestler`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name of the wrestler who had the lowest number of days held.",
    "evidence": "",
    "idx": 2843
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`wrestler`:`wrestler`)\nWHERE `wrestler`.`location` <> 'Tokyo , Japan'\nRETURN DISTINCT `wrestler`.`reign` AS `reign`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct reigns of wrestlers whose location is not \"Tokyo,Japan\" ?",
    "evidence": "",
    "idx": 2844
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`wrestler`:`wrestler`)\nWHERE `wrestler`.`location` <> 'Tokyo , Japan'\nRETURN DISTINCT `wrestler`.`reign` AS `reign`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the different reigns of wrestlers who are not located in Tokyo, Japan.",
    "evidence": "",
    "idx": 2845
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`wrestler`:`wrestler`)\nRETURN `wrestler`.`name` AS `name`, `wrestler`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the names and locations of all wrestlers.",
    "evidence": "",
    "idx": 2847
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`elimination`:`elimination`)\nWHERE `elimination`.`team` = 'Team Orton'\nRETURN `elimination`.`elimination_move` AS `elimination_move`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the elimination moves of wrestlers whose team is \"Team Orton\"?",
    "evidence": "",
    "idx": 2848
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`elimination`:`elimination`)\nWHERE `elimination`.`team` = 'Team Orton'\nRETURN `elimination`.`elimination_move` AS `elimination_move`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the elimination movies of wrestlers on Team Orton.",
    "evidence": "",
    "idx": 2849
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`t1`:`elimination`)-[eliminated_0:eliminated]->(`t2`:`wrestler`)\nWHERE `t1`.`wrestler_id` = `t2`.`wrestler_id`\nRETURN `t2`.`name` AS `name`, `t1`.`elimination_move` AS `elimination_move`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the names of wrestlers and their elimination moves.",
    "evidence": "",
    "idx": 2851
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`t1`:`elimination`)-[eliminated_0:eliminated]->(`t2`:`wrestler`)\nWHERE `t1`.`wrestler_id` = `t2`.`wrestler_id`\nORDER BY `t2`.`days_held` IS NULL ASC, `t2`.`days_held` DESC \nRETURN `t2`.`name` AS `name`, `t1`.`team` AS `team`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of wrestlers and the teams in elimination in descending order of days held.",
    "evidence": "",
    "idx": 2852
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`t1`:`elimination`)-[eliminated_0:eliminated]->(`t2`:`wrestler`)\nWHERE `t1`.`wrestler_id` = `t2`.`wrestler_id`\nORDER BY `t2`.`days_held` IS NULL ASC, `t2`.`days_held` DESC \nRETURN `t1`.`time` AS `time`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the time of elimination of the wrestlers with largest days held.",
    "evidence": "",
    "idx": 2854
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`t1`:`elimination`)-[eliminated_0:eliminated]->(`t2`:`wrestler`)\nWHERE `t1`.`wrestler_id` = `t2`.`wrestler_id`\nAND (`t2`.`days_held` > '50')\nRETURN `t1`.`time` AS `time`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show times of elimination of wrestlers with days held more than 50.",
    "evidence": "",
    "idx": 2856
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`elimination`:`elimination`)\nWITH `elimination`.`team` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `team`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different teams in eliminations and the number of eliminations from each team.",
    "evidence": "",
    "idx": 2858
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`elimination`:`elimination`)\nWITH `elimination`.`team` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `team`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show teams that have suffered more than three eliminations.",
    "evidence": "",
    "idx": 2860
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`wrestler`:`wrestler`)\nRETURN `wrestler`.`reign` AS `reign`, `wrestler`.`days_held` AS `days_held`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the reign and days held of wrestlers.",
    "evidence": "",
    "idx": 2862
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`wrestler`:`wrestler`)\nWHERE `wrestler`.`days_held` < '100'\nRETURN `wrestler`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of wrestlers with fewer than 100 days held.",
    "evidence": "",
    "idx": 2865
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`wrestler`:`wrestler`)\nWITH `wrestler`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the locations that are shared by more than two wrestlers.",
    "evidence": "",
    "idx": 2866
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "WITH *, COLLECT { MATCH (`elimination_sub0`:`elimination`)\nRETURN `elimination_sub0`.`wrestler_id` AS `wrestler_id`   } AS in_collect_0\nMATCH (`wrestler`:`wrestler`)\nWHERE NOT `wrestler`.`wrestler_id` IN in_collect_0\nRETURN `wrestler`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of wrestlers that have not been eliminated.",
    "evidence": "",
    "idx": 2868
  },
  {
    "filename": "train_spider.json",
    "db_id": "wrestler",
    "gql_statement": "MATCH (`elimination`:`elimination`)\nWHERE `elimination`.`eliminated_by` = 'Punk' OR `elimination`.`eliminated_by` = 'Orton'\nRETURN `elimination`.`time` AS `time`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the times of elimination by \"Punk\" or \"Orton\".",
    "evidence": "",
    "idx": 2872
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`school`:`school`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of schools.",
    "evidence": "",
    "idx": 2875
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`school`:`school`)\nRETURN `school`.`school_name` AS `school_name` ORDER BY `school_name` IS NULL DESC, `school_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all school names in alphabetical order.",
    "evidence": "",
    "idx": 2876
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`school`:`school`)\nRETURN `school`.`school_name` AS `school_name`, `school`.`location` AS `location`, `school`.`mascot` AS `mascot`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name, location, mascot for all schools.",
    "evidence": "",
    "idx": 2877
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`school`:`school`)\nRETURN sum(`school`.`enrollment`) AS `_col_0`, avg(`school`.`enrollment`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total and average enrollment of all schools?",
    "evidence": "",
    "idx": 2878
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`school`:`school`)\nORDER BY `school`.`enrollment` IS NULL DESC, `school`.`enrollment`  \nRETURN `school`.`school_name` AS `school_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of the school with the smallest enrollment.",
    "evidence": "",
    "idx": 2880
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`school`:`school`)\nRETURN avg(`school`.`enrollment`) AS `_col_0`, MAX(`school`.`enrollment`) AS `_col_1`, min(`school`.`enrollment`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average, maximum, minimum enrollment of all schools.",
    "evidence": "",
    "idx": 2881
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`school`:`school`)\nWITH `school`.`county` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, sum(`school`.`enrollment`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `county`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show each county along with the number of schools and total enrollment in each county.",
    "evidence": "",
    "idx": 2882
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`t2`:`school`)-[has_endowment_0:has_endowment]->(`t1`:`endowment`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nAND (`t2`.`school_name` = 'Glenn')\nRETURN COUNT(DISTINCT `t1`.`donator_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many donors have endowment for school named \"Glenn\"?",
    "evidence": "",
    "idx": 2883
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`endowment`:`endowment`)\nWITH `endowment`.`donator_name` AS _groupby_col_0, sum(`endowment`.`amount`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `donator_name`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List each donator name and the amount of endowment in descending order of the amount of endowment.",
    "evidence": "",
    "idx": 2884
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "WITH *, COLLECT { MATCH (`endowment_sub0`:`endowment`)\nRETURN `endowment_sub0`.`school_id` AS `school_id`   } AS in_collect_0\nMATCH (`school`:`school`)\nWHERE NOT `school`.`school_id` IN in_collect_0\nRETURN `school`.`school_name` AS `school_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of the schools without any endowment.",
    "evidence": "",
    "idx": 2885
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`endowment`:`endowment`)\nRETURN `endowment`.`amount` AS `amount`, `endowment`.`donator_name` AS `donator_name` ORDER BY `amount` IS NULL ASC, `amount` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the amount and donor name for the largest amount of donation.",
    "evidence": "",
    "idx": 2886
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`budget`:`budget`)\nWHERE `budget`.`budgeted` > 3000 AND `budget`.`year` <= 2001\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of budgets in year 2001 or before whose budgeted amount is greater than 3000",
    "evidence": "",
    "idx": 2888
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`t2`:`school`)-[has_budget_0:has_budget]->(`t1`:`budget`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nAND (`t1`.`year` >= 2002)\nRETURN `t2`.`school_name` AS `school_name`, `t1`.`budgeted` AS `budgeted`, `t1`.`invested` AS `invested`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show each school name, its budgeted amount, and invested amount in year 2002 or after.",
    "evidence": "",
    "idx": 2889
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`endowment`:`endowment`)\nRETURN DISTINCT `endowment`.`donator_name` AS `donator_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all donor names.",
    "evidence": "",
    "idx": 2890
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`t2`:`school`)-[has_budget_0:has_budget]->(`t1`:`budget`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nAND (`t2`.`school_name` = 'Glenn')\nRETURN sum(`t1`.`budgeted`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total budget amount for school \"Glenn\" in all years?",
    "evidence": "",
    "idx": 2892
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`t2`:`school`)-[has_budget_0:has_budget]->(`t1`:`budget`)\nMATCH (`t2`:`school`)-[has_endowment_0:has_endowment]->(`t3`:`endowment`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nAND `t2`.`school_id` = `t3`.`school_id`\nWITH `t2`.`school_name` AS _groupby_col_0, sum(`t1`.`budgeted`) > 100 AS _groupby_col_1, sum(`t3`.`amount`) > 10 AS _groupby_col_2\nWHERE _groupby_col_1 OR _groupby_col_2\nRETURN _groupby_col_0 AS `school_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of schools with a total budget amount greater than 100 or a total endowment greater than 10.",
    "evidence": "",
    "idx": 2893
  },
  {
    "filename": "train_spider.json",
    "db_id": "school_finance",
    "gql_statement": "MATCH (`t1`:`school`)-[has_budget_0:has_budget]->(`t2`:`budget`)\nWHERE `t1`.`school_id` = `t2`.`school_id`\nAND (`t2`.`budgeted` > 6000 OR `t2`.`year` < 2003)\nORDER BY `t2`.`total_budget_percent_invested` IS NULL DESC, `t2`.`total_budget_percent_invested` , `t2`.`total_budget_percent_budgeted` IS NULL DESC, `t2`.`total_budget_percent_budgeted`  \nRETURN `t1`.`school_name` AS `school_name`, `t1`.`mascot` AS `mascot`, `t1`.`ihsaa_football_class` AS `ihsaa_football_class`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name, IHSAA Football Class, and Mascot of the schools that have more than 6000 of budgeted amount or were founded before 2003, in the order of percent of total invested budget and total budgeted budget.",
    "evidence": "",
    "idx": 2894
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "MATCH (`building`:`building`)\nRETURN `building`.`name` AS `name`, `building`.`street_address` AS `street_address`, `building`.`floors` AS `floors` ORDER BY `floors` IS NULL DESC, `floors`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name, street address, and number of floors for all buildings ordered by the number of floors.",
    "evidence": "",
    "idx": 2896
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "MATCH (`building`:`building`)\nWHERE `building`.`height_feet` >= 200 AND `building`.`floors` >= 20\nRETURN `building`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of buildings with at least 200 feet of height and with at least 20 floors.",
    "evidence": "",
    "idx": 2899
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "MATCH (`institution`:`institution`)\nWHERE `institution`.`founded` > 1990 AND `institution`.`type` = 'Private'\nRETURN `institution`.`institution` AS `institution`, `institution`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names and locations of institutions that are founded after 1990 and have the type \"Private\".",
    "evidence": "",
    "idx": 2900
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "MATCH (`institution`:`institution`)\nWITH `institution`.`type` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, sum(`institution`.`enrollment`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `type`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show institution types, along with the number of institutions and total enrollment for each type.",
    "evidence": "",
    "idx": 2901
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "MATCH (`institution`:`institution`)\nWHERE `institution`.`founded` > 1990 AND `institution`.`enrollment` >= 1000\nRETURN `institution`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the institution type with an institution founded after 1990 and an institution with at least 1000 enrollment.",
    "evidence": "",
    "idx": 2902
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "WITH *, COLLECT { MATCH (`institution_sub0`:`institution`)\nRETURN `institution_sub0`.`building_id` AS `building_id`   } AS in_collect_0\nMATCH (`building`:`building`)\nWHERE NOT `building`.`building_id` IN in_collect_0\nRETURN `building`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name of buildings that do not have any institution.",
    "evidence": "",
    "idx": 2903
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "MATCH (`institution`:`institution`)\nRETURN DISTINCT `institution`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the distinct institution types.",
    "evidence": "",
    "idx": 2904
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "MATCH (`t2`:`protein`)-[researched_at_0:researched_at]->(`t1`:`institution`)\nWHERE `t1`.`institution_id` = `t2`.`institution_id`\nAND (`t1`.`founded` > 1880 OR `t1`.`type` = 'Private')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many proteins are associated with an institution founded after 1880 or an institution with type \"Private\"?",
    "evidence": "",
    "idx": 2905
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "MATCH (`t2`:`protein`)-[researched_at_0:researched_at]->(`t1`:`institution`)\nWHERE `t1`.`institution_id` = `t2`.`institution_id`\nRETURN `t2`.`protein_name` AS `protein_name`, `t1`.`institution` AS `institution`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the protein name and the institution name.",
    "evidence": "",
    "idx": 2906
  },
  {
    "filename": "train_spider.json",
    "db_id": "protein_institute",
    "gql_statement": "MATCH (`t2`:`protein`)-[researched_at_0:researched_at]->(`t1`:`institution`)-[located_in_0:located_in]->(`t3`:`building`)\nWHERE `t1`.`institution_id` = `t2`.`institution_id`\nAND `t3`.`building_id` = `t1`.`building_id`\nAND (`t3`.`floors` >= 20)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many proteins are associated with an institution in a building with at least 20 floors?",
    "evidence": "",
    "idx": 2907
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`cinema`:`cinema`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of cinemas.",
    "evidence": "",
    "idx": 2910
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`cinema`:`cinema`)\nRETURN `cinema`.`name` AS `name`, `cinema`.`openning_year` AS `openning_year`, `cinema`.`capacity` AS `capacity`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show name, opening year, and capacity for each cinema.",
    "evidence": "",
    "idx": 2911
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "CALL(*) {\nMATCH (`cinema_sub0`:`cinema`)\nRETURN avg(`cinema_sub0`.`capacity`) AS `_col_0`  \n}\nMATCH (`cinema`:`cinema`)\nWHERE `cinema`.`capacity` > `_col_0`\nRETURN `cinema`.`name` AS `name`, `cinema`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the cinema name and location for cinemas with capacity above average.",
    "evidence": "",
    "idx": 2912
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`cinema`:`cinema`)\nRETURN DISTINCT `cinema`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct locations that has a cinema.",
    "evidence": "",
    "idx": 2914
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`cinema`:`cinema`)\nRETURN `cinema`.`name` AS `name`, `cinema`.`openning_year` AS `openning_year` ORDER BY `openning_year` IS NULL ASC, `openning_year` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the cinema names and opening years in descending order of opening year.",
    "evidence": "",
    "idx": 2915
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`cinema`:`cinema`)\nWHERE `cinema`.`openning_year` >= 2011\nRETURN avg(`cinema`.`capacity`) AS `_col_0`, min(`cinema`.`capacity`) AS `_col_1`, MAX(`cinema`.`capacity`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average, minimum, and maximum capacity for all the cinemas opened in year 2011 or later.",
    "evidence": "",
    "idx": 2917
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`cinema`:`cinema`)\nWITH `cinema`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `location`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show each location and the number of cinemas there.",
    "evidence": "",
    "idx": 2918
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`cinema`:`cinema`)\nWHERE `cinema`.`capacity` > 300\nWITH `cinema`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the locations with at least two cinemas with capacity above 300.",
    "evidence": "",
    "idx": 2919
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN `film`.`title` AS `title`, `film`.`directed_by` AS `directed_by`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the title and director for all films.",
    "evidence": "",
    "idx": 2921
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`film`:`film`)\nRETURN DISTINCT `film`.`directed_by` AS `directed_by`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all directors.",
    "evidence": "",
    "idx": 2923
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`film`:`film`)\nWITH `film`.`directed_by` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `directed_by`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all directors along with the number of films directed by each director.",
    "evidence": "",
    "idx": 2925
  }
]