[
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`ranking_criteria`)-[belongs_to_system_0:`belongs_to_system`]->(t1@`ranking_system`)\nWHERE t1.`id` = t2.`ranking_system_id`\nAND (t1.`system_name` = 'Center for World University Rankings')\nRETURN COUNT(t2.`criteria_name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many criteria are associated with ranking system Center for World University Rankings?",
    "evidence": "ranking system Center for World University Rankings refers to system_name = 'Center for World University Rankings';",
    "idx": 3895
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)\nMATCH ()-[t2:`has_ranking_1`]->()\nWHERE t1.`university_id` = t2.`university_id`\nAND (t2.`score` = 90 AND t1.`year` = 2011)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students at the university earned a score of 90 in 2011?",
    "evidence": "in 2011 refers to year 2011; earned a score of 90 refers to score = 90;",
    "idx": 3896
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t2.`university_name` = 'Harvard University' AND t1.`year` >= 2011 AND t1.`year` <= 2012)\nRETURN sum(t1.`num_students`) - sum(cast (t1.`num_students` * t1.`pct_international_students` as float) / 100) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the difference in overall student enrollment and international student enrollment at the Harvard university from 2011 to 2012?",
    "evidence": "Harvard University refers to university_name = 'Harvard University'; difference in overall student enrollment and international student refers to SUBTRACT(SUM(num_students), SUM(DIVIDE(MULTIPLY(pct_international_students, num_students), 100))); from 2011 to 2012 refers to year BETWEEN 2011 AND 2012",
    "idx": 3897
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`year` = 2011 AND university_year.`num_students` > 30000\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many universities had over 30000 students in 2011?",
    "evidence": "in 2011 refers to year 2011; had over 30000 students refers to num_students > 30000;",
    "idx": 3898
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university@`university`)\nWHERE university.`university_name` = 'University of Tokyo'\nRETURN university.`country_id` AS `country_id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the country ID of the University of Tokyo?",
    "evidence": "University of Tokyo refers to university_name = 'University of Tokyo';",
    "idx": 3899
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (ranking_criteria@`ranking_criteria`)\nWHERE ranking_criteria.`criteria_name` = 'Publications Rank'\nRETURN ranking_criteria.`id` AS `id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ID of the Publications Rank criteria?",
    "evidence": "Publications Rank criteria refers to criteria_name = 'Publications Rank';",
    "idx": 3901
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`pct_international_students` > 30 AND university_year.`year` = 2013\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many universities had above 30% of international students in 2013?",
    "evidence": "had above 30% of international students refers to pct_international_students > 30; in 2013 refers to year = 2013",
    "idx": 3902
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH ()-[university_ranking_year:`has_ranking_1`]->()\nWHERE university_ranking_year.`ranking_criteria_id` = 6 AND university_ranking_year.`year` = 2011 AND university_ranking_year.`score` < 50\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many universities got less than 50 scores under ranking criteria ID 6 in 2011?",
    "evidence": "in 2011 refers to year 2011; less than 50 scores refers to score < 50;",
    "idx": 3903
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`university_year`)-[for_university_0:`for_university`]->(t1@`university`)\nWHERE t1.`id` = t2.`university_id`\nAND (t1.`university_name` = 'Harvard University' AND t2.`year` = 2012)\nRETURN cast (t2.`num_students` * t2.`pct_international_students` as float) / 100 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many international students attended Harvard University in 2012?",
    "evidence": "Harvard University refers to university_name = 'Harvard University'; international students refers to DIVIDE(MULTIPLY(num_students, pct_international_students), 100); in 2012 refers to year = 2012",
    "idx": 3908
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nMATCH (t3@`university`)-[t2:`has_ranking_1`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND t3.`id` = t2.`university_id`\nAND (t1.`criteria_name` = 'Teaching' AND t2.`year` = 2011)\nORDER BY t2.`score`  NULLS FIRST \nRETURN t3.`university_name` AS `university_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In 2011, which university got the lowest score in teaching criteria?",
    "evidence": "in 2011 refers to year 2011; got the lowest score refers to MIN(score), teaching criteria refers to criteria_name = 'Teaching'",
    "idx": 3911
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`year` = 2011 AND university_year.`university_id` = 1\nRETURN university_year.`num_students` AS `num_students`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students were there in university ID 1 in 2011?",
    "evidence": "in 2011 refers to year 2011;",
    "idx": 3916
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`year` = 2011\nORDER BY university_year.`num_students` DESC NULLS LAST \nRETURN university_year.`university_id` AS `university_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ID of the university with the most students in 2011?",
    "evidence": "in 2011 refers to year 2011; with the most students refers to MAX(num_students); ID of the university refers to university_id",
    "idx": 3917
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`year` = 2011 AND university_year.`pct_international_students` > 25 AND university_year.`num_students` > 20000\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the universities with over 20000 students in 2011, how many of them have an international students percentage of over 25% in the same year?",
    "evidence": "in 2011 refers to year 2011; with over 20000 students refers to num_students > 20000; international students percentage of over 25% refers to pct_international_students > 25;",
    "idx": 3919
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`university_id` = 1\nORDER BY university_year.`num_students` DESC NULLS LAST \nRETURN university_year.`year` AS `year` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which year did university ID 1 have the most students?",
    "evidence": "have the most students refers to MAX(num_students)",
    "idx": 3921
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t2.`university_name` = 'Harvard University' AND t1.`year` = 2011)\nRETURN t1.`num_students` AS `num_students`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students did Harvard University have in 2011?",
    "evidence": "in 2011 refers to year 2011; Harvard University refers to university_name = 'Harvard University';",
    "idx": 3922
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2011)\nORDER BY t1.`pct_international_students` DESC NULLS LAST \nRETURN t2.`university_name` AS `university_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the university with the most international students in 2011?",
    "evidence": "in 2011 refers to year 2011; the most international students refers to MAX(DIVIDE(MULTIPLY(num_students,  pct_international_students), 100)); name of university refers to university_id",
    "idx": 3923
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`university_year`)-[for_university_0:`for_university`]->(t1@`university`)-[located_in_0:`located_in`]->(t3@`country`)\nWHERE t1.`id` = t2.`university_id`\nAND t3.`id` = t1.`country_id`\nAND (t3.`country_name` = 'Australia' AND t2.`year` = 2011 AND t2.`num_students` > 15000)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the universities in Australia, how many of them have more than 15000 students in 2011?",
    "evidence": "in 2011 refers to year 2011; have more than 15000 students refers to num_students > 15000; in Australia refers to country_name = 'Australia';",
    "idx": 3925
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`country_id` = t2.`id`\nAND (t1.`university_name` = 'Harvard University')\nRETURN t2.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country is Harvard University in?",
    "evidence": "Harvard University refers to university_name = 'Harvard University'; which country refers to country_name",
    "idx": 3926
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nMATCH (t3@`university`)-[t2:`has_ranking_1`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND t3.`id` = t2.`university_id`\nAND (t1.`criteria_name` = 'Teaching' AND t2.`year` = 2011)\nORDER BY t2.`score` DESC NULLS LAST \nRETURN t3.`university_name` AS `university_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the university with the highest score in teaching in the year 2011?",
    "evidence": "with the highest score refers to MAX(score); in teaching refers to criteria_name = 'Teaching'; name of university refers to university_name;",
    "idx": 3927
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nMATCH (t3@`university`)-[t2:`has_ranking_1`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND t3.`id` = t2.`university_id`\nAND (t1.`criteria_name` = 'Teaching' AND t2.`year` = 2011 AND t2.`score` > 90)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the universities with a score in teaching of over 90 in 2011, how many of them are in the United States of America?",
    "evidence": "in 2011 refers to year 2011; in teaching refers to  criteria_name = 'Teaching'; score in teaching of over 90 refers to score > 90; in the United States of America refers to country_name = 'United States of America';",
    "idx": 3929
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nMATCH (t3@`university`)-[t2:`has_ranking_1`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND t3.`id` = t2.`university_id`\nAND (t1.`criteria_name` = 'Teaching' AND t2.`year` = 2011 AND t2.`score` = 98)\nRETURN t3.`university_name` AS `university_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the universities that got 98 in teaching in 2011?",
    "evidence": "in 2011 refers to year 2011; that got 98 refers to score = 98; in teaching refers to criteria_name = 'Teaching'; name of university refers to university_name",
    "idx": 3931
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`university_year`)-[for_university_0:`for_university`]->(t1@`university`)-[located_in_0:`located_in`]->(t3@`country`)\nWHERE t1.`id` = t2.`university_id`\nAND t3.`id` = t1.`country_id`\nAND (t3.`country_name` = 'Australia' AND t2.`student_staff_ratio` > 15 AND t2.`year` = 2011)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the universities in Australia, how many of them have a student staff ratio of over 15 in 2011?",
    "evidence": "in 2011 refers to year 2011; in Australia refers to country_name = 'Australia'; student staff ratio of over 15 refers to student_staff_ratio > 15",
    "idx": 3932
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2011 AND t2.`university_name` = 'Stanford University')\nRETURN cast (t1.`num_students` * t1.`pct_female_students` as float) / 100 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female students did Stanford University have in 2011?",
    "evidence": "in 2011 refers to year 2011; female students refers to DIVIDE(MULTIPLY(pct_female_students, num_students), 100); Stanford University refers to university_name = 'Stanford University';",
    "idx": 3933
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`country_id` = t2.`id`\nAND (t1.`university_name` = 'McMaster University')\nRETURN t2.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country is McMaster University located in?",
    "evidence": "McMaster University refers to university_name = 'McMaster University'; which country refers to country_name",
    "idx": 3940
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`country_id` = t2.`id`\nAND (t2.`country_name` = 'Turkey')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Turkish universities are there in the database?",
    "evidence": "Turkish universities refers to country_name = 'Turkey';",
    "idx": 3941
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`university_year`)-[for_university_0:`for_university`]->(t1@`university`)\nWHERE t1.`id` = t2.`university_id`\nAND (t1.`university_name` = 'University of Michigan' AND t2.`year` = 2011)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students were there in University of Michigan in 2011?",
    "evidence": "in 2011 refers to year 2011; in University of Michigan refers to university_name = 'University of Michigan';",
    "idx": 3943
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`university_year`)-[for_university_0:`for_university`]->(t1@`university`)\nWHERE t1.`id` = t2.`university_id`\nAND (t1.`university_name` = 'University of Oslo' AND t2.`year` = 2015)\nRETURN t2.`pct_international_students` AS `pct_international_students`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of the international students in University of Oslo in 2015?",
    "evidence": "percentage of the international students refers to pct_international_students; in 2015 refers to year = 2015; in University of Oslo refers to university_name = 'University of Oslo';",
    "idx": 3945
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nMATCH (t3@`university`)-[t2:`has_ranking_1`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND t3.`id` = t2.`university_id`\nAND (t3.`university_name` = 'University of Southampton' AND t2.`year` = 2015)\nORDER BY t2.`score` DESC NULLS LAST \nRETURN t1.`criteria_name` AS `criteria_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the University of Southampton in 2015, on which criteria did it score the best?",
    "evidence": "University of Southampton refers to university_name = 'University of Southampton'; in 2015 refers to year = 2015; score the best refers to MAX(score); which criteria refers to criteria_name",
    "idx": 3946
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2015 AND t2.`university_name` = 'Pierre and Marie Curie University')\nRETURN cast (t1.`num_students` * t1.`pct_female_students` as float) / 100 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female students were there in Pierre and Marie Curie University in 2015?",
    "evidence": "female students refers to DIVIDE(MULTIPLY(pct_female_students, num_students), 100); in Pierre and Marie Curie University refers to university_name = 'Pierre and Marie Curie University'; in 2015 refers to year = 2015",
    "idx": 3948
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2013)\nRETURN cast (sum(CASE  WHEN t2.`university_name` = 'University of Ottawa' THEN t1.`num_students` ELSE 0 END) as float) / sum(CASE  WHEN t2.`university_name` = 'Joseph Fourier University' THEN t1.`num_students` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many times more was the number of students of University of Ottawa than Joseph Fourier University in 2013?",
    "evidence": "Joseph Fourier University refers to university_name = 'Joseph Fourier University'; University of Ottawa refers to university_name = 'University of Ottawa'; in 2013 refers to year = 2013; how many times more refers to DIVIDE(SUM(num_students where university_name = 'University of Ottawa'), SUM(num_students where university_name = 'Joseph Fourier University'))",
    "idx": 3952
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH ()-[university_ranking_year:`has_ranking_1`]->()\nWHERE university_ranking_year.`year` = 2015 AND university_ranking_year.`university_id` = 68\nRETURN university_ranking_year.`score` AS `score`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the score of university ID 68 in 2015?",
    "evidence": "in 2015 refers to year = 2015",
    "idx": 3955
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nORDER BY university_year.`pct_international_students` DESC NULLS LAST \nRETURN university_year.`university_id` AS `university_id` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ID of university with the largest percentage of international students?",
    "evidence": "largest percentage of international students refers to MAX(pct_international_students); ID of university refers to university_id",
    "idx": 3957
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH ()-[university_ranking_year:`has_ranking_1`]->()\nWHERE university_ranking_year.`year` = 2012\nRETURN avg(university_ranking_year.`score`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average score of all universities in 2012?",
    "evidence": "average score refers to avg(score); in 2012 refers to year = 2012",
    "idx": 3959
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (university_year@`university_year`)\nWHERE university_year.`year` >= 2011 AND university_year.`year` <= 2013 AND university_year.`university_id` = 40\nRETURN sum(cast (university_year.`num_students` * university_year.`pct_female_students` as float) / 100) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In years 2011 to 2013, what is the total number of female students in university ID 40?",
    "evidence": "total number of female students refers to SUM(DIVIDE(MULTIPLY(pct_female_students, num_students), 100)); In years 2011 to 2013 refers to year BETWEEN 2011 AND 2013",
    "idx": 3960
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`ranking_criteria`)-[belongs_to_system_0:`belongs_to_system`]->(t1@`ranking_system`)\nWHERE t1.`id` = t2.`ranking_system_id`\nAND (t1.`system_name` = 'Shanghai Ranking')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of ranking criteria under the ranking system called Shanghai Ranking?",
    "evidence": "ranking system called Shanghai Ranking refers to system_name = 'Shanghai Ranking';",
    "idx": 3966
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university_year`)-[for_university_0:`for_university`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t1.`year` = 2011 AND t2.`university_name` = 'University of Pennsylvania')\nRETURN cast (t1.`num_students` * t1.`pct_female_students` as float) / 100 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female students are there in University of Pennsylvania in 2011?",
    "evidence": "in 2011 refers to year 2011; female students refers to DIVIDE(MULTIPLY(num_students, pct_female_students), 100); University of Pennsylvania refers to a university name;",
    "idx": 3968
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`country_id` = t2.`id`\nAND (t2.`country_name` = 'Japan')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many universities are located in Japan?",
    "evidence": "located in Japan refers to country_name = 'Japan';",
    "idx": 3970
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`university`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t1.`country_id` = t2.`id`\nAND (t1.`university_name` = 'Johns Hopkins University')\nRETURN t2.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which country does Johns Hopkins University located?",
    "evidence": "Johns Hopkins University refers to university_name = 'Johns Hopkins University'; which country refers to country_name",
    "idx": 3974
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH ()-[t1:`has_ranking_2`]->(t2@`university`)\nWHERE t1.`university_id` = t2.`id`\nAND (t2.`university_name` = 'Brown University')\nORDER BY t1.`score` DESC NULLS LAST \nRETURN t1.`year` AS `year` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In what year does the Brown University score the highest?",
    "evidence": "Brown University refers to university_name = 'Brown University'; score the highest refers to MAX(score)",
    "idx": 3976
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`university_year`)-[for_university_0:`for_university`]->(t1@`university`)-[located_in_0:`located_in`]->(t3@`country`)\nWHERE t1.`id` = t2.`university_id`\nAND t3.`id` = t1.`country_id`\nAND (t2.`year` = 2011 AND t1.`id` = 23)\nRETURN t3.`country_name` AS `country_name`, cast (t2.`num_students` * t2.`pct_female_students` as float) / 100 AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the location and number of female students in university ID 23 in 2011?",
    "evidence": "in 2011 refers to year 2011; female students refers to DIVIDE(MULTIPLY(num_students, pct_female_students), 100); location refers to country_name",
    "idx": 3979
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t1@`ranking_criteria`)-[t2:`has_ranking_2`]->()\nWHERE t1.`id` = t2.`ranking_criteria_id`\nAND (t2.`score` = 40 AND t1.`criteria_name` = 'Teaching' AND t2.`score` = 40)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many universities scored 40 in teaching criteria?",
    "evidence": "scored 40 refers to score = 40; in teaching refers to criteria_name = 'Teaching'",
    "idx": 3980
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (t2@`university_year`)-[for_university_0:`for_university`]->(t1@`university`)-[located_in_0:`located_in`]->(t3@`country`)\nWHERE t1.`id` = t2.`university_id`\nAND t3.`id` = t1.`country_id`\nAND (t3.`country_name` = 'United States of America' AND t2.`year` = 2016)\nRETURN sum(cast (t2.`pct_female_students` * t2.`num_students` as float) / 100) * 100 / sum(t2.`num_students`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the universities in United States of America, what is the percentage of female students in year 2016?",
    "evidence": "female students refers to DIVIDE(MULTIPLY(num_students, pct_female_students), 100); in United States of America refers to country_name = 'United States of America'; percentage refers to DIVIDE(SUM(DIVIDE(MULTIPLY(num_students, pct_female_students), 100)), SUM(num_students))",
    "idx": 3981
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (sales_in_weather@`sales_in_weather`)\nWHERE sales_in_weather.`date` = date('2012-01-01') AND sales_in_weather.`store_nbr` = 1 AND sales_in_weather.`item_nbr` = 9\nRETURN sales_in_weather.`units` AS `units`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many units of item no.9 were sold in store no.1 on 2012/1/1?",
    "evidence": "store no. 1 refers to store_nbr = 1; item no. 9 refers to item_nbr = 9; on 2012/1/1 refers to date = '2012-01-01'",
    "idx": 3984
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (sales_in_weather@`sales_in_weather`)\nWHERE sales_in_weather.`date` = date('2012-01-01') AND sales_in_weather.`store_nbr` = 1\nORDER BY sales_in_weather.`units` DESC NULLS LAST \nRETURN sales_in_weather.`item_nbr` AS `item_nbr` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ID of the item that sold the best on 2012/1/1 in store no.1?",
    "evidence": "sold on 2012/1/1 refers to date = '2012-01-01'; in store no.1 refers to store_nbr = 1; item sold the best refers to Max(units)",
    "idx": 3985
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (weather@`weather`)\nWHERE weather.`station_nbr` = 1 AND weather.`date` = date('2012-01-01')\nRETURN weather.`tmax` - weather.`tmin` AS `temrange`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the temperature range of station no.1 on 2012/1/1?",
    "evidence": "on 2012/1/1 refers to date = '2012-01-01'; temperature range refers to Subtract (tmax, tmin); station no.1 refers to station_nbr = 1",
    "idx": 3986
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (weather@`weather`)\nWHERE weather.`station_nbr` = 1\nRETURN CASE  WHEN (sum(CASE  WHEN weather.`date` = date('2012-01-01') THEN weather.`avgspeed` ELSE 0 END) - sum(CASE  WHEN weather.`date` = date('2012-01-02') THEN weather.`avgspeed` ELSE 0 END)) > 0 THEN '2012-01-01' ELSE '2012-01-02' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "On which day was the weather more windy in station no.1, 2012/1/1 or 2012/1/2?",
    "evidence": "station no.1 refers to station_nbr = 1; 2012/1/1 refers to date = '2012-01-01'; 2012/1/2 refers to date = '2012-01-02'; more windy refers to Max(avgspeed)",
    "idx": 3988
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t1@`relation`)-[store_0:`store`]->(t2@`sales_in_weather`)\nMATCH (t1@`relation`)-[station_0:`station`]->(t3@`weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND t1.`station_nbr` = t3.`station_nbr`\nAND (t2.`store_nbr` = 3 AND t2.`item_nbr` = 5)\nORDER BY t3.`tmax` - t3.`tmin` DESC NULLS LAST \nRETURN t2.`units` AS `units` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many units of item no.5 were sold in store no.3 on the day the temperature range was the biggest?",
    "evidence": "item no. 5 refers to item_nbr = 5; store no.3 refers to store_nbr = 3; when the temperature range was the biggest refers to Max(Subtract(tmax, tmin))",
    "idx": 3989
  },
  {
    "filename": "train.json",
    "db_id": "sales_in_weather",
    "gql_statement": "MATCH (t1@`relation`)-[store_0:`store`]->(t2@`sales_in_weather`)\nMATCH (t1@`relation`)-[station_0:`station`]->(t3@`weather`)\nWHERE t1.`store_nbr` = t2.`store_nbr`\nAND t1.`station_nbr` = t3.`station_nbr`\nAND (t2.`store_nbr` = 3 AND t2.`item_nbr` = 5 AND t2.`units` > 100)\nORDER BY t3.`tmax` - t3.`tmin` DESC NULLS LAST \nRETURN t2.`date` AS `date` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the days on which over 100 units of item no.5 were sold in store no.3, on which date was the temperature range the biggest?",
    "evidence": "over 100 units refers to units > 100; item no. 5 refers to item_nbr = 5; store no.3 refers to store_nbr = 3; the temperature range was the biggest refers to Max(Subtract(tmax, tmin))",
    "idx": 3990
  }
]