[
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`county` = 'SAINT CROIX')\nRETURN CASE WHEN COUNT(`t1`.`zip_code`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t2`.`type` = 'Post Office' THEN `t1`.`zip_code` ELSE NULL END)) * 100 / COUNT(`t1`.`zip_code`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the types of postal points in Saint Croix, what percentage of postal points is the post office?",
    "evidence": "DIVIDE(COUNT(type = 'Post Office' ), COUNT(type)) as percentage where county = 'SAINT CROIX';",
    "idx": 4067
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t3`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t1`.`zip_code` = `t3`.`zip_code`\nAND (`t1`.`area_code` = '787' AND `t3`.`type` = 'Unique Post Office')\nRETURN DISTINCT `t2`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the area code 787, list the country of the cities with a postal point type of unique postal office.",
    "evidence": "postal point type of unique postal office refers to type = 'Unique Post Office';",
    "idx": 4068
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`alias` = 'East Longmeadow')\nRETURN `t2`.`elevation` AS `elevation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the elevation of the city with the alias East Longmeadow?",
    "evidence": "",
    "idx": 4069
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`daylight_savings` = 'No')\nRETURN COUNT(`t1`.`area_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In cities that do not implement daylight savings, what is the total number of cities?",
    "evidence": "do not implement daylight savings refers to daylight_savings = 'No';",
    "idx": 4070
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`area_code`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`zip_code` = 1116)\nRETURN `t2`.`county` AS `county`, `t1`.`area_code` AS `area_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the country and area code of the city with zip code 1116.",
    "evidence": "",
    "idx": 4071
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`alias` = 'St Thomas')\nRETURN DISTINCT `t2`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cities with alias St Thomas, provide the type of postal point for each city.",
    "evidence": "",
    "idx": 4072
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nMATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t3`:`zip_data`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND `t2`.`zip_code` = `t3`.`zip_code`\nAND (`t1`.`name` = 'Oklahoma' AND `t2`.`county` = 'NOBLE')\nRETURN `t3`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the names of the cities belonging to Noble, Oklahoma.",
    "evidence": "the county of Noble is located in the state of Oklahoma;",
    "idx": 4073
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "CALL(*) {\nMATCH (`zip_data_sub0`:`zip_data`)\nRETURN MAX(`zip_data_sub0`.`water_area`) AS `_col_0`  \n}\nMATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`water_area` = `_col_0`)\nRETURN `t1`.`area_code` AS `area_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the listed cities, provide the area code of the city with the largest water area.",
    "evidence": "the largest water area refers to MAX(water_area);",
    "idx": 4074
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "CALL(*) {\nMATCH (`zip_data_sub0`:`zip_data`)\nRETURN MAX(`zip_data_sub0`.`population_2020`) AS `_col_0`  \n}\nMATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`population_2020` = `_col_0`)\nRETURN `t1`.`alias` AS `alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the alias of the city with the highest population in year 2020.",
    "evidence": "the highest population in year 2020 refers to MAX(population_2020);",
    "idx": 4075
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nMATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t3`:`zip_data`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND `t2`.`zip_code` = `t3`.`zip_code`\nAND (`t1`.`name` = 'Massachusetts' AND `t2`.`county` = 'HAMPDEN')\nWITH `t3`.`elevation` AS _groupby_col_0\nRETURN _groupby_col_0 AS `elevation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the elevation of the city belonging to Hampden, Massachusetts?",
    "evidence": "the county of Hampden is located in the state of Massachusetts.",
    "idx": 4076
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "CALL(*) {\nMATCH (`zip_data_sub0`:`zip_data`)\nRETURN MAX(`zip_data_sub0`.`hispanic_population`) AS `_col_0`  \n}\nMATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`hispanic_population` = `_col_0`)\nRETURN `t1`.`area_code` AS `area_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the area code of the city with the highest Hispanic population.",
    "evidence": "the highest Hispanic population refers to MAX(hispanic_population);",
    "idx": 4077
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`asian_population` = 7)\nRETURN `t1`.`alias` AS `alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the alias of the cities with an Asian population of 7.",
    "evidence": "Asian population of 7 refers to asian_population = 7;",
    "idx": 4078
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`area_code` = 920)\nRETURN avg(`t2`.`white_population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average of the white population in the cities with area code 920?",
    "evidence": "AVG(white_population) where area_code = 920;",
    "idx": 4079
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`alias`)-[is_alias_for_0:is_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`alias` = 'Ponce')\nRETURN CASE WHEN COUNT(`t2`.`zip_code`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t2`.`county_fips` < 20 THEN `t2`.`zip_code` ELSE NULL END)) * 100 / COUNT(`t2`.`zip_code`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cities with alias Ponce, what is the percentage of cities with a country level FIPS code of less than 20?",
    "evidence": "DIVIDE(COUNT(county_fips < 20), COUNT(county_fips)) as percentage where alias = 'Ponce';",
    "idx": 4080
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "CALL(*) {\nMATCH (`zip_data_sub0`:`zip_data`)\nRETURN avg(`zip_data_sub0`.`population_2020`) AS `_col_0`  \n}\nMATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`population_2020` > 0.97 * `_col_0`)\nRETURN `t1`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the country of the cities with a population greater than 97% of the average population of all countries in 2020.",
    "evidence": "population_2020 > MULTIPLY(0.97, AVG(population_2020));",
    "idx": 4081
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t1`.`cbsa_name` = 'Allentown-Bethlehem-Easton, PA-NJ')\nRETURN `t2`.`zip_code` AS `zip_code`, `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the zip codes and coordinates of the postal points under Allentown-Bethlehem-Easton, PA-NJ.",
    "evidence": "coordinates refer to latitude and longitude; under Allentown-Bethlehem-Easton, PA-NJ refers to CBSA_name = 'Allentown-Bethlehem-Easton, PA-NJ';",
    "idx": 4083
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`bad_alias` = 'Shared Reshipper')\nRETURN `t1`.`zip_code` AS `zip_code`, `t2`.`city` AS `city`, `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the zip codes, cities, and locations of the postal points that have Shared Reshipper as a bad alias.",
    "evidence": "latitude and longitude coordinates can be used to identify the location;",
    "idx": 4084
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[t2:represented_by]->(`t3`:`congress`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`district` = `t3`.`cognress_rep_id`\nAND (`t1`.`city` = 'Garfield')\nRETURN `t3`.`first_name` AS `first_name`, `t3`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who are the congress representatives of the postal points in Garfield?",
    "evidence": "Who are the congress representatives refer to first_name, last_name; Garfield is the city;",
    "idx": 4085
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t1`.`cbsa_name` = 'New York-Newark-Jersey City, NY-NJ-PA')\nRETURN COUNT(`t2`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the number of postal points under New York-Newark-Jersey City, NY-NJ-PA.",
    "evidence": "postal points refer to zip_code; under New York-Newark-Jersey City, NY-NJ-PA refers to CBSA_name = 'New York-Newark-Jersey City, NY-NJ-PA';",
    "idx": 4086
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH ()-[t2:represented_by]->(`t1`:`congress`)\nWHERE `t1`.`cognress_rep_id` = `t2`.`district`\nAND (`t1`.`state` = 'Puerto Rico')\nRETURN COUNT(`t2`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many postal points are there under the congress representative in Puerto Rico?",
    "evidence": "postal points refer to zip_code; Puerto Rico refers to state = 'Puerto Rico';",
    "idx": 4087
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'West Virginia')\nRETURN COUNT(DISTINCT `t2`.`zip_code`) AS `_col_0`, COUNT(DISTINCT `t2`.`county`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the number of postal points and the countries in West Virginia.",
    "evidence": "postal points refer to zip_code; West Virginia is the name of the state, in which name = 'West Virginia';",
    "idx": 4088
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`type` = 'Community Post Office ' AND `t2`.`elevation` > 6000)\nRETURN `t1`.`zip_code` AS `zip_code`, `t1`.`area_code` AS `area_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the zip codes and area codes of the postal points with the community post office type at the elevation above 6000.",
    "evidence": "community post office type refers to type = 'Community Post Office'; elevation above 6000 refers to elevation > 6000;",
    "idx": 4089
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH ()-[t2:represented_by]->(`t1`:`congress`)\nWHERE `t1`.`cognress_rep_id` = `t2`.`district`\nAND (`t1`.`state` = 'Mississippi')\nRETURN COUNT(`t2`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many postal points are there under the congress representative from the House of Representatives in Mississippi?",
    "evidence": "postal points refer to zip_code; Mississippi is the name of the state, in which name = 'Mississippi';",
    "idx": 4090
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[t2:represented_by]->()\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`city` = 'East Springfield')\nRETURN `t2`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the congress representatives' IDs of the postal points in East Springfield.",
    "evidence": "congress representatives' IDs refer to CID; East Springfield is the city;",
    "idx": 4091
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "CALL(*) {\nMATCH (`zip_data_sub0`:`zip_data`)\nRETURN MAX(`zip_data_sub0`.`employees`) AS `_col_0`  \n}\nMATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t2`.`employees` = `_col_0`)\nRETURN `t1`.`cbsa_name` AS `cbsa_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the CBSA officer of the post point in the area with the highest number of employees?",
    "evidence": "CBSA officer refers to CBSA_name; the highest number of employees refers to MAX(employees);",
    "idx": 4092
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'Ohio' AND `t2`.`type` = 'Unique Post Office')\nRETURN COUNT(`t2`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many postal points with unique post office types are there in Ohio?",
    "evidence": "postal points refer to zip_code; unique post office types refer to type = 'Unique Post Office'; Ohio is the name of the state, in which name = 'Ohio';",
    "idx": 4093
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'Guam')\nRETURN CASE WHEN COUNT(`t2`.`zip_code`)=0 THEN NULL ELSE toFloat(sum(`t2`.`total_beneficiaries`)) / COUNT(`t2`.`zip_code`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average number of beneficiaries per postal point in Guam.",
    "evidence": "DIVIDE(SUM(total_beneficiaries), COUNT(zip_code)) where name = 'Guam';",
    "idx": 4094
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH ()-[t2:represented_by]->(`t1`:`congress`)\nWHERE `t1`.`cognress_rep_id` = `t2`.`district`\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`party` = 'Democrat' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`, sum(CASE  WHEN `t1`.`state` = 'Hawaii' THEN 1 ELSE 0 END) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of congress representatives from the Democrat party. Among them, how many postal points are in the Hawaii state?",
    "evidence": "DIVIDE(COUNT(party = 'Democrat'), COUNT(congress_rep_id)) as percentage; postal points refer to zip_code; state = 'Hawaii';",
    "idx": 4095
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`rootbeerbrand`:`rootbeerbrand`)\nWHERE NOT `rootbeerbrand`.`facebookpage` IS NULL\nRETURN `rootbeerbrand`.`brandname` AS `brandname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the root beer brands that are advertised on facebook.",
    "evidence": "name of the root beer brand refers to BrandName; advertised on facebook refers to FacebookPage IS not NULL;",
    "idx": 4098
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:purchased]->()\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`first` = 'Frank-Paul' AND `t1`.`last` = 'Santangelo' AND CASE WHEN `t2`.`transactiondate` is not NULL THEN apoc.temporal.format(`t2`.`transactiondate`,'yyyy-MM') ELSE NULL END = '2014-07')\nRETURN COUNT(`t1`.`customerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many transactions had Frank-Paul Santangelo made in July, 2014?",
    "evidence": "in July, 2014 refers to SUBSTR(TransactionDate, 1, 4) = '2014' AND SUBSTR(TransactionDate, 6, 2) = '07';",
    "idx": 4102
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:purchased]->()\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`gender` = 'M' AND CASE WHEN `t2`.`transactiondate` is not NULL THEN apoc.temporal.format(`t2`.`transactiondate`,'yyyy-MM') ELSE NULL END = '2014-07')\nRETURN COUNT(`t1`.`customerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the transactions made in July, 2014, how many of them were made by a male customer?",
    "evidence": "in July, 2014 refers to SUBSTR(TransactionDate, 1, 4) = '2014' AND SUBSTR(TransactionDate, 6, 2) = '07'; male customer refers to Gender = 'M';",
    "idx": 4103
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:purchased]->()\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`subscribedtoemaillist` = 'TRUE' AND `t2`.`creditcardtype` = 'Visa' AND CASE WHEN `t2`.`transactiondate` is not NULL THEN apoc.temporal.format(`t2`.`transactiondate`,'yyyy-MM') ELSE NULL END = '2014-07')\nRETURN COUNT(`t1`.`customerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the users that permit the company to send regular emails to them, how many of them had made a transaction with a Visa card in July, 2014?",
    "evidence": "users permit the company to send regular emails to them refers to subscribedtoemaillist = 'TRUE'; Visa card refers to creditcardtype = 'Visa'; in July, 2014 refers to SUBSTR(TransactionDate, 1, 4) = '2014' AND SUBSTR(TransactionDate, 6, 2) = '07';",
    "idx": 4104
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:purchased]->(`t3`:`rootbeer`)-[manufactured_by_0:manufactured_by]->(`t4`:`rootbeerbrand`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND `t2`.`rootbeerid` = `t3`.`rootbeerid`\nAND `t3`.`brandid` = `t4`.`brandid`\nAND (`t1`.`first` = 'Frank-Paul' AND `t1`.`last` = 'Santangelo' AND `t2`.`transactiondate` = localdatetime('2014-07-07T00:00:00'))\nRETURN DISTINCT `t4`.`brandname` AS `brandname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the brands of all the root beer that Frank-Paul Santangelo had purchased on 2014/7/7.",
    "evidence": "brands of the root beer refers to BrandName; purchased on 2014/7/7 refers to transactiondate = '2014-07-07';",
    "idx": 4105
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:purchased]->()\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`gender` = 'M')\nWITH `t2`.`transactiondate` AS _groupby_col_0, COUNT(`t2`.`customerid`) AS _groupby_col_1\nWHERE _groupby_col_1 > 3\nRETURN _groupby_col_0 AS `transactiondate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the dates on which a male customer has purchased more than 3 root beers.",
    "evidence": "dates of purchase refers to TransactionDate; male customer refers to Gender = 'M'; purchased more than 3 root beers refers to COUNT(CustomerID) > 3;",
    "idx": 4112
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:reviewed]->()\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`first` = 'James' AND `t1`.`last` = 'House')\nRETURN COUNT(`t2`.`customerid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of reviews given by James House.",
    "evidence": "FALSE;",
    "idx": 4115
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:purchased]->()\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t1`.`first` = 'Lisa' AND `t1`.`last` = 'Ling')\nRETURN DISTINCT `t2`.`creditcardnumber` AS `creditcardnumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the credit card number of Lisa Ling.",
    "evidence": "FALSE;",
    "idx": 4116
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`location`)-[has_geolocation_0:has_geolocation]->(`t2`:`geolocation`)\nWHERE `t1`.`locationid` = `t2`.`locationid`\nAND (`t1`.`locationname` = 'Sac State American River Courtyard')\nRETURN `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the coordinate of Sac State American River Courtyard.",
    "evidence": "coordinate = Latitude, Longitude; Sac State American River Courtyard refers to LocationName = 'Sac State American River Courtyard';",
    "idx": 4117
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`gender` = 'M' AND `customers`.`city` = 'Fair Oaks' AND `customers`.`subscribedtoemaillist` = 'TRUE'\nRETURN `customers`.`first` AS `first`, `customers`.`last` AS `last`, `customers`.`phonenumber` AS `phonenumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name and phone number of male customers from Fair Oaks who are subscribed to the email list.",
    "evidence": "full name = First, Last; male customers refers to Gender = 'M'; Fair Oaks refers to City = 'Fair Oaks'; subscribed to the email list refers to SubscribedToEmailList = 'TRUE';",
    "idx": 4141
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`rootbeerbrand`:`rootbeerbrand`)\nWHERE `rootbeerbrand`.`firstbrewedyear` >= '1996' AND `rootbeerbrand`.`firstbrewedyear` <= '2000'\nORDER BY `rootbeerbrand`.`firstbrewedyear` IS NULL ASC, `rootbeerbrand`.`firstbrewedyear` DESC \nRETURN `rootbeerbrand`.`brandname` AS `brandname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the brands that brewed their first drink between 1996 and 2000 in the descending order of the date brewed.",
    "evidence": "name of the brands refers to BrandName; between 1996 and 2000 refers to FirstBrewedYear > = 1996 AND FirstBrewedYear < = 2000;",
    "idx": 4143
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`rootbeer`)-[manufactured_by_1:manufactured_by]->(`t1_sub0`:`rootbeerbrand`)\nWHERE `t1_sub0`.`brandid` = `t2_sub0`.`brandid`\nORDER BY `t1_sub0`.`currentretailprice` - `t1_sub0`.`wholesalecost` IS NULL ASC, `t1_sub0`.`currentretailprice` - `t1_sub0`.`wholesalecost` DESC \nRETURN `t1_sub0`.`brandname` AS `brandname`, `t2_sub0`.`containertype` AS `containertype`  LIMIT 1\n}\nWITH *\nRETURN `brandname`, `containertype`   \nUNION ALL\nCALL (*) {\nMATCH (`t4_sub0`:`rootbeer`)-[manufactured_by_3:manufactured_by]->(`t3_sub0`:`rootbeerbrand`)\nWHERE `t3_sub0`.`brandid` = `t4_sub0`.`brandid`\nORDER BY `t3_sub0`.`currentretailprice` - `t3_sub0`.`wholesalecost` IS NULL DESC, `t3_sub0`.`currentretailprice` - `t3_sub0`.`wholesalecost`  \nRETURN `t3_sub0`.`brandname` AS `brandname`, `t4_sub0`.`containertype` AS `containertype`  LIMIT 1\n}\nWITH *\nRETURN `brandname`, `containertype`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the root beer with the most and least amount of profit per unit and list the container types in which these root beers are sold.",
    "evidence": "most amount of profit per unit refers to MAX(SUBTRACT(CurrentRetailPrice, WholesaleCost)); least amount of profit per unit refers to MIN(SUBTRACT(CurrentRetailPrice, WholesaleCost));",
    "idx": 4148
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:purchased]->()\nMATCH ()-[t2:transacted_at]->(`t3`:`location`)\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND `t2`.`locationid` = `t3`.`locationid`\nAND (`t3`.`locationname` = 'Sac State Union' AND `t2`.`creditcardtype` = 'American Express')\nRETURN DISTINCT `t1`.`first` AS `first`, `t1`.`last` AS `last`, `t1`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find and list the full name and email of the customers who used American Express cards in Sac State Union.",
    "evidence": "full name = First, Last; American Express cards refers to CreditCardType = 'American Express'; Sac State Union refers to LocationName = 'Sac State Union';",
    "idx": 4155
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`rootbeer`)-[manufactured_by_0:manufactured_by]->(`t2`:`rootbeerbrand`)\nMATCH (`t1`:`rootbeer`)-[has_selling_geolocation_0:has_selling_geolocation]->(`t3`:`geolocation`)\nWHERE `t1`.`brandid` = `t2`.`brandid`\nAND `t1`.`locationid` = `t3`.`locationid`\nAND (`t3`.`latitude` = '38.566129' AND `t3`.`longitude` = '-121.426432')\nRETURN DISTINCT `t2`.`brandname` AS `brandname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What brands of beers are manufactured at coordinates 38,566,129, -121,426,432?",
    "evidence": "coordinates 38,566,129, -121,426,432 refers to Latitude = 38.566129 AND Longitude = -121.426432;",
    "idx": 4163
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:reviewed]->()\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t2`.`starrating` = 5 AND `t2`.`review` = 'The quintessential dessert root beer. No ice cream required.')\nRETURN `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the customer who gave a 5-star rating and commented \"The quintessential dessert root beer. No ice cream required\" on his review?",
    "evidence": "full name = First, Last; 5-star rating refers to StarRating = 5; commented \"The quintessential dessert root beer. No ice cream required\" refers to Review = 'The quintessential dessert root beer. No ice cream required.';",
    "idx": 4168
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:reviewed]->()\nWHERE `t1`.`customerid` = `t2`.`customerid`\nAND (`t2`.`starrating` > 3 AND `t1`.`city` = 'Sacramento' AND `t2`.`reviewdate` >= localdatetime('2014-01-01T00:00:00') AND `t2`.`reviewdate` <= localdatetime('2014-12-31T00:00:00'))\nRETURN DISTINCT `t1`.`email` AS `email`, `t1`.`phonenumber` AS `phonenumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tally the email addresses and phone numbers of customers from Sacramento who gave a star rating of more than 3 in 2014.",
    "evidence": "email addresses refers to Email; Sacramento refers to City = 'Sacramento'; star rating of more than 3 refers to StarRating > 3; in 2014 refers to ReviewDate LIKE '2014%';",
    "idx": 4169
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`rootbeer`)-[manufactured_by_0:manufactured_by]->(`t2`:`rootbeerbrand`)\nWHERE `t1`.`brandid` = `t2`.`brandid`\nAND (`t1`.`purchasedate` < localdatetime('2015-06-06T00:00:00') AND `t1`.`containertype` = 'Can')\nRETURN DISTINCT `t2`.`breweryname` AS `breweryname`, `t2`.`brandname` AS `brandname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give me the brewery and brand names of canned root beer that were purchased before 6/6/2015.",
    "evidence": "canned root beer refers to ContainerType = 'Can'; purchased before 6/6/2015 refers to PurchaseDate < '2015-06-06';",
    "idx": 4171
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`rootbeer`)-[manufactured_by_0:manufactured_by]->(`t2`:`rootbeerbrand`)\nWHERE `t1`.`brandid` = `t2`.`brandid`\nAND (`t2`.`firstbrewedyear` < '1930-01-01' AND `t1`.`containertype` = 'Bottle')\nORDER BY `t2`.`firstbrewedyear` IS NULL DESC, `t2`.`firstbrewedyear`  \nRETURN `t2`.`brandname` AS `brandname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the brand names of bottled root beer whose first brewing year is no later than 1930.",
    "evidence": "bottled root beer refers to ContainerType = 'Bottle'; first brewing year is no later than 1930 refers to FirstBrewedYear < 1930;",
    "idx": 4172
  },
  {
    "filename": "train.json",
    "db_id": "beer_factory",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:purchased]->()\nWHERE `t2`.`customerid` = `t1`.`customerid`\nAND ((`t1`.`first` = 'Tim' AND `t1`.`last` = 'Ocel') OR (`t1`.`first` = 'Dawn' AND `t1`.`last` = 'Childress'))\nRETURN `t2`.`rootbeerid` AS `rootbeerid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the root beers bought by Tim Ocel and Dawn Childress.",
    "evidence": "FALSE;",
    "idx": 4183
  }
]