[
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`official_full_name` = 'Sherrod Brown' AND `t2`.`district` = 13)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how many terms has current legislator Sherrod Brown served as a representative for district no.13?",
    "evidence": "district no. 13 refers to district = 13;",
    "idx": 3793
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_social_media_0:has_social_media]->(`t2`:`social-media`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`facebook` = 'senjoniernst')\nRETURN `t1`.`official_full_name` AS `official_full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the official full name of the current legislator whose current official Facebook presence is \"senjoniernst\"?",
    "evidence": "current official Facebook presence is \"senjoniernst\" refers to facebook = 'senjoniernst';",
    "idx": 3794
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nRETURN CASE  WHEN sum(CASE  WHEN `t1`.`official_full_name` = 'Maria Cantwell' THEN 1 ELSE 0 END) > sum(CASE  WHEN `t1`.`official_full_name` = 'Sherrod Brown' THEN 1 ELSE 0 END) THEN 'Maria Cantwell' ELSE 'Sherrod Brown' END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which current legislator has served for more terms, Sherrod Brown or Maria Cantwell?",
    "evidence": "if sum(official_full_name = 'Maria Cantwell') > sum(official_full_name = 'Sherrod Brown') then Maria Cantwell has served for more term than Sherrod Brown; if sum(official_full_name = 'Sherrod Brown') > sum(official_full_name = 'Maria Cantwell'), then Sherrod Brown has served for more terms than Maria Cantwell;",
    "idx": 3795
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (NOT `t1`.`wikipedia_id` IS NULL)\nRETURN CASE WHEN COUNT(DISTINCT `t1`.`bioguide_id`)=0 THEN NULL ELSE toFloat(COUNT(`t2`.`bioguide`)) / COUNT(DISTINCT `t1`.`bioguide_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of terms served for a current legislator that's famous or impact?",
    "evidence": "average = DIVIDE(COUNT(bioguide), COUNT(bioguide_id)); legislator that's famous or impact refers to wikipedia_id is not null;",
    "idx": 3796
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`current`:`current`)\nWHERE `current`.`gender_bio` = 'F'\nRETURN COUNT(`current`.`gender_bio`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the legislators are female?",
    "evidence": "female refers to gender_bio = 'F';",
    "idx": 3797
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`historical-terms`:`historical-terms`)\nWHERE `historical-terms`.`state` = 'NJ' AND `historical-terms`.`type` = 'rep'\nRETURN COUNT(`historical-terms`.`type`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of senators New Jersey have?",
    "evidence": "senators refers to type = 'rep'; New Jersey refers to state = 'NJ';",
    "idx": 3798
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_social_media_0:has_social_media]->(`t1`:`social-media`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t2`.`first_name` = 'Benjamin' AND `t2`.`last_name` = 'Hawkins')\nRETURN `t1`.`instagram` AS `instagram`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the Instagram username of the legislator named Benjamin Hawkins.",
    "evidence": "Instagram username refers to instagram;",
    "idx": 3800
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t2`:`current`)-[has_term_0:has_term]->(`t1`:`current-terms`)\nWHERE `t2`.`bioguide_id` = `t1`.`bioguide`\nAND (`t2`.`religion_bio` = 'Catholic' AND `t1`.`state` = 'NE')\nRETURN `t1`.`bioguide` AS `bioguide`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the alphanumeric ID of the Catholic legislators in Nebraska.",
    "evidence": "alphanumeric ID refers to bioguide; Catholic legislators refers to religion_bio = 'Catholic'; Nebraska refers to state = 'NE';",
    "idx": 3801
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`type` = 'rep' AND `t2`.`state` = 'ME')\nWITH `t1`.`maplight_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `maplight_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the MapLight ID of the representatives in Maine.",
    "evidence": "representatives refers to type = 'rep'; Maine refers to state = 'ME';",
    "idx": 3802
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`historical`)-[has_term_0:has_term]->(`t2`:`historical-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`birthday_bio` = '1727-11-26')\nRETURN `t2`.`type` AS `type`, `t2`.`start` AS `start`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the type and start date of the term of the legislator born on November 26, 1727.",
    "evidence": "start date of the term refers to start; born on November 26, 1727 refers to birthday_bio = '1727-11-26';",
    "idx": 3803
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t1`.`official_full_name` = 'Rick Crawford')\nRETURN `t2`.`contact_form` AS `contact_form`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the contact form of the legislator named Rick Crawford?",
    "evidence": "",
    "idx": 3804
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`current`)-[has_term_1:has_term]->(`t2_sub0`:`current-terms`)\nWHERE `t1_sub0`.`bioguide_id` = `t2_sub0`.`bioguide`\nAND (`t2_sub0`.`type` = 'rep' AND `t2_sub0`.`state` = 'MI' AND `t1_sub0`.`gender_bio` = 'F')\nWITH `t1_sub0`.`bioguide_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `bioguide_id`  \n}\nWITH *\nRETURN COUNT(`bioguide_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many female representatives are there in Michigan?",
    "evidence": "female refers to gender_bio = 'F'; representatives refers to type = 'rep'; Michigan refers to state = 'MI';",
    "idx": 3805
  },
  {
    "filename": "train.json",
    "db_id": "legislator",
    "gql_statement": "MATCH (`t1`:`current`)-[has_term_0:has_term]->(`t2`:`current-terms`)\nWHERE `t1`.`bioguide_id` = `t2`.`bioguide`\nAND (`t2`.`state` = 'ME' AND `t1`.`gender_bio` = 'F')\nRETURN CASE WHEN COUNT(`t2`.`type`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`type` = 'sen' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`type`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the female legislators, what is the percentage of the senators in Maine?",
    "evidence": "female refers to gender_bio = 'F'; percentage = MULTIPLY(DIVIDE(SUM(type = 'sen'), COUNT(type)), 100.0); senators refers to type = 'sen'; Maine refers to state = 'ME';",
    "idx": 3806
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`games`)-[t2:has_competitor]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`games_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t3`.`full_name` = 'John Aalberg')\nRETURN `t1`.`games_name` AS `games_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the Olympic games that John Aalberg has taken part in.",
    "evidence": "name of the Olympic games refers to games_name;",
    "idx": 3807
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`noc_region`)-[t2:has_person]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t1`.`region_name` = 'Finland')\nRETURN `t3`.`full_name` AS `full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the Olympic competitors from Finland.",
    "evidence": "names of competitors refer to full_name; from Finland refers to region_name = 'Finland';",
    "idx": 3811
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t2`:`event`)-[belongs_to_sport_0:belongs_to_sport]->(`t1`:`sport`)\nWHERE `t1`.`id` = `t2`.`sport_id`\nAND (`t2`.`event_name` =~ '(?i)(?s)Shooting Women.*s Trap')\nRETURN `t1`.`sport_name` AS `sport_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which sport does the event \"Shooting Women's Trap\" belong to?",
    "evidence": "sport refers to sport_name; event \"Shooting Women's Trap\" refers to event_name = 'Shooting Women''s Trap';",
    "idx": 3821
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t2`:`event`)-[belongs_to_sport_0:belongs_to_sport]->(`t1`:`sport`)\nWHERE `t1`.`id` = `t2`.`sport_id`\nAND (`t1`.`sport_name` = 'Swimming')\nRETURN COUNT(`t2`.`event_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of swimming related events.",
    "evidence": "swimming refers to sport_name = 'Swimming';",
    "idx": 3824
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`noc_region`)-[t2:has_person]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t3`.`full_name` = 'Peter Kohnke')\nRETURN `t1`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For Peter Kohnke, show the name of his/her region.",
    "evidence": "name of his/her region refers to region_name;",
    "idx": 3825
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:participated_in]->()\nWHERE `t1`.`id` = `t2`.`person_id`\nAND (`t1`.`full_name` = 'Jessica Carolina Aguilera Aguilera')\nRETURN `t2`.`games_id` AS `games_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which game has Jessica Carolina Aguilera Aguilera participated in? Give the id of the game.",
    "evidence": "id of the game refers to games_id;",
    "idx": 3826
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`noc_region`)-[t2:has_person]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t1`.`region_name` = 'Sweden')\nORDER BY `t3`.`height` IS NULL ASC, `t3`.`height` DESC \nRETURN `t3`.`full_name` AS `full_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the tallest athlete from Sweden.",
    "evidence": "the tallest athlete refers to id where MAX(height); from Sweden refers to region_name = 'Sweden'; name refers to full_name;",
    "idx": 3827
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:participated_in]->()\nWHERE `t1`.`id` = `t2`.`person_id`\nAND (`t2`.`id` = 90991)\nRETURN `t1`.`full_name` AS `full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the name of the competitor id 90991.",
    "evidence": "name of the competitor refers to full_name;",
    "idx": 3829
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:participated_in]->()\nWHERE `t1`.`id` = `t2`.`person_id`\nAND (`t2`.`id` = 147420)\nRETURN CASE WHEN (`t1`.`height` * `t1`.`height`)=0 THEN NULL ELSE toFloat(`t1`.`weight`) / (`t1`.`height` * `t1`.`height`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the bmi of the competitor id 147420.",
    "evidence": "DIVIDE(weight), MULTIPLY(height, height) where id = 147420;",
    "idx": 3831
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:participated_in]->()\nMATCH ()-[t3:awards_medal]->(`t4`:`medal`)\nWHERE `t1`.`id` = `t2`.`person_id`\nAND `t2`.`id` = `t3`.`competitor_id`\nAND `t3`.`medal_id` = `t4`.`id`\nAND (`t1`.`full_name` = 'Michael Fred Phelps, II')\nRETURN COUNT(`t3`.`event_id`) AS `_col_0`, CASE WHEN COUNT(`t4`.`id`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t4`.`id` = '1' THEN 1 ELSE NULL END)) * 100 / COUNT(`t4`.`id`) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Olympic events did Michael Phelps II join in total? Find the percentage of the events where he won a gold medal.",
    "evidence": "DIVIDE(COUNT(event_id where medal_name = 'Gold'), COUNT(event_id)) as percentage where full_name = 'Michael Fred Phelps, II';",
    "idx": 3842
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "CALL (*) {\nCALL (*) {\nMATCH (`t1_sub0_sub0`:`games`)-[t2_sub0_sub0:has_competitor]->()\nWHERE `t1_sub0_sub0`.`id` = `t2_sub0_sub0`.`games_id`\nAND (`t1_sub0_sub0`.`games_name` IN ['1988 Winter', '1988 Summer'])\nWITH `t1_sub0_sub0`.`season` AS _groupby_col_2, COUNT(`t2_sub0_sub0`.`person_id`) AS _groupby_col_3\nRETURN _groupby_col_3 AS `p2`  \n}\nWITH *\nORDER BY `p2` IS NULL ASC, `p2` DESC \nRETURN MAX(`p2`) - min(`p2`) AS `_col_0`  LIMIT 1\n}\nCALL (*) {\nMATCH (`t1_sub0`:`games`)-[t2_sub0:has_competitor]->()\nWHERE `t1_sub0`.`id` = `t2_sub0`.`games_id`\nAND (`t1_sub0`.`games_name` IN ['1988 Winter', '1988 Summer'])\nWITH `t1_sub0`.`season` AS _groupby_col_0, COUNT(`t2_sub0`.`person_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `p1`, _groupby_col_1 AS `p2`  \n}\nWITH *\nORDER BY `p2` IS NULL ASC, `p2` DESC \nRETURN `p1`, _col_0 AS _col_1   LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the Winter and Summer Olympics of 1988, which game has the most number of competitors? Find the difference of the number of competitors between the two games.",
    "evidence": "the most number of competitors refer to MAX(COUNT(person_id)); SUBTRACT(COUNT(person_id where games_name = '1988 Summer'), COUNT(person_id where games_name = '1988 Winter'));",
    "idx": 3843
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:participated_in]->()\nMATCH ()-[t3:awarded_in]->(`t4`:`event`)\nWHERE `t1`.`id` = `t2`.`person_id`\nAND `t2`.`id` = `t3`.`competitor_id`\nAND `t3`.`event_id` = `t4`.`id`\nAND (`t4`.`event_name` = 'Equestrianism Mixed Three-Day Event, Individual')\nRETURN CASE WHEN COUNT(`t1`.`id`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`gender` = 'F' THEN 1 ELSE NULL END)) * 100 / COUNT(`t1`.`id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of women who have participated in Equestrianism Mixed Three-Day Event, Individual.",
    "evidence": "DIVIDE(COUNT(person_id where gender = 'F), COUNT(person_id)) as percentage where event_name = 'Equestrianism Mixed Three-Day Event, Individual';",
    "idx": 3854
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`games`)-[t2:has_competitor]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`games_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t1`.`games_name` = '1992 Summer')\nRETURN avg(`t2`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average age of the persons who participated in the 1992 Summer Games.",
    "evidence": "DIVIDE(SUM(age), COUNT(person_id)) where games_name = '1992 Summer';",
    "idx": 3855
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`games`:`games`)\nWHERE `games`.`season` <> 'Winter'\nWITH `games`.`games_year` AS _groupby_col_0, COUNT(`games`.`season`) AS _groupby_col_1\nWHERE _groupby_col_1 = 1\nRETURN _groupby_col_0 AS `games_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out years that only have summer games.",
    "evidence": "years refer to games_year; only have summer games refer to games_year where COUNT(games_name) = 1 and season = 'Summer';",
    "idx": 3856
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`games`:`games`)\nWHERE `games`.`games_year` >= '1990' AND `games`.`games_year` <= '1999'\nRETURN COUNT(`games`.`games_year`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Olympics games were held during the 90s?",
    "evidence": "games refer to id; during the 90s refers to games_year BETWEEN 1990 AND 1999;",
    "idx": 3857
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`medal`)-[t2:awarded_in]->()\nMATCH ()-[t3:has_competitor]->(`t4`:`person`)\nWHERE `t1`.`id` = `t2`.`medal_id`\nAND `t2`.`competitor_id` = `t3`.`id`\nAND `t3`.`person_id` = `t4`.`id`\nAND (`t4`.`full_name` = 'Lee Chong Wei' AND `t2`.`medal_id` <> 4)\nRETURN DISTINCT `t1`.`medal_name` AS `medal_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out all the medals won by Lee Chong Wei.",
    "evidence": "medals refer to medal_id where medal_id <> 4;",
    "idx": 3861
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`noc_region`:`noc_region`)\nWHERE `noc_region`.`noc` = 'COL'\nRETURN `noc_region`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which region does the NOC code \"COL\" stand for?",
    "evidence": "region refers to region_name; NOC code \"COL\" refers to noc = 'COL';",
    "idx": 3876
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`sport`:`sport`)\nWHERE `sport`.`id` = 19\nRETURN `sport`.`sport_name` AS `sport_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of sport id 19.",
    "evidence": "name of sport refers to sport_name",
    "idx": 3877
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`event`:`event`)\nWHERE `event`.`event_name` = 'Shooting Mixed Skeet'\nRETURN `event`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the id of the event \"Shooting Mixed Skeet\".",
    "evidence": "\"Shooting Mixed Skeet\" refers to event_name = 'Shooting Mixed Skeet';",
    "idx": 3878
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`sport`:`sport`)\nWHERE `sport`.`sport_name` = 'Hockey'\nRETURN `sport`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide hockey's sport id.",
    "evidence": "hockey's sport refers to sport_name = 'hockey';",
    "idx": 3879
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`full_name` = 'Dagfinn Sverre Aarskog'\nRETURN `person`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the weight of Dagfinn Sverre Aarskog.",
    "evidence": "",
    "idx": 3880
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`games`)-[t2:has_competitor]->()\nWHERE `t1`.`id` = `t2`.`games_id`\nAND (`t1`.`games_name` = '1984 Summer' AND `t2`.`age` > 50)\nRETURN COUNT(`t2`.`person_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of athletes in the 1984 Summer Olympic Games who were more than 50 years old.",
    "evidence": "the 1984 Summer Olympic Games refer to games_name = '1984 Summer'; athletes more than 50 years old refer to person_id where age > 50;",
    "idx": 3888
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`noc_region`)-[t2:has_person]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t1`.`region_name` = 'Portugal')\nRETURN `t3`.`height` AS `height` ORDER BY `t3`.`height` IS NULL ASC, `t3`.`height` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the height of the tallest athlete from Portugal.",
    "evidence": "the tallest athlete refers to id where MAX(height); from Portugal refers to region_name = 'Portugal';",
    "idx": 3891
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`noc_region`)-[t2:has_person]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t1`.`region_name` = 'Tonga' AND `t3`.`gender` = 'M')\nRETURN avg(`t3`.`weight`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average weight of male athletes from Tonga.",
    "evidence": "AVG(weight) where region_name = 'Tonga' and gender = 'M';",
    "idx": 3894
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`games`)-[t2:has_competitor]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`games_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t1`.`games_name` = '1936 Summer')\nRETURN `t3`.`full_name` AS `full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all competitors' names who participated in 1936 Summer.",
    "evidence": "competitors' names refer to full_name; in 1936 Summer refers to games_name = '1936 Summer';",
    "idx": 3904
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t2`:`event`)-[belongs_to_sport_0:belongs_to_sport]->(`t1`:`sport`)\nWHERE `t1`.`id` = `t2`.`sport_id`\nAND (`t2`.`event_name` =~ '(?i)(?s)Cross Country Skiing Men.*s 10/15 kilometres Pursuit')\nRETURN `t1`.`sport_name` AS `sport_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the sport name of \"Cross Country Skiing Men's 10/15 kilometres Pursuit\" event?",
    "evidence": "\"Cross Country Skiing Men's 10/15 kilometres Pursuit\" refers to event_name = 'Cross Country Skiing Men''s 10/15 kilometres Pursuit';",
    "idx": 3908
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`games`)-[t2:has_competitor]->()\nWHERE `t1`.`id` = `t2`.`games_id`\nAND (`t2`.`games_id` = 13)\nRETURN DISTINCT `t1`.`games_name` AS `games_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the name of the game that the people participated in games id 13.",
    "evidence": "name of games refers to games_name;",
    "idx": 3915
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t2`:`event`)-[belongs_to_sport_0:belongs_to_sport]->(`t1`:`sport`)\nWHERE `t1`.`id` = `t2`.`sport_id`\nAND (`t1`.`sport_name` = 'Basketball')\nRETURN `t2`.`event_name` AS `event_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the event name of Basketball.",
    "evidence": "basketball refers to sport_name = 'Basketball';",
    "idx": 3918
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`medal`)-[t2:awarded_in]->()\nWHERE `t1`.`id` = `t2`.`medal_id`\nAND (`t1`.`medal_name` = 'Gold')\nRETURN `t2`.`event_id` AS `event_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the id of event that achieve the gold medal.",
    "evidence": "the gold medal refers to medal_name = 'Gold';",
    "idx": 3920
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`noc_region`)-[t2:has_person]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t1`.`region_name` = 'Argentina')\nRETURN `t3`.`full_name` AS `full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of competitors from Argentina.",
    "evidence": "name refers to full_name; Argentina refers to region_name = 'Argentina';",
    "idx": 3930
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`games`)-[t2:has_competitor]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`games_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t3`.`full_name` = 'Georgios Abaris')\nRETURN `t1`.`games_name` AS `games_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of the games that Georgios Abaris participated.",
    "evidence": "name of games refers to games_name;",
    "idx": 3932
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`noc_region`)-[t2:has_person]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t1`.`region_name` = 'Greece')\nRETURN `t3`.`full_name` AS `full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the name of competitors from Greece.",
    "evidence": "name refers to full_name; Greece refers to region_name = 'Greece';",
    "idx": 3933
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`games`)-[t2:has_competitor]->()\nWHERE `t1`.`id` = `t2`.`games_id`\nAND (`t1`.`games_name` = '1924 Winter')\nRETURN avg(`t2`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average age of the competitors who participated in the 1924 Winter.",
    "evidence": "AVG(age) where games_name = '1924 Winter';",
    "idx": 3934
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`games`)-[t2:has_competitor]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`games_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t1`.`games_name` = '2000 Summer')\nRETURN `t3`.`full_name` AS `full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the competitors' names who joined the 2000 Summer.",
    "evidence": "the competitors' names refer to full_name; the 2000 Summer refers to games_name = '2000 Summer';",
    "idx": 3937
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`noc_region`)-[t2:has_person]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`person_id` = `t3`.`id`\nORDER BY `t3`.`weight` IS NULL ASC, `t3`.`weight` DESC \nRETURN `t1`.`noc` AS `noc`, `t1`.`region_name` AS `region_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the NOC code and region name of the heaviest competitor.",
    "evidence": "NOC code refers to noc; the heaviest refers to MAX(weight);",
    "idx": 3941
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:participated_in]->()\nMATCH ()-[t3:awards_medal]->(`t4`:`medal`)\nWHERE `t1`.`id` = `t2`.`person_id`\nAND `t2`.`id` = `t3`.`competitor_id`\nAND `t3`.`medal_id` = `t4`.`id`\nAND (`t4`.`medal_name` = 'Gold')\nRETURN DISTINCT `t1`.`full_name` AS `full_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names of competitors who received a gold medal.",
    "evidence": "names of competitors refer to full_name; gold medal refers to medal_name = 'Gold';",
    "idx": 3946
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:participated_in]->()\nWHERE `t1`.`id` = `t2`.`person_id`\nAND (`t2`.`age` >= 22 AND `t2`.`age` <= 28)\nRETURN avg(`t1`.`height`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compute the average height of competitors whose age ranges from 22 to 28.",
    "evidence": "AVG(height) where age BETWEEN 22 AND 28;",
    "idx": 3947
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:participated_in]->()\nWHERE `t1`.`id` = `t2`.`person_id`\nORDER BY `t1`.`height` IS NULL ASC, `t1`.`height` DESC \nRETURN `t2`.`age` AS `age`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the age of the tallest competitor.",
    "evidence": "the tallest refers to MAX(height);",
    "idx": 3949
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:participated_in]->()\nWHERE `t1`.`id` = `t2`.`person_id`\nAND (`t2`.`age` < 24)\nRETURN COUNT(CASE  WHEN `t1`.`weight` > 70 THEN 1 ELSE NULL END) - COUNT(CASE  WHEN `t1`.`weight` < 70 THEN 1 ELSE NULL END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the competitors with age ranges 24 and below, calculate the difference between the number of competitors who weighed greater than 70 kg and competitors who weighted less than 70 kg.",
    "evidence": "SUBTRACT(COUNT(weight > 70), COUNT(weight < 70)) where age < 24;",
    "idx": 3950
  },
  {
    "filename": "train.json",
    "db_id": "olympics",
    "gql_statement": "CALL(*) {\nMATCH (`person_sub0`:`person`)\nWHERE `person_sub0`.`gender` = 'M'\nRETURN avg(`person_sub0`.`height`) AS `_col_0`  \n}\nMATCH (`t1`:`noc_region`)-[t2:has_person]->(`t3`:`person`)\nWHERE `t1`.`id` = `t2`.`region_id`\nAND `t2`.`person_id` = `t3`.`id`\nAND (`t3`.`gender` = 'M' AND `t3`.`height` * 100 > `_col_0` * 87)\nRETURN DISTINCT `t1`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the males, list the region name of people with height greater than 87% of the average height of all people listed.",
    "evidence": "males refer to gender = 'M'; height greater than 87% of the average height refers to height > MULTIPLY(AVG(height), 0.87);",
    "idx": 3952
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'ARECIBO')\nRETURN sum(`t1`.`households`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of households in Arecibo county?",
    "evidence": "\"ARECIBO\" is the county; total number of households refer to sum(households)",
    "idx": 3953
  }
]