[
  {
    "filename": "train.json",
    "db_id": "world",
    "gql_statement": "CALL(*) {\nMATCH (`country_sub0`:`country`)\nRETURN avg(`country_sub0`.`lifeexpectancy`) AS `_col_0`  \n}\nMATCH (`t1`:`city`)-[located_in_0:located_in]->(`t2`:`country`)\nWHERE `t1`.`countrycode` = `t2`.`code`\nAND (`t1`.`population` >= 140000 AND `t1`.`population` <= 150000)\nWITH `t2`.`name` AS _groupby_col_0, `t2`.`lifeexpectancy` AS _groupby_col_1, `t2`.`lifeexpectancy` AS _groupby_col_2, `_col_0` * 0.8 AS _groupby_col_3\nWHERE _groupby_col_2 < _groupby_col_3\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the cities with a population between 140000 and 150000, list the country that has life expectancy greater than 80% life expectancy of all countries.",
    "evidence": "life expectancy greater than 80% life expectancy of all countries refers to LifeExpectancy < (MULTIPLY(AVG(LifeExpectancy), 0.8));",
    "idx": 6048
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "CALL(*) {\nMATCH (`categories_sub0`:`categories`)\nWITH `categories_sub0`.`category` AS _groupby_col_0, COUNT(`categories_sub0`.`podcast_id`) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `category`  LIMIT 1\n}\nMATCH (`categories`:`categories`)\nWHERE `categories`.`category` = `category`\nRETURN COUNT(`categories`.`podcast_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many podcasts are there in the category which has the most podcasts?",
    "evidence": "category which has the most podcast refers to the category with Max(count(podcast_id))",
    "idx": 6050
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "CALL (*) {\nMATCH (`categories_sub0`:`categories`)\nWITH `categories_sub0`.`podcast_id` AS _groupby_col_0, COUNT(`categories_sub0`.`category`) AS _groupby_col_1\nWHERE _groupby_col_1 >= 4\nRETURN _groupby_col_0 AS `podcast_id`  \n}\nWITH *\nRETURN COUNT(`podcast_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of the podcast that are categorized in four or more categories?",
    "evidence": "categorized in 4 or more refers to Count(category) > 4; percentage = Divide(Count(podcast_id(count(category) > 4)), Count(podcast_id)) * 100",
    "idx": 6051
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`podcasts`:`podcasts`)\nWHERE `podcasts`.`title` = 'Brown Suga Diaries'\nRETURN `podcasts`.`itunes_id` AS `itunes_id`, `podcasts`.`itunes_url` AS `itunes_url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the itunes id and url for podcast titled 'Brown Suga Diaries'.",
    "evidence": "url refers to itunes_url; 'Brown Suga Diaries' is the title of podcast",
    "idx": 6052
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`podcasts`:`podcasts`)\nWHERE `podcasts`.`title` =~ '(?i)(?s).*Dream.*'\nWITH `podcasts`.`itunes_url` AS _groupby_col_0\nRETURN _groupby_col_0 AS `itunes_url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all podcast with its itunes url for all title containing the word 'Dream'.",
    "evidence": "containing the word 'Dream' refers to title LIKE '%Dream%'",
    "idx": 6053
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`podcasts`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`title` = 'I Heart My Life Show')\nRETURN `t1`.`category` AS `category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all the categories for podcast titled 'I Heart My Life Show'.",
    "evidence": "'I Hearty My Life Show' is the title of podcast",
    "idx": 6054
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`podcasts`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`category` = 'society-culture')\nRETURN `t2`.`title` AS `title`, `t2`.`itunes_url` AS `itunes_url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the podcast title and its itunes url under the 'society-culture' category.",
    "evidence": "",
    "idx": 6055
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`title` = 'Pop Rocket' AND `t2`.`created_at` =~ '(?i)(?s)2016-.*' AND `t2`.`rating` < 5)\nRETURN `t2`.`author_id` AS `author_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the authors who created review for podcast titled 'Pop Rocket' in 2016 with rating less than 5.",
    "evidence": "Pop Rocket' is the title of podcast; in 2016 refers to created_at like'2016%'; rating less than 5 refers to rating < 5; author refers to author_id",
    "idx": 6056
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`title` = 'Love it!')\nRETURN DISTINCT `t1`.`title` AS `title`, `t2`.`content` AS `content`, `t2`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the podcast title, content review and rating for all reviews with titled 'Love it!'",
    "evidence": "\"Love it!\" is the title of review; content reviewed refers to content",
    "idx": 6057
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`title` = 'In The Thick')\nWITH `t2`.`author_id` AS _groupby_col_0, `t2`.`rating` AS _groupby_col_1, `t2`.`created_at` AS _groupby_col_2\nRETURN _groupby_col_0 AS `author_id`, _groupby_col_1 AS `rating`, _groupby_col_2 AS `created_at`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the author, rating and review creation date of review for podcast title 'In The Thick'.",
    "evidence": "\"In The Thick\" is the title of podcast; author refers to author_id; creation date refers to created_at",
    "idx": 6058
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nRETURN `t1`.`podcast_id` AS `podcast_id`, `t2`.`created_at` AS `created_at`, `t2`.`title` AS `title`, `t2`.`rating` AS `rating` ORDER BY `t2`.`created_at` IS NULL ASC, `t2`.`created_at` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which podcast was reviewed the latest? State the date of creation, podcast tile and rating.",
    "evidence": "latest refers to Max(created_at); date of creation refers to created_at",
    "idx": 6059
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`author_id` = '76A4C24B6038145')\nRETURN `t2`.`title` AS `title`, `t2`.`rating` AS `rating`, `t2`.`content` AS `content`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the podcast title, rating and review content created by '76A4C24B6038145'.",
    "evidence": "\"76A4C24B6038145\" is author_id; review content refers to content",
    "idx": 6060
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`rating` = 1)\nRETURN DISTINCT `t1`.`title` AS `title`, `t2`.`title` AS `title_1`, `t2`.`content` AS `content`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all reviews with the worst rating, state the podcast title as well as the review title and content.",
    "evidence": "worst rating refers to rating = 1",
    "idx": 6061
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`created_at` =~ '(?i)(?s)2019-05-.*')\nRETURN DISTINCT `t1`.`title` AS `title`, `t2`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all reviews created in May 2019. State the title of podcast and review rating.",
    "evidence": "created in May 2019 refers to created_at like '2019-05%'",
    "idx": 6062
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "CALL(*) {\nMATCH (`reviews_sub0`:`reviews`)\nWHERE `reviews_sub0`.`title` = 'Long time listener, calling it quits'\nRETURN `reviews_sub0`.`podcast_id` AS `podcast_id_1`  \n}\nMATCH (`podcasts`:`podcasts`)\nWHERE `podcasts`.`podcast_id` = `podcast_id_1`\nRETURN `podcasts`.`podcast_id` AS `podcast_id`, `podcasts`.`itunes_url` AS `itunes_url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the podcast in which a commentor left a comment with the title 'Long time listener, calling it quits?' Include the URL of the podcast as well.",
    "evidence": "comment refers to review; 'Long time listener, calling it quits' is the title of review;  name of the podcast refers to title of podcast; URL refers to itunes_url",
    "idx": 6064
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`podcasts`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`category` = 'true-crime')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the names of podcasts under the 'true crime' category.",
    "evidence": "name of the podcast refers to title of the podcast",
    "idx": 6065
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "CALL(*) {\nMATCH (`podcasts_sub0`:`podcasts`)\nWHERE `podcasts_sub0`.`title` = 'StormCast: The Official Warhammer Age of Sigmar Podcast'\nRETURN `podcasts_sub0`.`podcast_id` AS `podcast_id`  \n}\nMATCH (`reviews`:`reviews`)\nWHERE `reviews`.`podcast_id` = `podcast_id`\nRETURN `reviews`.`content` AS `content`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write all the review content belonging to StormCast: The Official Warhammer Age of Sigmar Podcast.",
    "evidence": "review content refers to content; 'StormCast: The Official Warhammer Age of Sigmar Podcast' is the title of podcast;",
    "idx": 6066
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "CALL(*) {\nMATCH (`podcasts_sub0`:`podcasts`)\nWHERE `podcasts_sub0`.`title` = 'More Stupider: A 90-Day Fiance Podcast'\nRETURN `podcasts_sub0`.`podcast_id` AS `podcast_id`  \n}\nMATCH (`reviews`:`reviews`)\nWHERE `reviews`.`podcast_id` = `podcast_id` AND `reviews`.`rating` = 1\nRETURN `reviews`.`title` AS `title`, `reviews`.`content` AS `content`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write all the review titles and the contents belonging to the podcast 'More Stupider: A 90-Day Fiance Podcast' with a review rating of 1.",
    "evidence": "podcast 'More Stupider: A 90-Day Fiance Podcast'  refers to title = 'More Stupider: A 90-Day Fiance Podcast'; rating of 1 refers to rating = 1",
    "idx": 6067
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "CALL (*) {\nMATCH (`categories_sub0`:`categories`)\nWHERE `categories_sub0`.`category` = 'arts-books' OR `categories_sub0`.`category` = 'arts-design'\nWITH `categories_sub0`.`category` AS _groupby_col_0, COUNT(`categories_sub0`.`podcast_id`) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `category`  LIMIT 1\n}\nCALL (*) {\nMATCH (`categories_sub0`:`categories`)\nRETURN sum(CASE  WHEN category = 'arts-books' THEN 1 ELSE 0 END) - sum(CASE  WHEN category = 'arts-design' THEN 1 ELSE 0 END) AS `_col_0`  \n}\nWITH *\nRETURN category  AS `has more podcasts`, _col_0  AS `differenct between arts-books and arts-design`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Of the arts-books and arts-design categories, which one has more podcasts and what is the numerical difference between them?",
    "evidence": "arts-books' and 'arts-design' are category; numerical difference = Subtract(Count(podcast_id(category = 'arts-books')), Count(podcast_id(category = 'arts-design'))); one has much more podcast refers to Max(Count(podcast_id))",
    "idx": 6069
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`categories`:`categories`)\nRETURN CASE WHEN COUNT(`categories`.`podcast_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `categories`.`category` = 'fiction-science-fiction' THEN 1 ELSE 0 END)) * 100 / COUNT(`categories`.`podcast_id`) END OR False AS `percentage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of podcasts in the fiction-science-fiction category.",
    "evidence": "percentage =   Divide (Count(podcast_id(category = 'fiction-science-fiction')), Count(podcast_id)) * 100",
    "idx": 6072
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`podcasts`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`category` = 'fiction')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicates the title of all podcasts in the fiction category.",
    "evidence": "",
    "idx": 6075
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`itunes_id` = 1516665400)\nRETURN `t2`.`author_id` AS `author_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the id of the reviewer whose itunes id is 1516665400.",
    "evidence": "\"151665400\" is itunes_id; id of reviewer refers to author_id",
    "idx": 6076
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "WITH *, COLLECT { MATCH (`reviews_sub0`:`reviews`)\nWHERE `reviews_sub0`.`content` = 'Can\\'t stop listening'\nRETURN `reviews_sub0`.`podcast_id` AS `podcast_id`   } AS in_collect_0\nMATCH (`podcasts`:`podcasts`)\nWHERE `podcasts`.`podcast_id` IN in_collect_0\nRETURN `podcasts`.`slug` AS `slug`, `podcasts`.`itunes_url` AS `itunes_url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the slug and the itunes url of the podcast whose review content was written Can't stop listening.",
    "evidence": "review content was written Can't stop listening refers to content = 'Can't stop listening'",
    "idx": 6079
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`created_at` >= '2016-07-01T00:00:00-07:00' AND `t2`.`created_at` <= '2016-12-31T23:59:59-07:00')\nRETURN COUNT(DISTINCT `t1`.`category`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In how many categories were podcast reviews created in the last six months of 2016? List them.",
    "evidence": "created in last six months of 2016 refers to created_at BETWEEN '2016-07-01T00:00:00-07:00' and '2016-12-31T23:59:59-07:00'",
    "idx": 6081
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`category` = 'true-crime')\nRETURN avg(`t2`.`rating`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average rating of the true crime category.",
    "evidence": "average rating = Divide (Sum(rating(category = 'true-crime')), Count(podcast_id(category = 'true-crime')))",
    "idx": 6082
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`category` = 'arts')\nRETURN DISTINCT `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the titles of the art category.",
    "evidence": "art category refers to category = 'arts'",
    "idx": 6083
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`category` = 'arts' AND `t2`.`created_at` =~ '(?i)(?s)2018-.*')\nRETURN DISTINCT `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the names of podcasts in the art category in 2018.",
    "evidence": "art category refers to category = 'arts'; in 2018 refers to created_at like '2018%'; name of podcast refers to title",
    "idx": 6085
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`category` = 'music' AND `t2`.`rating` > 3)\nRETURN DISTINCT `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the names of the podcasts in the music category that have a rating greater than 3.",
    "evidence": "music category refers to category = 'music'; rating greater than 3 refers to rating > 3; name of the podcast refers to title",
    "idx": 6086
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND ((`t2`.`created_at` =~ '(?i)(?s)2018-.*' AND `t1`.`category` = 'arts' AND `t2`.`content` =~ '(?i)(?s).*love.*') OR (`t2`.`created_at` =~ '(?i)(?s)2019-.*' AND `t1`.`category` = 'arts' AND `t2`.`content` =~ '(?i)(?s).*love.*'))\nRETURN DISTINCT `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which titles have the content \"love\" but the category is art produced between 2018 and 2019.",
    "evidence": "content love refers to content = 'love'; 'arts' is the category; produced between 2018 and 2019 refers to year (created_at) BETWEEN 2018 and 2019",
    "idx": 6087
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`podcasts`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`title` = 'Scaling Global')\nRETURN `t1`.`category` AS `category`, `t2`.`itunes_url` AS `itunes_url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the category and itune url of the title \"Scaling Global\"?",
    "evidence": "",
    "idx": 6088
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "CALL(*) {\nMATCH (`reviews_sub0`:`reviews`)\nWHERE `reviews_sub0`.`title` = 'Hosts bring the show down'\nRETURN `reviews_sub0`.`podcast_id` AS `podcast_id`  \n}\nMATCH (`podcasts`:`podcasts`)\nWHERE `podcasts`.`podcast_id` = `podcast_id`\nRETURN `podcasts`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the review with the title \"Hosts bring the show down\" for?",
    "evidence": "\"Hosts bring the show down\" refers to title of review",
    "idx": 6091
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "WITH *, COLLECT { MATCH (`podcasts_sub0`:`podcasts`)\nWHERE `podcasts_sub0`.`title` =~ '(?i)(?s).*jessica.*'\nRETURN `podcasts_sub0`.`podcast_id` AS `podcast_id`   } AS in_collect_0\nMATCH (`categories`:`categories`)\nWHERE `categories`.`podcast_id` IN in_collect_0\nRETURN `categories`.`category` AS `category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the cagetories for all the podcasts with \"jessica\" in the title.",
    "evidence": "podcast with 'jessica' in title refers to title like '%jessica%'",
    "idx": 6093
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "WITH *, COLLECT { MATCH (`podcasts_sub0`:`podcasts`)\nWHERE `podcasts_sub0`.`title` = 'Moist Boys'\nRETURN `podcasts_sub0`.`podcast_id` AS `podcast_id`   } AS in_collect_0\nMATCH (`categories`:`categories`)\nWHERE `categories`.`podcast_id` IN in_collect_0\nRETURN `categories`.`category` AS `category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the category for the \"Moist Boys\" podcast?",
    "evidence": "\"Moist Boys\" refers to title of podcast",
    "idx": 6094
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`rating` = 2)\nRETURN `t1`.`category` AS `category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of the two-star reviews and their categories.",
    "evidence": "two-stars review refers to rating = 2",
    "idx": 6095
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`title` = 'Inspired & On Fire!')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the podcasts reviewed by a reviewer who has a review titled \"Inspired & On Fire!\".",
    "evidence": "\"Inspired & On Fire\" refers to title of review",
    "idx": 6096
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "WITH *, COLLECT { MATCH (`categories_sub0`:`categories`)\nWHERE `categories_sub0`.`category` = 'fiction-science-fiction'\nRETURN `categories_sub0`.`podcast_id` AS `podcast_id`   } AS in_collect_0\nMATCH (`podcasts`:`podcasts`)\nWHERE `podcasts`.`podcast_id` IN in_collect_0\nRETURN `podcasts`.`itunes_url` AS `itunes_url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the urls for all the \"fiction-science-fiction\" podcasts.",
    "evidence": "fiction-science-fiction podcasts refers to category = 'fiction-science-fiction'; urls refers to itunes_url",
    "idx": 6097
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`title` = 'Planet Money')\nRETURN COUNT(`t2`.`podcast_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many reviews does \"Planet Money\" have?",
    "evidence": "\"Planet Money\" is the title of podcast",
    "idx": 6098
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`title` = 'Crime Junkie')\nRETURN avg(`t2`.`rating`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average rating for the \"crime-junkie\" podcast?",
    "evidence": "\"crime-junkie\" podcast refers to title = 'crime-junkie'; average rating = Divide (Sum(rating), Count(rating))",
    "idx": 6099
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`podcasts`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nRETURN CASE WHEN COUNT(`t2`.`title`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`category` = 'technology' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`title`) END OR False AS `percentage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What percentage of podcasts are \"technology\" podcasts? List all of them.",
    "evidence": "\"technology\" podcast refers to category = 'technology'; percentage = Divide (Count (podcast_id (category = 'technology')), Count (podcast_id)) * 100",
    "idx": 6100
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "WITH *, COLLECT { MATCH (`podcasts_sub0`:`podcasts`)\nWHERE `podcasts_sub0`.`title` = 'Scaling Global'\nRETURN `podcasts_sub0`.`podcast_id` AS `podcast_id`   } AS in_collect_0\nMATCH (`categories`:`categories`)\nWHERE `categories`.`podcast_id` IN in_collect_0\nRETURN `categories`.`category` AS `category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which category is the podcast \"Scaling Global\" under?",
    "evidence": "\"Scaling Global\" is the title of podcast",
    "idx": 6102
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`categories`)\nMATCH (`t2`:`podcasts`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`category` = 'arts-performing-arts')\nRETURN DISTINCT `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of all the podcasts under the category \"arts-performing-arts\".",
    "evidence": "category 'arts-performing-arts' refers to category = 'arts-performing-arts';",
    "idx": 6103
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`title` = 'Scaling Global')\nRETURN COUNT(`t2`.`content`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many reviews are created for the podcast \"Scaling Global\" under?",
    "evidence": "\"Scaling Global\" is the title of podcast",
    "idx": 6104
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t2`.`author_id` = 'F7E5A318989779D')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of the podcasts for which the author whose ID is F7E5A318989779D has written a review.",
    "evidence": "author whose ID is F7E5A318989779D refers to author_id = 'F7E5A318989779D'",
    "idx": 6106
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`title` = 'Please Excuse My Dead Aunt Sally' AND `t2`.`rating` = 5)\nRETURN COUNT(`t2`.`rating`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many ratings of 5 have been given to the podcast \"Please Excuse My Dead Aunt Sally\"?",
    "evidence": "rating of 5 refers to rating = 5; 'Please Excuse My Dead Aunt Sally' is the title of podcast",
    "idx": 6107
  },
  {
    "filename": "train.json",
    "db_id": "music_platform_2",
    "gql_statement": "MATCH (`t1`:`podcasts`)\nMATCH (`t2`:`reviews`)\nWHERE `t2`.`podcast_id` = `t1`.`podcast_id`\nAND (`t1`.`title` = 'Please Excuse My Dead Aunt Sally')\nRETURN avg(`t2`.`rating`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average rating of the podcast \"Please Excuse My Dead Aunt Sally\"?",
    "evidence": "\"Please Excuse My Dead Aunty Sally\" is the title of podcast; Average rating = Divide (Sum(rating), Count(rating))",
    "idx": 6108
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t1`:`university_year`)-[for_university_0:for_university]->(`t2`:`university`)\nWHERE `t1`.`university_id` = `t2`.`id`\nAND (`t1`.`num_students` > 50000 AND `t1`.`year` = 2012)\nRETURN `t2`.`university_name` AS `university_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of all the universities that have no less than 50,000 students in the year 2012.",
    "evidence": "have no less than 50,000 students refers to num_students > 50000; name of university refers to university_name;",
    "idx": 6123
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`t2`:`university_year`)-[for_university_0:for_university]->(`t1`:`university`)-[located_in_0:located_in]->(`t3`:`country`)\nWHERE `t1`.`id` = `t2`.`university_id`\nAND `t3`.`id` = `t1`.`country_id`\nAND (`t2`.`year` = 2016 AND CASE WHEN 100=0 THEN NULL ELSE `t2`.`num_students` * `t2`.`pct_female_students` / 100 END > 20000)\nRETURN COUNT(*) AS `_col_0`, sum(CASE  WHEN `t3`.`country_name` = 'United States of America' THEN 1 ELSE 0 END) AS `nums_in_usa`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many universities have no less than 20,000 female students in 2016? Identify how many of the said universities are located in the United States of America.",
    "evidence": "have no less than 20,000 female students refers to DIVIDE(MULTIPLY(pct_female_students, num_students), 100) > 20000; in 2016 refers to year = 2016; located in the United States of America refers to country_name = 'United States of America'",
    "idx": 6125
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university_year`:`university_year`)\nORDER BY `university_year`.`num_students` IS NULL DESC, `university_year`.`num_students`  \nRETURN `university_year`.`year` AS `year`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the year where a university had the lowest number of students.",
    "evidence": "had the lowest number of students refers to MIN(num_students)",
    "idx": 6128
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university_year`:`university_year`)\nRETURN avg(`university_year`.`pct_female_students`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Compute the average percentage of female students.",
    "evidence": "average percentage of female students refers to avg(pct_female_students)",
    "idx": 6129
  },
  {
    "filename": "train.json",
    "db_id": "university",
    "gql_statement": "MATCH (`university_year`:`university_year`)\nWHERE `university_year`.`year` = 2013 AND `university_year`.`university_id` = 20\nRETURN `university_year`.`pct_international_students` * `university_year`.`num_students` AS `_col_0`, `university_year`.`num_students` AS `num_students`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of international students and number of students in 2013 in university ID 20.",
    "evidence": "number of international students refers to DIVIDE(MULTIPLY(pct_international_students, num_students), 100); in 2013 refers to year = 2013",
    "idx": 6130
  }
]