[
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nWHERE `trip`.`start_date` = '7/1/2014%' AND `trip`.`end_date` = '7/31/2014%' AND `trip`.`start_station_name` = 'Steuart at Market' AND `trip`.`end_station_name` = 'Embarcadero at Sansome'\nRETURN avg(`trip`.`duration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the average ride time of the bikes that started at Steuart at Market station and ended at Embarcadero at Sansome station in July 2014.",
    "evidence": "started at refers to start_station_name; start_station_name = 'Steuart at Market'; ended at refers to end_station_name; end_station_name = 'Embarcadero at Sansome'; rides in July 2004 refers to start_date = '7/1/2014 0:00'AND end_date = '7/31/2014 12:59';average ride time = DIVIDE(SUM(duration), COUNT(id))",
    "idx": 6927
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`weather`:`weather`)\nWHERE `weather`.`date` =~ '(?i)(?s)5/.*/2015' AND `weather`.`mean_humidity` >= 65 AND `weather`.`mean_humidity` <= 75\nRETURN avg(`weather`.`max_temperature_f`) AS `_col_0`, avg(`weather`.`min_temperature_f`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the average maximum and minimum temperatures in May 2015 when the mean humidity is between 65 and 75?",
    "evidence": "average maximum temperature = DIVIDE(SUM(max_temperature_f), COUNT(date)); average minimum temperature = DIVIDE(SUM(min_temperature_f), COUNT(date)); May 2015 refers to date BETWEEN '5/1/2015'AND '5/31/2015';",
    "idx": 6928
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nWHERE `trip`.`start_date` =~ '(?i)(?s)6/.*/2013.*'\nRETURN sum(CASE WHEN `trip`.`subscription_type` = 'Subscriber' THEN 1 ELSE 0 END) - sum(CASE WHEN `trip`.`subscription_type` = 'Customer' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference between the number of customers and the number of subscribers who did the trip in June 2013.",
    "evidence": "customer refers to subscription_type = 'Customer'; subscribers refers to subscription_type = 'Subscriber'; difference = SUBTRACT(SUM(subscription_type = 'Subscriber' t), SUM(subscription_type = 'Customer')); trip in June 2013 refers to start_date BETWEEN '6/1/2013 0:00'AND '6/31/2013 12:59';",
    "idx": 6929
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (CASE WHEN -4-1 < 0 THEN substring(toString(`t2`.`date`),size(toString(`t2`.`date`))+1+(-4-1)) ELSE substring(toString(`t2`.`date`),-4-1) END = '2013' AND `t2`.`events` = 'Fog-Rain')\nRETURN `t2`.`date` AS `date`, `t1`.`bike_id` AS `bike_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the days in 2013 when rain and fog occurred together and find the id of bikes borrowed on these days.",
    "evidence": "in 2013 refers to year(date) = 2013; rain and fog ocurred together refers to events = 'Fog-Rain'; id of bikes refers to biked_id;",
    "idx": 6930
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND ((`t2`.`events` = 'Rain' AND `t2`.`precipitation_inches` > '0.8') OR (`t2`.`events` = 'rain' AND `t2`.`precipitation_inches` > '0.8'))\nRETURN avg(`t1`.`duration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the average ride duration during the rain of more than 0.8 inches.",
    "evidence": "rain of more than 0.8 inches refers to events = rain where precipitation_inches>0.8; average ride duration = DIVIDE(SUM(duration), COUNT(duration));",
    "idx": 6931
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`station`:`station`)\nRETURN sum(CASE  WHEN `station`.`city` = 'San Francisco' AND CASE WHEN -4-1 < 0 THEN substring(`station`.`installation_date`,size(`station`.`installation_date`)+1+(-4-1)) ELSE substring(`station`.`installation_date`,-4-1) END = '2014' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many stations in San Francisco are installed in 2014?",
    "evidence": "stations refers to name; San Francisco refers to city = 'San Francisco'; installed in 2004 refers to installation_date like'%2014';",
    "idx": 6932
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`end_station_name`\nAND (`t2`.`city` = 'Mountain View' AND `t1`.`start_date` =~ '(?i)(?s).*2006.*')\nRETURN COUNT(`t2`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2006, how many trips ended at stations in Mountain View?",
    "evidence": "in 2006 refers to start_date LIKE'%2006%'; ended at station refers to end_station_name; Mountain View refers to city = 'Mountain View';",
    "idx": 6933
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t2`.`installation_date` =~ '(?i)(?s).*2013')\nRETURN DISTINCT `t1`.`bike_id` AS `bike_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list bikes id were used in trips which start station were installed in 2013.",
    "evidence": "start station refers to start_station_name; installed in 2013 refers to installation_date LIKE '%2013';",
    "idx": 6934
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`end_station_name`\nAND (`t1`.`subscription_type` = 'Subscriber' AND `t2`.`city` = 'San Jose')\nRETURN COUNT(`t1`.`subscription_type`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many trips which subscription types were Subscriber and ended in San Jose city?",
    "evidence": "ended in refers to end_station_name;",
    "idx": 6935
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t2`.`city` = 'San Jose')\nRETURN CASE WHEN COUNT(`t1`.`id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`duration` > 800 THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of trips that started in San Jose and durations were longer than 800 seconds?",
    "evidence": "percentage of trips = DIVIDE(COUNT(duration>800), COUNT(duration)) as percentage; San Jose refers to city = 'San Jose'; duration>800;",
    "idx": 6936
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nWHERE `trip`.`start_date` =~ '(?i)(?s).*/.*/2013.*' AND `trip`.`duration` > 1000\nRETURN COUNT(`trip`.`duration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many trips in 2013 had durations longer than 1000 seconds?",
    "evidence": "trips in 2013 refers to start_date like'%2013%'; duration>1000;",
    "idx": 6937
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nWHERE `trip`.`start_date` =~ '(?i)(?s).*2015.*' AND `trip`.`start_station_name` = 'South Van Ness at Market'\nRETURN avg(`trip`.`duration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the average duration of trips started at South Van Ness at Market in 2015.",
    "evidence": "started at refers to start_station_name; start_station_name = 'South Van Ness at Market'; average duration = DIVIDE(SUM(duration), COUNT(duration));",
    "idx": 6938
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nRETURN sum(CASE WHEN `trip`.`start_station_id` = `trip`.`end_station_id` THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many trips which start station and end station are the same?",
    "evidence": "start station refers to start_station_id; end station refers to end_station_id; start station and end station are the same refers to start_station_id = end_station_id;",
    "idx": 6939
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`events` = 'Rain' AND `t1`.`start_station_name` = 'Mountain View City Hall'\nRETURN `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which were the trips that started at Mountain View City Hall and ended on a rainy day?",
    "evidence": "started at refers to start_station_name; start_station_name = 'Mountain View City Hall'; ended on a rainy day refers to end_date where events = 'rain';",
    "idx": 6940
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t2`.`events` = 'Fog')\nRETURN avg(`t1`.`duration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average duration of trips that ended on a foggy day?",
    "evidence": "ended on a foggy day refers to end_date where events = 'fog'; average duration = DIVIDE(SUM(duration), COUNT(duration));",
    "idx": 6941
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (CASE WHEN -4-1 < 0 THEN substring(toString(`t2`.`date`),size(toString(`t2`.`date`))+1+(-4-1)) ELSE substring(toString(`t2`.`date`),-4-1) END = '2013' AND `t1`.`start_station_name` = 'Market at 4th')\nRETURN avg(`t2`.`mean_temperature_f`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please calculate the average temperature of those trips that started at Market at 4th in 2013.",
    "evidence": "started at refers to start_station_name; start station_name = 'Market at 4th'; in 2013 refers to start_date like '%2013%'; temperature refers to mean_temperature_f; average temperature = DIVIDE(SUM(mean_temperature_f), COUNT(mean_temperature_f));",
    "idx": 6942
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t1`.`id` = 4275)\nRETURN `t2`.`mean_humidity` AS `mean_humidity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the mean humidity of a trip with id 4275?",
    "evidence": "mean humidity refers to mean_humidity;",
    "idx": 6943
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (CASE WHEN -4-1 < 0 THEN substring(toString(`t2`.`date`),size(toString(`t2`.`date`))+1+(-4-1)) ELSE substring(toString(`t2`.`date`),-4-1) END = '2015' AND `t1`.`subscription_type` = 'Customer')\nRETURN CASE WHEN COUNT(`t1`.`id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`events` = 'Rain' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2015, what percentage of trips that had the subscription type was Customer and ended on a rainy day?",
    "evidence": "in 2015 refers to end_date like '%2015%'; percentage = DIVIDE(COUNT(events = 'Rain'), COUNT(events));",
    "idx": 6944
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`station`:`station`)\nWHERE `station`.`city` = 'San Jose' AND (CASE  WHEN 1-1 < 0 AND (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 < 0  THEN substring(toString(`station`.`installation_date`),(case when size(toString(`station`.`installation_date`))+1+(1-1)+(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 < 0 then 0 else size(toString(`station`.`installation_date`))+1+(1-1)+(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 end),-((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1))  WHEN 1-1 < 0 AND (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 >= 0  THEN substring(toString(`station`.`installation_date`),size(toString(`station`.`installation_date`))+1+(1-1),(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1)  WHEN 1-1 >= 0 AND (apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1 < 0  THEN substring(toString(`station`.`installation_date`),(case when 1-1+1+((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1) < 0 then 0 else 1-1+1+((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1) end),-((apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1))  ELSE substring(toString(`station`.`installation_date`),1-1,(apoc.text.indexOf(`station`.`installation_date`,'/') + 1) - 1) END IN ['8', '9', '10', '11', '12'] AND CASE WHEN -4-1 < 0 THEN substring(toString(`station`.`installation_date`),size(toString(`station`.`installation_date`))+1+(-4-1)) ELSE substring(toString(`station`.`installation_date`),-4-1) END = '2013') OR CASE WHEN -4-1 < 0 THEN substring(toString(`station`.`installation_date`),size(toString(`station`.`installation_date`))+1+(-4-1)) ELSE substring(toString(`station`.`installation_date`),-4-1) END > '2013'\nRETURN COUNT(`station`.`installation_date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many bike stations are installed after August, 2013 in San Jose?",
    "evidence": "installed after August, 2013 refers to year(installation_date)>2013; in San Jose refers to city = 'San Jose';",
    "idx": 6945
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`weather`:`weather`)\nRETURN sum(CASE WHEN `weather`.`zip_code` = '94107' AND `weather`.`date` = '8/29/2013' THEN `weather`.`mean_temperature_f` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the mean temperature in Fahrenheit on 8/29/2013 for the area where the zip code is 94107?",
    "evidence": "mean temperature in Fahrenheit refers to mean_temperature_f; on 8/29/2013 refers to date = '8/29/2013';",
    "idx": 6946
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`weather`:`weather`)\nRETURN sum(CASE WHEN `weather`.`zip_code` = '94107' AND `weather`.`date` = '8/29/2013' THEN `weather`.`max_temperature_f` - `weather`.`min_temperature_f` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference between the hottest temperature and the coldest temperature in in Fahrenheit on 8/29/2013 for the area where the zip code is 94107?",
    "evidence": "hottest temperature refers to max_temperatutre_f; coldest temperature refers to min_temperature_f; difference = SUBTRACT(max_temperature_f, min_temperature_f); date = '8/29/2013'",
    "idx": 6947
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`station`)\nMATCH (`t2`:`status`)\nWHERE `t1`.`id` = `t2`.`station_id`\nAND (`t1`.`name` = 'San Jose Diridon Caltrain Station' AND `t2`.`time` = '2013/08/29 12:06:01')\nRETURN `t2`.`bikes_available` AS `bikes_available`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many bikes can be borrowed in San Jose Diridon Caltrain Station at 12:06:01 on 2013/8/29?",
    "evidence": "number of bikes that can be borrowed refers to bikes_available; San Jose Diridon Caltrain Station refers to name = 'San Jose Diridon Caltrain Station'; time = '2013/8/29 12:06:01'",
    "idx": 6948
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t1`.`id` = 4069)\nRETURN `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which city's station is a bike borrowed on trip ID4069?",
    "evidence": "bike is borrowed from refers to start_station_id;",
    "idx": 6949
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t2`.`date` =~ '(?i)(?s)9/.*/2013' AND `t2`.`zip_code` = '94107' AND `t2`.`max_temperature_f` > 70)\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many bike trips started on the days in September, 2013 with the hottest temperature over 70 degrees Fahrenheit in the area where the zip code is 94107?",
    "evidence": "started on the days in September, 2013 refers to date LIKE'9%'AND date LIKE'%2013' hottest temperature over 70 degrees Fahrenheit refers to max_temperature_f>70;",
    "idx": 6950
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (CASE WHEN -4-1 < 0 THEN substring(toString(`t2`.`date`),size(toString(`t2`.`date`))+1+(-4-1)) ELSE substring(toString(`t2`.`date`),-4-1) END = '2013' AND `t2`.`zip_code` = '94107' AND `t2`.`max_temperature_f` > 80)\nRETURN DISTINCT `t1`.`start_station_name` AS `start_station_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the starting stations of the bike trips made on a day with a max humidity over 80 in 2013 in the area where the zip code is 94107.",
    "evidence": "starting stations refers to start_station_name; day with a max humidity over 80 refers to max_humidity>80; in 2013 refers to date LIKE'%2013';",
    "idx": 6951
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t1`.`id` = `t2`.`start_station_id`\nAND (`t2`.`subscription_type` = 'Subscriber' AND `t2`.`start_date` =~ '(?i)(?s)8/.*/2013.*' AND `t1`.`dock_count` > 20)\nRETURN COUNT(`t2`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many trips made by a subscriber started in August, 2013 from a station that can hold more than 20 bikes?",
    "evidence": "subscriber refers to subscription_type = 'Subscriber'; in August 2013 refers to start_date LIKE'8%' AND start_date LIKE'%2013%'; station that can hold more than 20 bikes refers to dock_count>20;",
    "idx": 6952
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t2`.`date` =~ '(?i)(?s).*2013.*' AND `t2`.`events` = 'Fog' AND `t1`.`start_station_name` = '2nd at Townsend' AND `t2`.`zip_code` = '94107')\nRETURN COUNT(`t1`.`start_station_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the bike trips started on the days with a fog in 2013, how many of those trips started from the station \"2nd at Townsend\"?",
    "evidence": "started on the days with a fog refers to start_date where events = 'fog'; in 2013 refers to date LIKE '%2013'; started from station refers to start_station_name; start_station_name = '2nd at Townsend';",
    "idx": 6953
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t2`.`date` =~ '(?i)(?s).*2013.*' AND `t2`.`events` = 'Fog' AND `t2`.`zip_code` = '94107')\nRETURN MAX(`t1`.`duration`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the longest duration for a bike trip starting on a day with a fog in 2013?",
    "evidence": "longest duration refers to MAX(duration); starting on a day with a fog refers to start_date where events = 'fog'; in 2013 refers to date LIKE '%2013';",
    "idx": 6954
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t1`.`id` = 4069)\nRETURN `t2`.`installation_date` AS `installation_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was the bike station from which the bike was borrowed on trip ID4069 installed?",
    "evidence": "bike was borrowed from refers to start_station_id; when the bike station was installed refers to installation_date;",
    "idx": 6955
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`id` = `t1`.`start_station_id`\nAND (`t2`.`city` = 'San Francisco' AND `t1`.`subscription_type` = 'Subscriber')\nRETURN COUNT(`t1`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many trips with a bike borrowed from the stations in San Francisco were made by a subscriber?",
    "evidence": "bike was borrowed from refers to start_station_id; San Francisco refers to city = 'San Francisco'; subscriber refers to subscription_type = 'Subscriber';",
    "idx": 6956
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nWHERE `trip`.`start_station_name` = '2nd at South Park'\nRETURN DISTINCT `trip`.`end_station_name` AS `end_station_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out all end stations for a bicycle that were making a trip starting from 2nd at South Park station? Only retain the unique value.",
    "evidence": "end station refers to end_station_name; starting from refers to start_station_name; start_station_name = '2nd at South Park';",
    "idx": 6957
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`weather`:`weather`)\nRETURN sum(CASE WHEN `weather`.`zip_code` = '94041' AND `weather`.`events` = 'Rain' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many rainy days were recorded in Mountain View?",
    "evidence": "rainy days refers to events = 'rain'; Mountain View refers to zip_code = 94041;",
    "idx": 6958
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`station`:`station`)\nRETURN sum(CASE  WHEN `station`.`city` = 'Redwood City' AND CASE WHEN -4-1 < 0 THEN substring(`station`.`installation_date`,size(`station`.`installation_date`)+1+(-4-1)) ELSE substring(`station`.`installation_date`,-4-1) END < '2014' THEN `station`.`dock_count` ELSE 0 END) AS `num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of bikes that can be hold in Redwood City before 2014.",
    "evidence": "total number of bikes that can be hold = MAX(dock_count); before 2014 refers to year(installation_date)<2014;",
    "idx": 6959
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nRETURN MAX(`trip`.`duration`) AS `_col_0`, CASE WHEN 86400=0 THEN NULL ELSE toFloat(MAX(`trip`.`duration`)) / 86400 END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the longest trip duration according? Convert the it to number of days.",
    "evidence": "longest trip duration refers to MAX(duration); days conversion = DIVIDE(duration, 86400);",
    "idx": 6960
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`weather`:`weather`)\nWHERE CASE  WHEN 1-1 < 0 AND (apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1 < 0  THEN substring(toString(`weather`.`date`),(case when size(toString(`weather`.`date`))+1+(1-1)+(apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1 < 0 then 0 else size(toString(`weather`.`date`))+1+(1-1)+(apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1 end),-((apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1))  WHEN 1-1 < 0 AND (apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1 >= 0  THEN substring(toString(`weather`.`date`),size(toString(`weather`.`date`))+1+(1-1),(apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1)  WHEN 1-1 >= 0 AND (apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1 < 0  THEN substring(toString(`weather`.`date`),(case when 1-1+1+((apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1) < 0 then 0 else 1-1+1+((apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1) end),-((apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1))  ELSE substring(toString(`weather`.`date`),1-1,(apoc.text.indexOf(`weather`.`date`,'/') + 1) - 1) END = '8' AND CASE WHEN -4-1 < 0 THEN substring(toString(`weather`.`date`),size(toString(`weather`.`date`))+1+(-4-1)) ELSE substring(toString(`weather`.`date`),-4-1) END = '2013' AND `weather`.`zip_code` = '94107'\nRETURN CASE WHEN 1.8000=0 THEN NULL ELSE (`weather`.`max_temperature_f` - 32) / 1.8000 END AS `_col_0`, CASE WHEN 1.8000=0 THEN NULL ELSE (`weather`.`mean_temperature_f` - 32) / 1.8000 END AS `_col_1`, CASE WHEN 1.8000=0 THEN NULL ELSE (`weather`.`min_temperature_f` - 32) / 1.8000 END AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Convert all temperature recorded at San Francisco city during August 2013 into degree Celsius.",
    "evidence": "temperature refers to max_temperature_f; March 2013 refers to date like '3/%/2013'; conversion to Celcius = DIVIDE(SUBTRACT(max_temperature_f, 32), 1.800) as Celsius1; DIVIDE(SUBTRACT(mean_temperature_f, 32), 1.800) as Celsius2; DIVIDE(SUBTRACT(min_temperature_f, 32), 1.800) as Celcius3;",
    "idx": 6961
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nWHERE `trip`.`start_station_name` = '2nd at South Park' AND `trip`.`end_station_name` = '2nd at South Park'\nRETURN CASE WHEN sum(CASE WHEN `trip`.`subscription_type` = 'Customer' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `trip`.`subscription_type` = 'Subscriber' THEN 1 ELSE 0 END)) / sum(CASE WHEN `trip`.`subscription_type` = 'Customer' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ratio for subscriber to customer given that the starting and the ending stations is 2nd at South Park?",
    "evidence": "subscriber refers to subscription_type = 'Subscriber'; customer refers to subscription_type = 'customer';starting station refers to start_station_name; ending station refers to end_statio_name; start_station_name = '2nd at South Park' AND end_station_name = '2nd at South Park'",
    "idx": 6962
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t1`.`zip_code` = 94107)\nRETURN DISTINCT `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Are all stations with zip code 94107 located in San Francisco city?",
    "evidence": "station refers to name;",
    "idx": 6963
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`weather`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`date` =~ '(?i)(?s).*2014' AND `t1`.`mean_temperature_f` = 20 * 1.8 + 32)\nRETURN DISTINCT `t2`.`start_station_name` AS `start_station_name`, `t2`.`end_station_name` AS `end_station_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out all stations name that having a mean temperature 20 degree Celsius in year 2014.",
    "evidence": "mean temperature refers to mean_temperature_f; mean temperature of 20 degree Celsius refers to DIVIDE(SUBTRACT(mean_temperature_f, 32), 1.8) = 20; in 2014 refers to date LIKE'%2015%';",
    "idx": 6964
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t2`.`start_station_name` = `t1`.`name`\nAND (`t1`.`city` = 'San Jose' AND `t2`.`start_date` =~ '(?i)(?s)8/.*/2013.*' AND `t2`.`start_station_name` =~ '(?i)(?s)San Jose.*' AND `t2`.`end_station_name` =~ '(?i)(?s)San Jose.*')\nRETURN COUNT(`t2`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many bicycle trip were made within San Jose city during August 2013?",
    "evidence": "during August 2013 refers to start_date like '8/%/2013%';",
    "idx": 6965
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nOPTIONAL MATCH (`t2`:`station`)\nWHERE `t1`.`start_date` =~ '(?i)(?s).*/.*/2014.*' AND `t1`.`start_station_name` <> `t1`.`end_station_name`\nAND `t2`.`name` = `t1`.`start_station_name`\nRETURN `t1`.`start_station_name` AS `start_station_name`, `t1`.`end_station_name` AS `end_station_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Is there any intercity trip were made during 2014? If yes, list out the city name for the start and end station.",
    "evidence": "intercity trip refers to start_station_name! = end_station_name; during 2014 refers to start_date like '%2014%'; start station refers to start_station_name; end station refers to end_station_name;",
    "idx": 6966
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t1`.`bike_id` = 16 AND `t1`.`start_station_name` <> `t1`.`end_station_name`)\nRETURN `t1`.`end_station_name` AS `end_station_name`, `t2`.`city` AS `city`, CASE WHEN 3600=0 THEN NULL ELSE toFloat(sum(`t1`.`duration`)) / 3600 END AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Does the bike with Id number 16 making any intercity trip? If yes, calculate the total travel duration during all the intercity trip. Convert the duration to hour.",
    "evidence": "intercity trip refers to start_station_name! = end_station_name; total travel duration to hour = DIVIDE(SUM(duration), 3600) AS hour;",
    "idx": 6967
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nOPTIONAL MATCH (`t2`:`station`)\nWHERE `t2`.`city` = 'Mountain View'\nAND `t2`.`name` = `t1`.`start_station_name`\nRETURN CASE WHEN sum(CASE  WHEN `t1`.`subscription_type` = 'Subscriber' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`subscription_type` = 'Customer' THEN 1 ELSE 0 END)) * 100 / sum(CASE  WHEN `t1`.`subscription_type` = 'Subscriber' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ratio of customer to subscriber that making a trip inside Mountain View city?",
    "evidence": "customer refers to subscription_type = 'customer'; subscriber refers to subscription_type = 'subscriber'; ratio = MULTIPLY(DIVIDE(COUNT(subscription_type = 'Customer'), COUNT(subscription_type = 'Subscriber'). 1.0)) AS ratio;",
    "idx": 6968
  }
]