[
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[made_from_0:made_from]->(`t1`:`grapes`)\nWHERE `t1`.`grape` = `t2`.`grape`\nAND (`t1`.`color` = 'Red')\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of wines made from red grapes?",
    "evidence": "",
    "idx": 6570
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[produced_in_0:produced_in]->(`t1`:`appellations`)\nWHERE `t1`.`appelation` = `t2`.`appelation`\nAND (`t1`.`area` = 'North Coast')\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all distinct wines that have appellations in North Coast area.",
    "evidence": "",
    "idx": 6571
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[produced_in_0:produced_in]->(`t1`:`appellations`)\nWHERE `t1`.`appelation` = `t2`.`appelation`\nAND (`t1`.`area` = 'North Coast')\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct names of wines that have appellations in the North Coast area?",
    "evidence": "",
    "idx": 6572
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`winery` = 'Robert Biale'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many wines are produced at Robert Biale winery?",
    "evidence": "",
    "idx": 6573
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`winery` = 'Robert Biale'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of wines produced at Robert Biale winery.",
    "evidence": "",
    "idx": 6574
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`appellations`:`appellations`)\nWHERE `appellations`.`county` = 'Napa'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of appelations in Napa County.",
    "evidence": "",
    "idx": 6576
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[produced_in_0:produced_in]->(`t1`:`appellations`)\nWHERE `t1`.`appelation` = `t2`.`appelation`\nAND (`t1`.`county` = 'Sonoma')\nRETURN avg(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the average prices of wines that are produced by appelations in Sonoma County.",
    "evidence": "",
    "idx": 6577
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[produced_in_0:produced_in]->(`t1`:`appellations`)\nWHERE `t1`.`appelation` = `t2`.`appelation`\nAND (`t1`.`county` = 'Sonoma')\nRETURN avg(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average price of wines produced in appelations in Sonoma County?",
    "evidence": "",
    "idx": 6578
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[made_from_0:made_from]->(`t1`:`grapes`)\nWHERE `t1`.`grape` = `t2`.`grape`\nAND (`t1`.`color` = 'White')\nRETURN `t2`.`name` AS `name`, `t2`.`score` AS `score`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and scores of wines that are made of white color grapes?",
    "evidence": "",
    "idx": 6579
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[made_from_0:made_from]->(`t1`:`grapes`)\nWHERE `t1`.`grape` = `t2`.`grape`\nAND (`t1`.`color` = 'White')\nRETURN `t2`.`name` AS `name`, `t2`.`score` AS `score`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the names and scores of wines made from white grapes.",
    "evidence": "",
    "idx": 6580
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[produced_in_0:produced_in]->(`t1`:`appellations`)\nWHERE `t1`.`appelation` = `t2`.`appelation`\nAND (`t1`.`area` = 'Central Coast' AND `t2`.`year` < 2005)\nRETURN MAX(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the maximum price of wins from the appelations in Central Coast area and produced before the year of 2005.",
    "evidence": "",
    "idx": 6581
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[produced_in_0:produced_in]->(`t1`:`appellations`)\nWHERE `t1`.`appelation` = `t2`.`appelation`\nAND (`t1`.`area` = 'Central Coast' AND `t2`.`year` < 2005)\nRETURN MAX(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum price of wines from the appelation in the Central Coast area, which was produced before 2005?",
    "evidence": "",
    "idx": 6582
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[made_from_0:made_from]->(`t1`:`grapes`)\nWHERE `t1`.`grape` = `t2`.`grape`\nAND (`t1`.`color` = 'White' AND `t2`.`score` > 90)\nRETURN DISTINCT `t1`.`grape` AS `grape`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the the grape whose white color grapes are used to produce wines with scores higher than 90.",
    "evidence": "",
    "idx": 6583
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[made_from_0:made_from]->(`t1`:`grapes`)\nWHERE `t1`.`grape` = `t2`.`grape`\nAND (`t1`.`color` = 'White' AND `t2`.`score` > 90)\nRETURN DISTINCT `t1`.`grape` AS `grape`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the white grape used to produce wines with scores above 90.",
    "evidence": "",
    "idx": 6584
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[made_from_0:made_from]->(`t1`:`grapes`)\nWHERE `t1`.`grape` = `t2`.`grape`\nAND (`t1`.`color` = 'Red' AND `t2`.`price` > 50)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the wines that have prices higher than 50 and made of Red color grapes?",
    "evidence": "",
    "idx": 6585
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[made_from_0:made_from]->(`t1`:`grapes`)\nWHERE `t1`.`grape` = `t2`.`grape`\nAND (`t1`.`color` = 'Red' AND `t2`.`price` > 50)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of wines made from red grapes and with prices above 50?",
    "evidence": "",
    "idx": 6586
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`t2`:`wine`)-[produced_in_0:produced_in]->(`t1`:`appellations`)\nWHERE `t1`.`appelation` = `t2`.`appelation`\nAND (`t1`.`county` = 'Monterey' AND `t2`.`price` < 50)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the wines that have prices lower than 50 and have appelations in Monterey county?",
    "evidence": "",
    "idx": 6587
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`grape` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `grape`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the numbers of wines for different grapes?",
    "evidence": "",
    "idx": 6589
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`grape` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `grape`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many wines are there for each grape?",
    "evidence": "",
    "idx": 6590
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`year` AS _groupby_col_0, avg(`wine`.`price`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average prices of wines for different years?",
    "evidence": "",
    "idx": 6591
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`year` AS _groupby_col_0, avg(`wine`.`price`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average prices of wines for each each?",
    "evidence": "",
    "idx": 6592
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "CALL(*) {\nMATCH (`wine`:`wine`)\nWHERE `wine`.`winery` = 'John Anthony'\nRETURN min(`wine`.`price`) AS `_col_0`  \n}\nMATCH (`wine`:`wine`)\nWHERE `wine`.`price` > `_col_0`\nRETURN DISTINCT `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct names of all wines that have prices higher than some wines from John Anthony winery.",
    "evidence": "",
    "idx": 6593
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "CALL(*) {\nMATCH (`wine`:`wine`)\nWHERE `wine`.`winery` = 'John Anthony'\nRETURN min(`wine`.`price`) AS `_col_0`  \n}\nMATCH (`wine`:`wine`)\nWHERE `wine`.`price` > `_col_0`\nRETURN DISTINCT `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct names of wines with prices higher than any wine from John Anthony winery.",
    "evidence": "",
    "idx": 6594
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nRETURN DISTINCT `wine`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all distinct wines in alphabetical order.",
    "evidence": "",
    "idx": 6595
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nRETURN DISTINCT `wine`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of wines, sorted in alphabetical order?",
    "evidence": "",
    "idx": 6596
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nORDER BY `wine`.`price` IS NULL DESC, `wine`.`price`  \nRETURN DISTINCT `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all distinct wines ordered by price.",
    "evidence": "",
    "idx": 6597
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nORDER BY `wine`.`price` IS NULL DESC, `wine`.`price`  \nRETURN DISTINCT `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of wines, sorted by price ascending?",
    "evidence": "",
    "idx": 6598
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`year` < 2000 OR `wine`.`year` > 2010\nRETURN DISTINCT `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct names of wines produced before the year of 2000 or after the year of 2010.",
    "evidence": "",
    "idx": 6599
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`year` < 2000 OR `wine`.`year` > 2010\nRETURN DISTINCT `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the distinct names of wines made before 2000 or after 2010.",
    "evidence": "",
    "idx": 6600
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`price` >= 50 AND `wine`.`price` <= 100\nRETURN DISTINCT `wine`.`winery` AS `winery`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct winery of wines having price between 50 and 100.",
    "evidence": "",
    "idx": 6601
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`price` >= 50 AND `wine`.`price` <= 100\nRETURN DISTINCT `wine`.`winery` AS `winery`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct wineries which produce wines costing between 50 and 100?",
    "evidence": "",
    "idx": 6602
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`year` = 2009 AND `wine`.`grape` = 'Zinfandel'\nRETURN avg(`wine`.`price`) AS `_col_0`, avg(`wine`.`cases`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the average price and case of wines made from Zinfandel grapes in the year 2009.",
    "evidence": "",
    "idx": 6604
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`appelation` = 'St. Helena'\nRETURN MAX(`wine`.`price`) AS `_col_0`, MAX(`wine`.`score`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum price and score of wines produced by St. Helena appelation?",
    "evidence": "",
    "idx": 6605
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`appelation` = 'St. Helena'\nRETURN MAX(`wine`.`price`) AS `_col_0`, MAX(`wine`.`score`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the maximum price and score for wines produced in the appelation St. Helena.",
    "evidence": "",
    "idx": 6606
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`year` AS _groupby_col_0, MAX(`wine`.`price`) AS _groupby_col_1, MAX(`wine`.`score`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum price and score of wines in each year?",
    "evidence": "",
    "idx": 6607
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`year` AS _groupby_col_0, MAX(`wine`.`price`) AS _groupby_col_1, MAX(`wine`.`score`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum price and score of wines for each year?",
    "evidence": "",
    "idx": 6608
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`appelation` AS _groupby_col_0, avg(`wine`.`price`) AS _groupby_col_1, avg(`wine`.`score`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `appelation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average price and score of wines grouped by appelation?",
    "evidence": "",
    "idx": 6609
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`appelation` AS _groupby_col_0, avg(`wine`.`price`) AS _groupby_col_1, avg(`wine`.`score`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `appelation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average price and score of wines for each appelation?",
    "evidence": "",
    "idx": 6610
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`winery` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 4\nRETURN _groupby_col_0 AS `winery`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the wineries that have at least four wines.",
    "evidence": "",
    "idx": 6611
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWITH `wine`.`winery` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 4\nRETURN _groupby_col_0 AS `winery`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which wineries produce at least four wines?",
    "evidence": "",
    "idx": 6612
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "CALL(*) {\nMATCH (`wine`:`wine`)\nWHERE `wine`.`winery` = 'Brander'\nRETURN min(`wine`.`year`) AS `_col_0`  \n}\nMATCH (`wine`:`wine`)\nWHERE `wine`.`year` < `_col_0`\nRETURN `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of wines whose production year are before the year of all wines by Brander winery?",
    "evidence": "",
    "idx": 6613
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "CALL(*) {\nMATCH (`wine`:`wine`)\nWHERE `wine`.`winery` = 'Brander'\nRETURN min(`wine`.`year`) AS `_col_0`  \n}\nMATCH (`wine`:`wine`)\nWHERE `wine`.`year` < `_col_0`\nRETURN `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of wines produced before any wine from the Brander winery?",
    "evidence": "",
    "idx": 6614
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "CALL(*) {\nMATCH (`wine_sub0`:`wine`)\nWHERE `wine_sub0`.`year` = 2006\nRETURN MAX(`wine_sub0`.`price`) AS `_col_0`  \n}\nMATCH (`wine`:`wine`)\nWHERE `wine`.`price` > `_col_0`\nRETURN `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of wines that are more expensive then all wines made in the year 2006?",
    "evidence": "",
    "idx": 6615
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "CALL(*) {\nMATCH (`wine_sub0`:`wine`)\nWHERE `wine_sub0`.`year` = 2006\nRETURN MAX(`wine_sub0`.`price`) AS `_col_0`  \n}\nMATCH (`wine`:`wine`)\nWHERE `wine`.`price` > `_col_0`\nRETURN `wine`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the names of wines with prices above any wine produced in 2006.",
    "evidence": "",
    "idx": 6616
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`price` > 100\nRETURN `wine`.`grape` AS `grape`, `wine`.`winery` AS `winery`, `wine`.`year` AS `year` ORDER BY `year` IS NULL DESC, `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the grape, winery and year of the wines whose price is bigger than 100 ordered by year.",
    "evidence": "",
    "idx": 6617
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`price` > 100\nRETURN `wine`.`grape` AS `grape`, `wine`.`winery` AS `winery`, `wine`.`year` AS `year` ORDER BY `year` IS NULL DESC, `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the grapes, wineries and years for wines with price higher than 100, sorted by year?",
    "evidence": "",
    "idx": 6618
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`score` > 93\nRETURN `wine`.`grape` AS `grape`, `wine`.`appelation` AS `appelation`, `wine`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the grape, appelation and name of wines whose score is higher than 93 ordered by Name.",
    "evidence": "",
    "idx": 6619
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "MATCH (`wine`:`wine`)\nWHERE `wine`.`score` > 93\nRETURN `wine`.`grape` AS `grape`, `wine`.`appelation` AS `appelation`, `wine`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the grapes, appelations, and wines with scores above 93, sorted by Name?",
    "evidence": "",
    "idx": 6620
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`t2_sub0`:`wine`)-[produced_in_0:produced_in]->(`t1_sub0`:`appellations`)\nWHERE `t1_sub0`.`appelation` = `t2_sub0`.`appelation`\nAND (`t1_sub0`.`county` = 'Sonoma')\nRETURN `t1_sub0`.`appelation` AS `appelation`   } AS in_collect_0\nMATCH (`wine`:`wine`)\nWHERE NOT `wine`.`appelation` IN in_collect_0\nRETURN avg(`wine`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average price of wines that are not produced from Sonoma county.",
    "evidence": "",
    "idx": 6621
  },
  {
    "filename": "train_spider.json",
    "db_id": "wine_1",
    "gql_statement": "WITH *, COLLECT { MATCH (`t2_sub0`:`wine`)-[produced_in_0:produced_in]->(`t1_sub0`:`appellations`)\nWHERE `t1_sub0`.`appelation` = `t2_sub0`.`appelation`\nAND (`t1_sub0`.`county` = 'Sonoma')\nRETURN `t1_sub0`.`appelation` AS `appelation`   } AS in_collect_0\nMATCH (`wine`:`wine`)\nWHERE NOT `wine`.`appelation` IN in_collect_0\nRETURN avg(`wine`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average price for wines not produced in Sonoma county?",
    "evidence": "",
    "idx": 6622
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`station`:`station`)\nRETURN `station`.`name` AS `name`, `station`.`location` AS `location`, `station`.`number_of_platforms` AS `number_of_platforms`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name, location, and number of platforms for all stations.",
    "evidence": "",
    "idx": 6624
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`station`:`station`)\nWHERE `station`.`location` <> 'London'\nRETURN `station`.`name` AS `name`, `station`.`total_passengers` AS `total_passengers`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names and total passengers for all train stations not in London.",
    "evidence": "",
    "idx": 6626
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`station`:`station`)\nORDER BY `station`.`total_passengers` IS NULL ASC, `station`.`total_passengers` DESC \nRETURN `station`.`name` AS `name`, `station`.`main_services` AS `main_services`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names and main services for train stations that have the top three total number of passengers.",
    "evidence": "",
    "idx": 6627
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`station`:`station`)\nWHERE `station`.`location` = 'London' OR `station`.`location` = 'Glasgow'\nRETURN avg(`station`.`total_passengers`) AS `_col_0`, MAX(`station`.`total_passengers`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average and maximum number of total passengers for train stations in London or Glasgow?",
    "evidence": "",
    "idx": 6628
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`station`:`station`)\nWITH `station`.`location` AS _groupby_col_0, sum(`station`.`number_of_platforms`) AS _groupby_col_1, sum(`station`.`total_passengers`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `location`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all locations and the total number of platforms and passengers for all train stations in each location.",
    "evidence": "",
    "idx": 6629
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`station`:`station`)\nWHERE `station`.`number_of_platforms` >= 15 AND `station`.`total_passengers` > 25\nRETURN DISTINCT `station`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all locations that have train stations with at least 15 platforms and train stations with more than 25 total passengers.",
    "evidence": "",
    "idx": 6630
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`train`:`train`)\nRETURN `train`.`name` AS `name`, `train`.`time` AS `time`, `train`.`service` AS `service`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name, time, and service for all trains.",
    "evidence": "",
    "idx": 6631
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`train`:`train`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the number of trains",
    "evidence": "",
    "idx": 6632
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`train`:`train`)\nORDER BY `train`.`time` IS NULL DESC, `train`.`time`  \nRETURN `train`.`name` AS `name`, `train`.`service` AS `service`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and service for all trains in order by time.",
    "evidence": "",
    "idx": 6633
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`t3`:`train`)-[t1:stops_at]->(`t2`:`station`)\nWHERE `t1`.`station_id` = `t2`.`station_id`\nAND `t3`.`train_id` = `t1`.`train_id`\nRETURN `t2`.`name` AS `name`, `t3`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "show the train name and station name for each train.",
    "evidence": "",
    "idx": 6634
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`t3`:`train`)-[t1:stops_at]->(`t2`:`station`)\nWHERE `t1`.`station_id` = `t2`.`station_id`\nAND `t3`.`train_id` = `t1`.`train_id`\nAND (`t2`.`location` = 'London')\nRETURN `t3`.`name` AS `name`, `t3`.`time` AS `time` ORDER BY `t3`.`time` IS NULL ASC, `t3`.`time` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all train names and times in stations in London in descending order by train time.",
    "evidence": "",
    "idx": 6635
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`station`:`station`)\nWITH `station`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 = 1\nRETURN _groupby_col_0 AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all locations with only 1 station.",
    "evidence": "",
    "idx": 6636
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[train_station_sub0:stops_at]->()\nRETURN `train_station_sub0`.`station_id` AS `station_id`   } AS in_collect_0\nMATCH (`station`:`station`)\nWHERE NOT `station`.`station_id` IN in_collect_0\nRETURN `station`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show station names without any trains.",
    "evidence": "",
    "idx": 6637
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[t3:stops_at]->(`t4`:`station`)\nWHERE `t3`.`station_id` = `t4`.`station_id`\nAND (`t4`.`location` = 'London')\nRETURN `t4`.`station_id` AS `station_id`   } AS in_collect_0\nMATCH (`t2`:`train`)-[t1:stops_at]->()\nWHERE `t1`.`train_id` = `t2`.`train_id`\nAND (NOT `t1`.`station_id` IN in_collect_0)\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the trains that do not pass any station located in London.",
    "evidence": "",
    "idx": 6638
  },
  {
    "filename": "train_spider.json",
    "db_id": "train_station",
    "gql_statement": "MATCH (`station`:`station`)\nORDER BY `station`.`annual_entry_exit` IS NULL DESC, `station`.`annual_entry_exit` , `station`.`annual_interchanges` IS NULL DESC, `station`.`annual_interchanges`  \nRETURN `station`.`name` AS `name`, `station`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names and locations of all stations ordered by their yearly entry exit and interchange amounts.",
    "evidence": "",
    "idx": 6639
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`vehicles`:`vehicles`)\nRETURN `vehicles`.`vehicle_id` AS `vehicle_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all vehicle id",
    "evidence": "",
    "idx": 6640
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`vehicles`:`vehicles`)\nWHERE `vehicles`.`vehicle_id` = 1\nRETURN `vehicles`.`vehicle_details` AS `vehicle_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the detail of vehicle with id 1.",
    "evidence": "",
    "idx": 6644
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`staff`:`staff`)\nRETURN `staff`.`first_name` AS `first_name`, `staff`.`middle_name` AS `middle_name`, `staff`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the first name middle name and last name of all staff.",
    "evidence": "",
    "idx": 6646
  },
  {
    "filename": "train_spider.json",
    "db_id": "driving_school",
    "gql_statement": "MATCH (`t2`:`staff`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`staff_address_id`\nAND (`t1`.`city` = 'Damianfort')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find out the first name and last name of staff lived in city Damianfort.",
    "evidence": "",
    "idx": 6668
  }
]