[
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`t3`:`cinema`)-[t1:shows]->(`t2`:`film`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND `t1`.`cinema_id` = `t3`.`cinema_id`\nRETURN `t3`.`name` AS `name`, `t2`.`title` AS `title`, `t1`.`date` AS `date`, `t1`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show cinema name, film title, date, and price for each record in schedule.",
    "evidence": "",
    "idx": 2926
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[schedule_sub0:shows]->()\nRETURN `schedule_sub0`.`film_id` AS `film_id`   } AS in_collect_0\nMATCH (`film`:`film`)\nWHERE NOT `film`.`film_id` IN in_collect_0\nRETURN `film`.`title` AS `title`, `film`.`directed_by` AS `directed_by`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the title and director of the films without any schedule?",
    "evidence": "",
    "idx": 2927
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`cinema`:`cinema`)\nWHERE `cinema`.`capacity` > 300\nWITH `cinema`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the locations that have more than one movie theater with capacity above 300.",
    "evidence": "",
    "idx": 2928
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`title` =~ '(?i)(?s).*Dummy.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many films have the word 'Dummy' in their titles?",
    "evidence": "",
    "idx": 2930
  },
  {
    "filename": "train_spider.json",
    "db_id": "cinema",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`title` =~ '(?i)(?s).*Dummy.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of films whose title contains the word 'Dummy'.",
    "evidence": "",
    "idx": 2931
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_for_hire",
    "gql_statement": "MATCH (`payments`:`payments`)\nWITH `payments`.`customer_id` AS _groupby_col_0, sum(`payments`.`amount_paid`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `customer_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum total amount paid by a customer? List the customer id and amount.",
    "evidence": "",
    "idx": 2933
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_for_hire",
    "gql_statement": "MATCH ()-[products_booked:books]->()\nWITH `products_booked`.`product_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 = 3\nRETURN _groupby_col_0 AS `product_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id of the product that is booked for 3 times?",
    "evidence": "",
    "idx": 2934
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_for_hire",
    "gql_statement": "MATCH (`t2`:`products_for_hire`)-[t1:has_availability_for]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t1`.`available_yn` = 1)\nRETURN `t2`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of products whose availability equals to 1?",
    "evidence": "",
    "idx": 2937
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_for_hire",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`good_or_bad_customer` = 'good'\nRETURN `customers`.`first_name` AS `first_name`, `customers`.`last_name` AS `last_name`, `customers`.`gender_mf` AS `gender_mf` ORDER BY `last_name` IS NULL DESC, `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first name, last name, and gender of all the good customers? Order by their last name.",
    "evidence": "",
    "idx": 2939
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_for_hire",
    "gql_statement": "MATCH (`payments`:`payments`)\nRETURN avg(`payments`.`amount_due`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average amount due for all the payments?",
    "evidence": "",
    "idx": 2940
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_for_hire",
    "gql_statement": "MATCH ()-[products_booked:books]->()\nRETURN MAX(`products_booked`.`booked_count`) AS `_col_0`, min(`products_booked`.`booked_count`) AS `_col_1`, avg(`products_booked`.`booked_count`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the maximum, minimum, and average booked count for the products booked?",
    "evidence": "",
    "idx": 2941
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_for_hire",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[products_booked_sub0:books]->()\nWHERE `products_booked_sub0`.`booked_amount` > 200\nRETURN `products_booked_sub0`.`product_id` AS `product_id`   } AS in_collect_0\nMATCH (`products_for_hire`:`products_for_hire`)\nWHERE NOT `products_for_hire`.`product_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many products are never booked with amount higher than 200?",
    "evidence": "",
    "idx": 2944
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_for_hire",
    "gql_statement": "MATCH (`payments`:`payments`)\nWHERE `payments`.`amount_paid` > 300 OR `payments`.`payment_type_code` = 'Check'\nRETURN `payments`.`payment_date` AS `payment_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the payment date of the payment with amount paid higher than 300 or with payment type is 'Check'",
    "evidence": "",
    "idx": 2945
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_market",
    "gql_statement": "MATCH (`phone`:`phone`)\nORDER BY `phone`.`price` IS NULL DESC, `phone`.`price`  \nRETURN `phone`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of phones in ascending order of price.",
    "evidence": "",
    "idx": 2948
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_market",
    "gql_statement": "MATCH (`phone`:`phone`)\nWHERE `phone`.`memory_in_g` > 32\nRETURN DISTINCT `phone`.`carrier` AS `carrier`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the distinct carriers of phones with memories bigger than 32.",
    "evidence": "",
    "idx": 2950
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_market",
    "gql_statement": "MATCH (`phone`:`phone`)\nWHERE `phone`.`carrier` = 'Sprint' OR `phone`.`carrier` = 'TMobile'\nRETURN `phone`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of phones with carrier either \"Sprint\" or \"TMobile\".",
    "evidence": "",
    "idx": 2951
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_market",
    "gql_statement": "MATCH (`phone`:`phone`)\nWITH `phone`.`carrier` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `carrier`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different carriers of phones together with the number of phones with each carrier.",
    "evidence": "",
    "idx": 2953
  },
  {
    "filename": "train_spider.json",
    "db_id": "phone_market",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[phone_market_sub0:available_in]->()\nRETURN `phone_market_sub0`.`phone_id` AS `phone_id`   } AS in_collect_0\nMATCH (`phone`:`phone`)\nWHERE NOT `phone`.`phone_id` IN in_collect_0\nRETURN `phone`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of phones that are not on any market.",
    "evidence": "",
    "idx": 2958
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nORDER BY `company`.`sales_billion` IS NULL ASC, `company`.`sales_billion` DESC \nRETURN `company`.`company` AS `company`, `company`.`rank` AS `rank`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the company name and rank for all companies in the decreasing order of their sales.",
    "evidence": "",
    "idx": 2961
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nWHERE `company`.`headquarters` <> 'USA'\nRETURN `company`.`company` AS `company`, `company`.`main_industry` AS `main_industry`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the company name and the main industry for all companies whose headquarters are not from USA.",
    "evidence": "",
    "idx": 2963
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nORDER BY `company`.`market_value` IS NULL ASC, `company`.`market_value` DESC \nRETURN `company`.`company` AS `company`, `company`.`headquarters` AS `headquarters`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all company names and headquarters in the descending order of market value.",
    "evidence": "",
    "idx": 2965
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nRETURN min(`company`.`market_value`) AS `_col_0`, MAX(`company`.`market_value`) AS `_col_1`, avg(`company`.`market_value`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show minimum, maximum, and average market value for all companies.",
    "evidence": "",
    "idx": 2967
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nRETURN DISTINCT `company`.`main_industry` AS `main_industry`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all main industry for all companies.",
    "evidence": "",
    "idx": 2969
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nWITH `company`.`headquarters` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `headquarters`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all headquarters and the number of companies in each headquarter.",
    "evidence": "",
    "idx": 2971
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nWITH `company`.`main_industry` AS _groupby_col_0, sum(`company`.`market_value`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `main_industry`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all main industry and total market value in each industry.",
    "evidence": "",
    "idx": 2973
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nWITH `company`.`main_industry` AS _groupby_col_0, sum(`company`.`market_value`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `main_industry`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the main indstries and total market value for each industry?",
    "evidence": "",
    "idx": 2974
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nWHERE `company`.`main_industry` = 'Banking'\nWITH `company`.`headquarters` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `headquarters`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show headquarters with at least two companies in the banking industry.",
    "evidence": "",
    "idx": 2975
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`gas_station`:`gas_station`)\nORDER BY `gas_station`.`open_year` IS NULL DESC, `gas_station`.`open_year`  \nRETURN `gas_station`.`station_id` AS `station_id`, `gas_station`.`location` AS `location`, `gas_station`.`manager_name` AS `manager_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show gas station id, location, and manager_name for all gas stations ordered by open year.",
    "evidence": "",
    "idx": 2977
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`gas_station`:`gas_station`)\nWITH `gas_station`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `location`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL DESC, `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all locations and the number of gas stations in each location ordered by the count.",
    "evidence": "",
    "idx": 2981
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[station_company_sub0:operated_by]->()\nRETURN `station_company_sub0`.`company_id` AS `company_id`   } AS in_collect_0\nMATCH (`company`:`company`)\nWHERE NOT `company`.`company_id` IN in_collect_0\nRETURN `company`.`company` AS `company`, `company`.`main_industry` AS `main_industry`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show company name and main industry without a gas station.",
    "evidence": "",
    "idx": 2983
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`gas_station`:`gas_station`)\nORDER BY `gas_station`.`open_year` IS NULL DESC, `gas_station`.`open_year`  \nRETURN `gas_station`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "order all gas station locations by the opening year.",
    "evidence": "",
    "idx": 2989
  },
  {
    "filename": "train_spider.json",
    "db_id": "gas_company",
    "gql_statement": "MATCH (`company`:`company`)\nWHERE `company`.`main_industry` = 'Banking'\nORDER BY `company`.`sales_billion` IS NULL DESC, `company`.`sales_billion` , `company`.`profits_billion` IS NULL DESC, `company`.`profits_billion`  \nRETURN `company`.`rank` AS `rank`, `company`.`company` AS `company`, `company`.`market_value` AS `market_value`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the rank, company names, market values of the companies in the banking industry order by their sales and profits in billion.",
    "evidence": "",
    "idx": 2991
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`region`:`region`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of regions.",
    "evidence": "",
    "idx": 2996
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`region`:`region`)\nORDER BY `region`.`label` IS NULL DESC, `region`.`label`  \nRETURN DISTINCT `region`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all distinct region names ordered by their labels.",
    "evidence": "",
    "idx": 2997
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`region`:`region`)\nORDER BY `region`.`label` IS NULL DESC, `region`.`label`  \nRETURN DISTINCT `region`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different region names, ordered by labels?",
    "evidence": "",
    "idx": 2998
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`party`:`party`)\nRETURN COUNT(DISTINCT `party`.`party_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different parties.",
    "evidence": "",
    "idx": 3000
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`party`:`party`)\nRETURN `party`.`minister` AS `minister`, `party`.`took_office` AS `took_office`, `party`.`left_office` AS `left_office` ORDER BY `left_office` IS NULL DESC, `left_office`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the ministers and the time they took and left office, listed by the time they left office.",
    "evidence": "",
    "idx": 3001
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`party`:`party`)\nWHERE `party`.`took_office` > '1961' OR `party`.`took_office` < '1959'\nRETURN `party`.`minister` AS `minister`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the minister who took office after 1961 or before 1959.",
    "evidence": "",
    "idx": 3003
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`party`:`party`)\nWHERE `party`.`party_name` <> 'Progress Party'\nRETURN `party`.`minister` AS `minister`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all ministers who do not belong to Progress Party.",
    "evidence": "",
    "idx": 3005
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`party`:`party`)\nORDER BY `party`.`took_office` IS NULL ASC, `party`.`took_office` DESC \nRETURN `party`.`minister` AS `minister`, `party`.`party_name` AS `party_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all ministers and parties they belong to in descending order of the time they took office.",
    "evidence": "",
    "idx": 3007
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`party`:`party`)\nORDER BY `party`.`left_office` IS NULL ASC, `party`.`left_office` DESC \nRETURN `party`.`minister` AS `minister`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the minister who left office at the latest time.",
    "evidence": "",
    "idx": 3009
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`t1`:`member`)-[member_of_0:member_of]->(`t2`:`party`)\nWHERE `t1`.`party_id` = `t2`.`party_id`\nRETURN `t1`.`member_name` AS `member_name`, `t2`.`party_name` AS `party_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List member names and their party names.",
    "evidence": "",
    "idx": 3011
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`t1`:`party`)-[located_in_0:located_in]->(`t2`:`region`)\nWHERE `t1`.`region_id` = `t2`.`region_id`\nRETURN `t1`.`party_name` AS `party_name`, `t2`.`region_name` AS `region_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all party names and their region names.",
    "evidence": "",
    "idx": 3013
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "WITH *, COLLECT { MATCH (`member_sub0`:`member`)\nRETURN `member_sub0`.`party_id` AS `party_id`   } AS in_collect_0\nMATCH (`party`:`party`)\nWHERE NOT `party`.`party_id` IN in_collect_0\nRETURN `party`.`party_name` AS `party_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of parties that does not have any members.",
    "evidence": "",
    "idx": 3015
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`t1`:`member`)-[member_of_0:member_of]->(`t2`:`party`)\nWHERE `t1`.`party_id` = `t2`.`party_id`\nAND (`t2`.`party_name` <> 'Progress Party')\nRETURN `t1`.`member_name` AS `member_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show member names that are not in the Progress Party.",
    "evidence": "",
    "idx": 3017
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`party_events`:`party_events`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of party events.",
    "evidence": "",
    "idx": 3020
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`party_events`:`party_events`)\nWITH `party_events`.`event_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `event_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find the event names that have more than 2 records.",
    "evidence": "",
    "idx": 3021
  },
  {
    "filename": "train_spider.json",
    "db_id": "party_people",
    "gql_statement": "MATCH (`t3`:`party_events`)-[hosted_by_0:hosted_by]->(`t2`:`party`)-[located_in_0:located_in]->(`t1`:`region`)\nWHERE `t1`.`region_id` = `t2`.`region_id`\nAND `t2`.`party_id` = `t3`.`party_id`\nAND (`t1`.`region_name` = 'United Kingdom' AND `t3`.`event_name` = 'Annaual Meeting')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of Annual Meeting events that took place in the region of the United Kingdom.",
    "evidence": "",
    "idx": 3024
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "MATCH (`pilot`:`pilot`)\nORDER BY `pilot`.`rank` IS NULL DESC, `pilot`.`rank`  \nRETURN `pilot`.`pilot_name` AS `pilot_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of pilots in ascending order of rank.",
    "evidence": "",
    "idx": 3026
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "MATCH (`pilot`:`pilot`)\nWHERE `pilot`.`age` > 30\nRETURN DISTINCT `pilot`.`position` AS `position`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the distinct positions of pilots older than 30.",
    "evidence": "",
    "idx": 3028
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "MATCH (`pilot`:`pilot`)\nWHERE `pilot`.`team` = 'Bradley' OR `pilot`.`team` = 'Fordham'\nRETURN `pilot`.`pilot_name` AS `pilot_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of pilots from team \"Bradley\" or \"Fordham\".",
    "evidence": "",
    "idx": 3029
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "MATCH (`pilot`:`pilot`)\nWITH `pilot`.`nationality` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `nationality`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different nationalities of pilots? Show each nationality and the number of pilots of each nationality.",
    "evidence": "",
    "idx": 3031
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "MATCH (`t3`:`pilot`)-[t1:operated]->(`t2`:`aircraft`)\nWHERE `t1`.`aircraft_id` = `t2`.`aircraft_id`\nAND `t1`.`pilot_id` = `t3`.`pilot_id`\nRETURN `t3`.`pilot_name` AS `pilot_name`, `t2`.`model` AS `model`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of pilots and models of aircrafts they have flied with.",
    "evidence": "",
    "idx": 3032
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "MATCH (`t3`:`pilot`)-[t1:operated]->(`t2`:`aircraft`)\nWHERE `t1`.`aircraft_id` = `t2`.`aircraft_id`\nAND `t1`.`pilot_id` = `t3`.`pilot_id`\nORDER BY `t3`.`rank` IS NULL DESC, `t3`.`rank`  \nRETURN `t3`.`pilot_name` AS `pilot_name`, `t2`.`fleet_series` AS `fleet_series`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of pilots and fleet series of the aircrafts they have flied with in ascending order of the rank of the pilot.",
    "evidence": "",
    "idx": 3033
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "MATCH (`t3`:`pilot`)-[t1:operated]->(`t2`:`aircraft`)\nWHERE `t1`.`aircraft_id` = `t2`.`aircraft_id`\nAND `t1`.`pilot_id` = `t3`.`pilot_id`\nAND (`t3`.`age` < 34)\nRETURN `t2`.`fleet_series` AS `fleet_series`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the fleet series of the aircrafts flied by pilots younger than 34",
    "evidence": "",
    "idx": 3034
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "MATCH (`t2`:`pilot`)-[t1:operated]->()\nWHERE `t1`.`pilot_id` = `t2`.`pilot_id`\nWITH `t2`.`pilot_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `pilot_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of pilots and the number of records they have.",
    "evidence": "",
    "idx": 3035
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "MATCH (`t2`:`pilot`)-[t1:operated]->()\nWHERE `t1`.`pilot_id` = `t2`.`pilot_id`\nWITH `t2`.`pilot_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `pilot_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of pilots that have more than one record.",
    "evidence": "",
    "idx": 3036
  },
  {
    "filename": "train_spider.json",
    "db_id": "pilot_record",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[pilot_record_sub0:operated]->()\nRETURN `pilot_record_sub0`.`pilot_id` AS `pilot_id`   } AS in_collect_0\nMATCH (`pilot`:`pilot`)\nWHERE NOT `pilot`.`pilot_id` IN in_collect_0\nRETURN `pilot`.`pilot_name` AS `pilot_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of pilots that do not have any record.",
    "evidence": "",
    "idx": 3037
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Control_Systems",
    "gql_statement": "MATCH (`documents`:`documents`)\nRETURN `documents`.`document_id` AS `document_id`, `documents`.`receipt_date` AS `receipt_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all document ids and receipt dates of documents.",
    "evidence": "",
    "idx": 3048
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Control_Systems",
    "gql_statement": "MATCH (`documents`:`documents`)\nWHERE `documents`.`document_id` = 2\nRETURN `documents`.`document_type_code` AS `document_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the document type code for the document with the id 2.",
    "evidence": "",
    "idx": 3051
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Control_Systems",
    "gql_statement": "MATCH (`documents`:`documents`)\nWHERE `documents`.`document_status_code` = 'done' AND `documents`.`document_type_code` = 'Paper'\nRETURN `documents`.`document_id` AS `document_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the document ids for any documents with the status code done and the type code paper.",
    "evidence": "",
    "idx": 3052
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Control_Systems",
    "gql_statement": "MATCH (`documents`:`documents`)-[has_shipping_agent_0:has_shipping_agent]->(`ref_shipping_agents`:`ref_shipping_agents`)\nWHERE `documents`.`shipping_agent_code` = `ref_shipping_agents`.`shipping_agent_code`\nAND (`documents`.`document_id` = 2)\nRETURN `ref_shipping_agents`.`shipping_agent_name` AS `shipping_agent_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the shipping agent of the document with id 2?",
    "evidence": "",
    "idx": 3053
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Control_Systems",
    "gql_statement": "MATCH (`draft_copies`:`draft_copies`)\nWITH `draft_copies`.`document_id` AS _groupby_col_0, COUNT(`draft_copies`.`copy_number`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `document_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which document has the most draft copies? List its document id and number of draft copies.",
    "evidence": "",
    "idx": 3060
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Doc_Control_Systems",
    "gql_statement": "MATCH (`draft_copies`:`draft_copies`)\nWITH `draft_copies`.`document_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `document_id`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which documents have more than 1 draft copies? List document id and number of draft copies.",
    "evidence": "",
    "idx": 3061
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_1",
    "gql_statement": "MATCH (`department`:`department`)\nORDER BY `department`.`mgr_start_date` IS NULL DESC, `department`.`mgr_start_date`  \nRETURN `department`.`dname` AS `dname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all department names ordered by their starting date.",
    "evidence": "",
    "idx": 3064
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_1",
    "gql_statement": "MATCH (`dependent`:`dependent`)\nWHERE `dependent`.`relationship` = 'Spouse'\nRETURN `dependent`.`dependent_name` AS `dependent_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "find all dependent names who have a spouse relation with some employee.",
    "evidence": "",
    "idx": 3065
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_1",
    "gql_statement": "MATCH (`t2`:`dept_locations`)\nMATCH (`t1`:`department`)\nWHERE `t1`.`dnumber` = `t2`.`dnumber`\nAND (`t2`.`dlocation` = 'Houston')\nRETURN `t1`.`dname` AS `dname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of departments that are located in Houston.",
    "evidence": "",
    "idx": 3067
  },
  {
    "filename": "train_spider.json",
    "db_id": "company_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`salary` > 30000\nRETURN `employee`.`fname` AS `fname`, `employee`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the first names and last names of employees who earn more than 30000 in salary.",
    "evidence": "",
    "idx": 3068
  }
]