[
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`nametokenized` = 'crc parameters get hash code')\nRETURN `t1`.`repoid` AS `repoid`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the repository id of the method with tokenized name \"crc parameters get hash code\"?",
    "evidence": "repository id refers to RepoId; tokenized name refers to NameTokenized; NameTokenized = 'crc parameters get hash code';",
    "idx": 401
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`path` = 'maravillas_linq-to-delicious\\tasty.sln')\nRETURN COUNT(`t2`.`solutionid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many methods with solutions with path 'maravillas_linq-to-delicious\\tasty.sln'?",
    "evidence": "solution refers to SolutionId;",
    "idx": 402
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`processedtime` = 636430969128176000)\nRETURN `t2`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the solutions ids of the repository with \"636430969128176000\" processed time",
    "evidence": "solution ids refers to Solution.Id;",
    "idx": 403
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`forks` > CASE WHEN 2=0 THEN NULL ELSE `t1`.`watchers` / 2 END)\nRETURN DISTINCT `t2`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the solutions of repositories with the Forks higher than half of the watchers.",
    "evidence": "solutions refers to Solution.Id; forks higher than half of the watchers refers tto Forks>(Watchers/2);;",
    "idx": 404
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`id` = 104086)\nRETURN CASE WHEN `t1`.`stars`=0 THEN NULL ELSE toFloat(`t1`.`forks`) * 100 / `t1`.`stars` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of Forks to Stars of repository for solution \"104086\"?",
    "evidence": "solution refers to Solution.Id; Solution.Id = 104086; percentage = MULTIPLY(DIVIDE(Forkk, Stars), 100);",
    "idx": 405
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "CALL(*) {\nMATCH (`repo_sub0`:`repo`)\nRETURN MAX(`repo_sub0`.`stars`) AS `_col_0`  \n}\nMATCH (`repo`:`repo`)\nWHERE `repo`.`stars` = `_col_0`\nRETURN `repo`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the id of the respository that the most people like.",
    "evidence": "repository that the most people like refers to MAX(Stars);",
    "idx": 406
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`name` = 'HtmlSharp.HtmlParser.Feed')\nRETURN `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the solution's path of method \"HtmlSharp.HtmlParser.Feed\"?",
    "evidence": "solution's path refers to Path; method refers to Name; Name = 'HtmlSharp.HtmlParser.Feed';",
    "idx": 407
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`id` = 35)\nRETURN `t1`.`forks` AS `forks`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the number of forks that the repository of the solution 35 have.",
    "evidence": "solution refers to Solution.Id; Solution.Id = 35;",
    "idx": 408
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`id` = 20)\nRETURN `t1`.`stars` AS `stars`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the number of stars that the repository of the solution 20 have.",
    "evidence": "solution refers to Solution.ID; Solution.Id = 20;",
    "idx": 409
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`solutionid` = 1)\nRETURN COUNT(`t2`.`solutionid`) AS `_col_0`, CASE  WHEN `t1`.`wascompiled` = 0 THEN 'Needs' ELSE 'NoNeeds' END AS `needtocompile`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many methods does solution 1 have? And please tell me if solution 1 needs to be compiled.",
    "evidence": "method refers to Name; solution refers to Solution.Id; Solution.Id = 1; solution needs to be compiled refers to WasCompiled = 0;",
    "idx": 410
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`path` = 'wallerdev_htmlsharpHtmlSharp.sln')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of methods with the solution path \"wallerdev_htmlsharp\\HtmlSharp.sln\".",
    "evidence": "name of the methods refers to Name; solution path refers to Path; Path = 'wallerdev_htmlsharp\\HtmlSharp.sln';",
    "idx": 412
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "CALL(*) {\nMATCH (`repo_sub0`:`repo`)\nWHERE `repo_sub0`.`stars` = 21\nRETURN MAX(`repo_sub0`.`forks`) AS `_col_0`  \n}\nMATCH (`repo`:`repo`)\nWHERE `repo`.`stars` = 21 AND `repo`.`forks` = `_col_0`\nRETURN `repo`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the id of the respository that received the most forks among the respositories that receive 21 stars.",
    "evidence": "repository that received the most forks refers to MAX(Forks);",
    "idx": 415
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`nametokenized` = 'html parser feed')\nRETURN `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the path of solution of method whose tokenized name is html parser feed.",
    "evidence": "path of solution refers to Path; method refers to Name; tokenized name refers to NameTokenized; Name = ''html parser feed';",
    "idx": 417
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`forks` = 238)\nRETURN `t2`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the solution id of the respository among the respository that receive 238 forks.",
    "evidence": "solution id of the repository refers to solution.Id;",
    "idx": 418
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`lang` = 'en' AND `t1`.`wascompiled` = 0)\nRETURN `t2`.`nametokenized` AS `nametokenized`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the english methods,please list the tokenized names of methods whose solutions need to be compiled.",
    "evidence": "english methods refers to lang = 'en'; tokenized name refers to NameTokenized; methods refers to Name; solution needs to be compiled refers to WasCompiled = 0;",
    "idx": 419
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`fullcomment` = 'Feeds data into the parser')\nRETURN `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the path of solution of method whose full comment is Feeds data into the parser.",
    "evidence": "path of solution refers to Path; method refers to name; full comment = 'Feeds data into the parser';",
    "idx": 421
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nRETURN CASE WHEN sum(CASE  WHEN `t2`.`id` = 2 THEN `t1`.`stars` ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`id` = 1 THEN `t1`.`stars` ELSE 0 END) - sum(CASE  WHEN `t2`.`id` = 2 THEN `t1`.`stars` ELSE 0 END)) * 100 / sum(CASE  WHEN `t2`.`id` = 2 THEN `t1`.`stars` ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many more stars in percentage are there for the repository of solution \"1\" than solution \"2\"?",
    "evidence": "solution refers to Solution.Id; Solution.Id = 1 OR 2; percentage = DIVIDE(MULTIPLY(SUBTRACT(SUM(Solution.Id = 1), SUM(Solution.Id = 2)), 100)), SUM(Solution.Id = 2);",
    "idx": 424
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "CALL(*) {\nMATCH (`repo_sub0`:`repo`)\nRETURN MAX(`repo_sub0`.`watchers`) AS `_col_0`  \n}\nMATCH (`repo`:`repo`)\nWHERE `repo`.`watchers` = `_col_0`\nRETURN `repo`.`url` AS `url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide a link to the most well-known repository's Github address.",
    "evidence": "link refers to Url; well-known repository refers to MAX(Watchers);",
    "idx": 428
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`nametokenized` =~ '(?i)(?s)query language.*')\nRETURN COUNT(`t2`.`solutionid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many methods in the same repository share a tokenized name that begins with \"query language...\"?",
    "evidence": "methods refers to Name; tokenized name refers to NameTokenized; NameTokenized LIKE 'query language%';",
    "idx": 433
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`id` = 10)\nRETURN `t2`.`apicalls` AS `apicalls`, `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please state the API calls for method number 10 and its intended course of action.",
    "evidence": "method number refers to Method_100k.Id; Method_100k.Id = 10; intended course of action refers to Path;",
    "idx": 434
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`id` = 50 AND `t1`.`path` = 'managedfusion_managedfusionManagedFusion.sln')\nRETURN CASE  WHEN `t2`.`commentisxml` = 0 THEN 'isNotXMLFormat' WHEN `t2`.`commentisxml` = 1 THEN 'isXMLFormat'  END AS `format`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the comment format of method number 50 with the solution path \"managedfusion_managedfusion\\ManagedFusion.sln\"?",
    "evidence": "comment format refers to CommentIsXml; method number refers to Method_100k.Id; Method_100k.Id = 50; solution path refers to Path; Path = 'managedfusion_managedfusion\\ManagedFusion.sln';",
    "idx": 436
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`method`:`method`)\nWHERE `method`.`name` = 'Sky.Excel.ExcelBook.TypeConvert'\nRETURN `method`.`nametokenized` AS `nametokenized`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the tokenized name of the method \"Sky.Excel.ExcelBook.TypeConvert\".",
    "evidence": "tokenized name refers to NameTokenized; NameTokenized = 'Sky.Excel.ExcelBook.TypeConvert';",
    "idx": 438
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t1`.`url` = 'https://github.com/jeffdik/tachy.git')\nRETURN COUNT(DISTINCT `t2`.`path`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many path does the github address \"https://github.com/jeffdik/tachy.git\" have?",
    "evidence": "github address refers to Url; Url = 'https://github.com/jeffdik/tachy.git';",
    "idx": 439
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`path` = 'maff_se3ue7US7.sln')\nRETURN `t1`.`watchers` AS `watchers`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many watchers does the path \"maff_se3ue7\\US7.sln\" have?",
    "evidence": "",
    "idx": 440
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`wascompiled` = 1)\nRETURN `t1`.`url` AS `url`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List 5 github address that the solutions can be implemented without the need of compilation.",
    "evidence": "github address refers to Url; solution can be implemented without the need of compliation refers to WasCompiled = 1;",
    "idx": 441
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t2`.`nametokenized` = 'matrix multiply')\nRETURN DISTINCT `t1`.`path` AS `path`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the solution path of the tokenized name \"matrix multiply\"?",
    "evidence": "solution path refers to Path; tokenized name refers to NameTokenized; NameTokenized = 'matrix multiply';",
    "idx": 442
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`path` = 'joeyrobert_bloomfilterDataTypes.BloomFilter.sln')\nRETURN `t1`.`url` AS `url`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the github address of the solution path \"joeyrobert_bloomfilter\\DataTypes.BloomFilter.sln\"?",
    "evidence": "github address refers to Url; solution path refers to Path; Path = 'joeyrobert_bloomfilter\\DataTypes.BloomFilter.sln';",
    "idx": 443
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`path` = 'graffen_NLog.Targets.SyslogsrcNLog.Targets.Syslog.sln')\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the method name of the solution path \"graffen_NLog.Targets.Syslog\\src\\NLog.Targets.Syslog.sln\n\".",
    "evidence": "method name refers to Name; solution path refers to Path; Path = 'graffen_NLog.Targets.Syslog\\src\\NLog.Targets.Syslog.sln';",
    "idx": 444
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`method`)\nMATCH (`t1`:`solution`)\nWHERE `t1`.`id` = `t2`.`solutionid`\nAND (`t1`.`path` = 'jurney_P4BackupP4BackupP4Backup.sln')\nRETURN DISTINCT `t2`.`nametokenized` AS `nametokenized`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the tokenized name of the solution path \"jurney_P4Backup\\P4Backup\\P4Backup.sln\n\".",
    "evidence": "tokenized name refers to NameTokenized; solution path refers to Path; Path = 'jurney_P4Backup\\P4Backup\\P4Backup.sln';",
    "idx": 445
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (`t2`:`solution`)\nMATCH (`t1`:`repo`)\nWHERE `t1`.`id` = `t2`.`repoid`\nAND (`t2`.`path` = 'ninject_NinjectNinject.sln')\nRETURN DISTINCT `t1`.`stars` AS `stars`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many liked by people does the solution path \"ninject_Ninject\\Ninject.sln\n\" have?",
    "evidence": "how many liked by people refers to Stars; solution path refers to Path; Path = 'ninject_Ninject\\Ninject.sln';",
    "idx": 446
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (`cars`:`cars`)\nWHERE `cars`.`shape` IN ['elipse', 'bucket']\nWITH `cars`.`train_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `train_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of all the trains with at least one car in a non-regular shape.",
    "evidence": "non-regular shape refers to shape in ('elipse', 'bucket')",
    "idx": 452
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (`cars`:`cars`)\nWHERE `cars`.`train_id` = 1 AND `cars`.`wheels` = 2\nRETURN `cars`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of all the cars on train no.1 that have 2 wheels.",
    "evidence": "train no.1 refers to train_id = 1; 2 wheels refers to wheels = 2",
    "idx": 454
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL (*) {\nMATCH (`cars_sub0`:`cars`)\nWITH `cars_sub0`.`train_id` AS _groupby_col_0, MAX(`cars_sub0`.`position`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `train_id`, _groupby_col_1 AS `carsnum`  \n}\nMATCH (`t1`:`trains`)\nWHERE `t1`.`id` = `train_id`\nAND (`t1`.`direction` = 'east' AND `carsnum` < 4)\nRETURN `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of all the trains that run in the east direction and have less than 4 cars.",
    "evidence": "less than 4 cars refers to carsNum < 4",
    "idx": 456
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (`t1`:`cars`)-[belongs_to_0:belongs_to]->(`t2`:`trains`)\nWHERE `t1`.`train_id` = `t2`.`id`\nAND (`t2`.`direction` = 'east' AND `t1`.`sides` = 'double')\nRETURN `t1`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of all the cars with double sides on trains that run in the west direction.",
    "evidence": "double sides on trains refers to sides = 'double'",
    "idx": 457
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (`t1`:`cars`)-[belongs_to_0:belongs_to]->(`t2`:`trains`)\nWHERE `t1`.`train_id` = `t2`.`id`\nAND (`t1`.`load_num` = 0)\nRETURN `t2`.`direction` AS `direction`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the directions in which the trains with at least one empty-loaded car run.",
    "evidence": "at least one empty-loaded car run refers to load_num = 0",
    "idx": 459
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (`t1`:`cars`)-[belongs_to_0:belongs_to]->(`t2`:`trains`)\nWHERE `t1`.`train_id` = `t2`.`id`\nAND (`t2`.`direction` = 'east' AND `t1`.`position` = 1)\nWITH `t1`.`shape` AS _groupby_col_0\nRETURN _groupby_col_0 AS `shape`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the shapes of all the head cars on the trains that run in the east direction.",
    "evidence": "head cars refers to position = 1;",
    "idx": 462
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (`t1`:`cars`)-[belongs_to_0:belongs_to]->(`t2`:`trains`)\nWHERE `t1`.`train_id` = `t2`.`id`\nAND (`t1`.`len` = 'short' AND `t1`.`position` = 4)\nRETURN `t2`.`direction` AS `direction`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the directions in which the trains with 4 short cars run.",
    "evidence": "short refers to len = 'short'; 4 cars run refers to position = 4",
    "idx": 466
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`cars`)-[belongs_to_1:belongs_to]->(`t2_sub0`:`trains`)\nWHERE `t1_sub0`.`train_id` = `t2_sub0`.`id`\nAND (`t1_sub0`.`position` = 3 AND `t2_sub0`.`direction` = 'west' AND `t1_sub0`.`sides` = 'double')\nWITH `t1_sub0`.`train_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `train_id`  \n}\nWITH *\nRETURN COUNT(`train_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many trains running west have double sided cars in 3rd position?",
    "evidence": "west is a direction; double sided cars refers to sides = 'double'; 3rd position refers to position = 3",
    "idx": 475
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`cars`)-[belongs_to_1:belongs_to]->(`t2_sub0`:`trains`)\nWHERE `t1_sub0`.`train_id` = `t2_sub0`.`id`\nAND (`t1_sub0`.`position` = 1 AND `t2_sub0`.`direction` = 'east' AND `t1_sub0`.`shape` = 'rectangle')\nWITH `t1_sub0`.`train_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `train_id`  \n}\nWITH *\nRETURN COUNT(`train_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many eastbound trains have rectangular-shaped head cars?",
    "evidence": "eastbound refers to direction = 'east'; head cars refers to position = 1",
    "idx": 476
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL (*) {\nMATCH (`cars_sub0`:`cars`)\nWHERE `cars_sub0`.`roof` = 'none'\nWITH `cars_sub0`.`train_id` AS _groupby_col_0, COUNT(`cars_sub0`.`id`) AS _groupby_col_1\nWHERE _groupby_col_1 = 1\nRETURN _groupby_col_0 AS `train_id`, _groupby_col_1 AS `_col_1`  \n}\nMATCH (`t1`:`trains`)\nWHERE `t1`.`id` = `train_id`\nRETURN sum(CASE  WHEN `t1`.`direction` = 'west' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the trains running west, how many trains have no more than one car with an open roof?",
    "evidence": "running west refers to direction = 'west'; open roof refers to roof = 'none'",
    "idx": 477
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL (*) {\nMATCH (`cars_sub0`:`cars`)\nWITH `cars_sub0`.`train_id` AS _groupby_col_0, COUNT(`cars_sub0`.`id`) AS _groupby_col_1\nWHERE _groupby_col_1 = 3\nRETURN _groupby_col_0 AS `train_id`, _groupby_col_1 AS `carsnum`  \n}\nMATCH (`t1`:`trains`)\nWHERE `t1`.`id` = `train_id`\nWITH `t1`.`direction` AS _groupby_col_2\nRETURN _groupby_col_2 AS `direction`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which direction does the majority of the trains that have 3 cars are running?",
    "evidence": "3 cars refers to carsNum = 3",
    "idx": 478
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (`t1`:`cars`)-[belongs_to_0:belongs_to]->(`t2`:`trains`)\nWHERE `t1`.`train_id` = `t2`.`id`\nAND (`t1`.`load_num` = 0)\nRETURN `t2`.`direction` AS `direction`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the directions of the trains that have empty cars.",
    "evidence": "empty cars refers to load_num = 0",
    "idx": 481
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL (*) {\nMATCH (`cars_sub0`:`cars`)\nWITH `cars_sub0`.`train_id` AS _groupby_col_0, MAX(`cars_sub0`.`position`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `train_id`, _groupby_col_1 AS `trailposi`  \n}\nMATCH (`t1`:`trains`)\nWHERE `t1`.`id` = `train_id`\nAND (`trailposi` <= 2)\nRETURN `t1`.`direction` AS `direction`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the directions for all the trains that have 2 or less cars.",
    "evidence": "2 or less cars refers to trailPosi < = 2",
    "idx": 484
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`title` = 'Look Who\\'s Talking')\nRETURN `t2`.`character name` AS `character name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the characters in the movie Look Who's Talking.",
    "evidence": "movie Look Who's Talking refers to title = 'Look Who's Talking'",
    "idx": 485
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`title` = 'Batman')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the actors who played a role in the movie Batman.",
    "evidence": "movie Batman refers to title = 'Batman'",
    "idx": 488
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t3`.`name` = 'Tom Cruise')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of the movies starring Tom Cruise.",
    "evidence": "movie name refers to title; starring Tom Cruise refers to name = 'Tom Cruise'",
    "idx": 490
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`movie`:`movie`)\nORDER BY `movie`.`budget` IS NULL ASC, `movie`.`budget` DESC \nRETURN `movie`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which movie had the biggest budget? Give the name of the movie.",
    "evidence": "biggest budget refers to max(Budget); name of the movie refers to Title",
    "idx": 499
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t2`.`character name` = 'Peter Quill')\nRETURN `t1`.`mpaa rating` AS `mpaa rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the MPAA rating for the movie with the character named \"Peter Quill\" in it?",
    "evidence": "MPAA rating = 'G' means General audiences; MPAA rating = 'PG' means Parental guidance suggested; MPAA rating = 'R'means Restricted; MPAA rating = 'X' means No one under 17 admitted",
    "idx": 500
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t2`.`creditorder` = '1' AND `t1`.`genre` = 'Thriller')\nORDER BY `t1`.`rating` IS NULL ASC, `t1`.`rating` DESC \nRETURN `t2`.`character name` AS `character name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the No.1 character in the credit list from the highest rating thriller movie.",
    "evidence": "No.1 character in the credit list refers to creditOrder = '1'; highest rating refers to max(rating); thriller movie refers to Genre = 'Thriller'",
    "idx": 501
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "CALL(*) {\nMATCH (`actor_sub0`:`actor`)\nRETURN MAX(toFloat(replace(replace(`actor_sub0`.`networth`,',',''),'$',''))) AS `_col_0_1`  \n}\nMATCH ()-[t1:features]->(`t2`:`actor`)\nWHERE `t1`.`actorid` = `t2`.`actorid`\nAND (toFloat(replace(replace(`t2`.`networth`,',',''),'$','')) = `_col_0_1`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many movies has the highest networth actor acted in?",
    "evidence": "highest networth refers to max(networth)",
    "idx": 503
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND (`t1`.`title` = 'G.I. Joe: The Rise of Cobra' AND `t2`.`creditorder` = '3')\nRETURN `t2`.`character name` AS `character name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the No.3 character name in the credit list of the movie \"G.I. Joe: The Rise of Cobra\".",
    "evidence": "No.3 character refers to creditOrder = '3'; movie \"G.I. Joe: The Rise of Cobra\" refers to Title = 'G.I. Joe: The Rise of Cobra'",
    "idx": 509
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`title` = 'American Hustle' AND `t2`.`creditorder` = '2')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who played the No.2 character in the credit list of the movie \"American Hustle\"?",
    "evidence": "No.2 character refers to creditOrder = '2'; movie \"American Hustle\" refers to Title = 'American Hustle'",
    "idx": 510
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`release date` = '2015-10-26' AND `t2`.`creditorder` = '1')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who played the No.1 character in the credit list of the movie which was released on \"2015/10/26\"?",
    "evidence": "No.1 character refers to creditOrder = '1'; released on \"2015/10/26\" refers to Release Date = '2015-10-26'",
    "idx": 511
  },
  {
    "filename": "train.json",
    "db_id": "movie",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:features]->()\nMATCH (`t3`:`actor`)-[t2:acted_in]->()\nWHERE `t1`.`movieid` = `t2`.`movieid`\nAND `t3`.`actorid` = `t2`.`actorid`\nAND (`t1`.`title` = 'Mrs. Doubtfire')\nRETURN CASE WHEN COUNT(`t3`.`birth country`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t3`.`birth country` = 'USA' THEN 1 ELSE 0 END)) * 100 / COUNT(`t3`.`birth country`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of the USA actors that showed up in the credit list of movie \"Mrs. Doubtfire\"?",
    "evidence": "USA actors refers to Birth Country = 'USA'; movie \"Mrs. Doubtfire\" refers to Title = 'Mrs. Doubtfire'; percentage = divide(count(ActorID where Birth Country = 'USA'), count(ActorID)) * 100%",
    "idx": 512
  }
]