[
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[teaches_sub0:teaches]->()\nRETURN `teaches_sub0`.`id` AS `id`   } AS in_collect_0\nMATCH (`instructor`:`instructor`)\nWHERE NOT `instructor`.`id` IN in_collect_0\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of instructors who didn't teach any courses?",
    "evidence": "",
    "idx": 2524
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[teaches_sub0:teaches]->()\nRETURN `teaches_sub0`.`id` AS `id`   } AS in_collect_0\nMATCH (`instructor`:`instructor`)\nWHERE NOT `instructor`.`id` IN in_collect_0\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of instructors who didn't teach?",
    "evidence": "",
    "idx": 2525
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[teaches_sub0:teaches]->()\nWHERE `teaches_sub0`.`semester` = 'Spring'\nRETURN `teaches_sub0`.`id` AS `id`   } AS in_collect_0\nMATCH (`instructor`:`instructor`)\nWHERE NOT `instructor`.`id` IN in_collect_0\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of instructors who didn't each any courses in any Spring semester.",
    "evidence": "",
    "idx": 2526
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[teaches_sub0:teaches]->()\nWHERE `teaches_sub0`.`semester` = 'Spring'\nRETURN `teaches_sub0`.`id` AS `id`   } AS in_collect_0\nMATCH (`instructor`:`instructor`)\nWHERE NOT `instructor`.`id` IN in_collect_0\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of instructors who didn't teach courses in the Spring?",
    "evidence": "",
    "idx": 2527
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`instructor`)-[works_in_0:works_in]->(`t2`:`department`)\nWHERE `t1`.`dept_name` = `t2`.`dept_name`\nORDER BY `t2`.`budget` IS NULL ASC, `t2`.`budget` DESC \nRETURN avg(`t1`.`salary`) AS `_col_0`, COUNT(*) AS `_col_1`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number and averaged salary of all instructors who are in the department with the highest budget.",
    "evidence": "",
    "idx": 2528
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`instructor`)-[works_in_0:works_in]->(`t2`:`department`)\nWHERE `t1`.`dept_name` = `t2`.`dept_name`\nORDER BY `t2`.`budget` IS NULL ASC, `t2`.`budget` DESC \nRETURN avg(`t1`.`salary`) AS `_col_0`, COUNT(*) AS `_col_1`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many instructors are in the department with the highest budget, and what is their average salary?",
    "evidence": "",
    "idx": 2529
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`student`)-[enrolled_in_0:enrolled_in]->(`t1`:`department`)\nMATCH (`t3`:`instructor`)-[works_in_0:works_in]->(`t1`:`department`)\nWHERE `t1`.`dept_name` = `t2`.`dept_name`\nAND `t1`.`dept_name` = `t3`.`dept_name`\nWITH `t3`.`dept_name` AS _groupby_col_0, COUNT(DISTINCT `t2`.`id`) AS _groupby_col_1, COUNT(DISTINCT `t3`.`id`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of students and total number of instructors for each department.",
    "evidence": "",
    "idx": 2530
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`student`)-[enrolled_in_0:enrolled_in]->(`t1`:`department`)\nMATCH (`t3`:`instructor`)-[works_in_0:works_in]->(`t1`:`department`)\nWHERE `t1`.`dept_name` = `t2`.`dept_name`\nAND `t1`.`dept_name` = `t3`.`dept_name`\nWITH `t3`.`dept_name` AS _groupby_col_0, COUNT(DISTINCT `t2`.`id`) AS _groupby_col_1, COUNT(DISTINCT `t3`.`id`) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_0 AS `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students and instructors are in each department?",
    "evidence": "",
    "idx": 2531
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH (`t3_sub0`:`course`)-[t4_sub0:has_prerequisite]->()\nWHERE `t3_sub0`.`course_id` = `t4_sub0`.`course_id`\nAND (`t3_sub0`.`title` = 'International Finance')\nRETURN `t4_sub0`.`prereq_id` AS `prereq_id`   } AS in_collect_0\nMATCH (`t1`:`student`)-[t2:takes]->()\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`course_id` IN in_collect_0)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of students who have taken the prerequisite course of the course with title International Finance.",
    "evidence": "",
    "idx": 2532
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "WITH *, COLLECT { MATCH (`t3_sub0`:`course`)-[t4_sub0:has_prerequisite]->()\nWHERE `t3_sub0`.`course_id` = `t4_sub0`.`course_id`\nAND (`t3_sub0`.`title` = 'International Finance')\nRETURN `t4_sub0`.`prereq_id` AS `prereq_id`   } AS in_collect_0\nMATCH (`t1`:`student`)-[t2:takes]->()\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t2`.`course_id` IN in_collect_0)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of students who have taken the prerequisite for the course International Finance?",
    "evidence": "",
    "idx": 2533
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`instructor_sub0`:`instructor`)\nWHERE `instructor_sub0`.`dept_name` = 'Physics'\nRETURN avg(`instructor_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`instructor`:`instructor`)\nWHERE `instructor`.`salary` < `_col_0`\nRETURN `instructor`.`name` AS `name`, `instructor`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and salary of instructors whose salary is below the average salary of the instructors in the Physics department.",
    "evidence": "",
    "idx": 2534
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`instructor_sub0`:`instructor`)\nWHERE `instructor_sub0`.`dept_name` = 'Physics'\nRETURN avg(`instructor_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`instructor`:`instructor`)\nWHERE `instructor`.`salary` < `_col_0`\nRETURN `instructor`.`name` AS `name`, `instructor`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and salaries for instructors who earn less than the average salary of instructors in the Physics department?",
    "evidence": "",
    "idx": 2535
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`course`)\nMATCH (`t3`:`student`)-[t2:takes]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND `t2`.`id` = `t3`.`id`\nAND (`t1`.`dept_name` = 'Statistics')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of students who took some course offered by Statistics department.",
    "evidence": "",
    "idx": 2536
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`course`)\nMATCH (`t3`:`student`)-[t2:takes]->()\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND `t2`.`id` = `t3`.`id`\nAND (`t1`.`dept_name` = 'Statistics')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of students who have taken Statistics courses?",
    "evidence": "",
    "idx": 2537
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`section`)-[part_of_0:part_of]->(`t1`:`course`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`dept_name` = 'Psychology')\nORDER BY `t1`.`title` IS NULL DESC, `t1`.`title`  \nRETURN `t2`.`building` AS `building`, `t2`.`room_number` AS `room_number`, `t2`.`semester` AS `semester`, `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the building, room number, semester and year of all courses offered by Psychology department sorted by course titles.",
    "evidence": "",
    "idx": 2538
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t2`:`section`)-[part_of_0:part_of]->(`t1`:`course`)\nWHERE `t1`.`course_id` = `t2`.`course_id`\nAND (`t1`.`dept_name` = 'Psychology')\nORDER BY `t1`.`title` IS NULL DESC, `t1`.`title`  \nRETURN `t2`.`building` AS `building`, `t2`.`room_number` AS `room_number`, `t2`.`semester` AS `semester`, `t2`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the building, room number, semester and year of courses in the Psychology department, sorted using course title?",
    "evidence": "",
    "idx": 2539
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWHERE `instructor`.`dept_name` = 'Comp. Sci.'\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all instructors in computer science department",
    "evidence": "",
    "idx": 2540
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWHERE `instructor`.`dept_name` = 'Comp. Sci.'\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all instructors in the Comp. Sci. department?",
    "evidence": "",
    "idx": 2541
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWHERE `instructor`.`dept_name` = 'Comp. Sci.' AND `instructor`.`salary` > 80000\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all instructors in Comp. Sci. department with salary > 80000.",
    "evidence": "",
    "idx": 2542
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWHERE `instructor`.`dept_name` = 'Comp. Sci.' AND `instructor`.`salary` > 80000\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the instructors in the Comp. Sci. department who earn more than 80000?",
    "evidence": "",
    "idx": 2543
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`instructor`)-[t2:teaches]->()\nWHERE `t1`.`id` = `t2`.`id`\nRETURN `t1`.`name` AS `name`, `t2`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all instructors who have taught some course and the course_id.",
    "evidence": "",
    "idx": 2544
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`instructor`)-[t2:teaches]->()\nWHERE `t1`.`id` = `t2`.`id`\nRETURN `t1`.`name` AS `name`, `t2`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all instructors who have taught a course, as well as the corresponding course id?",
    "evidence": "",
    "idx": 2545
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`instructor`)-[t2:teaches]->()\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`dept_name` = 'Art')\nRETURN `t1`.`name` AS `name`, `t2`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all instructors in the Art department who have taught some course and the course_id.",
    "evidence": "",
    "idx": 2546
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`t1`:`instructor`)-[t2:teaches]->()\nWHERE `t1`.`id` = `t2`.`id`\nAND (`t1`.`dept_name` = 'Art')\nRETURN `t1`.`name` AS `name`, `t2`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of Art instructors who have taught a course, and the corresponding course id?",
    "evidence": "",
    "idx": 2547
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWHERE `instructor`.`name` =~ '(?i)(?s).*dar.*'\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all instructors whose name includes the substring “dar”.",
    "evidence": "",
    "idx": 2548
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWHERE `instructor`.`name` =~ '(?i)(?s).*dar.*'\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all instructors with names that include \"dar\"?",
    "evidence": "",
    "idx": 2549
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nRETURN DISTINCT `instructor`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List in alphabetic order the names of all distinct instructors.",
    "evidence": "",
    "idx": 2550
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nRETURN DISTINCT `instructor`.`name` AS `name` ORDER BY `name` IS NULL DESC, `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the distinct names of the instructors, ordered by name.",
    "evidence": "",
    "idx": 2551
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`section`:`section`)\nWHERE `section`.`semester` = 'Fall' AND `section`.`year` = 2009\nRETURN `section`.`course_id` AS `course_id`   \nUNION DISTINCT\nMATCH (`section`:`section`)\nWHERE `section`.`semester` = 'Spring' AND `section`.`year` = 2010\nRETURN `section`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find courses that ran in Fall 2009 or in Spring 2010.",
    "evidence": "",
    "idx": 2552
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`section`:`section`)\nWHERE `section`.`semester` = 'Fall' AND `section`.`year` = 2009\nRETURN `section`.`course_id` AS `course_id`   \nUNION DISTINCT\nMATCH (`section`:`section`)\nWHERE `section`.`semester` = 'Spring' AND `section`.`year` = 2010\nRETURN `section`.`course_id` AS `course_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids for courses in the Fall of 2009 or the Spring of 2010?",
    "evidence": "",
    "idx": 2553
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`instructor_sub0`:`instructor`)\nRETURN MAX(`instructor_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`instructor`:`instructor`)\nWHERE `instructor`.`salary` < `_col_0`\nRETURN DISTINCT `instructor`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the salaries of all distinct instructors that are less than the largest salary.",
    "evidence": "",
    "idx": 2554
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`instructor_sub0`:`instructor`)\nRETURN MAX(`instructor_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`instructor`:`instructor`)\nWHERE `instructor`.`salary` < `_col_0`\nRETURN DISTINCT `instructor`.`salary` AS `salary`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct salaries of all instructors who earned less than the maximum salary?",
    "evidence": "",
    "idx": 2555
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH ()-[teaches:teaches]->()\nWHERE `teaches`.`semester` = 'Spring' AND `teaches`.`year` = 2010\nRETURN COUNT(DISTINCT `teaches`.`id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many instructors teach a course in the Spring of 2010?",
    "evidence": "",
    "idx": 2557
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWITH `instructor`.`dept_name` AS _groupby_col_0, avg(`instructor`.`salary`) AS _groupby_col_1\nWHERE _groupby_col_1 > 42000\nRETURN _groupby_col_0 AS `dept_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names and average salaries of all departments whose average salary is greater than 42000.",
    "evidence": "",
    "idx": 2558
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`instructor`:`instructor`)\nWITH `instructor`.`dept_name` AS _groupby_col_0, avg(`instructor`.`salary`) AS _groupby_col_1\nWHERE _groupby_col_1 > 42000\nRETURN _groupby_col_0 AS `dept_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and average salaries for departments with average salary higher than 42000?",
    "evidence": "",
    "idx": 2559
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`instructor_sub0`:`instructor`)\nWHERE `instructor_sub0`.`dept_name` = 'Biology'\nRETURN min(`instructor_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`instructor`:`instructor`)\nWHERE `instructor`.`salary` > `_col_0`\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find names of instructors with salary greater than that of some (at least one) instructor in the Biology department.",
    "evidence": "",
    "idx": 2560
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`instructor_sub0`:`instructor`)\nWHERE `instructor_sub0`.`dept_name` = 'Biology'\nRETURN min(`instructor_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`instructor`:`instructor`)\nWHERE `instructor`.`salary` > `_col_0`\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of instructors who earn more than at least one instructor from the Biology department?",
    "evidence": "",
    "idx": 2561
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`instructor_sub0`:`instructor`)\nWHERE `instructor_sub0`.`dept_name` = 'Biology'\nRETURN MAX(`instructor_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`instructor`:`instructor`)\nWHERE `instructor`.`salary` > `_col_0`\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all instructors whose salary is greater than the salary of all instructors in the Biology department.",
    "evidence": "",
    "idx": 2562
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`instructor_sub0`:`instructor`)\nWHERE `instructor_sub0`.`dept_name` = 'Biology'\nRETURN MAX(`instructor_sub0`.`salary`) AS `_col_0`  \n}\nMATCH (`instructor`:`instructor`)\nWHERE `instructor`.`salary` > `_col_0`\nRETURN `instructor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all instructors with a higher salary than any of the instructors in the Biology department?",
    "evidence": "",
    "idx": 2563
  },
  {
    "filename": "train_spider.json",
    "db_id": "debate",
    "gql_statement": "MATCH (`debate`:`debate`)\nORDER BY `debate`.`num_of_audience` IS NULL DESC, `debate`.`num_of_audience`  \nRETURN `debate`.`venue` AS `venue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the venues of debates in ascending order of the number of audience.",
    "evidence": "",
    "idx": 2565
  },
  {
    "filename": "train_spider.json",
    "db_id": "debate",
    "gql_statement": "MATCH (`debate`:`debate`)\nWHERE `debate`.`num_of_audience` > 150\nRETURN `debate`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the dates of debates with number of audience bigger than 150",
    "evidence": "",
    "idx": 2567
  },
  {
    "filename": "train_spider.json",
    "db_id": "debate",
    "gql_statement": "MATCH (`people`:`people`)\nWHERE `people`.`age` = 35 OR `people`.`age` = 36\nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of people aged either 35 or 36.",
    "evidence": "",
    "idx": 2568
  },
  {
    "filename": "train_spider.json",
    "db_id": "debate",
    "gql_statement": "MATCH (`people`:`people`)\nWITH `people`.`party` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `party`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different parties of people along with the number of people in each party.",
    "evidence": "",
    "idx": 2570
  },
  {
    "filename": "train_spider.json",
    "db_id": "debate",
    "gql_statement": "MATCH (`debate`:`debate`)\nRETURN DISTINCT `debate`.`venue` AS `venue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the distinct venues of debates",
    "evidence": "",
    "idx": 2571
  },
  {
    "filename": "train_spider.json",
    "db_id": "debate",
    "gql_statement": "MATCH (`t2`:`debate`)-[t1:has_participant]->(`t3`:`people`)\nWHERE `t1`.`debate_id` = `t2`.`debate_id`\nAND `t1`.`affirmative` = `t3`.`people_id`\nRETURN `t3`.`name` AS `name`, `t2`.`date` AS `date`, `t2`.`venue` AS `venue`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of people, and dates and venues of debates they are on the affirmative side.",
    "evidence": "",
    "idx": 2572
  },
  {
    "filename": "train_spider.json",
    "db_id": "debate",
    "gql_statement": "MATCH (`t2`:`debate`)-[t1:has_participant]->(`t3`:`people`)\nWHERE `t1`.`debate_id` = `t2`.`debate_id`\nAND `t1`.`negative` = `t3`.`people_id`\nRETURN `t3`.`name` AS `name`, `t2`.`date` AS `date`, `t2`.`venue` AS `venue` ORDER BY `t3`.`name` IS NULL DESC, `t3`.`name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of people, and dates and venues of debates they are on the negative side, ordered in ascending alphabetical order of name.",
    "evidence": "",
    "idx": 2573
  },
  {
    "filename": "train_spider.json",
    "db_id": "debate",
    "gql_statement": "MATCH (`t2`:`debate`)-[t1:has_participant]->(`t3`:`people`)\nWHERE `t1`.`debate_id` = `t2`.`debate_id`\nAND `t1`.`affirmative` = `t3`.`people_id`\nAND (`t2`.`num_of_audience` > 200)\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of people that are on affirmative side of debates with number of audience bigger than 200.",
    "evidence": "",
    "idx": 2574
  },
  {
    "filename": "train_spider.json",
    "db_id": "debate",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[debate_people_sub0:has_participant]->()\nRETURN `debate_people_sub0`.`affirmative` AS `affirmative`   } AS in_collect_0\nMATCH (`people`:`people`)\nWHERE NOT `people`.`people_id` IN in_collect_0\nRETURN `people`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of people that have not been on the affirmative side of debates.",
    "evidence": "",
    "idx": 2577
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`customer_details` AS `customer_details` ORDER BY `customer_details` IS NULL DESC, `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all the customers in alphabetical order.",
    "evidence": "",
    "idx": 2578
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`customer_details` AS `customer_details` ORDER BY `customer_details` IS NULL DESC, `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort the customer names in alphabetical order.",
    "evidence": "",
    "idx": 2579
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`t1`:`policies`)-[belongs_to_0:belongs_to]->(`t2`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`customer_details` = 'Dayana Robel')\nRETURN `t1`.`policy_type_code` AS `policy_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the policy type codes associated with the customer \"Dayana Robel\"",
    "evidence": "",
    "idx": 2580
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`policies`:`policies`)\nWITH `policies`.`policy_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `policy_type_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the policy types that are used by more than 2 customers.",
    "evidence": "",
    "idx": 2582
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`claim_headers`:`claim_headers`)\nRETURN sum(`claim_headers`.`amount_piad`) AS `_col_0`, avg(`claim_headers`.`amount_piad`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total and average amount paid in claim headers.",
    "evidence": "",
    "idx": 2584
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`claim_headers`:`claim_headers`)\nRETURN sum(`claim_headers`.`amount_piad`) AS `_col_0`, avg(`claim_headers`.`amount_piad`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total amount and average amount paid in claim headers?",
    "evidence": "",
    "idx": 2585
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "CALL(*) {\nMATCH (`claims_documents_sub0`:`claims_documents`)\nRETURN `claims_documents_sub0`.`created_date` AS `created_date` ORDER BY `created_date` IS NULL DESC, `created_date`  \nLIMIT 1\n}\nMATCH (`t2`:`claims_documents`)-[for_claim_0:for_claim]->(`t1`:`claim_headers`)\nWHERE `t1`.`claim_header_id` = `t2`.`claim_id`\nAND (`t2`.`created_date` = `created_date`)\nRETURN sum(`t1`.`amount_claimed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total amount claimed in the most recently created document.",
    "evidence": "",
    "idx": 2586
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "CALL(*) {\nMATCH (`claims_documents_sub0`:`claims_documents`)\nRETURN `claims_documents_sub0`.`created_date` AS `created_date` ORDER BY `created_date` IS NULL DESC, `created_date`  \nLIMIT 1\n}\nMATCH (`t2`:`claims_documents`)-[for_claim_0:for_claim]->(`t1`:`claim_headers`)\nWHERE `t1`.`claim_header_id` = `t2`.`claim_id`\nAND (`t2`.`created_date` = `created_date`)\nRETURN sum(`t1`.`amount_claimed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How much amount in total were claimed in the most recently created document?",
    "evidence": "",
    "idx": 2587
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "CALL(*) {\nMATCH (`claim_headers_sub0`:`claim_headers`)\nRETURN MAX(`claim_headers_sub0`.`amount_claimed`) AS `_col_0`  \n}\nMATCH (`t1`:`claim_headers`)-[belongs_to_0:belongs_to]->(`t2`:`policies`)-[belongs_to_1:belongs_to]->(`t3`:`customers`)\nWHERE `t1`.`policy_id` = `t2`.`policy_id`\nAND `t2`.`customer_id` = `t3`.`customer_id`\nAND (`t1`.`amount_claimed` = `_col_0`)\nRETURN `t3`.`customer_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the customer who has made the largest amount of claim in a single claim?",
    "evidence": "",
    "idx": 2588
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "CALL(*) {\nMATCH (`claim_headers_sub0`:`claim_headers`)\nRETURN min(`claim_headers_sub0`.`amount_piad`) AS `_col_0`  \n}\nMATCH (`t1`:`claim_headers`)-[belongs_to_0:belongs_to]->(`t2`:`policies`)-[belongs_to_1:belongs_to]->(`t3`:`customers`)\nWHERE `t1`.`policy_id` = `t2`.`policy_id`\nAND `t2`.`customer_id` = `t3`.`customer_id`\nAND (`t1`.`amount_piad` = `_col_0`)\nRETURN `t3`.`customer_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the customer who has made the minimum amount of payment in one claim?",
    "evidence": "",
    "idx": 2590
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`claims_processing_stages`:`claims_processing_stages`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of distinct stages in claim processing.",
    "evidence": "",
    "idx": 2593
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_details` =~ '(?i)(?s).*Diana.*'\nRETURN `customers`.`customer_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of customers whose name contains \"Diana\".",
    "evidence": "",
    "idx": 2594
  },
  {
    "filename": "train_spider.json",
    "db_id": "insurance_and_eClaims",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_details` =~ '(?i)(?s).*Diana.*'\nRETURN `customers`.`customer_details` AS `customer_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which customers have the substring \"Diana\" in their names? Return the customer details.",
    "evidence": "",
    "idx": 2595
  }
]