[
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the biggest city in wyoming",
    "evidence": "",
    "idx": 0
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what wyoming city has the largest population",
    "evidence": "",
    "idx": 1
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the largest city in wyoming",
    "evidence": "",
    "idx": 2
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the most populated area of wyoming",
    "evidence": "",
    "idx": 3
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which city in wyoming has the largest population",
    "evidence": "",
    "idx": 4
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what cities in wyoming have the highest number of citizens",
    "evidence": "",
    "idx": 5
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the most populous city in wyoming",
    "evidence": "",
    "idx": 7
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the largest city in wyoming by population",
    "evidence": "",
    "idx": 8
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the largest city of wyoming",
    "evidence": "",
    "idx": 9
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'wyoming'\nRETURN MAX(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'wyoming'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the city in wyoming with the largest population",
    "evidence": "",
    "idx": 10
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'new mexico'\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how big is new mexico",
    "evidence": "",
    "idx": 11
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'new mexico'\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the area of new mexico",
    "evidence": "",
    "idx": 12
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'new mexico'\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how large is new mexico",
    "evidence": "",
    "idx": 13
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'new mexico'\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the area of the new mexico state",
    "evidence": "",
    "idx": 14
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'new mexico'\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the size of new mexico",
    "evidence": "",
    "idx": 15
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'new mexico'\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the area of new mexico in square kilometers",
    "evidence": "",
    "idx": 16
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people live in california",
    "evidence": "",
    "idx": 17
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people reside in california",
    "evidence": "",
    "idx": 18
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many residents live in california",
    "evidence": "",
    "idx": 19
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how much population does california have",
    "evidence": "",
    "idx": 20
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the population of california",
    "evidence": "",
    "idx": 21
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population of california",
    "evidence": "",
    "idx": 22
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people are in the state of california",
    "evidence": "",
    "idx": 23
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what can you tell me about the population of california",
    "evidence": "",
    "idx": 24
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people are there in california",
    "evidence": "",
    "idx": 25
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many citizens in california",
    "evidence": "",
    "idx": 26
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people stay in california",
    "evidence": "",
    "idx": 27
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`state_name` = 'california'\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many citizens live in california",
    "evidence": "",
    "idx": 28
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the smallest population",
    "evidence": "",
    "idx": 29
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the least populous state",
    "evidence": "",
    "idx": 30
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the state with the lowest population",
    "evidence": "",
    "idx": 31
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'texas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the cities in texas",
    "evidence": "",
    "idx": 32
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'texas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "tell me what cities are in texas",
    "evidence": "",
    "idx": 33
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'texas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what cities are located in texas",
    "evidence": "",
    "idx": 34
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'texas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the cities in texas",
    "evidence": "",
    "idx": 35
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'texas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what cities in texas",
    "evidence": "",
    "idx": 36
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'texas'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the cities which are in texas",
    "evidence": "",
    "idx": 37
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`capital` = 'albany'\nRETURN `state`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the area of the state with the capital albany",
    "evidence": "",
    "idx": 38
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`lake`:`lake`)\nWHERE `lake`.`state_name` = 'california'\nRETURN `lake`.`lake_name` AS `lake_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the lakes in california",
    "evidence": "",
    "idx": 39
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`lake`:`lake`)\nWHERE `lake`.`area` > 750 AND `lake`.`state_name` = 'michigan'\nRETURN `lake`.`lake_name` AS `lake_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "name the major lakes in michigan",
    "evidence": "",
    "idx": 40
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the states",
    "evidence": "",
    "idx": 41
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list the states",
    "evidence": "",
    "idx": 42
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`state`:`state`)\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me all the states of usa",
    "evidence": "",
    "idx": 43
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states do ohio river flow through",
    "evidence": "",
    "idx": 44
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states does the ohio river run through",
    "evidence": "",
    "idx": 45
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states border the ohio river",
    "evidence": "",
    "idx": 46
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states border the ohio river",
    "evidence": "",
    "idx": 47
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states does the ohio run through",
    "evidence": "",
    "idx": 48
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is the ohio river",
    "evidence": "",
    "idx": 49
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states does the ohio river run through",
    "evidence": "",
    "idx": 50
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states does the ohio run through",
    "evidence": "",
    "idx": 51
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states does the ohio river pass through",
    "evidence": "",
    "idx": 52
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the states that the ohio run through",
    "evidence": "",
    "idx": 53
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the ohio river",
    "evidence": "",
    "idx": 54
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states have rivers named ohio",
    "evidence": "",
    "idx": 55
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "through which states does the ohio flow",
    "evidence": "",
    "idx": 56
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states are next to the ohio",
    "evidence": "",
    "idx": 57
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "through which states does the ohio run",
    "evidence": "",
    "idx": 58
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`river_name` = 'ohio'\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states does the ohio river go through",
    "evidence": "",
    "idx": 59
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the largest population",
    "evidence": "",
    "idx": 60
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the most populous state",
    "evidence": "",
    "idx": 61
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state is the largest in population",
    "evidence": "",
    "idx": 62
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the biggest population",
    "evidence": "",
    "idx": 63
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the greatest population",
    "evidence": "",
    "idx": 64
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the most population",
    "evidence": "",
    "idx": 65
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the most people",
    "evidence": "",
    "idx": 66
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the most people",
    "evidence": "",
    "idx": 67
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the most populous state in the us",
    "evidence": "",
    "idx": 68
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`population` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the highest population",
    "evidence": "",
    "idx": 69
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'pennsylvania'\nRETURN `highlow`.`lowest_elevation` AS `lowest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the lowest elevation in pennsylvania",
    "evidence": "",
    "idx": 70
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`lowest_elevation` = '0'\nRETURN `highlow`.`highest_point` AS `highest_point`, `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in each state whose lowest point is sea level",
    "evidence": "",
    "idx": 71
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the length of the longest river in the usa",
    "evidence": "",
    "idx": 72
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`length` AS `length`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how long is the longest river in the usa",
    "evidence": "",
    "idx": 73
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN MAX(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0` AND `river`.`traverse` = 'texas'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the longest river flowing through texas",
    "evidence": "",
    "idx": 74
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN MAX(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0` AND `river`.`traverse` = 'texas'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the largest river in texas state",
    "evidence": "",
    "idx": 75
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN MAX(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0` AND `river`.`traverse` = 'texas'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the longest river in texas",
    "evidence": "",
    "idx": 76
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN MAX(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0` AND `river`.`traverse` = 'texas'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the biggest river in texas",
    "evidence": "",
    "idx": 77
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN MAX(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0` AND `river`.`traverse` = 'texas'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the longest river that flows through texas",
    "evidence": "",
    "idx": 78
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'texas'\nRETURN MAX(`river`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0` AND `river`.`traverse` = 'texas'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the biggest rivers in texas",
    "evidence": "",
    "idx": 79
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'idaho'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers are in idaho",
    "evidence": "",
    "idx": 80
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'idaho'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the number of rivers in idaho",
    "evidence": "",
    "idx": 81
  }
]