[
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nORDER BY `episode`.`rating` IS NULL DESC, `episode`.`rating`  \nRETURN `episode`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of the episode that received the lowest rating?",
    "evidence": "lowest rating refers to Min(rating)",
    "idx": 3168
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`result` = 'Winner' AND `award`.`award` = 'Favorite Animated Comedy'\nRETURN `award`.`year` AS `year` ORDER BY `year` IS NULL ASC, `year` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What year did the Simpsons receive its first ever award for Favorite Animated Comedy in People's Choice Award?",
    "evidence": "\"Favorite Animated Comedy\" is the award; 'People's Choice Award' is the award_category; received award refers to result = 'Winner'; first ever award refers to Min(year)",
    "idx": 3169
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH ()-[credit:credit]->()\nWHERE `credit`.`person` = 'Dell Hake' AND `credit`.`credited` = 'false'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many episodes was Dell Hake not included in the credit list?",
    "evidence": "\"Dell Hake\" is the person; not included in the credit list refers to credited = ''",
    "idx": 3170
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`award` = 'Outstanding Voice-Over Performance' AND `t2`.`organization` = 'Primetime Emmy Awards' AND `t2`.`result` = 'Winner')\nRETURN `t2`.`year` - toInteger(CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`t1`.`birthdate`,(case when size(`t1`.`birthdate`)+1+(1-1)+4 < 0 then 0 else size(`t1`.`birthdate`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`t1`.`birthdate`,size(`t1`.`birthdate`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`t1`.`birthdate`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`t1`.`birthdate`,1-1,4) END) AS `age`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How old was the awardee when he/she won the first-ever award for Outstanding Voice-Over Performance in Primetime Emmy Awards?",
    "evidence": "\"Outstanding Voice-Over Performance\" is the award; 'Primetime Emmy Awards' is the organization; awardee refers to result = 'Winner'; first ever award refers to Min(year); age at the time of awarded refers to Subtract(year, SUBSTR(birthdate, 0, 5))",
    "idx": 3171
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t1`.`person` = 'Dan Castellaneta' AND `t1`.`award` = 'Outstanding Voice-Over Performance' AND `t1`.`organization` = 'Primetime Emmy Awards' AND `t1`.`year` = 2009)\nRETURN DISTINCT `t2`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What character did Dan Castellaneta play that won him an award for Outstanding Voice-Over Performance in 2009 in the Primetime Emmy Awards?",
    "evidence": "\"Dan Castellaneta\" is the person; won refers to result = 'Winner'; 'Outstanding Voice-Over Performance' is the award; 'Primetime Emmy Awards' is the organization; in 2009 refers to year = 2009",
    "idx": 3172
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`award` = 'Best Voice-Over Performance' AND `t2`.`organization` = 'Online Film & Television Association' AND `t2`.`year` = 2009)\nRETURN `t1`.`birth_place` AS `birth_place`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the birth place of the cast or crew member who won the Best Voice-Over Performance in Online Film & Television Association in 2009?",
    "evidence": "won refers to result = 'Winner'; 'Best Voice-Over Performance' is the award; ' Online Film & Television Association' is the organization; in 2009 refers to year = 2009",
    "idx": 3173
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`stars` = 10)\nORDER BY `t1`.`rating` IS NULL ASC, `t1`.`rating` DESC \nRETURN sum(`t1`.`votes`) AS `_col_0`  LIMIT 4",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many 10 star votes did the top 4 episodes with the highest rating received?",
    "evidence": "10 stars votes refers to stars = 10; highest rating refers to Max(rating); number of votes refers to SUM(votes)",
    "idx": 3174
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'No Loan Again, Naturally' AND `t2`.`votes` < 50)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In \"No Loan Again, Naturally\", how many stars received votes of no more than 50?",
    "evidence": "\"No Loan Again, Naturally\" is the title of episode; votes of no more than 50 refers to votes < 50; number of stars refers to SUM(stars)",
    "idx": 3175
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t1`.`birth_country` = 'USA' AND `t2`.`result` = 'Winner')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many award winners are from the USA?",
    "evidence": "award winner refers to result = 'Winner'; 'USA' is the birth_country",
    "idx": 3176
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t1`.`nickname` = 'Doofus' AND `t2`.`credited` = 'true' AND `t2`.`episode_id` = 'S20-E11')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In Season 20 Episode 11, how many times was Doofus included in the credit list?",
    "evidence": "in Season 20 Episode 11 refers to episode_id = 'S20-E11'; 'Doofus' is the nickname of person; include in credit list refers to credited = 'true'",
    "idx": 3177
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`award`)-[awarded_to_0:awarded_to]->(`t1`:`person`)\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`result` = 'Winner')\nORDER BY `t2`.`year` IS NULL DESC, `t2`.`year`  \nRETURN `t2`.`award` AS `award`, `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the first award won by the cast or crew member of the show? Give the name of the person who won the said award.",
    "evidence": "won refers to result = 'Winner'; first award refers to Min(year)",
    "idx": 3178
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`title` = 'Sex, Pies and Idiot Scrapes' AND `t2`.`stars` = 9)\nRETURN `t2`.`percent` AS `percent`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In \"Sex, Pies and Idiot Scrapes\", how many percentage of votes did the 9 star score has?",
    "evidence": "\"Sex, Pies and Idiot Scrapes\" is the title of episode; 9 star score refers to stars = 9; percentage refers to percent",
    "idx": 3179
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`birth_place` = 'Los Angeles' AND `person`.`height_meters` >= 1.8\nRETURN `person`.`name` AS `name`, `person`.`birthdate` AS `birthdate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the casts who were born in Los Angeles, describe the name and birth date of who have 1.8 m and above in height.",
    "evidence": "\"Los Angeles\" is the birth_place; 1.8 m and above in height refers to height_meters > = 1.8",
    "idx": 3180
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nWHERE CASE  WHEN 1-1 < 0 AND 7 < 0  THEN substring(`episode`.`air_date`,(case when size(`episode`.`air_date`)+1+(1-1)+7 < 0 then 0 else size(`episode`.`air_date`)+1+(1-1)+7 end),-(7))  WHEN 1-1 < 0 AND 7 >= 0  THEN substring(`episode`.`air_date`,size(`episode`.`air_date`)+1+(1-1),7)  WHEN 1-1 >= 0 AND 7 < 0  THEN substring(`episode`.`air_date`,(case when 1-1+1+(7) < 0 then 0 else 1-1+1+(7) end),-(7))  ELSE substring(`episode`.`air_date`,1-1,7) END =~ '(?i)(?s)2008-10.*'\nRETURN `episode`.`episode` AS `episode`, `episode`.`title` AS `title`, `episode`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the episode number, title and rating of which were aired in October, 2008.",
    "evidence": "episode number refers to episode; aired in refers to air_date; October refers to Substr(air_date, 6, 2) = '10': 2008 refers to Substr(air_date, 0, 5) = '2008'",
    "idx": 3181
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t2`.`character` = 'Homer Simpson' AND `t1`.`result` = 'Winner')\nRETURN `t1`.`award_id` AS `award_id`, `t1`.`award` AS `award`, `t1`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the award ID, award name and winner for character named \"Homer simpson 20\".",
    "evidence": "\"Homer simpson 20\" is the character; \"Winner\" is the result; award name refers to award",
    "idx": 3182
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)\nMATCH ()-[t2:credit]->()\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`person` = 'Billy Kimball')\nRETURN DISTINCT `t1`.`award` AS `award`, `t1`.`result` AS `result`, `t2`.`category` AS `category`, `t2`.`credited` AS `credited`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the award name, result, credit category and credited status of the \"Billy Kimball\".",
    "evidence": "\"Billy Kimball\" is the person; award name refers to award; credited category refers to category; credited status refers to credited; credited = 'true' means the person is included in the credit list and vice versa",
    "idx": 3183
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)\nMATCH ()-[t2:credit]->()\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t2`.`episode_id` = 'S20-E13' AND `t2`.`role` = 'assistant director')\nRETURN `t1`.`person` AS `person`, `t1`.`award` AS `award`, `t1`.`organization` AS `organization`, `t1`.`result` AS `result`, `t2`.`credited` AS `credited`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the person, award, organization, result and credited status of the assistant director in S20-E13.",
    "evidence": "\"assistant director\" is the role of person; 'S20-E13' is the episode_id; credited status refers to credited; credited = 'true' means the person is included in the credit list and vice versa",
    "idx": 3184
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t2`.`category` = 'Cast' AND `t2`.`credited` = 'false')\nRETURN `t1`.`birth_country` AS `birth_country`, `t1`.`height_meters` AS `height_meters`, `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the birth country, height and person name who were not included in credit list with category of casting.",
    "evidence": "height refers to height_meters; not in credit list refers to credited = ''; category of casting refers to category = 'Casting Department'",
    "idx": 3185
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`keyword`)-[tagged_for_0:tagged_for]->(`t2`:`episode`)\nMATCH (`t3`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t2`.`episode_id` = `t3`.`episode_id`\nAND (`t2`.`title` = 'The Good, the Sad and the Drugly' AND `t3`.`result` = 'Nominee')\nRETURN `t3`.`person` AS `person`, `t1`.`keyword` AS `keyword`, `t1`.`episode_id` AS `episode_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the nominee, keywords and episode ID of the title \"The Good, the Sad and the Drugly\".",
    "evidence": "nominee refers to result = 'Nominee'",
    "idx": 3186
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`keyword` = 'arab stereotype' AND `t2`.`stars` = 10)\nRETURN `t2`.`votes` AS `votes`, `t2`.`percent` AS `percent`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the voting numbers and percentage of the best rating scale of the episode which had keyword of \"arab stereotype\"?",
    "evidence": "best rating scale refers to stars = 10",
    "idx": 3187
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`organization` = 'Jupiter Award' AND `t1`.`result` = 'Winner')\nRETURN `t1`.`award` AS `award`, `t2`.`air_date` AS `air_date`, `t2`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the episode who won the award held by Jupiter Award, describe award name, aired date and rating of that episode.",
    "evidence": "held by Jupiter Award refers to organization = 'Jupiter Award'; won the award refers to result = 'Winner'",
    "idx": 3188
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`keyword`)-[tagged_for_0:tagged_for]->(`t2`:`episode`)\nMATCH (`t3`:`vote`)-[voted_for_0:voted_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t2`.`episode_id` = `t3`.`episode_id`\nAND (`t3`.`stars` = 1)\nORDER BY `t3`.`votes` IS NULL ASC, `t3`.`votes` DESC \nRETURN DISTINCT `t3`.`episode_id` AS `episode_id`, `t2`.`title` AS `title`, `t1`.`keyword` AS `keyword`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the episode ID, title and any three keywords of the episode which get the most number of votes in star classification of worst.",
    "evidence": "star classification of worst refers to stars = 1; most number of votes refers to MAX(votes)",
    "idx": 3189
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_for_0:awarded_for]->(`t2`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`rating` >= 7 AND `t2`.`rating` <= 10 AND CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`t2`.`air_date`,(case when size(`t2`.`air_date`)+1+(1-1)+4 < 0 then 0 else size(`t2`.`air_date`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`t2`.`air_date`,size(`t2`.`air_date`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`t2`.`air_date`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`t2`.`air_date`,1-1,4) END = '2008' AND `t1`.`result` = 'Nominee')\nRETURN `t2`.`title` AS `title`, `t2`.`episode_image` AS `episode_image`, `t1`.`award` AS `award`, `t1`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the episodes with excellent rating which were aired in 2008, describe the title, episode's image, award name and person who were nominated.",
    "evidence": "excellent rating refers to 7 < = rating < = 10; aired in 2008 refers to SUBSTRACT(air_date, 0, 5) = '2008'; who were nominated refers to result = 'Nominee'",
    "idx": 3190
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t2`.`award_id` = 326)\nRETURN DISTINCT `t1`.`award` AS `award`, `t1`.`person` AS `person`, `t2`.`character` AS `character`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe the award title, person and character name of the award ID 326.",
    "evidence": "",
    "idx": 3191
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (NOT `t1`.`birthdate` IS NULL)\nORDER BY `t1`.`birthdate` IS NULL DESC, `t1`.`birthdate`  \nRETURN `t1`.`name` AS `name`, `t1`.`birth_place` AS `birth_place`, `t2`.`role` AS `role`, 2022 - toInteger(CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`t1`.`birthdate`,(case when size(`t1`.`birthdate`)+1+(1-1)+4 < 0 then 0 else size(`t1`.`birthdate`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`t1`.`birthdate`,size(`t1`.`birthdate`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`t1`.`birthdate`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`t1`.`birthdate`,1-1,4) END) AS `age`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Describe name, birth country, role in episode and age in 2022 of the oldest crew member..",
    "evidence": "age in 2022 refers to SUBTRACT(2022, substr(birthdate, 0, 5)); oldest refers to MIN(birthdate)",
    "idx": 3192
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t1`.`birth_country` = 'North Korea')\nRETURN DISTINCT `t2`.`credited` AS `credited`, `t2`.`category` AS `category`, `t2`.`role` AS `role`, `t1`.`birth_place` AS `birth_place`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of credits, category, role and birthplace of the crew member who was born in North Korea.",
    "evidence": "number of credits refers to credited; born in North Korea refers to birth_country = 'North Korea'",
    "idx": 3193
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nORDER BY `t2`.`stars` IS NULL ASC, `t2`.`stars` DESC, `t2`.`votes` IS NULL ASC, `t2`.`votes` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the title of the episode that received the highest star score and the highest number of votes.",
    "evidence": "received the highest star score refers to MAX(stars); the highest number of votes refers to MAX(votes)",
    "idx": 3194
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`result` = 'Winner'\nRETURN COUNT(`award`.`award_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total number of awards won by The simpson 20s: Season 20?",
    "evidence": "total number of awards refers to COUNT(award); awards won refers to result = 'Winner';",
    "idx": 3195
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`episode_id` = 'S20-E12')\nRETURN avg(`t2`.`stars`) AS `_col_0`, `t1`.`summary` AS `summary`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of stars assigned to The simpson 20s: S20-E12? What is the said episode all about?",
    "evidence": "average number of stars refers to AVG(stars); simpson 20s: S20-E12 refers to episode_id = 'S20-E12'; episode all about refers to summary",
    "idx": 3196
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`character_award`)-[for_award_0:for_award]->(`t1`:`award`)\nWHERE `t1`.`award_id` = `t2`.`award_id`\nAND (`t2`.`character` = 'Homer simpson 20' AND `t1`.`organization` = 'Primetime Emmy Awards' AND `t1`.`award` = 'Outstanding Voice-Over Performance' AND `t1`.`result` = 'Winner')\nRETURN `t1`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the performer who won Emmy Award for Outstanding Voice-Over Performance by playing Homer simpson 20.",
    "evidence": "Outstanding Voice-Over Performance refers to award = 'Outstanding Voice-Over Performance'; who won refers to result = 'Winner'; Emmy refers to organization = 'Primetime Emmy Awards'; playing Homer simpson 20 refers to character = 'Homer simpson 20'",
    "idx": 3197
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:credit]->()\nWHERE `t1`.`name` = `t2`.`person`\nAND (`t1`.`name` = 'Al Jean')\nRETURN DISTINCT `t1`.`birth_name` AS `birth_name`, `t2`.`role` AS `role`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the birth name of Al Jean and his role in creating The simpson 20s: Season 20?",
    "evidence": "",
    "idx": 3198
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nWHERE `award`.`result` = 'Winner'\nORDER BY `award`.`year` IS NULL ASC, `award`.`year` DESC \nRETURN `award`.`award` AS `award`, `award`.`award_category` AS `award_category`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the name and category of the most recent award received by the show.",
    "evidence": "most recent refers to MAX(year); received refers to result = 'Winner'; name of award refers to award; category refers to award_category",
    "idx": 3200
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`award`:`award`)\nRETURN CASE WHEN COUNT(`award`.`award`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `award`.`result` = 'Winner' THEN 1 ELSE 0 END)) * 100 / COUNT(`award`.`award`) END AS `rate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is The simpson 20s: Season 20 average awards winning rate?",
    "evidence": "average awards winning rate refers to DIVIDE(SUM(result = 'winner'), COUNT(award));",
    "idx": 3201
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nWHERE `episode`.`air_date` =~ '(?i)(?s)2008-10.*' OR `episode`.`air_date` =~ '(?i)(?s)2008-11.*'\nRETURN COUNT(`episode`.`episode_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many episodes were aired between October and November 2008?",
    "evidence": "between October and November 2008 refers to air_date BETWEEN '2008-10-01' and '2008-11-30'",
    "idx": 3202
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`episode`:`episode`)\nWHERE `episode`.`air_date` =~ '(?i)(?s)2009.*'\nORDER BY `episode`.`rating` IS NULL DESC, `episode`.`rating`  \nRETURN `episode`.`episode_id` AS `episode_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among episodes aired in 2009, which episode has received the worst response based on the rating.",
    "evidence": "aired in 2009 refers to year(air_date) = 2009; received the worst response based on the rating refers to MIN(rating)",
    "idx": 3203
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`birthdate` = '1957-10-29' AND `person`.`birth_place` = 'Chicago' AND `person`.`birth_region` = 'Illinois'\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who from The simpson 20s: Season 20 cast and crew was born in October 29, 1957 in Chicago, Illinois?",
    "evidence": "born in October 29, 1957 refers to birthdate = '1957-10-29'; in Chicago refers to birth_place = 'Chicago'; Illinois refers to birth_region = 'Illinois'",
    "idx": 3205
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH ()-[credit:credit]->()\nWHERE `credit`.`role` = 'producer'\nRETURN DISTINCT `credit`.`person` AS `person`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who produced The simpson 20s: Season 20?",
    "evidence": "produced refers to role = 'producer'",
    "idx": 3206
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t1`:`award`)-[awarded_to_0:awarded_to]->(`t2`:`person`)\nWHERE `t1`.`person` = `t2`.`name`\nAND (`t1`.`role` = 'composer' AND `t1`.`organization` = 'Primetime Emmy Awards' AND `t1`.`award` = 'Outstanding Music Composition for a Series (Original Dramatic Score)' AND `t1`.`result` = 'Nominee' AND `t1`.`year` = 2009)\nRETURN `t1`.`year` - toFloat(`t2`.`birthdate`) AS `agein2009`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How old was composer of the show when he was nominated for Emmy's Outstanding Music Composition for a Series in 2009. Indicate his full name as well.",
    "evidence": "in 2009 refers to year = 2009; old refers to SUBTRACT(2009, birthdate); composer of the show refers to role = 'composer'; Emmy's refers to organization = 'Primetime Emmy Awards'; nominated refers to result = 'Nominee'; Outstanding Music Composition refers to award = 'Outstanding Music Composition for a Series (Original Dramatic Score)'",
    "idx": 3207
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`name` = 'Dan Castellaneta'\nRETURN `person`.`birth_place` AS `birth_place`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate the birthplace of the crew which name is Dan Castellaneta.",
    "evidence": "",
    "idx": 3208
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE `person`.`birth_country` = 'USA'\nRETURN COUNT(`person`.`name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many crews were born in the USA?",
    "evidence": "born in the USA refers to birth_country = 'USA'",
    "idx": 3209
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`person`:`person`)\nWHERE CASE  WHEN 1-1 < 0 AND 4 < 0  THEN substring(`person`.`birthdate`,(case when size(`person`.`birthdate`)+1+(1-1)+4 < 0 then 0 else size(`person`.`birthdate`)+1+(1-1)+4 end),-(4))  WHEN 1-1 < 0 AND 4 >= 0  THEN substring(`person`.`birthdate`,size(`person`.`birthdate`)+1+(1-1),4)  WHEN 1-1 >= 0 AND 4 < 0  THEN substring(`person`.`birthdate`,(case when 1-1+1+(4) < 0 then 0 else 1-1+1+(4) end),-(4))  ELSE substring(`person`.`birthdate`,1-1,4) END < '1970'\nRETURN `person`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the name of crew that were born before 1970.",
    "evidence": "born before 1970 refers to birthdate < '1970-01-01'",
    "idx": 3210
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`vote`:`vote`)\nWHERE `vote`.`stars` = 5 AND `vote`.`votes` > 100\nRETURN `vote`.`episode_id` AS `episode_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which episode ids are rated 5 stars and have more than 100 votes?",
    "evidence": "more than 100 votes refers to votes > 100",
    "idx": 3212
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)-[tagged_for_0:tagged_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Double, Double, Boy in Trouble')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate the keywords of the title \"Double, Double, Boy in Trouble\".",
    "evidence": "",
    "idx": 3213
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)-[voted_for_0:voted_for]->(`t1`:`episode`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`episode` >= 10 AND `t1`.`episode` <= 20 AND `t2`.`votes` > 200)\nRETURN DISTINCT `t1`.`episode` AS `episode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among episodes from 10 to 20, which episode has more than 200 votes?",
    "evidence": "episodes from 10 to 20 refers to episode BETWEEN 10 and 20; more than 200 votes refers to COUNT(votes) > 200",
    "idx": 3214
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`keyword`)\nMATCH (`t1`:`award`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`award_category` = 'Primetime Emmy')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate the keywords of the episode that won the Primetime Emmy Award category.",
    "evidence": "Primetime Emmy Award refers to award_category = 'Primetime Emmy'",
    "idx": 3215
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`award`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`award_category` = 'Primetime Emmy')\nORDER BY `t2`.`votes` IS NULL ASC, `t2`.`votes` DESC \nRETURN `t1`.`person` AS `person`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the recipient of the Primetime Emmy Award with the most votes?",
    "evidence": "Primetime Emmy Award refers to award_category = 'Primetime Emmy'; the most votes refers to MAX(votes)",
    "idx": 3216
  },
  {
    "filename": "train.json",
    "db_id": "simpson_episodes",
    "gql_statement": "MATCH (`t2`:`vote`)\nMATCH (`t1`:`award`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`award` = 'Outstanding Animated Program (For Programming Less Than One Hour)' AND `t2`.`stars` = 10)\nRETURN DISTINCT `t1`.`episode_id` AS `episode_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which episode id did award Outstanding Animated Program (For Programming Less Than One Hour) with an episode star score of 10?",
    "evidence": "star score of 10 refers to stars = 10",
    "idx": 3217
  }
]