[
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB')\nWITH `t2`.`year` AS _groupby_col_0, COUNT(DISTINCT `t2`.`title`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the number of papers published in the VLDB conference in each year .",
    "evidence": "",
    "idx": 1196
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nORDER BY `publication`.`citation_num` IS NULL ASC, `publication`.`citation_num` DESC \nRETURN `publication`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper with the most citations .",
    "evidence": "",
    "idx": 1199
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`domain`)-[t1:has_publication]->()\nMATCH (`t3`:`publication`)-[t1:belongs_to_domain]->()\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`pid` = `t1`.`pid`\nAND (`t2`.`name` = 'Databases')\nORDER BY `t3`.`citation_num` IS NULL ASC, `t3`.`citation_num` DESC \nRETURN `t3`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper in Databases area with the most citations .",
    "evidence": "",
    "idx": 1200
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB')\nORDER BY `t2`.`citation_num` IS NULL ASC, `t2`.`citation_num` DESC \nRETURN `t2`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper in PVLDB with the most citations .",
    "evidence": "",
    "idx": 1201
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB')\nORDER BY `t2`.`citation_num` IS NULL ASC, `t2`.`citation_num` DESC \nRETURN `t2`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper in VLDB conference with the most citations .",
    "evidence": "",
    "idx": 1202
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`publication`:`publication`)\nWHERE `publication`.`year` > 2000\nORDER BY `publication`.`citation_num` IS NULL ASC, `publication`.`citation_num` DESC \nRETURN `publication`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper after 2000 with the most citations .",
    "evidence": "",
    "idx": 1204
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`domain`)-[t1:has_publication]->()\nMATCH (`t3`:`publication`)-[t1:belongs_to_domain]->()\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`pid` = `t1`.`pid`\nAND (`t2`.`name` = 'Databases' AND `t3`.`year` > 2000)\nORDER BY `t3`.`citation_num` IS NULL ASC, `t3`.`citation_num` DESC \nRETURN `t3`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper after 2000 in Databases area with the most citations .",
    "evidence": "",
    "idx": 1205
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`journal`)\nWHERE `t2`.`jid` = `t1`.`jid`\nAND (`t1`.`name` = 'PVLDB' AND `t2`.`year` > 2000)\nORDER BY `t2`.`citation_num` IS NULL ASC, `t2`.`citation_num` DESC \nRETURN `t2`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper after 2000 in PVLDB with the most citations .",
    "evidence": "",
    "idx": 1206
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t1`:`conference`)\nWHERE `t2`.`cid` = `t1`.`cid`\nAND (`t1`.`name` = 'VLDB' AND `t2`.`year` > 2000)\nORDER BY `t2`.`citation_num` IS NULL ASC, `t2`.`citation_num` DESC \nRETURN `t2`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the paper after 2000 in VLDB conference with the most citations .",
    "evidence": "",
    "idx": 1207
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`publication`)-[t4:has_keyword]->(`t1`:`keyword`)\nMATCH (`t3`:`publication`)-[published_in_0:published_in]->(`t2`:`conference`)\nWHERE `t4`.`kid` = `t1`.`kid`\nAND `t3`.`pid` = `t4`.`pid`\nAND `t3`.`cid` = `t2`.`cid`\nAND (`t1`.`keyword` = 'Relational Database')\nWITH `t2`.`name` AS _groupby_col_0, COUNT(DISTINCT `t3`.`title`) AS _groupby_col_1\nWHERE _groupby_col_1 > 60\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the conferences, which have more than 60 papers containing keyword \" Relational Database \" .",
    "evidence": "",
    "idx": 1210
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[t4:has_keyword]->(`t1`:`keyword`)\nMATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t4`.`kid` = `t1`.`kid`\nAND `t2`.`pid` = `t4`.`pid`\nAND `t2`.`jid` = `t3`.`jid`\nAND (`t1`.`keyword` = 'Relational Database')\nWITH `t3`.`name` AS _groupby_col_0, COUNT(DISTINCT `t2`.`title`) AS _groupby_col_1\nWHERE _groupby_col_1 > 60\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the journals, which have more than 60 papers containing keyword \" Relational Database \" .",
    "evidence": "",
    "idx": 1211
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t3`:`publication`)-[t4:has_keyword]->(`t1`:`keyword`)\nMATCH (`t3`:`publication`)-[published_in_0:published_in]->(`t2`:`conference`)\nWHERE `t4`.`kid` = `t1`.`kid`\nAND `t3`.`pid` = `t4`.`pid`\nAND `t3`.`cid` = `t2`.`cid`\nAND (`t2`.`name` = 'VLDB')\nWITH `t1`.`keyword` AS _groupby_col_0, COUNT(DISTINCT `t3`.`title`) AS _groupby_col_1\nWHERE _groupby_col_1 > 100\nRETURN _groupby_col_0 AS `keyword`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the keywords, which have been contained by more than 100 papers in VLDB conference .",
    "evidence": "",
    "idx": 1212
  },
  {
    "filename": "train_others.json",
    "db_id": "academic",
    "gql_statement": "MATCH (`t2`:`publication`)-[t4:has_keyword]->(`t1`:`keyword`)\nMATCH (`t2`:`publication`)-[published_in_0:published_in]->(`t3`:`journal`)\nWHERE `t4`.`kid` = `t1`.`kid`\nAND `t2`.`pid` = `t4`.`pid`\nAND `t2`.`jid` = `t3`.`jid`\nAND (`t3`.`name` = 'PVLDB')\nWITH `t1`.`keyword` AS _groupby_col_0, COUNT(DISTINCT `t2`.`title`) AS _groupby_col_1\nWHERE _groupby_col_1 > 100\nRETURN _groupby_col_0 AS `keyword`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "return me the keywords, which have been contained by more than 100 papers in PVLDB .",
    "evidence": "",
    "idx": 1213
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`title` = 'The Imitation Game'\nRETURN `movie`.`release_year` AS `release_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What year is the movie \" The Imitation Game \" from ?",
    "evidence": "",
    "idx": 1216
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`title` = 'The Imitation Game'\nRETURN `movie`.`release_year` AS `release_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What year was the movie \" The Imitation Game \" produced",
    "evidence": "",
    "idx": 1217
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`name` = 'Benedict Cumberbatch'\nRETURN `actor`.`birth_year` AS `birth_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What year was \" Benedict Cumberbatch \" born ?",
    "evidence": "",
    "idx": 1218
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`name` = 'Benedict Cumberbatch'\nRETURN `actor`.`birth_year` AS `birth_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "In what year was \" Benedict Cumberbatch \" born",
    "evidence": "",
    "idx": 1219
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`name` = 'Christoph Waltz'\nRETURN `actor`.`nationality` AS `nationality`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the nationality of the actress \" Christoph Waltz \" ?",
    "evidence": "",
    "idx": 1220
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`name` = 'Christoph Waltz'\nRETURN `actor`.`nationality` AS `nationality`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the nationality of the actor \" Christoph Waltz \" ?",
    "evidence": "",
    "idx": 1221
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`release_year` = 2015\nRETURN `movie`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies produced in 2015",
    "evidence": "",
    "idx": 1222
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'Tehran'\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors born in \" Tehran \"",
    "evidence": "",
    "idx": 1223
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'Tehran'\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors born in Tehran",
    "evidence": "",
    "idx": 1224
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'Tehran'\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which actors were born in Tehran",
    "evidence": "",
    "idx": 1225
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`nationality` = 'Afghanistan'\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors who are from Afghanistan",
    "evidence": "",
    "idx": 1226
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`nationality` = 'Afghanistan'\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors from Afghanistan",
    "evidence": "",
    "idx": 1227
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`nationality` = 'Afghanistan'\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the name of all the actors from Afghanistan",
    "evidence": "",
    "idx": 1228
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_year` = 1984\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors who were born in 1984",
    "evidence": "",
    "idx": 1229
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`name` = 'actor_name0'\nRETURN `actor`.`birth_year` AS `birth_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When was \" Kevin Spacey \" born ?",
    "evidence": "",
    "idx": 1230
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`name` = 'actor_name0'\nRETURN `actor`.`birth_year` AS `birth_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "In what year was \" Kevin Spacey \" born ?",
    "evidence": "",
    "idx": 1231
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`director`:`director`)\nWHERE `director`.`name` = 'director_name0'\nRETURN `director`.`birth_city` AS `birth_city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where is the birth place of \" Kevin Spacey \"",
    "evidence": "",
    "idx": 1232
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`director`:`director`)\nWHERE `director`.`name` = 'director_name0'\nRETURN `director`.`birth_city` AS `birth_city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "In what city was \" Kevin Spacey \" born ?",
    "evidence": "",
    "idx": 1233
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`director`:`director`)\nWHERE `director`.`name` = 'director_name0'\nRETURN `director`.`nationality` AS `nationality`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the nationality of \" Kevin Spacey \" ?",
    "evidence": "",
    "idx": 1234
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`title` = 'Finding Nemo'\nRETURN `movie`.`budget` AS `budget`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How much was the budget of \" Finding Nemo \"",
    "evidence": "",
    "idx": 1235
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t2`.`name` = 'Steven Spielberg' AND `t3`.`release_year` > 2006)\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies directed by \" Steven Spielberg \" after 2006",
    "evidence": "",
    "idx": 1236
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t3`.`title` = 'James Bond')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the director of the movie \" James Bond \" ?",
    "evidence": "",
    "idx": 1237
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t3`.`title` = 'James Bond')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who directed the movie \" James Bond \" ?",
    "evidence": "",
    "idx": 1238
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t3`.`title` = 'James Bond')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List \" James Bond \" directors",
    "evidence": "",
    "idx": 1239
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->(`t3`:`movie`)\nWHERE `t2`.`aid` = `t1`.`aid`\nAND `t3`.`mid` = `t2`.`msid`\nAND (`t2`.`role` = 'Alan Turing' AND `t3`.`title` = 'The Imitation Game')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the actor who played \" Alan Turing \" in the movie \" The Imitation Game \"",
    "evidence": "",
    "idx": 1240
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t3`:`movie`)-[t1:has_genre]->(`t2`:`genre`)\nWHERE `t2`.`gid` = `t1`.`gid`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t3`.`title` = 'Jurassic Park')\nRETURN `t2`.`genre` AS `genre`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the genre of the movie \" Jurassic Park \" ?",
    "evidence": "",
    "idx": 1245
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`writer`)-[t3:wrote]->(`t1`:`movie`)\nWHERE `t3`.`msid` = `t1`.`mid`\nAND `t3`.`wid` = `t2`.`wid`\nAND (`t2`.`name` = 'Matt Damon')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies written by \" Matt Damon \"",
    "evidence": "",
    "idx": 1247
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`producer`)-[t3:produced]->(`t2`:`movie`)\nMATCH (`t4`:`writer`)-[t5:wrote]->(`t2`:`movie`)\nWHERE `t2`.`mid` = `t3`.`msid`\nAND `t1`.`pid` = `t3`.`pid`\nAND `t5`.`msid` = `t2`.`mid`\nAND `t5`.`wid` = `t4`.`wid`\nAND (`t1`.`name` = 'Woody Allen' AND `t4`.`name` = 'Woody Allen')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies written and produced by \" Woody Allen \"",
    "evidence": "",
    "idx": 1248
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`movie`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`mid` = `t3`.`msid`\nAND (`t1`.`name` = 'Robin Wright')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies featuring \" Robin Wright \"",
    "evidence": "",
    "idx": 1249
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`movie`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`mid` = `t3`.`msid`\nAND (`t1`.`name` = 'Robin Wright')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the movies featuring \" Robin Wright \" ?",
    "evidence": "",
    "idx": 1250
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`movie`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`mid` = `t3`.`msid`\nAND (`t1`.`name` = 'Robin Wright')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies in which \" Robin Wright \" appears",
    "evidence": "",
    "idx": 1251
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t3`:`movie`)-[t1:has_genre]->(`t2`:`genre`)\nWHERE `t2`.`gid` = `t1`.`gid`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t2`.`genre` = 'Sci-Fi' AND `t3`.`release_year` = 2010)\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all Sci-Fi produced in year 2010",
    "evidence": "",
    "idx": 1253
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t3`:`movie`)-[t1:has_genre]->(`t2`:`genre`)\nWHERE `t2`.`gid` = `t1`.`gid`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t2`.`genre` = 'Sci-Fi' AND `t3`.`release_year` = 2010)\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the Sci-Fi movies which released in 2010",
    "evidence": "",
    "idx": 1254
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'Austin' AND `actor`.`birth_year` > 1980\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors born in \" Austin \" after 1980",
    "evidence": "",
    "idx": 1255
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'Austin' AND `actor`.`birth_year` > 1980\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who are the actors born in \" Austin \" after 1980 ?",
    "evidence": "",
    "idx": 1256
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'Austin' AND `actor`.`birth_year` > 1980\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors from Austin born after 1980",
    "evidence": "",
    "idx": 1257
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t2`.`birth_city` = 'Los Angeles')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies by directors born in \" Los Angeles \"",
    "evidence": "",
    "idx": 1258
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'New York City' AND `actor`.`birth_year` = 1984\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors who were born in \" New York City \" in 1984",
    "evidence": "",
    "idx": 1259
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`keyword`)\nMATCH (`t3`:`movie`)-[t2:has_keyword]->()\nWHERE `t2`.`kid` = `t1`.`id`\nAND `t2`.`msid` = `t3`.`mid`\nAND (`t1`.`keyword` = 'nuclear weapons')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies about nuclear weapons",
    "evidence": "",
    "idx": 1260
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`keyword`)\nMATCH (`t3`:`movie`)-[t2:has_keyword]->()\nWHERE `t2`.`kid` = `t1`.`id`\nAND `t2`.`msid` = `t3`.`mid`\nAND (`t1`.`keyword` = 'nuclear weapons')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the movies related to nuclear weapons",
    "evidence": "",
    "idx": 1261
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`movie`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`mid` = `t1`.`msid`\nAND (`t2`.`name` = 'Alfred Hitchcock')\nRETURN `t3`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which movies did \" Alfred Hitchcock \" direct ?",
    "evidence": "",
    "idx": 1262
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t5:acted_in]->(`t4`:`movie`)\nMATCH (`t3`:`director`)-[t2:directed]->(`t4`:`movie`)\nWHERE `t5`.`aid` = `t1`.`aid`\nAND `t4`.`mid` = `t5`.`msid`\nAND `t4`.`mid` = `t2`.`msid`\nAND `t3`.`did` = `t2`.`did`\nAND (`t1`.`name` = 'Taraneh Alidoosti' AND `t3`.`name` = 'Asghar Farhadi')\nRETURN `t4`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all movies directed by \" Asghar Farhadi \" and featuring \" Taraneh Alidoosti \"",
    "evidence": "",
    "idx": 1263
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`producer`)-[t3:produced]->(`t2`:`tv_series`)\nWHERE `t1`.`pid` = `t3`.`pid`\nAND `t2`.`sid` = `t3`.`msid`\nAND (`t1`.`name` = 'Shonda Rhimes')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the tv series created by \" Shonda Rhimes \" ?",
    "evidence": "",
    "idx": 1267
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`tv_series`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`sid` = `t3`.`msid`\nAND (`t3`.`role` = 'Olivia Pope' AND `t2`.`title` = 'Scandal')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who acts \" Olivia Pope \" in the series Scandal ?",
    "evidence": "",
    "idx": 1268
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`writer`)-[t3:wrote]->(`t1`:`movie`)\nWHERE `t3`.`msid` = `t1`.`mid`\nAND `t3`.`wid` = `t2`.`wid`\nAND (`t1`.`title` = 'The Truman Show')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the writer of the movie \" The Truman Show \"",
    "evidence": "",
    "idx": 1269
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`writer`)-[t3:wrote]->(`t1`:`movie`)\nWHERE `t3`.`msid` = `t1`.`mid`\nAND `t3`.`wid` = `t2`.`wid`\nAND (`t1`.`title` = 'The Truman Show')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the writer of \" The Truman Show \"",
    "evidence": "",
    "idx": 1270
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`tv_series`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`sid` = `t3`.`msid`\nAND (`t1`.`name` = 'Scott Foley')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the series featuring \" Scott Foley \" ?",
    "evidence": "",
    "idx": 1271
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t3:acted_in]->(`t2`:`tv_series`)\nWHERE `t3`.`aid` = `t1`.`aid`\nAND `t2`.`sid` = `t3`.`msid`\nAND (`t1`.`name` = 'Scott Foley')\nRETURN `t2`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the series in which \" Scott Foley \" is an actor ?",
    "evidence": "",
    "idx": 1272
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t4:acted_in]->(`t5`:`movie`)\nMATCH (`t3`:`director`)-[t2:directed]->(`t5`:`movie`)\nWHERE `t4`.`aid` = `t1`.`aid`\nAND `t5`.`mid` = `t4`.`msid`\nAND `t5`.`mid` = `t2`.`msid`\nAND `t3`.`did` = `t2`.`did`\nAND (`t1`.`name` = 'Kate Winslet')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the directors of all movies featuring \" Kate Winslet \"",
    "evidence": "",
    "idx": 1273
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`actor`)-[t3:acted_in]->(`t5`:`movie`)\nMATCH (`t1`:`producer`)-[t4:produced]->(`t5`:`movie`)\nWHERE `t3`.`aid` = `t2`.`aid`\nAND `t5`.`mid` = `t3`.`msid`\nAND `t5`.`mid` = `t4`.`msid`\nAND `t1`.`pid` = `t4`.`pid`\nAND (`t2`.`name` = 'Kate Winslet')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the producers of all movies in which \" Kate Winslet \" is an actor",
    "evidence": "",
    "idx": 1274
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t2`:`director`)-[t1:directed]->(`t3`:`tv_series`)\nWHERE `t2`.`did` = `t1`.`did`\nAND `t3`.`sid` = `t1`.`msid`\nAND (`t3`.`release_year` = 2013 AND `t3`.`title` = 'House of Cards')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the director of the tv series \" House of Cards \" from 2013 ?",
    "evidence": "",
    "idx": 1275
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'Austin' AND `actor`.`gender` = 'female'\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the female actors from Austin",
    "evidence": "",
    "idx": 1276
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_year` > 1980 AND `actor`.`nationality` = 'Italy'\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors from Italy born after 1980",
    "evidence": "",
    "idx": 1277
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`birth_city` = 'New York City' AND `actor`.`birth_year` > 1980 AND `actor`.`gender` = 'female'\nRETURN `actor`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the female actors born in \" New York City \" after 1980",
    "evidence": "",
    "idx": 1278
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->(`t3`:`movie`)\nWHERE `t2`.`aid` = `t1`.`aid`\nAND `t3`.`mid` = `t2`.`msid`\nAND (`t1`.`gender` = 'female' AND `t3`.`title` = 'Saving Private Ryan')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the female actors in the movie \" Saving Private Ryan \"",
    "evidence": "",
    "idx": 1279
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`director`:`director`)\nWHERE `director`.`nationality` = 'Afghanistan'\nRETURN `director`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the directors who are from Afghanistan",
    "evidence": "",
    "idx": 1280
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->(`t3`:`movie`)\nWHERE `t2`.`aid` = `t1`.`aid`\nAND `t3`.`mid` = `t2`.`msid`\nAND (`t3`.`title` = 'Camp X-Ray')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the actors who played in the movie \" Camp X-Ray \"",
    "evidence": "",
    "idx": 1281
  },
  {
    "filename": "train_others.json",
    "db_id": "imdb",
    "gql_statement": "MATCH (`t1`:`actor`)-[t2:acted_in]->(`t3`:`movie`)\nWHERE `t2`.`aid` = `t1`.`aid`\nAND `t3`.`mid` = `t2`.`msid`\nAND (`t1`.`nationality` = 'Canada' AND `t3`.`title` = 'James Bond')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all actors from Canada who acted in \" James Bond \" movies",
    "evidence": "",
    "idx": 1282
  }
]