[
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`address`)-[located_in_0:`located_in`]->(t2@`country`)\nWHERE t2.`country_id` = t1.`country_id`\nAND (t1.`street_number` = '9' AND t1.`street_name` = 'Green Ridge Point' AND t1.`city` = 'Arendal')\nRETURN t2.`country_name` AS `country_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which country is 9 Green Ridge Point, Arendal located at?",
    "evidence": "\"9\" is the street_number; 'Green Reidge Point' is the street_name; 'Arendal' is the city",
    "idx": 3108
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[written_in_0:`written_in`]->(t2@`book_language`)\nWHERE t1.`language_id` = t2.`language_id`\nAND (t1.`title` = 'El plan infinito')\nRETURN t2.`language_name` AS `language_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which language is 'El plan infinito' written in?",
    "evidence": "\"El plan infinito\" is the title of the book; language refers to language_name",
    "idx": 3111
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t3@`book`)-[t2:`has_author`]->(t1@`author`)\nMATCH (t3@`book`)-[published_by_0:`published_by`]->(t4@`publisher`)\nWHERE t2.`author_id` = t1.`author_id`\nAND t3.`book_id` = t2.`book_id`\nAND t4.`publisher_id` = t3.`publisher_id`\nAND (t4.`publisher_name` = 'VIZ Media')\nRETURN cast (sum(CASE  WHEN t1.`author_name` = 'Hirohiko Araki' THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of books written by Hirohiko make up the number of books published by Viz Media?",
    "evidence": "\"Hirohiko Araki\" is the author_name; 'Viz Media' is the publisher_name; percentage = Divide (Count(author_name = 'Hirohiko Araki'), Count(book_id)) * 100",
    "idx": 3112
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t3@`book`)-[t1:`has_author`]->(t2@`author`)\nWHERE t1.`author_id` = t2.`author_id`\nAND t3.`book_id` = t1.`book_id`\nAND (t2.`author_name` = 'Zilpha Keatley Snyder')\nRETURN avg(t3.`num_pages`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of book pages written by Zilpha Keatley Snyder?",
    "evidence": "\"Zilpha Keatley Snyder\" is the author_name; average number of book pages refers to AVG(num_pages)",
    "idx": 3113
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (customer@`customer`)\nWHERE customer.`email` = 'ckupis4@tamu.edu'\nRETURN customer.`first_name` AS `first_name`, customer.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of customer with email ckupis4@tamu.edu?",
    "evidence": "\"ckupis4@tamu.edu\" is the email of customer; full name refers to first_name, last_name",
    "idx": 3114
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (book@`book`)\nORDER BY book.`num_pages` DESC NULLS LAST \nRETURN book.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which book has the most number of pages?",
    "evidence": "books with the most number of pages refers to Max(num_pages)",
    "idx": 3115
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH ()-[t1:`has_author`]->(t2@`author`)\nWHERE t1.`author_id` = t2.`author_id`\nAND (t2.`author_name` = 'A.J. Ayer')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many books were written by author A.J. Ayer?",
    "evidence": "\"A.J. Ayer\" is the author_name;",
    "idx": 3116
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[published_by_0:`published_by`]->(t2@`publisher`)\nWHERE t1.`publisher_id` = t2.`publisher_id`\nAND (t1.`title` = 'The Season: A Candid Look at Broadway')\nRETURN t2.`publisher_name` AS `publisher_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "The book name \"The Season: A Candid Look at Broadway\" was published by which publisher?",
    "evidence": "\"The Season: A Candid Look at Broadway\" is the  title of the book; publisher refers to publisher_name",
    "idx": 3118
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t2@`book`)-[written_in_0:`written_in`]->(t1@`book_language`)\nMATCH (t2@`book`)-[published_by_0:`published_by`]->(t3@`publisher`)\nWHERE t1.`language_id` = t2.`language_id`\nAND t3.`publisher_id` = t2.`publisher_id`\nAND (t3.`publisher_name` = 'Carole Marsh Mysteries')\nRETURN cast (sum(CASE  WHEN t1.`language_name` = 'English' THEN 1 ELSE 0 END) as float) / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average of English books among all books published by Carole Marsh Mysteries?",
    "evidence": "English book refers to language_name = 'English'; 'Carole Marsh Mysteries' is the publisher_name; average = Divide (Count(language_name = 'English'), Count(book_id))",
    "idx": 3119
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t4@`address_status`)\nMATCH (t1@`customer`)-[t2:`has_address`]->(t3@`address`)\nWHERE t1.`customer_id` = t2.`customer_id`\nAND t3.`address_id` = t2.`address_id`\nAND t4.`status_id` = t2.`status_id`\nAND (t1.`first_name` = 'Kandy')\nRETURN t3.`street_number` AS `street_number`, t3.`street_name` AS `street_name`, t3.`city` AS `city`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the current address of customer Kandy?",
    "evidence": "current address refers to address_status = 1; address refers to street_number, street_name, city",
    "idx": 3120
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[t2:`has_author`]->(t3@`author`)\nWHERE t1.`book_id` = t2.`book_id`\nAND t3.`author_id` = t2.`author_id`\nAND (t3.`author_name` = 'A.J. Ayer')\nORDER BY t1.`publication_date`  NULLS FIRST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the first book that was written by A.J. Ayer?",
    "evidence": "\"A.J. Ayer\" is the author_name; first book refers to Min(publication_date)",
    "idx": 3122
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)\nMATCH (t2@`order_line`)\nWHERE t1.`book_id` = t2.`book_id`\nAND (t1.`isbn13` = '9780763628321')\nRETURN t2.`price` AS `price`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the price of the book with ISBN 9780763628321?",
    "evidence": "\"9780763628321\" is the isbn13",
    "idx": 3126
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)\nMATCH (t2@`order_line`)\nWHERE t1.`book_id` = t2.`book_id`\nAND (t2.`order_id` = 1167)\nRETURN t1.`num_pages` AS `num_pages`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of pages of the book in the order ID 1167?",
    "evidence": "number of pages refers to num_pages",
    "idx": 3127
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)\nMATCH (t2@`order_line`)\nWHERE t1.`book_id` = t2.`book_id`\nAND (t2.`order_id` = 931)\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the book in the order ID 931?",
    "evidence": "",
    "idx": 3130
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)-[written_in_0:`written_in`]->(t2@`book_language`)\nWHERE t1.`language_id` = t2.`language_id`\nAND (t1.`title` = 'Zorro')\nRETURN t2.`language_name` AS `language_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the language of the book titled Zorro?",
    "evidence": "\"Zorro\" is the title of the book; langauge refers to language_name",
    "idx": 3131
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t2@`book`)-[written_in_0:`written_in`]->(t1@`book_language`)\nMATCH (t2@`book`)-[published_by_0:`published_by`]->(t3@`publisher`)\nWHERE t1.`language_id` = t2.`language_id`\nAND t3.`publisher_id` = t2.`publisher_id`\nAND (t3.`publisher_name` = 'Ace Book')\nRETURN cast (sum(CASE  WHEN t1.`language_name` = 'English' THEN 1 ELSE 0 END) as float) * 100 / COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In books published by Ace Book, what is the percentage of English books published?",
    "evidence": "\"Ace Book\" is the publisher_name; English book refers to language_name = 'English'; percentage = Divide (Count(book_id where language_name = 'English'), Count(book_id)) * 100",
    "idx": 3134
  },
  {
    "filename": "train.json",
    "db_id": "books",
    "gql_statement": "MATCH (t1@`book`)\nMATCH (t2@`order_line`)\nWHERE t1.`book_id` = t2.`book_id`\nAND (t2.`price` < 1)\nRETURN sum(CASE  WHEN t1.`num_pages` < 500 THEN 1 ELSE 0 END) - sum(CASE  WHEN t1.`num_pages` > 500 THEN 1 ELSE 0 END) AS `dif`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the books purchased by less than 1 dollar, what is the difference between the number of books with less than 500 pages and books with greater than 500 pages?",
    "evidence": "book purchased by less than 1 dollar refers to price < 1; books with less than 500 pages refers to num_pages < 500; greater than 500 pages refers to num_pages > 500; Difference = Subtract (Count(book_id where num_pages < 500), Count(book_id where num_pages > 500))",
    "idx": 3135
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nMATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t3@`establishment`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND t2.`license_no` = t3.`license_no`\nAND (t2.`inspection_date` = date('2010-05-11') AND t3.`dba_name` = 'AMUNDSEN HIGH SCHOOL' AND t1.`title` = 'Sanitarian')\nRETURN t1.`first_name` AS `first_name`, t1.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the sanitarian who inspected Amundsen High School on 2010/5/11?",
    "evidence": "full name refers to first_name, last_name;  Amundsen High School refers to dba_name = 'AMUNDSEN HIGH SCHOOL'; on 2010/5/11 refers to inspection_date = '2010-05-11'",
    "idx": 3140
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t1@`inspection`)-[performed_at_0:`performed_at`]->(t2@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t2.`dba_name` = 'Azha Restaurant Inc.' AND t1.`results` = 'Pass' AND t1.`inspection_date` = date('2010-01-21'))\nRETURN t1.`followup_to` AS `followup_to`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "After Azha Restaurant Inc. passed the inspection on 2010/1/21, when was the follow-up inspection done?",
    "evidence": "Azha Restaurant Inc. refers to dba_name = 'Azha Restaurant Inc.'; on 2010/1/21 refers to inspection_date = '2010-01-21'; follow-up inspection date refers to followup_to",
    "idx": 3142
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nRETURN cast (sum(CASE  WHEN like(cast (t2.`inspection_date` as string),'2010%') THEN 1 ELSE 0 END) as float) / sum(CASE  WHEN t1.`salary` > 70000 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of inspections carried out in the year 2010 by a sanitarian whose salary is over 70000?",
    "evidence": "in the year 2010 refers to inspection_date like '2010%'; salary is over 70000 refers to salary > 70000; average number = divide(sum(inspection where inspection_date like '2010%'), sum(employee_id where salary > 70000))",
    "idx": 3143
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t1.`facility_type` = 'Restaurant' AND t1.`dba_name` = 'All Style Buffet')\nRETURN COUNT(t2.`inspection_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many inspections did All Style Buffet Restaurant have?",
    "evidence": "All Style Buffet refers to dba_name = 'All Style Buffet'; Restaurant refers to facility_type = 'Restaurant'",
    "idx": 3146
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t2.`inspection_date` = date('2015-05-08') AND t1.`facility_type` = 'Restaurant')\nRETURN COUNT(t2.`license_no`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants were inspected on 2015/5/8?",
    "evidence": "restaurant refers to facility_type = 'Restaurant'; on 2015/5/8 refers to inspection_date = '2015-05-08'",
    "idx": 3147
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t1.`address` = '3635 W DIVERSEY AVE ' AND t1.`facility_type` = 'Grocery Store')\nRETURN COUNT(t2.`inspection_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the grocery store located at \"3635 W DIVERSEY AVE\", how many inspections did it have?",
    "evidence": "grocery store refers to facility_type = 'Grocery Store'; \"3635 W DIVERSEY AVE\" refers to address = '3635 W DIVERSEY AVE'",
    "idx": 3149
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t1.`risk_level` = 3 AND t1.`facility_type` = 'TAVERN')\nRETURN cast (COUNT(t2.`inspection_id`) as float) / COUNT(DISTINCT t1.`license_no`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of inspections did risk level 3 taverns have?",
    "evidence": "risk level 3 refers to risk_level = '3'; tavern refers to facility_type = 'TAVERN'; average number = divide(count(inspection_id), sum(license_no)) where risk_level = '3' and facility_type = 'TAVERN'",
    "idx": 3153
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (establishment@`establishment`)\nWHERE establishment.`address` = '2903 W IRVING PARK RD '\nRETURN DISTINCT establishment.`dba_name` AS `dba_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the assumed name of the business located at 2903 W Irving Park Rd?",
    "evidence": "assumed name refers to dba_name; 2903 W Irving Park Rd refers to address = '2903 W IRVING PARK RD '",
    "idx": 3155
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (employee@`employee`)\nORDER BY employee.`salary`  NULLS FIRST \nRETURN employee.`first_name` AS `first_name`, employee.`last_name` AS `last_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the employee with the lowest salary?",
    "evidence": "full name refers to first_name, last_name; the lowest salary refers to min(salary)",
    "idx": 3156
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (establishment@`establishment`)\nWHERE establishment.`risk_level` = 2 AND establishment.`dba_name` = 'HOMEMADE PIZZA'\nRETURN COUNT(establishment.`license_no`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many establishments that are doing business as Homemade Pizza have a risk level of 2?",
    "evidence": "Homemade Pizza refers to dba_name = 'HOMEMADE PIZZA'; a risk level of 2 refers to risk_level = 2",
    "idx": 3157
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH ()-[violation:`has_violation`]->()\nWHERE violation.`point_id` = 3 AND violation.`fine` = 500\nRETURN COUNT(violation.`inspection_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many inspections with critical food safety problems are under inspection point id 3?",
    "evidence": "critical food safety problems refers to fine = 500; point_id = 3",
    "idx": 3158
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL {\nMATCH (employee_sub0@`employee`)\nWHERE employee_sub0.`first_name` = 'Gregory' AND employee_sub0.`last_name` = 'Cardenas'\nRETURN employee_sub0.`employee_id` AS `employee_id` \n}\nMATCH (t1@`employee`)\nWHERE t1.`supervisor` = employee_id\nRETURN COUNT(t1.`employee_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many employees are under Gregory Cardenas?",
    "evidence": "",
    "idx": 3159
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t1.`first_name` = 'David' AND t1.`last_name` = 'Hodges' AND t1.`employee_id` = 153225 AND t2.`inspection_type` = 'Short Form Complaint' AND t2.`results` = 'Pass')\nRETURN COUNT(DISTINCT t2.`license_no`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Out of all the short form complaint inspections done by David Hodges, how many businesses passed?",
    "evidence": "short form complaint inspection refers to inspection_type = 'Short Form Complaint'; pass refers to results = 'Pass'",
    "idx": 3160
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "CALL {\nMATCH (inspection_sub0@`inspection`)\nRETURN inspection_sub0.`employee_id` AS `employee_id`, COUNT(inspection_sub0.`inspection_id`) AS `_col_1` \nGROUP BY employee_id\nORDER BY _col_1 DESC NULLS LAST \nLIMIT 1\n}\nMATCH (t1@`employee`)\nWHERE t1.`employee_id` = employee_id\nRETURN t1.`salary` AS `salary`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the salary of the employee who has the highest number of inspections done of all time?",
    "evidence": "the highest number of inspections done refers to max(count(employee_id))",
    "idx": 3161
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nMATCH (t2@`inspection`)-[t3:`has_violation`]->()\nWHERE t1.`license_no` = t2.`license_no`\nAND t2.`inspection_id` = t3.`inspection_id`\nAND (t2.`inspection_date` = date('2010-01-25') AND t1.`dba_name` = 'TAQUERIA LA FIESTA')\nRETURN t3.`inspector_comment` AS `inspector_comment`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the comments of the inspector during the inspection of Taqueria La Fiesta on 1/25/2010?",
    "evidence": "comment of the inspector refers to inspector_comment; Taqueria La Fiesta refers to dba_name = 'TAQUERIA LA FIESTA'; on 1/25/2010 refers to inspection_date = '2010-01-25'",
    "idx": 3162
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (employee@`employee`)\nWHERE employee.`address` = '7211 S Hermitage Ave' AND employee.`city` = 'Chicago' AND employee.`state` = 'IL'\nRETURN employee.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the employee's last name at 7211 S Hermitage Ave, Chicago, IL?",
    "evidence": "7211 S Hermitage Ave refers to address = '7211 S Hermitage Ave'; Chicago refers to city = 'Chicago'; IL refers to state = 'IL'",
    "idx": 3165
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nMATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t3@`employee`)\nWHERE t1.`license_no` = t2.`license_no`\nAND t2.`employee_id` = t3.`employee_id`\nAND (t2.`inspection_date` = date('2010-05-05') AND t2.`inspection_id` = 44256)\nRETURN t1.`dba_name` AS `dba_name`, t3.`first_name` AS `first_name`, t3.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the establishment's name and employee involved in the inspection ID 44256 on May 5, 2010?",
    "evidence": "establishment's name refers to dba_name; employee name refers to first_name, last_name; inspection ID 44256 refers to inspection_id = 44256; on May 5, 2010 refers to inspection_date = '2010-05-05'",
    "idx": 3166
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t2.`inspection_date` = date('2010-03-09') AND t2.`inspection_type` = 'Canvass')\nRETURN DISTINCT t1.`first_name` AS `first_name`, t1.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the employee's full name involved in the canvass inspection type on March 09, 2010?",
    "evidence": "full name refers to first_name, last_name; canvass inspection type refers to inspection_type = 'Canvass'; on March 09, 2010 refers to inspection_date = '2010-03-09'",
    "idx": 3167
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t1.`risk_level` = 3 AND t2.`results` = 'Pass' AND t1.`facility_type` = 'Restaurant')\nRETURN COUNT(DISTINCT t1.`license_no`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many restaurants with the highest risk level still passed the inspection?",
    "evidence": "restaurant refers to facility_type = 'Restaurant'; the highest risk level refers to max(risk_level); pass the inspection refers to results = 'Pass'",
    "idx": 3169
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t2.`inspection_id` = 60332)\nRETURN t1.`title` AS `title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the title of the employee involved in inspection ID 60332?",
    "evidence": "",
    "idx": 3171
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH ()-[t2:`has_violation`]->(t1@`inspection_point`)\nWHERE t1.`point_id` = t2.`point_id`\nAND (t2.`inspection_id` = 44247)\nRETURN t1.`description` AS `description`, t2.`inspector_comment` AS `inspector_comment`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the inspection description and inspector's comments in the inspection ID 164795?",
    "evidence": "inspection description refers to Description; inspector's comment refers to inspector_comment",
    "idx": 3174
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH ()-[t2:`has_violation`]->(t1@`inspection_point`)\nWHERE t1.`point_id` = t2.`point_id`\nAND (t2.`inspection_id` = 54216 AND t2.`point_id` = 34)\nRETURN t2.`inspector_comment` AS `inspector_comment`, t1.`code` AS `code`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the inspector's comments and clean operating requirement code for inspection ID 54216 and point ID 34?",
    "evidence": "inspector's comment refers to inspector_comment; clean operating requirement code refers to code",
    "idx": 3175
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t2.`results` = 'Fail')\nRETURN cast (COUNT(CASE  WHEN t1.`risk_level` = 3 THEN t1.`license_no`  END) as float) * 100 / COUNT(t1.`risk_level`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the establishments that failed in the inspection, what is the percentage of establishments with the highest risk level?",
    "evidence": "failed in inspection refers to results = 'Fail'; the highest risk level refers to max(risk_level); percentage = divide(count(license_no where risk_level = max(risk_level)), count(license_no)) * 100% where results = 'Fail'",
    "idx": 3176
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nMATCH (t2@`inspection`)-[t3:`has_violation`]->()\nWHERE t1.`employee_id` = t2.`employee_id`\nAND t2.`inspection_id` = t3.`inspection_id`\nAND (t1.`salary` >= 75000 AND t1.`salary` <= 80000)\nRETURN sum(CASE  WHEN t3.`fine` = 100 THEN 1 ELSE 0 END) - sum(CASE  WHEN t3.`fine` = 500 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the employees that receive a salary between $75000 to $85000, what is the difference between the number of employees which undergone an inspection that fined 100 and 500?",
    "evidence": "salary between $75000 and $85000 refers to 75000 < = salary < = 80000; difference = subtract(count(inspection_id where fine = 100), count(inspection_id where fine = 500)) where 75000 < = salary < = 80000",
    "idx": 3177
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH ()-[t1:`has_violation`]->(t2@`inspection_point`)\nWHERE t1.`point_id` = t2.`point_id`\nAND (t2.`category` = 'Personnel')\nRETURN COUNT(t1.`inspection_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many inspections were done under the personnel category?",
    "evidence": "under the personnel category refers to category = 'Personnel'",
    "idx": 3180
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nMATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t3@`employee`)\nWHERE t1.`license_no` = t2.`license_no`\nAND t2.`employee_id` = t3.`employee_id`\nAND (t2.`inspection_date` = date('2012-11-20') AND t3.`first_name` = 'Sarah' AND t3.`last_name` = 'Lindsey')\nRETURN DISTINCT t1.`dba_name` AS `dba_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which facilities were inspected by Sarah Lindsey on 20th November 2012?",
    "evidence": "facility name refers to dba_name; on 20th November 2012 refers to inspection_date = '2012-11-20'",
    "idx": 3183
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH ()-[t2:`has_violation`]->(t1@`inspection_point`)\nWHERE t1.`point_id` = t2.`point_id`\nAND (t1.`category` = 'Display of Inspection Report Summary')\nRETURN COUNT(t2.`inspection_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many inspections were done under the display of inspection report summary category?",
    "evidence": "under the display of inspection report summary category refers to category = 'Display of Inspection Report Summary'",
    "idx": 3184
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nMATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t3@`employee`)\nWHERE t1.`license_no` = t2.`license_no`\nAND t2.`employee_id` = t3.`employee_id`\nAND (t1.`dba_name` = 'JEAN SAMOCKI')\nRETURN t3.`first_name` AS `first_name`, t3.`last_name` AS `last_name`, t2.`results` AS `results`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who inspected Jean Samocki and what was the result?",
    "evidence": "employee's name refers to first_name, last_name; Jean Samocki refers to dba_name = 'JEAN SAMOCKI'",
    "idx": 3186
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nMATCH (t2@`inspection`)-[t3:`has_violation`]->()\nWHERE t1.`license_no` = t2.`license_no`\nAND t2.`inspection_id` = t3.`inspection_id`\nAND (t1.`dba_name` = 'HACIENDA LOS TORRES' AND t1.`ward` = 36 AND t2.`results` = 'Fail')\nRETURN sum(t3.`fine`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much did Hacienda Los Torres from ward 36 fine for failing an inspection?",
    "evidence": "Hacienda Los Torres refers to dba_name = 'HACIENDA LOS TORRES'; ward 36 refers to ward = 36; failing an inspection refers to results = 'Fail';",
    "idx": 3187
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[performed_at_0:`performed_at`]->(t1@`establishment`)\nWHERE t1.`license_no` = t2.`license_no`\nAND (t1.`city` = 'CHICAGO')\nRETURN cast (COUNT(CASE  WHEN like(t2.`results`,'%Pass%') THEN t2.`inspection_id`  END) as float) * 100 / COUNT(t2.`inspection_id`) AS `_col_0`, COUNT(DISTINCT t2.`license_no`) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of inspections with verified quality. Among them, how many businesses were from Chicago?",
    "evidence": "verified quality refers to results like 'Pass%'; from Chicago refers to city = 'CHICAGO'; percentage = divide(count(inspection_id where results like 'Pass%'), sum(inspection_id)) * 100%",
    "idx": 3190
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t2.`inspection_id` = 48225)\nRETURN t1.`first_name` AS `first_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Provide the first name of employee who did inspection ID 48225?",
    "evidence": "",
    "idx": 3191
  },
  {
    "filename": "train.json",
    "db_id": "food_inspection_2",
    "gql_statement": "MATCH (t2@`inspection`)-[conducted_by_0:`conducted_by`]->(t1@`employee`)\nWHERE t1.`employee_id` = t2.`employee_id`\nAND (t2.`inspection_id` = 52238)\nRETURN t1.`address` AS `address`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Tell the address of employee who did inspection ID 52238?",
    "evidence": "",
    "idx": 3192
  }
]