[
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nMATCH (`t1`:`products`)-[has_color_0:has_color]->(`t4`:`ref_colors`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND `t1`.`color_code` = `t4`.`color_code`\nAND (`t4`.`color_description` = 'red' AND `t3`.`characteristic_name` = 'fast')\nRETURN `t1`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the products that have a color description of 'red' and the 'fast' characteristic?",
    "evidence": "",
    "idx": 5799
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t3`.`characteristic_name` = 'hot')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many products have the characteristic named \"hot\"?",
    "evidence": "",
    "idx": 5800
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t3`.`characteristic_name` = 'warm')\nRETURN DISTINCT `t1`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the all the distinct names of the products with the characteristic name 'warm'.",
    "evidence": "",
    "idx": 5802
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t3`.`characteristic_name` = 'warm')\nRETURN DISTINCT `t1`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different product names for products that have the 'warm' characteristic:?",
    "evidence": "",
    "idx": 5803
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nMATCH (`t1`:`products`)-[has_color_0:has_color]->(`t4`:`ref_colors`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND `t1`.`color_code` = `t4`.`color_code`\nAND (`t4`.`color_description` = 'red' AND `t3`.`characteristic_name` = 'slow')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many products have the color description 'red' and the characteristic name 'slow'?",
    "evidence": "",
    "idx": 5805
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nMATCH (`t1`:`products`)-[has_color_0:has_color]->(`t4`:`ref_colors`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND `t1`.`color_code` = `t4`.`color_code`\nAND (`t4`.`color_description` = 'white' OR `t3`.`characteristic_name` = 'hot')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the products that have the color description \"white\" or have the characteristic name \"hot\".",
    "evidence": "",
    "idx": 5806
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nMATCH (`t1`:`products`)-[has_color_0:has_color]->(`t4`:`ref_colors`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND `t1`.`color_code` = `t4`.`color_code`\nAND (`t4`.`color_description` = 'white' OR `t3`.`characteristic_name` = 'hot')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many products have their color described as 'white' or have a characteristic with the name 'hot'?",
    "evidence": "",
    "idx": 5807
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`ref_product_categories`:`ref_product_categories`)\nWHERE `ref_product_categories`.`product_category_code` = 'Herbs'\nRETURN `ref_product_categories`.`unit_of_measure` AS `unit_of_measure`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the unit of measuerment of the product category code \"Herbs\"?",
    "evidence": "",
    "idx": 5808
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`ref_product_categories`:`ref_product_categories`)\nWHERE `ref_product_categories`.`product_category_code` = 'Spices'\nRETURN `ref_product_categories`.`product_category_description` AS `product_category_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the product category description of the product category with code \"Spices\".",
    "evidence": "",
    "idx": 5810
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`ref_product_categories`:`ref_product_categories`)\nWHERE `ref_product_categories`.`product_category_code` = 'Herbs'\nRETURN `ref_product_categories`.`product_category_description` AS `product_category_description`, `ref_product_categories`.`unit_of_measure` AS `unit_of_measure`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the product category description and unit of measurement of category \"Herbs\"?",
    "evidence": "",
    "idx": 5812
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_category_0:has_category]->(`t2`:`ref_product_categories`)\nWHERE `t1`.`product_category_code` = `t2`.`product_category_code`\nAND (`t1`.`product_name` = 'cumin')\nRETURN `t2`.`unit_of_measure` AS `unit_of_measure`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the unit of measurement of product named \"cumin\"?",
    "evidence": "",
    "idx": 5814
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_category_0:has_category]->(`t2`:`ref_product_categories`)\nWHERE `t1`.`product_category_code` = `t2`.`product_category_code`\nAND (`t1`.`product_name` = 'chervil')\nRETURN `t2`.`unit_of_measure` AS `unit_of_measure`, `t2`.`product_category_code` AS `product_category_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the unit of measurement and product category code of product named \"chervil\".",
    "evidence": "",
    "idx": 5816
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_category_0:has_category]->(`t2`:`ref_product_categories`)\nWHERE `t1`.`product_category_code` = `t2`.`product_category_code`\nAND (`t1`.`product_name` = 'chervil')\nRETURN `t2`.`unit_of_measure` AS `unit_of_measure`, `t2`.`product_category_code` AS `product_category_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the unit of measure and category code for the 'chervil' product?",
    "evidence": "",
    "idx": 5817
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_category_0:has_category]->(`t2`:`ref_product_categories`)\nMATCH (`t1`:`products`)-[has_color_0:has_color]->(`t3`:`ref_colors`)\nWHERE `t1`.`product_category_code` = `t2`.`product_category_code`\nAND `t1`.`color_code` = `t3`.`color_code`\nAND (`t3`.`color_description` = 'white' AND `t2`.`unit_of_measure` <> 'Handful')\nRETURN `t1`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the product names that are colored 'white' but do not have unit of measurement \"Handful\".",
    "evidence": "",
    "idx": 5818
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_category_0:has_category]->(`t2`:`ref_product_categories`)\nMATCH (`t1`:`products`)-[has_color_0:has_color]->(`t3`:`ref_colors`)\nWHERE `t1`.`product_category_code` = `t2`.`product_category_code`\nAND `t1`.`color_code` = `t3`.`color_code`\nAND (`t3`.`color_description` = 'white' AND `t2`.`unit_of_measure` <> 'Handful')\nRETURN `t1`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of products that are not 'white' in color and are not measured by the unit 'Handful'?",
    "evidence": "",
    "idx": 5819
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "WITH *, COLLECT { MATCH (`products_sub0`:`products`)\nRETURN `products_sub0`.`color_code` AS `color_code`   } AS in_collect_0\nMATCH (`ref_colors`:`ref_colors`)\nWHERE NOT `ref_colors`.`color_code` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many colors are never used by any product?",
    "evidence": "",
    "idx": 5822
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "WITH *, COLLECT { MATCH (`products_sub0`:`products`)\nRETURN `products_sub0`.`color_code` AS `color_code`   } AS in_collect_0\nMATCH (`ref_colors`:`ref_colors`)\nWHERE NOT `ref_colors`.`color_code` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of colors that are not used in any products.",
    "evidence": "",
    "idx": 5823
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`event`:`event`)\nORDER BY `event`.`year` IS NULL ASC, `event`.`year` DESC \nRETURN `event`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the event names by year from the most recent to the oldest.",
    "evidence": "",
    "idx": 5825
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`stadium`:`stadium`)\nORDER BY `stadium`.`capacity` IS NULL ASC, `stadium`.`capacity` DESC \nRETURN `stadium`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the stadium that has the maximum capacity.",
    "evidence": "",
    "idx": 5828
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "CALL(*) {\nMATCH (`stadium_sub0`:`stadium`)\nRETURN avg(`stadium_sub0`.`capacity`) AS `_col_0`  \n}\nMATCH (`stadium`:`stadium`)\nWHERE `stadium`.`capacity` < `_col_0`\nRETURN `stadium`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of stadiums whose capacity is smaller than the average capacity.",
    "evidence": "",
    "idx": 5829
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`stadium`:`stadium`)\nWHERE `stadium`.`country` <> 'Russia'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many stadiums are not in country \"Russia\"?",
    "evidence": "",
    "idx": 5833
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`swimmer`:`swimmer`)\nORDER BY `swimmer`.`meter_100` IS NULL DESC, `swimmer`.`meter_100`  \nRETURN `swimmer`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all swimmers, sorted by their 100 meter scores in ascending order.",
    "evidence": "",
    "idx": 5834
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`swimmer`:`swimmer`)\nWITH `swimmer`.`nationality` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `nationality`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List countries that have more than one swimmer.",
    "evidence": "",
    "idx": 5836
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`swimmer`:`swimmer`)\nWHERE `swimmer`.`nationality` = 'Australia'\nRETURN `swimmer`.`meter_200` AS `meter_200`, `swimmer`.`meter_300` AS `meter_300`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all 200 meter and 300 meter results of swimmers with nationality \"Australia\".",
    "evidence": "",
    "idx": 5837
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`t1`:`swimmer`)-[t2:participated_in]->()\nWHERE `t1`.`id` = `t2`.`swimmer_id`\nAND (`t2`.`result` = 'Win')\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of swimmers who has a result of \"win\".",
    "evidence": "",
    "idx": 5838
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`t2`:`event`)-[held_in_0:held_in]->(`t1`:`stadium`)\nWHERE `t1`.`id` = `t2`.`stadium_id`\nAND (`t2`.`name` = 'World Junior')\nRETURN `t1`.`name` AS `name`, `t1`.`capacity` AS `capacity`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and capacity of the stadium where the event named \"World Junior\" happened.",
    "evidence": "",
    "idx": 5839
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "WITH *, COLLECT { MATCH (`event_sub0`:`event`)\nRETURN `event_sub0`.`stadium_id` AS `stadium_id`   } AS in_collect_0\nMATCH (`stadium`:`stadium`)\nWHERE NOT `stadium`.`id` IN in_collect_0\nRETURN `stadium`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of stadiums which have never had any event.",
    "evidence": "",
    "idx": 5840
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[record_sub0:participated_in]->()\nRETURN `record_sub0`.`swimmer_id` AS `swimmer_id`   } AS in_collect_0\nMATCH (`swimmer`:`swimmer`)\nWHERE NOT `swimmer`.`id` IN in_collect_0\nRETURN `swimmer`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the swimmers who have no record.",
    "evidence": "",
    "idx": 5841
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`t1`:`swimmer`)-[t2:participated_in]->(`t3`:`event`)-[held_in_0:held_in]->(`t4`:`stadium`)\nWHERE `t1`.`id` = `t2`.`swimmer_id`\nAND `t2`.`event_id` = `t3`.`id`\nAND `t4`.`id` = `t3`.`stadium_id`\nAND (`t1`.`nationality` = 'Australia')\nRETURN `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of stadiums that some Australian swimmers have been to.",
    "evidence": "",
    "idx": 5842
  },
  {
    "filename": "train_spider.json",
    "db_id": "swimming",
    "gql_statement": "MATCH (`swimmer`:`swimmer`)\nRETURN `swimmer`.`id` AS `id`, `swimmer`.`name` AS `name`, `swimmer`.`nationality` AS `nationality`, `swimmer`.`meter_100` AS `meter_100`, `swimmer`.`meter_200` AS `meter_200`, `swimmer`.`meter_300` AS `meter_300`, `swimmer`.`meter_400` AS `meter_400`, `swimmer`.`meter_500` AS `meter_500`, `swimmer`.`meter_600` AS `meter_600`, `swimmer`.`meter_700` AS `meter_700`, `swimmer`.`time` AS `time`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all details for each swimmer.",
    "evidence": "",
    "idx": 5843
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`railway`:`railway`)\nRETURN `railway`.`builder` AS `builder` ORDER BY `builder` IS NULL DESC, `builder`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the builders of railways in ascending alphabetical order.",
    "evidence": "",
    "idx": 5846
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`railway`:`railway`)\nRETURN `railway`.`wheels` AS `wheels`, `railway`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the wheels and locations of the railways.",
    "evidence": "",
    "idx": 5847
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`manager`:`manager`)\nWHERE `manager`.`country` <> 'Australia\t'\nRETURN MAX(`manager`.`level`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum level of managers in countries that are not \"Australia\"?",
    "evidence": "",
    "idx": 5848
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`t2`:`train`)-[operated_by_0:operated_by]->(`t1`:`railway`)\nWHERE `t1`.`railway_id` = `t2`.`railway_id`\nRETURN `t2`.`name` AS `name`, `t1`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of trains and locations of railways they are in.",
    "evidence": "",
    "idx": 5853
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`t2`:`train`)-[operated_by_0:operated_by]->(`t1`:`railway`)\nWHERE `t1`.`railway_id` = `t2`.`railway_id`\nAND (`t2`.`name` = 'Andaman Exp')\nRETURN `t1`.`builder` AS `builder`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the builder of railways associated with the trains named \"Andaman Exp\".",
    "evidence": "",
    "idx": 5854
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`railway`:`railway`)\nWITH `railway`.`builder` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `builder`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different builders of railways, along with the corresponding number of railways using each builder.",
    "evidence": "",
    "idx": 5855
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`railway`:`railway`)\nWITH `railway`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `location`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different locations of railways along with the corresponding number of railways at each location.",
    "evidence": "",
    "idx": 5856
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`railway`:`railway`)\nWITH `railway`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the locations that have more than one railways.",
    "evidence": "",
    "idx": 5857
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "WITH *, COLLECT { MATCH (`train_sub0`:`train`)\nRETURN `train_sub0`.`railway_id` AS `railway_id`   } AS in_collect_0\nMATCH (`railway`:`railway`)\nWHERE NOT `railway`.`railway_id` IN in_collect_0\nRETURN `railway`.`objectnumber` AS `objectnumber`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the object number of railways that do not have any trains.",
    "evidence": "",
    "idx": 5858
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`manager`:`manager`)\nRETURN DISTINCT `manager`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the distinct countries of managers.",
    "evidence": "",
    "idx": 5859
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`manager`:`manager`)\nORDER BY `manager`.`level` IS NULL ASC, `manager`.`level` DESC \nRETURN `manager`.`working_year_starts` AS `working_year_starts`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the working years of managers in descending order of their level.",
    "evidence": "",
    "idx": 5860
  },
  {
    "filename": "train_spider.json",
    "db_id": "railway",
    "gql_statement": "MATCH (`manager`:`manager`)\nWHERE `manager`.`age` > 50 OR `manager`.`age` < 46\nRETURN `manager`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the countries that have managers of age above 50 or below 46.",
    "evidence": "",
    "idx": 5861
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_products_contacts",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nRETURN DISTINCT `addresses`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all distinct cities in the address record.",
    "evidence": "",
    "idx": 5863
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_products_contacts",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nWITH `addresses`.`state_province_county` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `state_province_county`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show each state and the number of addresses in each state.",
    "evidence": "",
    "idx": 5864
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_products_contacts",
    "gql_statement": "MATCH (`customers`:`customers`)\nORDER BY `customers`.`customer_number` IS NULL ASC, `customers`.`customer_number` DESC \nRETURN `customers`.`customer_name` AS `customer_name`, `customers`.`customer_phone` AS `customer_phone`, `customers`.`payment_method_code` AS `payment_method_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name, phone, and payment method code for all customers in descending order of customer number.",
    "evidence": "",
    "idx": 5867
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_products_contacts",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN min(`products`.`product_price`) AS `_col_0`, MAX(`products`.`product_price`) AS `_col_1`, avg(`products`.`product_price`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the minimum, maximum, average price for all products.",
    "evidence": "",
    "idx": 5868
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_products_contacts",
    "gql_statement": "MATCH (`t2`:`customers`)-[t1:has_address]->(`t3`:`addresses`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t1`.`address_id` = `t3`.`address_id`\nRETURN `t2`.`customer_name` AS `customer_name`, `t3`.`city` AS `city`, `t1`.`date_from` AS `date_from`, `t1`.`date_to` AS `date_to`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the customer name, customer address city, date from, and date to for each customer address history.",
    "evidence": "",
    "idx": 5870
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_products_contacts",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_price` > 1000 OR `products`.`product_price` < 500\nRETURN `products`.`product_type_code` AS `product_type_code`, `products`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the product type and name for the products with price higher than 1000 or lower than 500.",
    "evidence": "",
    "idx": 5871
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nWHERE `dorm`.`gender` = 'F'\nRETURN `dorm`.`dorm_name` AS `dorm_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of dorms only for female (F gender).",
    "evidence": "",
    "idx": 5872
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nWHERE `dorm`.`student_capacity` > 300\nRETURN `dorm`.`dorm_name` AS `dorm_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of dorms that can accommodate more than 300 students.",
    "evidence": "",
    "idx": 5874
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`age` > 20\nRETURN `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name of students who is older than 20.",
    "evidence": "",
    "idx": 5878
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`city_code` = 'PHL' AND `student`.`age` >= 20 AND `student`.`age` <= 25\nRETURN `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first name of students living in city PHL whose age is between 20 and 25.",
    "evidence": "",
    "idx": 5880
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`city_code` = 'PHL' AND `student`.`age` >= 20 AND `student`.`age` <= 25\nRETURN `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name of the students who are in age 20 to 25 and living in PHL city?",
    "evidence": "",
    "idx": 5881
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm_amenity`:`dorm_amenity`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of distinct amenities.",
    "evidence": "",
    "idx": 5884
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nRETURN sum(`dorm`.`student_capacity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total capacity of all dorms.",
    "evidence": "",
    "idx": 5886
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nRETURN sum(`dorm`.`student_capacity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total student capacity of all dorms?",
    "evidence": "",
    "idx": 5887
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`city_code` AS _groupby_col_0, avg(`student`.`age`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `city_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age of all students living in the each city.",
    "evidence": "",
    "idx": 5890
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nWHERE `dorm`.`gender` = 'X'\nRETURN avg(`dorm`.`student_capacity`) AS `_col_0`, sum(`dorm`.`student_capacity`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average and total capacity of dorms for the students with gender X.",
    "evidence": "",
    "idx": 5892
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nWHERE `dorm`.`gender` = 'X'\nRETURN avg(`dorm`.`student_capacity`) AS `_col_0`, sum(`dorm`.`student_capacity`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average and total capacity for all dorms who are of gender X?",
    "evidence": "",
    "idx": 5893
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[has_amenity_sub0:has_amenity]->()\nRETURN `has_amenity_sub0`.`dormid` AS `dormid`   } AS in_collect_0\nMATCH (`dorm`:`dorm`)\nWHERE NOT `dorm`.`dormid` IN in_collect_0\nRETURN `dorm`.`dorm_name` AS `dorm_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of dorms that do not have any amenity",
    "evidence": "",
    "idx": 5896
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[has_amenity_sub0:has_amenity]->()\nRETURN `has_amenity_sub0`.`dormid` AS `dormid`   } AS in_collect_0\nMATCH (`dorm`:`dorm`)\nWHERE NOT `dorm`.`dormid` IN in_collect_0\nRETURN `dorm`.`dorm_name` AS `dorm_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all the dorms that don't have any amenities?",
    "evidence": "",
    "idx": 5897
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nRETURN COUNT(DISTINCT `dorm`.`gender`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of distinct gender for dorms.",
    "evidence": "",
    "idx": 5898
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nWHERE `dorm`.`dorm_name` =~ '(?i)(?s).*Donor.*'\nRETURN `dorm`.`student_capacity` AS `student_capacity`, `dorm`.`gender` AS `gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the capacity and gender type of the dorm whose name has substring ‘Donor’.",
    "evidence": "",
    "idx": 5900
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`dorm`:`dorm`)\nWHERE `dorm`.`student_capacity` > 300 OR `dorm`.`student_capacity` < 100\nRETURN `dorm`.`dorm_name` AS `dorm_name`, `dorm`.`gender` AS `gender`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and gender type of the dorms whose capacity is greater than 300 or less than 100.",
    "evidence": "",
    "idx": 5902
  },
  {
    "filename": "train_spider.json",
    "db_id": "dorm_1",
    "gql_statement": "MATCH (`student`:`student`)\nRETURN COUNT(DISTINCT `student`.`major`) AS `_col_0`, COUNT(DISTINCT `student`.`city_code`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the numbers of different majors and cities.",
    "evidence": "",
    "idx": 5904
  }
]