[
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_cast`]->(t3@`person`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`person_id` = t3.`person_id`\nAND (t1.`title` = 'Pirates of the Caribbean: The Curse of the Black Pearl' AND t3.`person_name` = 'Orlando Bloom')\nRETURN t2.`character_name` AS `character_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which character did Orlando Bloom play in the movie Pirates of the Caribbean: The Curse of the Black Pearl?",
    "evidence": "Which character refers to character_name; movie Pirates of the Caribbean: The Curse of the Black Pearl refers to title = 'Pirates of the Caribbean: The Curse of the Black Pearl'",
    "idx": 299
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (t1@`movie`)-[t2:`has_genre`]->(t3@`genre`)\nWHERE t1.`movie_id` = t2.`movie_id`\nAND t2.`genre_id` = t3.`genre_id`\nRETURN cast (COUNT(CASE  WHEN t3.`genre_name` = 'Horror' THEN t1.`movie_id` ELSE NULL END) as float) / COUNT(t1.`movie_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of horror movies among all movies genre?",
    "evidence": "horror movies refers to genre_name = 'horror'; average number = divide(sum(movie_id) when genre_name = 'horror', count(movie_id))",
    "idx": 300
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (method@`method`)\nWHERE method.`lang` = 'en' AND method.`commentisxml` = 1\nRETURN COUNT(method.`lang`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many English language codes whose comments for the method are in the XML format?",
    "evidence": "English language refers to Lang = 'en'; the comments for this method is XML format refers to CommentIsXml = 1;",
    "idx": 302
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "CALL {\nMATCH (solution_sub0@`solution`)\nRETURN MAX(solution_sub0.`processedtime`) AS `_col_0` \n}\nMATCH (solution@`solution`)\nWHERE solution.`processedtime` = _col_0\nRETURN solution.`path` AS `path`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the solution path with the highest processed time?",
    "evidence": "highest processed time refers to max(ProcessedTime);",
    "idx": 306
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "CALL {\nMATCH (repo_sub0@`repo`)\nRETURN MAX(repo_sub0.`watchers`) AS `_col_0` \n}\nMATCH (repo@`repo`)\nWHERE repo.`watchers` = _col_0\nRETURN repo.`processedtime` AS `processedtime`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the processed time of downloading the most popular repository?",
    "evidence": "more watchers mean that this repository is more popular;",
    "idx": 307
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`stars` >= 6000 AND t1.`stars` <= 9000 AND t2.`wascompiled` = 0)\nRETURN t2.`repoid` AS `repoid`, COUNT(t2.`repoid`) AS `_col_1` \nGROUP BY repoid\nORDER BY _col_1 DESC NULLS LAST \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the repositories whose number of stars received are between 6,000 to 9,000, which repository has the highest number of solution paths and many of those solution paths needs to be compiled if user wants to implement it?",
    "evidence": "Stars between 6,000 to 9,000; highest number of solution paths refers to max(count(Path)); needs to be compiled if user wants to implement it refers to WasCompiled = 0;",
    "idx": 310
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t2.`id` = 12)\nRETURN t1.`url` AS `url`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the github address of the repository that contains files used by solution ID12?",
    "evidence": "github address refers to Url;",
    "idx": 320
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`forks` > 1000 AND t2.`wascompiled` = 1)\nRETURN COUNT(t2.`repoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the solutions that contain files within the repository followed by over 1000 people, how many of them can be\nimplemented without needs of compilation?",
    "evidence": "followed by over 1000 people refers to Forks >1000; can be\nimplemented without needs of compilation refers to WasCompiled = 1;",
    "idx": 321
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nRETURN CASE  WHEN sum(CASE  WHEN t2.`id` = 18 THEN t1.`watchers` ELSE 0 END) > sum(CASE  WHEN t2.`id` = 19 THEN t1.`watchers` ELSE 0 END) THEN 'SolutionID18' WHEN sum(CASE  WHEN t2.`id` = 18 THEN t1.`watchers` ELSE 0 END) < sum(CASE  WHEN t2.`id` = 19 THEN t1.`watchers` ELSE 0 END) THEN 'SolutionID19'  END AS `ismorepopular`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which solution contains files within a more popular repository, the solution ID18 or solution ID19?",
    "evidence": "more watchers mean that this repository is more popular;",
    "idx": 322
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t2.`id` = 9)\nRETURN t1.`url` AS `url`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Please give the url of the repository whose files are contained in solution ID 9?",
    "evidence": "",
    "idx": 324
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t2.`processedtime` < 636439500080712000 AND t1.`stars` > 200)\nRETURN COUNT(t2.`repoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the repositories with over 200 likes, how many of them have files contained by solutions with a processed time of under 636439500080712000?",
    "evidence": "over 200 likes refers to Stars > 200; ProcessedTime<636439500080712000;",
    "idx": 326
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nRETURN cast ((sum(CASE  WHEN t2.`id` = 18 THEN t1.`forks` ELSE 0 END) - sum(CASE  WHEN t2.`id` = 19 THEN t1.`forks` ELSE 0 END)) as float) * 100 / sum(CASE  WHEN t2.`id` = 19 THEN t1.`forks` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many more followers in percentage are there for the repository used by solution ID 18 than solution ID19?",
    "evidence": "followers refers to Forks; percentage = divide(SUBTRACT(Forks(Solution.ID = 18), Forks(Solution.ID = 19)), Forks(Solution.ID = 19))*100%",
    "idx": 329
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t2.`id` = 45997)\nRETURN t1.`stars` AS `stars`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stars does the repository of the solution No. 45997 have?",
    "evidence": "repository of solution no. refers to Id",
    "idx": 334
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`stars` = 8094)\nRETURN COUNT(t2.`repoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the repository which got '8094' Stars, how many solutions does it contain?",
    "evidence": "repository refers to Repo.Id;",
    "idx": 335
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t2.`nametokenized` = 'interp parser expr')\nRETURN t1.`processedtime` AS `processedtime`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the method which got the tokenized name as 'interp parser expr', what is the processed time for its solution?",
    "evidence": "tokenized name refers to NameTokenized; NameTokenized = 'interp parser expr'; processed time for its solution refers to ProcessedTime;",
    "idx": 337
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`watchers` = 8094)\nRETURN COUNT(t2.`repoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the repository with '8094' watchers , how many solutions does it contain?",
    "evidence": "repository refers to Repo.Id and RepoId; solutions a repository contains refers to Solution.Id;",
    "idx": 340
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`forks` = 1445)\nRETURN COUNT(t2.`repoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many solutions does the repository which has 1445 Forks contain?",
    "evidence": "solutions refers to Solution.Id; repository refers to Repository.Id;",
    "idx": 341
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`stars` = 189 AND t2.`wascompiled` = 0)\nRETURN COUNT(t2.`repoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the repository which got '189' Stars, how many solutions which needs to be compiled does it contain?",
    "evidence": "repository refers to Repository.Id; solution needs to be compiled refers to WasCompiled = 0;",
    "idx": 343
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t2.`nametokenized` = 't jadwal entity get single mpic')\nRETURN DISTINCT t1.`processedtime` AS `processedtime`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the method which got the tokenized name as 't jadwal entity get single mpic', what is the path time for its solution?",
    "evidence": "tokenized name refers to NameTokenized; NameTokenized = 't jadwal entity get single mpic'; path time for its solution refers to ProcessedTime;",
    "idx": 345
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t2.`summary` = 'Refetches the Entity FROM the persistent storage. Refetch is used to re-load an Entity which is marked \"Out-of-sync\", due to a save action. Refetching an empty Entity has no effect.')\nRETURN DISTINCT t1.`path` AS `path`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the method has the summary of \"Refetches the Entity from the persistent storage. Refetch is used to re-load an Entity which is marked \"Out-of-sync\", due to a save action. Refetching an empty Entity has no effect.\", what is its solution path?",
    "evidence": "solution path refers to Path;",
    "idx": 347
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t2.`lang` = 'sw')\nRETURN DISTINCT t1.`path` AS `path`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the solution of the most 'sw' methods, what is its path?",
    "evidence": "solution refers to SolutionId; sw refers to Lang = 'sw'; solution with the most 'sw' methods refers to MAX(COUNT(Lang = 'sw'));",
    "idx": 349
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nRETURN cast (sum(CASE  WHEN t2.`id` = 83855 THEN t1.`watchers` ELSE 0 END) - sum(CASE  WHEN t2.`id` = 1502 THEN t1.`watchers` ELSE 0 END) as float) * 100 / sum(CASE  WHEN t2.`id` = 1502 THEN t1.`watchers` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many percent more of the watchers for the repository of solution No.83855 than No.1502?",
    "evidence": "solution No. refers to Solution.Id; percentage = DIVIDE(MULTIPLY(SUBTRACT(SUM(Solution.Id = 83855), SUM(Solution.Id = 1502)), 100)), SUM(Soltution.Id = 1502);",
    "idx": 350
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nRETURN cast (sum(CASE  WHEN t2.`id` = 51424 THEN t1.`stars` ELSE 0 END) - sum(CASE  WHEN t2.`id` = 167053 THEN t1.`stars` ELSE 0 END) as float) * 100 / sum(CASE  WHEN t2.`id` = 167053 THEN t1.`stars` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many percent more of the stars for the repository of solution No.51424 than No.167053?",
    "evidence": "solution No. refers to Solution.Id; percentage = DIVIDE(MULTIPLY(SUBTRACT(SUM(Solution.Id = 51424), SUM(Solution.Id = 167053)), 100)), SUM(Solution.Id = 167053);",
    "idx": 351
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nRETURN cast (sum(CASE  WHEN t2.`id` = 53546 THEN t1.`forks` ELSE 0 END) - sum(CASE  WHEN t2.`id` = 1502 THEN t1.`forks` ELSE 0 END) as float) * 100 / sum(CASE  WHEN t2.`id` = 1502 THEN t1.`forks` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many percent more of the Forks for the repository of solution No.53546 than No.1502?",
    "evidence": "solution No. refers to Solution.Id; percentage = DIVIDE(MULTIPLY(SUBTRACT(SUM(Solution.Id = 53546), SUM(Solution.Id = 1502)), 100)), SUM(Solution.Id = 1502);",
    "idx": 352
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t2.`commentisxml` = 1)\nRETURN cast (sum(CASE  WHEN t1.`wascompiled` = 0 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`solutionid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of the methods' solutions that need to be compiled among the methods whose comments is XML format?",
    "evidence": "comment is XML format refers to CommentIsXml = 1; solution needs to be compiled refesr to WasCompiled = 0; percentage = MULTIPLY(DIVIDE(SUM(WasCompiled = 0), COUNT(Solution.Id)), 100);",
    "idx": 370
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (repo@`repo`)\nRETURN cast (sum(CASE  WHEN repo.`stars` > 2000 THEN 1 ELSE 0 END) as float) * 100 / COUNT(repo.`stars`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of respositories that receive more than 2,000 stars?",
    "evidence": "stars>2000; percentage = DIVIDE(MULTIPLY(COUNT(Stars>2000), 100), COUNT(Id));",
    "idx": 372
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t2.`id` = 1)\nRETURN t1.`url` AS `url`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the url of solution 1?",
    "evidence": "solution refers to Solution.Id; Solution.Id = 1;",
    "idx": 373
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (method@`method`)\nWHERE method.`commentisxml` = 1\nRETURN cast (sum(CASE  WHEN method.`lang` = 'en' THEN 1 ELSE 0 END) as float) * 100 / COUNT(method.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What the percentage of the english methods among the methods whose comments is XML format?",
    "evidence": "english methods refers to lang = 'en'; comment is XML format refers to CommentIsXml = 1;",
    "idx": 375
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`forks` < t1.`stars` * 1 / 3)\nRETURN COUNT(t2.`repoid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many solutions whose repository's stars are a third more than forks?",
    "evidence": "solutions refers to Solution.Id; repository stars are a third more than forks = (MULTIPLY(Stars, 1/3))>Forks;",
    "idx": 379
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t1.`repoid` = 3 AND t2.`commentisxml` = 1)\nRETURN COUNT(t2.`solutionid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the repository \"3\", how many methods whose comments is XML format?",
    "evidence": "repository refers to RepoId; RepoId = 3; method refers to Name; method whose comment is XML format refers to CommentIsXml = 1;",
    "idx": 381
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t2.`lang` = 'en')\nRETURN cast (sum(CASE  WHEN t1.`wascompiled` = 0 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`lang`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of solutions for the method that needs to be compiled in the English methods?",
    "evidence": "method that needs to be compiled refers to WasCompiled = 0; English method refers to Lang = 'en'; percentage of solutions = MULTIPLY(DIVIDE(SUM(WasCompiled = 0), COUNT(Solution.Id)), 100);",
    "idx": 382
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`stars` > cast (t1.`forks` as float) / 3)\nRETURN COUNT(DISTINCT t1.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many solutions are there whose respositories received the number of stars more than one third of the number of forks?",
    "evidence": "number of solutions are there whose repositories received the number of stars more than one third of the number of forks refers to Stars>DIVIDE(Forks, 3);",
    "idx": 384
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (method@`method`)\nWHERE method.`id` = 8\nRETURN CASE  WHEN method.`commentisxml` = 0 THEN 'isNotXMLFormat' WHEN method.`commentisxml` = 1 THEN 'isXMLFormat'  END AS `format`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What format does the method number 8's comment have?",
    "evidence": "format refers CommentIsXml; method number refers to Method_100k.Id; Method_100k.Id = 8;",
    "idx": 385
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t2.`id` = 3)\nRETURN t1.`path` AS `path`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the solution path for method number 3?",
    "evidence": "solution path refers to Path; method number refers to Method_100k.Id; Method_100k.Id = 3;",
    "idx": 387
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t2.`id` = 28 AND t1.`repoid` = 3)\nRETURN t2.`lang` AS `lang`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the language of method number 28 that can be found in the repository number 3?",
    "evidence": "language of method refers to Lang; method number refers to Method_100k.Id; Method_100k.Id = 28; repository number refers to RepoId; RepoID = 3;",
    "idx": 388
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t2.`solutionid` = 1)\nRETURN t1.`processedtime` AS `processedtime`, COUNT(t2.`solutionid`) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is solution 1's processing time and how many methods have been using this solution?",
    "evidence": "solution refers to Solution.Id and SolutionId; Solution.Id = 1; SolutionId = 1; processing time refers to ProcessedTime; methods refers to Name;",
    "idx": 389
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t2@`method`)\nMATCH (t1@`solution`)\nWHERE t1.`id` = t2.`solutionid`\nAND (t1.`repoid` = 150 AND t2.`fullcomment` IS NULL AND t2.`summary` IS NULL)\nRETURN COUNT(t2.`solutionid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many methods in repository 150 did not have a comment and a summary?",
    "evidence": "methods refers to Name; repository that did not have a comment and a summary refers to FullComment IS NULL AND Summary IS NULL;",
    "idx": 392
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`stars` = 111 AND t1.`forks` = 58 AND t1.`watchers` = 111)\nRETURN COUNT(t2.`path`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many solution path does the repository with 111 stars, 58 forks, and 111 watchers?",
    "evidence": "solution path refers to Path;",
    "idx": 403
  },
  {
    "filename": "train.json",
    "db_id": "codebase_comments",
    "gql_statement": "MATCH (t1@`repo`)\nMATCH (t2@`solution`)\nWHERE t1.`id` = t2.`repoid`\nAND (t1.`stars` = 254 AND t1.`forks` = 88 AND t1.`watchers` = 254)\nRETURN cast (sum(t2.`processedtime`) as float) / COUNT(t2.`processedtime`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average processed time of the solution with a repository of 254 likes, 88 followers, and 254 watchers?",
    "evidence": "average processed time = AVG(ProcessedTime);",
    "idx": 404
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (trains@`trains`)\nWHERE trains.`direction` = 'east'\nRETURN COUNT(trains.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many trains are there that run in the east direction?",
    "evidence": "east is a direction",
    "idx": 405
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (cars@`cars`)\nWHERE cars.`train_id` = 1\nRETURN COUNT(cars.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cars are there on train no.1?",
    "evidence": "train no.1 refers to train_id = 1",
    "idx": 406
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (cars@`cars`)\nWHERE cars.`train_id` = 1 AND cars.`position` = 4\nRETURN cars.`shape` AS `shape`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the shape of the tail car on train no.1?",
    "evidence": "train no.1 refers to train_id = 1; tail car refers to position = 4",
    "idx": 407
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (cars@`cars`)\nWHERE cars.`train_id` = 1 AND cars.`roof` = 'none'\nRETURN COUNT(cars.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cars on train no.1 have the roof open?",
    "evidence": "train no. 1 refers to train_id = 1; roof open refers to roof = 'none'",
    "idx": 408
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t2.`direction` = 'east')\nRETURN sum(CASE  WHEN t1.`shape` IN ['bucket', 'elipse'] THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the trains that run in the east direction, how many of them have at least one car in a non-regular shape?",
    "evidence": "non-regular shape refers to shape in ('elipse', 'bucket')",
    "idx": 410
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL {\nMATCH (cars_sub0@`cars`)\nWHERE cars_sub0.`len` = 'long'\nRETURN cars_sub0.`train_id` AS `train_id`, COUNT(cars_sub0.`id`) AS `longcarsnum` \nGROUP BY train_id\n}\nMATCH (t1@`trains`)\nWHERE t1.`id` = train_id\nAND (t1.`direction` = 'west')\nRETURN sum(CASE  WHEN longcarsnum > 2 THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the trains that run in the east direction, how many of them have more than 2 long cars?",
    "evidence": "more than 2 long cars refers to longCarsNum > 2",
    "idx": 413
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t1.`shape` = 'ellipse')\nRETURN t2.`direction` AS `direction`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which direction does the train with an ellipse-shape car run?",
    "evidence": "shape = 'ellipse'",
    "idx": 415
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t2.`direction` = 'east')\nRETURN sum(CASE  WHEN t1.`len` = 'short' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of short cars on all the trains that run in the east direction?",
    "evidence": "short cars refers to len = 'short'",
    "idx": 416
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t2.`direction` = 'east')\nRETURN sum(CASE  WHEN t1.`roof` = 'flat' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many cars on a train that runs in the east direction have a flat roof?",
    "evidence": "flat roof refers to roof = 'flat'",
    "idx": 417
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t2.`direction` = 'east' AND t1.`roof` = 'flat')\nRETURN sum(CASE  WHEN t1.`load_shape` = 'circle' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the cars on a train that runs in the east direction, how many of them have a flat roof and a circle load shape?",
    "evidence": "flat roof refers to roof = 'flat'; load_shape = 'circle'",
    "idx": 418
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "CALL {\nMATCH (cars_sub0@`cars`)\nWHERE cars_sub0.`shape` = 'rectangle'\nRETURN cars_sub0.`train_id` AS `train_id`, COUNT(cars_sub0.`id`) AS `rectcarsnum` \nGROUP BY train_id\n}\nMATCH (t1@`trains`)\nWHERE t1.`id` = train_id\nORDER BY rectcarsnum DESC NULLS LAST \nRETURN t1.`direction` AS `direction`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Trains that run in which direction have more rectangle-shaped cars in total?",
    "evidence": "more rectangle-shaped cars refers to MAX(rectCarsNum)",
    "idx": 419
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t2.`direction` = 'east')\nRETURN cast (COUNT(t1.`id`) as float) / COUNT(DISTINCT t1.`train_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of cars on trains that run in the east direction?",
    "evidence": "calculation = DIVIDE(count(id), count(train_id))",
    "idx": 421
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (t1@`cars`)-[belongs_to_0:`belongs_to`]->(t2@`trains`)\nWHERE t1.`train_id` = t2.`id`\nAND (t1.`shape` IN ['bucket', 'ellipse'])\nRETURN cast (COUNT(DISTINCT CASE  WHEN t2.`direction` = 'east' THEN t1.`train_id` ELSE NULL END) as float) * 100 / COUNT(DISTINCT t1.`train_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the trains that have at least one non-regular shaped car, what is the percentage of it running in the east direction?",
    "evidence": "non-regular shaped car refers to shape in ('bucket', 'ellipse'); calculation = MULTIPLY(DIVIDE(count(direction = 'east' then train_id)), count(train_id), 100)",
    "idx": 422
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (cars@`cars`)\nWHERE cars.`shape` = 'hexagon' AND cars.`len` = 'short'\nRETURN COUNT(cars.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many short cars are in the shape of hexagon?",
    "evidence": "short cars refers to len = 'short'; in the shape of hexagon refers to shape = 'hexagon'",
    "idx": 423
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (trains@`trains`)\nWHERE trains.`direction` = 'west'\nRETURN COUNT(trains.`id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many trains are running west?",
    "evidence": "west is a direction",
    "idx": 424
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (cars@`cars`)\nWHERE cars.`shape` = 'ellipse' AND cars.`len` = 'short'\nRETURN cars.`load_shape` AS `load_shape`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the load shapes of all the short ellipse cars?",
    "evidence": "short refers to len = 'short'; ellipse cars refers to shape = 'ellipse'",
    "idx": 425
  },
  {
    "filename": "train.json",
    "db_id": "trains",
    "gql_statement": "MATCH (trains@`trains`)\nWHERE trains.`direction` = 'east'\nRETURN trains.`id` AS `id`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the ids of the train running east?",
    "evidence": "east is a direction",
    "idx": 426
  }
]