[
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'ARECIBO')\nORDER BY `t1`.`avg_house_value` IS NULL ASC, `t1`.`avg_house_value` DESC \nRETURN `t1`.`zip_code` AS `zip_code`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which residential area in Arecibo county has the highest average house value? Please give its zip_code.",
    "evidence": "\"ARECIBO\" is the county; highest average house value refers to Max(avg_house_value)",
    "idx": 3954
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'ARECIBO')\nRETURN sum(`t1`.`male_population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the numbers of males in all the residential areas in Arecibo county.",
    "evidence": "\"ARECIBO\" is the county; number of males refers to Sum(male_population)",
    "idx": 3955
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'DELAWARE' AND `t1`.`daylight_savings` = 'Yes')\nRETURN COUNT(`t1`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the residential areas in Delaware, how many of them implement daylight saving?",
    "evidence": "\"Delaware\" is a county; implement daylight savings refers to daylight_saving = 'Yes'",
    "idx": 3956
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'ARECIBO')\nORDER BY `t1`.`white_population` IS NULL ASC, `t1`.`white_population` DESC \nRETURN `t1`.`zip_code` AS `zip_code`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the residential areas in Arecibo county, what is the zip_code of the one with the highest white population?",
    "evidence": "\"ARECIBO\" is the county; highest white population refers to Max(white_population)",
    "idx": 3957
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'ARECIBO')\nWITH `t2`.`county` AS _groupby_col_0\nORDER BY `t1`.`avg_income_per_household` IS NULL ASC, `t1`.`avg_income_per_household` DESC \nRETURN _groupby_col_0 AS `county`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which county is the residential area with the highest average income per household located?",
    "evidence": "highest average income per household refers to Max(avg_income_per_household)",
    "idx": 3958
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`daylight_savings` = 'Yes')\nRETURN DISTINCT `t2`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the counties with at least one residential area that implements daylight saving.",
    "evidence": "implements daylight savings refers to daylight_savings = 'Yes'",
    "idx": 3959
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'HUNTINGDON' AND `t1`.`employees` > 30)\nRETURN DISTINCT `t1`.`zip_code` AS `zip_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the zip_codes of all the residential areas in Huntingdon county with over 30 employees.",
    "evidence": "over 30 employees refers to employee > 30; 'HUNTINGDON' is the county",
    "idx": 3960
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`bad_alias` = 'URB San Joaquin')\nRETURN sum(`t1`.`asian_population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the Asian populations of all the residential areas with the bad alias \"URB San Joaquin\".",
    "evidence": "\"URB San Joaquin\" is the bad_alias",
    "idx": 3961
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`bad_alias` = 'Internal Revenue Service' AND `t1`.`time_zone` = 'Eastern')\nRETURN COUNT(`t1`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the residential areas with the bad alias \"Internal Revenue Service\", how many of them are in the Eastern time zone?",
    "evidence": "\"Internal Revenue Service\" is the bad_alias; in Eastern time zone refers to time_zone = 'Eastern'",
    "idx": 3962
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "CALL(*) {\nMATCH (`zip_data_sub0`:`zip_data`)\nRETURN MAX(`zip_data_sub0`.`avg_house_value`) AS `_col_0`  \n}\nMATCH (`t2`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`avg_house_value` = `_col_0`)\nRETURN `t2`.`bad_alias` AS `bad_alias`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the bad alias of the residential area with the highest average house value?",
    "evidence": "highest average house value refers to Max(avg_house_value)",
    "idx": 3963
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`female_median_age` > 32)\nRETURN DISTINCT `t2`.`bad_alias` AS `bad_alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the bad alias of all the residential areas with a median female age of over 32.",
    "evidence": "median female age of over 32 refers to median_female_age > 32",
    "idx": 3964
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'ARECIBO' AND `t1`.`female_population` <> 0)\nRETURN CASE WHEN `t1`.`female_population`=0 THEN NULL ELSE toFloat(`t1`.`male_population`) / `t1`.`female_population` END AS `_col_0` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest gender ratio of the residential areas in Arecibo county?",
    "evidence": "\"ARECIBO\" is the county; highest gender ration refers to Max(Divide (male_population, female_population))",
    "idx": 3965
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'ARECIBO')\nRETURN CASE WHEN COUNT(`t1`.`zip_code`)=0 THEN NULL ELSE sum(`t1`.`female_median_age`) / COUNT(`t1`.`zip_code`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average median female age of all the residential areas in the Arecibo county?",
    "evidence": "\"ARECIBO\" is the county; average median female age = Divide (Sum(median_female_age), Count(country))",
    "idx": 3966
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`female_median_age` > 32)\nWITH `t1`.`area_code` AS _groupby_col_0\nRETURN _groupby_col_0 AS `area_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the area code of the city with the female median age over 32 years old?",
    "evidence": "",
    "idx": 3967
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`alias`)-[is_alias_for_0:is_alias_for]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`city` = 'Hartford')\nRETURN DISTINCT `t2`.`alias` AS `alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the alias of the city called Hartford?",
    "evidence": "\"Hartford\" is the city",
    "idx": 3968
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'Alabama')\nRETURN COUNT(`t2`.`county`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many counties are there in Alabama?",
    "evidence": "\"Alabama\" is the name",
    "idx": 3969
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`abbreviation` = 'NY' AND `t2`.`type` = 'Post Office')\nRETURN COUNT(DISTINCT `t2`.`zip_code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many post offices are there in New York?",
    "evidence": "\"New York\" refers to state = 'NY' and name = 'New York'; 'Post Office' is the type",
    "idx": 3970
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`area_code` = '787')\nWITH `t2`.`latitude` AS _groupby_col_0, `t2`.`longitude` AS _groupby_col_1\nRETURN _groupby_col_0 AS `latitude`, _groupby_col_1 AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the precise locations of the cities with an area code of 787?",
    "evidence": "precise location refers to latitude, longitude",
    "idx": 3971
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`abbreviation` = 'CA' AND `t2`.`type` =~ '(?i)(?s).*Community Post Office.*' AND `t1`.`name` = 'California' AND `t2`.`state` = 'CA')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In California, how many delivery receptacles are there in the community post office that has the highest number of delivery receptacles?",
    "evidence": "in California refers to name = 'California' and state = 'CA'; 'Community Post Office' is the Type",
    "idx": 3972
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t4`:`country`)-[contains_zip_0:contains_zip]->(`t3`:`zip_data`)\nWHERE `t3`.`zip_code` = `t4`.`zip_code`\nWITH `t4`.`county` AS _groupby_col_0\nORDER BY `t3`.`female_population` IS NULL ASC, `t3`.`female_population` DESC \nRETURN _groupby_col_0 AS `county`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which county can you find the city with the highest number of females?",
    "evidence": "highest number of females refers to Max(female_population)",
    "idx": 3973
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[in_state_0:in_state]->(`t2`:`state`)\nWHERE `t1`.`state` = `t2`.`abbreviation`\nAND (`t1`.`division` IS NULL)\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the names of the states whose postal point is not affiliated with any organization?",
    "evidence": "postal point is not affiliated with any organization refers to division is null",
    "idx": 3974
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t2`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t2`.`cbsa_name` = 'Allentown-Bethlehem-Easton, PA-NJ')\nORDER BY `t1`.`population_2020` IS NULL ASC, `t1`.`population_2020` DESC \nRETURN `t1`.`population_2020` - `t1`.`population_2010` AS `result_data`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference in the most populated city of Allentown-Bethlehem-Easton, PA-NJ in 2020 against its population in 2010?",
    "evidence": "\"Allentown-Bethlehem-Easton, PA-NJ\" is the CBSA_name; most populated city refers to Max(population_2020); difference = Subtract (population_2020, population_2011)",
    "idx": 3975
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t2`.`county` = 'NEW CASTLE' AND `t1`.`name` = 'Delaware')\nRETURN DISTINCT `t2`.`zip_code` AS `zip_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the zip codes in the county of New Castle in Delaware.",
    "evidence": "\"NEW CASTLE\" is the county; 'Delaware' is the name of state",
    "idx": 3976
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[in_state_0:in_state]->(`t2`:`state`)\nMATCH (`t3`:`congress`)-[from_state_0:from_state]->(`t2`:`state`)\nWHERE `t1`.`state` = `t2`.`abbreviation`\nAND `t2`.`abbreviation` = `t3`.`abbreviation`\nORDER BY `t1`.`monthly_benefits_retired_workers` IS NULL ASC, `t1`.`monthly_benefits_retired_workers` DESC \nRETURN COUNT(`t3`.`cognress_rep_id`) AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many representatives are there in the state with the highest monthly benefit payments for retired workers?",
    "evidence": "state with highest monthly benefits payment for retired workers refers to Max(monthly_benefits_retired_workers)",
    "idx": 3977
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`congress`)-[from_state_0:from_state]->(`t2`:`state`)\nMATCH (`t3`:`zip_data`)-[in_state_0:in_state]->(`t2`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`abbreviation`\nAND `t2`.`abbreviation` = `t3`.`state`\nAND (`t1`.`first_name` = 'Murkowski' AND `t1`.`last_name` = 'Lisa' AND `t3`.`employees` = 0)\nRETURN COUNT(`t3`.`city`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the state where Lisa Murkowski is the representative, how many cities have zero employees?",
    "evidence": "zero employee refers to employees = 0",
    "idx": 3978
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[in_state_0:in_state]->(`t2`:`state`)\nWHERE `t1`.`state` = `t2`.`abbreviation`\nAND (`t1`.`county` = 'OUTAGAMIE')\nRETURN DISTINCT `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which state is Outagamie County in? Give the full name of the state.",
    "evidence": "\"OUTAGAMIE\" is the county",
    "idx": 3979
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`congress`)-[from_state_0:from_state]->(`t2`:`state`)\nMATCH (`t3`:`zip_data`)-[in_state_0:in_state]->(`t2`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`abbreviation`\nAND `t2`.`abbreviation` = `t3`.`state`\nAND (`t3`.`zip_code` = 91701)\nWITH `t1`.`party` AS _groupby_col_0\nRETURN _groupby_col_0 AS `party`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What party does the area with the zip code 91701 belong to?",
    "evidence": "",
    "idx": 3980
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[contains_zip_0:contains_zip]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`county` = 'NEW HAVEN')\nRETURN sum(`t1`.`male_population`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many males are there in New Haven County's residential areas?",
    "evidence": "\"NEW HAVEN\" is the county; male refers to male_population",
    "idx": 3981
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`alias`)-[is_alias_for_0:is_alias_for]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`latitude` = 18.090875 AND `t1`.`longitude` = -66.867756)\nRETURN `t2`.`alias` AS `alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the alias for the county at coordinate (18.090875, -66.867756).",
    "evidence": "coordinates refers to latitude, longitude; latitude = '18.090875; longitude = '-66.867756'",
    "idx": 3982
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`area_code`)-[area_code_for_0:area_code_for]->(`t1`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nWITH `t2`.`area_code` AS _groupby_col_0\nORDER BY `t1`.`over_65` IS NULL ASC, `t1`.`over_65` DESC \nRETURN _groupby_col_0 AS `area_code`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the city with the most elders, what's its area code?",
    "evidence": "city with most elders refers to Max(over_65)",
    "idx": 3983
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`avoid`)\nMATCH ()-[t1:represented_by]->(`t3`:`congress`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t1`.`district` = `t3`.`cognress_rep_id`\nAND (`t3`.`first_name` = 'Thompson' AND `t3`.`last_name` = 'Bennie G')\nRETURN COUNT(DISTINCT `t2`.`bad_alias`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the county represented by Thompson Bennie G, how many bad aliases does it have?",
    "evidence": "",
    "idx": 3984
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`area_code` = 636)\nRETURN `t2`.`latitude` AS `latitude`, `t2`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the location coordinates of the city with area code 636.",
    "evidence": "location coordinate refers to (latitude, longitude)",
    "idx": 3985
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`area_code` = 878)\nRETURN `t2`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which state is area code 878 in? Give the name of the state.",
    "evidence": "",
    "idx": 3987
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`abbreviation` = `t2`.`state`\nAND (`t1`.`name` = 'Virginia')\nRETURN COUNT(`t2`.`county`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many counties are there in Virginia State?",
    "evidence": "\"Virginia\" is the state",
    "idx": 3988
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t2`.`zip_code` = 45503)\nWITH `t1`.`cbsa_name` AS _groupby_col_0, `t2`.`latitude` AS _groupby_col_1, `t2`.`longitude` AS _groupby_col_2\nRETURN _groupby_col_0 AS `cbsa_name`, _groupby_col_1 AS `latitude`, _groupby_col_2 AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name and the position of the cbsa officer from the area with the zip code 45503.",
    "evidence": "position refers to latitude, longitude",
    "idx": 3989
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH ()-[t2:represented_by]->(`t3`:`congress`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`district` = `t3`.`cognress_rep_id`\nAND (`t3`.`first_name` = 'Hartzler' AND `t3`.`last_name` = 'Vicky')\nWITH `t1`.`county` AS _groupby_col_0\nRETURN _groupby_col_0 AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the name of the county which is represented by Hartzler Vicky.",
    "evidence": "name of county refers to county",
    "idx": 3990
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`county` = 'WINDHAM')\nRETURN CASE WHEN COUNT(`t2`.`median_age`)=0 THEN NULL ELSE sum(`t2`.`male_median_age`) / COUNT(`t2`.`median_age`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average male median age of all the residential areas in Windham county.",
    "evidence": "average male median age refers to Divide (Sum(male_median_age), Count(county)); 'WINDHAM' is the county",
    "idx": 3991
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH ()-[t2:represented_by]->(`t3`:`congress`)\nMATCH (`t1`:`country`)-[contains_zip_0:contains_zip]->(`t4`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`district` = `t3`.`cognress_rep_id`\nAND `t1`.`zip_code` = `t4`.`zip_code`\nAND (`t3`.`first_name` = 'DeSantis' AND `t3`.`last_name` = 'Ron')\nRETURN CASE WHEN COUNT(`t1`.`county`)=0 THEN NULL ELSE sum(`t4`.`female_median_age`) / COUNT(`t1`.`county`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the county where DeSantis Ron is from, what is the average female median age?",
    "evidence": "average female median age refers to Divide (Sum(female_median_age), Count(county))",
    "idx": 3992
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`city` = 'Bishopville' AND `t2`.`state` = 'SC')\nRETURN `t1`.`area_code` AS `area_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the area code of Bishopville, SC?",
    "evidence": "\"Bishopville\" is the city; 'SC' is the state",
    "idx": 3993
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`city` = 'Geneva' AND `t2`.`state` = 'AL')\nRETURN `t1`.`bad_alias` AS `bad_alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the bad alias of Geneva, AL.",
    "evidence": "\"Geneva\" is the city; 'AL' is the state",
    "idx": 3994
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`bad_alias` = 'Lawrenceville')\nWITH `t2`.`city` AS _groupby_col_0, `t2`.`state` AS _groupby_col_1\nRETURN _groupby_col_0 AS `city`, _groupby_col_1 AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which city and state has the bad alias of Lawrenceville?",
    "evidence": "\"Lawrenceville\" is the bad_alias",
    "idx": 3995
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`avoid`)\nMATCH (`t1`:`alias`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`zip_code` = 38015)\nRETURN `t1`.`alias` AS `alias`, `t2`.`bad_alias` AS `bad_alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name both the alias and the bad alias of zip code 38015.",
    "evidence": "",
    "idx": 3996
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH ()-[t2:represented_by]->(`t1`:`congress`)\nWHERE `t1`.`cognress_rep_id` = `t2`.`district`\nAND (`t1`.`first_name` = 'King' AND `t1`.`last_name` = 'Steven A')\nRETURN `t2`.`zip_code` AS `zip_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the zip code of the district represented by Steven A King?",
    "evidence": "",
    "idx": 3997
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t2`.`city` = 'York' AND `t2`.`state` = 'ME')\nRETURN `t1`.`cbsa_name` AS `cbsa_name`, `t1`.`cbsa_type` AS `cbsa_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the CBSA name and type in York, ME?",
    "evidence": "\"York\" is the city; 'ME' is the state; type refers to CBSA_type",
    "idx": 3998
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`median_age` >= 40)\nRETURN `t2`.`city` AS `city`, `t2`.`zip_code` AS `zip_code`, `t1`.`area_code` AS `area_code`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List 10 cities with a median age over 40. Include their zip codes and area codes.",
    "evidence": "median age over 40 refers to median_age > 40",
    "idx": 3999
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`country`)\nMATCH (`t1`:`avoid`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`bad_alias` = 'Druid Hills')\nRETURN `t2`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the county that has the bad alias of Druid Hills.",
    "evidence": "\"Druid Hills\" is the bad_alias",
    "idx": 4000
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)\nMATCH (`t2`:`country`)-[in_state_0:in_state]->(`t3`:`state`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`state` = `t3`.`abbreviation`\nAND (`t2`.`county` = 'PHILLIPS' AND `t3`.`name` = 'Montana')\nRETURN DISTINCT `t1`.`area_code` AS `area_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the area code of Phillips county in Montana?",
    "evidence": "\"PHILLIPS\" is the county; 'Montana' is the name of state",
    "idx": 4001
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[in_state_0:in_state]->(`t2`:`state`)\nWHERE `t2`.`abbreviation` = `t1`.`state`\nAND (`t1`.`time_zone` = 'Central')\nRETURN sum(CASE  WHEN `t1`.`time_zone` = 'Central' THEN 1 ELSE 0 END) AS `count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many states are in the central time zone? Write their full names.",
    "evidence": "central time zone refers to time_zone = 'Central'",
    "idx": 4003
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t1`.`cbsa_name` = 'Lexington-Fayette, KY')\nRETURN DISTINCT `t2`.`city` AS `city`, `t2`.`state` AS `state`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name 10 cities with their states that are under the Lexington-Fayette, KY office of the Canada Border Services Agency.",
    "evidence": "\"Lexington-Fayette, KY\" is the CBSA_name",
    "idx": 4004
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`congress`:`congress`)\nRETURN CASE WHEN COUNT(CASE  WHEN `congress`.`state` = 'Illinois' THEN `congress`.`cognress_rep_id` ELSE NULL END)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `congress`.`state` = 'Alabama' THEN `congress`.`cognress_rep_id` ELSE NULL END)) / COUNT(CASE  WHEN `congress`.`state` = 'Illinois' THEN `congress`.`cognress_rep_id` ELSE NULL END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the ratio between the number of representatives in Alabama and the number of representatives in Illinois.",
    "evidence": "\"Alabama\" and \"Illinois\" are both state; Ratio = Divide (Count(state = 'Alabama'), Count(state = 'Illinois'))",
    "idx": 4006
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`zip_data`:`zip_data`)\nRETURN CASE WHEN COUNT(`zip_data`.`zip_code`)=0 THEN NULL ELSE toFloat(sum(`zip_data`.`population_2020`)) / COUNT(`zip_data`.`zip_code`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average of 2020's population in each zip code.",
    "evidence": "average of 2020 population in each zip code refers to Divide (Sum(population_2020), Count(zip_code))",
    "idx": 4007
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t2`:`zip_data`)-[in_cbsa_0:in_cbsa]->(`t1`:`cbsa`)\nWHERE `t1`.`cbsa` = `t2`.`cbsa`\nAND (`t1`.`cbsa_name` = 'Berlin, NH')\nWITH `t2`.`male_population` AS _groupby_col_0\nRETURN _groupby_col_0 AS `male_population`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the male population for all zip code which were under the Berlin, NH CBSA.",
    "evidence": "\"Berlin, NH\" is the CBSA_name",
    "idx": 4008
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`avoid`)-[is_bad_alias_for_0:is_bad_alias_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t2`.`state` = 'PR')\nRETURN `t1`.`bad_alias` AS `bad_alias`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the bad alias for zip codes in Puerto Rico.",
    "evidence": "\"Puerto Rico\" refers to state = 'PR'",
    "idx": 4009
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`zip_data`)-[t2:represented_by]->(`t3`:`congress`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND `t2`.`district` = `t3`.`cognress_rep_id`\nAND (`t3`.`first_name` = 'Grayson' AND `t3`.`last_name` = 'Alan')\nRETURN `t1`.`latitude` AS `latitude`, `t1`.`longitude` AS `longitude`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the longitude and latitude for the district represented by Grayson Alan?",
    "evidence": "",
    "idx": 4010
  },
  {
    "filename": "train.json",
    "db_id": "address",
    "gql_statement": "MATCH (`t1`:`area_code`)-[area_code_for_0:area_code_for]->(`t2`:`zip_data`)\nWHERE `t1`.`zip_code` = `t2`.`zip_code`\nAND (`t1`.`area_code` = 787)\nRETURN DISTINCT `t2`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the state for area code of 787?",
    "evidence": "",
    "idx": 4011
  }
]