[
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[t2:sold_at]->()\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND (`t1`.`title` = 'Life Without Fear')\nRETURN CASE WHEN COUNT(`t1`.`title_id`)=0 THEN NULL ELSE toFloat(sum(`t2`.`qty`)) / COUNT(`t1`.`title_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average quantity of each order for the book \"Life Without Fear\"?",
    "evidence": "qty is abbreviation for quantity; average quantity order = AVG(qty)",
    "idx": 40
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`minit` = ''\nORDER BY `employee`.`job_lvl` IS NULL ASC, `employee`.`job_lvl` DESC \nRETURN `employee`.`emp_id` AS `emp_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show me the employ id of the highest employee who doesn't have a middle name.",
    "evidence": "highest employee refers to employee with the highest job level; MAX(job_lvl)",
    "idx": 45
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`authors`)-[t2:authored]->(`t3`:`titles`)\nWHERE `t1`.`au_id` = `t2`.`au_id`\nAND `t2`.`title_id` = `t3`.`title_id`\nAND (`t3`.`title` = 'Sushi, Anyone?')\nRETURN `t1`.`contract` AS `contract`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Is the author of \"Sushi, Anyone?\" on the contract?",
    "evidence": "contract = 1 means on contract; contract = 0 means not on contract",
    "idx": 46
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`employee`)-[has_job_0:has_job]->(`t2`:`jobs`)\nWHERE `t1`.`job_id` = `t2`.`job_id`\nORDER BY `t1`.`job_lvl` IS NULL ASC, `t1`.`job_lvl` DESC \nRETURN `t1`.`fname` AS `fname`, `t1`.`minit` AS `minit`, `t1`.`lname` AS `lname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which publisher had the highest job level? Give his/her full name.",
    "evidence": "highest job level refers to MAX(job_lvl)",
    "idx": 47
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[t2:sold_at]->()\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND (CASE WHEN `t2`.`ord_date` is not NULL THEN apoc.temporal.format(`t2`.`ord_date`,'yyyy-MM-dd') ELSE NULL END = '1994-09-14')\nRETURN `t1`.`notes` AS `notes`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's on the notes for the order happened on 1994/9/14?",
    "evidence": "order happened on refers to ord_date",
    "idx": 50
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[t2:sold_at]->()\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND (CASE WHEN `t2`.`ord_date` is not NULL THEN apoc.temporal.format(`t2`.`ord_date`,'yyyy-MM-dd') ELSE NULL END = '1993-05-29')\nRETURN DISTINCT `t1`.`type` AS `type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the type of the book for the order which was sold on 1993/5/29.",
    "evidence": "sold on refers to ord_date",
    "idx": 51
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`pub_info`)-[info_for_0:info_for]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (`t2`.`country` = 'France')\nRETURN `t1`.`pr_info` AS `pr_info`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell me about the information of the French publisher.",
    "evidence": "French publisher means publisher in France where country = 'France'",
    "idx": 52
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (`t1`.`title` = 'Silicon Valley Gastronomic Treats')\nRETURN `t2`.`pub_name` AS `pub_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What's the publisher of the book \"Silicon Valley Gastronomic Treats\"? Give the publisher's name.",
    "evidence": "publisher name refers to pub_name; Silicon Valley Gastronomic Treats is the title of a book",
    "idx": 53
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH ()-[t1:sold_at]->(`t2`:`stores`)\nWHERE `t1`.`stor_id` = `t2`.`stor_id`\nAND (CASE WHEN `t1`.`ord_date` is not NULL THEN apoc.temporal.format(`t1`.`ord_date`,'yyyy') ELSE NULL END = '1993')\nRETURN CASE WHEN sum(CASE  WHEN `t2`.`city` = 'Fremont' THEN `t1`.`qty`  END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`city` = 'Fremont' THEN `t1`.`qty`  END) - sum(CASE  WHEN `t2`.`city` = 'Portland' THEN `t1`.`qty`  END)) * 100 / sum(CASE  WHEN `t2`.`city` = 'Fremont' THEN `t1`.`qty`  END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the quantities, what percent more did the store in Fremont sell than the store in Portland in 1993?",
    "evidence": "qty is abbreviation for quantity; Fremont and Portland are name of city; sell in 1993 refers to YEAR(ord_date) = 1993; percentage = DIVIDE(\nSUBTRACT(SUM(qty where city = ‘Fremont’ and year(ord_date = 1993)), \nSUM(qty where city = ‘Portland’ and year(ord_date = 1993))), SUM(qty where city = ‘Fremont’ and year(ord_date = 1993)) *100",
    "idx": 56
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE CASE WHEN `employee`.`hire_date` is not NULL THEN apoc.temporal.format(`employee`.`hire_date`,'yyyy') ELSE NULL END >= '1990' AND CASE WHEN `employee`.`hire_date` is not NULL THEN apoc.temporal.format(`employee`.`hire_date`,'yyyy') ELSE NULL END <= '1995'\nORDER BY `employee`.`job_lvl` IS NULL ASC, `employee`.`job_lvl` DESC \nRETURN `employee`.`fname` AS `fname`, `employee`.`minit` AS `minit`, `employee`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find and list the full name of employees who were hired between 1990 and 1995. Also, arrange them in the descending order of job level.",
    "evidence": "job level refers to job_lvl; YEAR(hire_date) between 1990 and 1995",
    "idx": 58
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "CALL(*) {\nMATCH (`t3_sub0`:`titles`)-[t4_sub0:sold_at]->()\nWHERE `t3_sub0`.`title_id` = `t4_sub0`.`title_id`\nRETURN CASE WHEN COUNT(`t3_sub0`.`title_id`)=0 THEN NULL ELSE toFloat(sum(`t4_sub0`.`qty`)) / COUNT(`t3_sub0`.`title_id`) END AS `_col_0`  \n}\nMATCH (`t1`:`titles`)-[t2:sold_at]->()\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND (toString(`t2`.`ord_date`) =~ '(?i)(?s)1994.*' AND `t2`.`qty` < `_col_0`)\nRETURN DISTINCT `t1`.`title` AS `title`, `t1`.`type` AS `type`, `t1`.`price` AS `price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 1994 which title had less order quanty than the average order quantity? Find the title name, type and price.",
    "evidence": "orders in 1994 refers to YEAR(ord_date) = 1994; order quantity refers to number of order expressed by ord_num; average order quantity = DIVIDE(SUM(ord_num), COUNT(title_id))",
    "idx": 60
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (`t2`.`pub_name` = 'New Moon Books')\nRETURN `t1`.`title` AS `title`, `t1`.`type` AS `type`, `t1`.`price` AS `price` ORDER BY `t1`.`price` IS NULL DESC, `t1`.`price`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the title name, type, and price of the titles published by New Moon Books. Arrange the list in ascending order of price.",
    "evidence": "Eric the Read Books is a publisher which refers to pub_name;",
    "idx": 61
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t3`:`roysched`)-[royalty_schedule_for_0:royalty_schedule_for]->(`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND `t1`.`title_id` = `t3`.`title_id`\nAND (`t2`.`country` = 'USA')\nORDER BY `t1`.`royalty` IS NULL ASC, `t1`.`royalty` DESC \nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the books published by US publishers, which book has the highest royalty? List these books in the descending order of royalty.",
    "evidence": "US publisher refers publisher in the US where country = 'USA';",
    "idx": 62
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "CALL(*) {\nMATCH (`callcenterlogs_sub0`:`callcenterlogs`)\nRETURN MAX(`callcenterlogs_sub0`.`ser_time`) AS `_col_0`  \n}\nMATCH (`callcenterlogs`:`callcenterlogs`)\nWHERE `callcenterlogs`.`ser_time` = `_col_0`\nRETURN `callcenterlogs`.`date received` AS `date received`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On which day was the most verbose complaint received?",
    "evidence": "day received refers to \"Date received\"; most verbose complaint refers to MAX(ser_time);",
    "idx": 67
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`callcenterlogs`:`callcenterlogs`)\nWHERE `callcenterlogs`.`date received` = localdatetime('2017-03-22T00:00:00')\nRETURN min(`callcenterlogs`.`ser_time`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did the earliest complaint start on 2017/3/22?",
    "evidence": "earliest complaint refers to oldest ser_start; on 2017/3/22 refers to \"Date received\" = '2017-03-22';",
    "idx": 68
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`client`:`client`)\nWHERE `client`.`year` > 1990\nRETURN `client`.`first` AS `first`, `client`.`middle` AS `middle`, `client`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of all the male clients born after the year 1990.",
    "evidence": "full names = first, middle, last; male refers to sex = 'Male'; year > 1990;",
    "idx": 70
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t1`.`first` = 'Matthew' AND `t1`.`last` = 'Pierce' AND `t2`.`date received` = localdatetime('2016-10-28T00:00:00'))\nRETURN 365 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END))) + 30 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'%M') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'%M') ELSE NULL END))) + toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'dd') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'dd') ELSE NULL END))) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how long was the complaint filed by Matthew Pierce on 2016/10/28 delayed?",
    "evidence": "on 2016/10/28 refers to \"Date received\" = '2016-10-28'; delayed = SUBTRACT(\"Date sent to company', 'Date received\");",
    "idx": 74
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`company response to consumer` = 'In progress')\nRETURN `t1`.`first` AS `first`, `t1`.`middle` AS `middle`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of all the clients whose complaints are still in progress.",
    "evidence": "full name = first, middle, last; complaints are still in progress refers to \"Company response to consumer\" = 'In progress';",
    "idx": 78
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END = '2016' AND `t1`.`sex` = 'Male' AND `t2`.`product` = 'Credit card')\nRETURN COUNT(`t1`.`sex`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many complaints on credit cards in the year 2016 were filed by male clients?",
    "evidence": "credit cards refers to Product = 'Credit card'; 2016 refers to year(Date received) = 2016; male refers to sex = 'Male';",
    "idx": 80
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[located_in_0:located_in]->(`t2`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t2`.`division` = 'Pacific' AND `t1`.`sex` = 'Male')\nRETURN `t1`.`first` AS `first`, `t1`.`middle` AS `middle`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of all the male clients in the Pacific division.",
    "evidence": "full names = first, middle, last; male refers to sex = 'Male';",
    "idx": 82
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END >= '2015' AND CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END <= '2017' AND `t1`.`city` = 'New York City' AND `t2`.`product` = 'Credit card')\nRETURN CASE WHEN 3=0 THEN NULL ELSE toFloat(COUNT(`t2`.`complaint id`)) / 3 END AS `average`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of complaints on credit cards filed by clients from New York in the 3 consecutive years starting from 2015?",
    "evidence": "average = AVG(Complaint ID); credit cards refers to Product = 'Credit card'; New York refers to city = 'New York'; 3 consecutive years starting from 2015 refers to \"Date received\" BETWEEN 2015 AND 2017;",
    "idx": 83
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t1`.`city` = 'New York City')\nRETURN CASE WHEN sum(CASE  WHEN CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END = '2016' THEN 1 ELSE 0 END)=0 THEN NULL ELSE 100.0 * (sum(CASE  WHEN CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END = '2017' THEN 1 ELSE 0 END) - sum(CASE  WHEN CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END = '2016' THEN 1 ELSE 0 END)) / sum(CASE  WHEN CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END = '2016' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of the increase of complaints filed by the clients from New York from the year 2016 to the year 2017?",
    "evidence": "percentage of increase = MULTIPLY(DIVIDE(SUBTRACT(SUM(year(\"Date received\") = 2017), SUM(year(\"Date received\") = 2016)), SUM(year(\"Date received\") = 2016)), 1.0); New York refers to city = 'New York'; year(\"Date received\") BETWEEN 2016 AND 2017;",
    "idx": 84
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[located_in_0:located_in]->(`t2`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t1`.`email` = 'wyatt.collins@gmail.com')\nRETURN `t1`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which state does the owner of \"wyatt.collins@gmail.com\" live in? Give the full name of the state.",
    "evidence": "full name of the state refers to state_name;",
    "idx": 86
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`date received` = localdatetime('2012-05-18T00:00:00') AND `t1`.`sex` = 'Male' AND `t1`.`first` = 'Brantley' AND `t1`.`middle` = 'Julian' AND `t1`.`last` = 'Stanley')\nRETURN 365 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'yyyy') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'yyyy') ELSE NULL END))) + 30 * toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'%M') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'%M') ELSE NULL END))) + toFloat((toFloat(CASE WHEN `t2`.`date sent to company` is not NULL THEN apoc.temporal.format(`t2`.`date sent to company`,'dd') ELSE NULL END) - toFloat(CASE WHEN `t2`.`date received` is not NULL THEN apoc.temporal.format(`t2`.`date received`,'dd') ELSE NULL END))) AS `days`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many days delay for the complaint call from Mr. Brantley Julian Stanley on 2012/5/18?",
    "evidence": "days delay for the complaint = SUBTRACT(\"date sent to company\", \"Date received\"); Mr refers to sex = 'Male'; on 2012/5/18 refers to \"Date received\" = '2012-05-18';",
    "idx": 90
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`reviews`)-[from_district_0:from_district]->(`t2`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t1`.`date` = localdatetime('2018-09-11T00:00:00'))\nRETURN `t2`.`district_id` AS `district_id`, `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which district did the review on 2018/9/11 come from? Give the name of the city.",
    "evidence": "on 2018/9/11 refers to Date = '2017-07-22';",
    "idx": 91
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`complaint id` = 'CR0100432')\nRETURN `t1`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the phone of number of the client who made the complaint call \"CR0100432\" ？",
    "evidence": "complaint call refers to Complaint ID;",
    "idx": 96
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "CALL(*) {\nMATCH (`callcenterlogs_sub0`:`callcenterlogs`)\nRETURN MAX(`callcenterlogs_sub0`.`priority`) AS `_col_0_1`  \n}\nMATCH (`callcenterlogs`:`callcenterlogs`)\nWHERE toString(`callcenterlogs`.`date received`) =~ '(?i)(?s)2017-01.*' AND `callcenterlogs`.`priority` = `_col_0_1`\nRETURN COUNT(`callcenterlogs`.`complaint id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many priority urgent complaints were received in march of 2017? List the complaint ID of these complaints.",
    "evidence": "urgent complaints refers to priority = 2; march of 2017 refers to \"Date received\" BETWEEN '2017-01-01' AND '2017-01-31';",
    "idx": 99
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`client`:`client`)\nWHERE `client`.`age` > 65\nORDER BY `client`.`age` IS NULL ASC, `client`.`age` DESC \nRETURN `client`.`first` AS `first`, `client`.`middle` AS `middle`, `client`.`last` AS `last`, `client`.`year` AS `year`, `client`.`month` AS `month`, `client`.`day` AS `day`, `client`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full name, date of birth, and email id of the elderly clients in descending order of age.",
    "evidence": "full name = first, middle, last; date of birth = year, month, day; elderly clients refers to age > 65;",
    "idx": 100
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "CALL (*) {\nMATCH (`reviews_sub0`:`reviews`)\nWHERE `reviews_sub0`.`stars` = 5\nWITH `reviews_sub0`.`product` AS _groupby_col_0, COUNT(`reviews_sub0`.`stars`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `product`, _groupby_col_1 AS `num`  \n}\nWITH *\nRETURN `product`, MAX(`num`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which product got the most five stars, and how many?",
    "evidence": "most five stars refers to MAX(COUNT(stars = 5));",
    "idx": 101
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`state`:`state`)\nWHERE `state`.`region` = 'South'\nRETURN `state`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the states in the South region.",
    "evidence": "",
    "idx": 102
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[located_in_0:located_in]->(`t2`:`district`)-[in_state_0:in_state]->(`t3`:`state`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND `t2`.`state_abbrev` = `t3`.`statecode`\nAND (`t3`.`region` = 'Midwest')\nRETURN CASE WHEN COUNT(`t3`.`region`)=0 THEN NULL ELSE toFloat(sum(`t1`.`age`)) / COUNT(`t3`.`region`) END AS `average`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average age of clients from the Midwest region.",
    "evidence": "average age = AVG(age);",
    "idx": 104
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`submitted via` = 'Fax')\nRETURN `t1`.`first` AS `first`, `t1`.`middle` AS `middle`, `t1`.`last` AS `last`, `t1`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full name and phone number of clients who submitted the complaint via fax.",
    "evidence": "full name = first, middle, last; submitted the complaint via fax refers to \"Submitted via\" = 'fax';",
    "idx": 105
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`reviews`)-[from_district_1:from_district]->(`t2_sub0`:`district`)\nWHERE `t1_sub0`.`district_id` = `t2_sub0`.`district_id`\nRETURN avg(`t1_sub0`.`stars`) AS `_col_0`  \n}\nMATCH (`t1`:`reviews`)-[from_district_0:from_district]->(`t2`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t1`.`product` = 'Eagle Capital' AND `t1`.`stars` > `_col_0`)\nRETURN `t2`.`division` AS `division`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find and list the names of districts which has below-average stars for Eagle Capital.",
    "evidence": "below average = AVG(stars) < Stars; Eagle Capital refers to Product = 'Eagle Capital';",
    "idx": 106
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t1`.`year` >= 1980 AND `t1`.`year` <= 2000 AND `t1`.`sex` = 'Male' AND `t2`.`submitted via` = 'Referral')\nRETURN `t1`.`first` AS `first`, `t1`.`middle` AS `middle`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the clients born between 1980 and 2000, list the name of male clients who complained through referral.",
    "evidence": "born between 1980 and 2000 refers to year BETWEEN 1980 AND 2000; name = first, middle, last; male refers to sex = 'Male'; complained through refers to \"Submitted via\";",
    "idx": 109
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t2`.`tags` = 'Servicemember' AND `t1`.`city` = 'Syracuse')\nRETURN COUNT(`t1`.`client_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the number of service members who complained in Syracuse.",
    "evidence": "service members refers to client.client_id; Syracuse refers to city = 'Syracuse';",
    "idx": 111
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[located_in_0:located_in]->(`t2`:`district`)-[in_state_0:in_state]->(`t3`:`state`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND `t2`.`state_abbrev` = `t3`.`statecode`\nAND (`t3`.`region` = 'Northeast')\nRETURN (CASE WHEN sum(CASE  WHEN `t1`.`age` >= 35 AND `t1`.`age` <= 55 THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`age` >= 35 AND `t1`.`age` <= 55 THEN `t1`.`age` ELSE 0 END)) / sum(CASE  WHEN `t1`.`age` >= 35 AND `t1`.`age` <= 55 THEN 1 ELSE 0 END) END) - (CASE WHEN sum(CASE  WHEN `t1`.`age` > 65 THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`age` > 65 THEN `t1`.`age` ELSE 0 END)) / sum(CASE  WHEN `t1`.`age` > 65 THEN 1 ELSE 0 END) END) AS `difference`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference in the average age of elderly and middle-aged clients in the Northeast region.",
    "evidence": "difference in the average = SUBTRACT(AVG(age BETWEEN 35 AND 55), AVG( age > 65)); elderly refers to age > 65; middle-aged refers to age BETWEEN 35 AND 55;",
    "idx": 113
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`callcenterlogs`:`callcenterlogs`)\nORDER BY `callcenterlogs`.`ser_time` IS NULL ASC, `callcenterlogs`.`ser_time` DESC \nRETURN `callcenterlogs`.`complaint id` AS `complaint id`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List by their ID number the 3 longest complaints.",
    "evidence": "ID number refers to \"Complaint ID\"; longest complaints refers to MAX(ser_time);",
    "idx": 114
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`callcenterlogs`:`callcenterlogs`)\nWHERE `callcenterlogs`.`priority` = 2\nORDER BY `callcenterlogs`.`date received` IS NULL ASC, `callcenterlogs`.`date received` DESC \nRETURN DISTINCT `callcenterlogs`.`complaint id` AS `complaint id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List priority 2 complaints by date received.",
    "evidence": "",
    "idx": 117
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`callcenterlogs`)-[submitted_by_0:submitted_by]->(`t1`:`client`)\nWHERE `t1`.`client_id` = `t2`.`rand client`\nAND (`t2`.`type` = 'PS' AND `t2`.`server` = 'TOVA')\nRETURN `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Lists the last name of all clients who made a PS-type complaint and were served by TOVA.",
    "evidence": "PS-type complaint refers to type = 'PS'; served by refers to server;\n\n",
    "idx": 122
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t1`.`first` = 'Brenda' AND `t1`.`last` = 'Mayer')\nRETURN `t2`.`consumer complaint narrative` AS `consumer complaint narrative`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the complaints narratives made by the customer named Brenda and last name Mayer.",
    "evidence": "complaints narratives refers to \"Consumer complaint narrative\";",
    "idx": 132
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "CALL(*) {\nMATCH (`callcenterlogs_sub0`:`callcenterlogs`)\nRETURN MAX(`callcenterlogs_sub0`.`ser_time`) AS `_col_0`  \n}\nMATCH ()-[t2:filed_complaint]->(`t1`:`callcenterlogs`)\nWHERE `t1`.`complaint id` = `t2`.`complaint id`\nAND (`t1`.`ser_time` = `_col_0`)\nRETURN `t2`.`issue` AS `issue`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the issue that the client with the longest server time faced?",
    "evidence": "longest server time refers to MAX(ser_time);",
    "idx": 142
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`callcenterlogs`:`callcenterlogs`)\nWHERE CASE WHEN `callcenterlogs`.`ser_time` is not NULL THEN apoc.temporal.format(`callcenterlogs`.`ser_time`,'%M') ELSE NULL END > '15'\nRETURN COUNT(`callcenterlogs`.`ser_time`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the complaints are longer than 15 minutes?",
    "evidence": "longer than 15 minutes refers to ser_time > '00:15:00'",
    "idx": 148
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t2`:`client`)-[located_in_0:located_in]->(`t1`:`district`)\nWHERE `t1`.`district_id` = `t2`.`district_id`\nAND (`t1`.`division` = 'Pacific')\nRETURN `t2`.`first` AS `first`, `t2`.`middle` AS `middle`, `t2`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names of all clients who live in the Pacific division.",
    "evidence": "full name refers to first, last",
    "idx": 149
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t1`:`client`)-[t2:filed_complaint]->()\nWHERE `t1`.`client_id` = `t2`.`client_id`\nAND (`t1`.`first` = 'Kaitlyn' AND `t1`.`middle` = 'Eliza' AND `t1`.`last` = 'Elliott')\nRETURN DISTINCT `t2`.`issue` AS `issue`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the issues of the complaints made by Kaitlyn Eliza Elliott.",
    "evidence": "",
    "idx": 153
  },
  {
    "filename": "train.json",
    "db_id": "retail_complains",
    "gql_statement": "MATCH (`t3`:`client`)-[located_in_0:located_in]->(`t2`:`district`)-[in_state_0:in_state]->(`t1`:`state`)\nWHERE `t1`.`statecode` = `t2`.`state_abbrev`\nAND `t2`.`district_id` = `t3`.`district_id`\nAND (`t3`.`email` = 'skylar.ramirez@gmail.com')\nRETURN `t3`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the state that the client with the email \"skylar.ramirez@gmail.com\" lives in?",
    "evidence": "",
    "idx": 154
  }
]