[
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`t2`:`assets`)-[supplied_by_0:supplied_by]->(`t1`:`third_party_companies`)\nWHERE `t1`.`company_id` = `t2`.`supplier_company_id`\nWITH `t1`.`company_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `company_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many assets does each third party company supply? List the count and the company id.",
    "evidence": "",
    "idx": 3859
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`t1`:`maintenance_engineers`)-[t2:has_skill]->(`t3`:`skills`)\nWHERE `t1`.`engineer_id` = `t2`.`engineer_id`\nAND `t2`.`skill_id` = `t3`.`skill_id`\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`, `t1`.`other_details` AS `other_details`, `t3`.`skill_description` AS `skill_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all every engineer's first name, last name, details and coresponding skill description.",
    "evidence": "",
    "idx": 3860
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`t1`:`part_faults`)-[t2:requires_skill]->(`t3`:`skills`)\nWHERE `t1`.`part_fault_id` = `t2`.`part_fault_id`\nAND `t2`.`skill_id` = `t3`.`skill_id`\nRETURN `t1`.`fault_short_name` AS `fault_short_name`, `t3`.`skill_description` AS `skill_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For all the faults of different parts, what are all the decriptions of the skills required to fix them? List the name of the faults and the skill description.",
    "evidence": "",
    "idx": 3861
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`t2`:`engineer_visits`)-[for_fault_0:for_fault]->(`t1`:`fault_log`)\nWHERE `t1`.`fault_log_entry_id` = `t2`.`fault_log_entry_id`\nWITH `t1`.`fault_log_entry_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `fault_log_entry_id` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many engineer visits are required at most for a single fault log? List the number and the log entry id.",
    "evidence": "",
    "idx": 3864
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "WITH *, COLLECT { MATCH (`engineer_visits_sub0`:`engineer_visits`)\nRETURN `engineer_visits_sub0`.`engineer_id` AS `engineer_id`   } AS in_collect_0\nMATCH (`maintenance_engineers`:`maintenance_engineers`)\nWHERE NOT `maintenance_engineers`.`engineer_id` IN in_collect_0\nRETURN `maintenance_engineers`.`first_name` AS `first_name`, `maintenance_engineers`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which engineers have never visited to maintain the assets? List the engineer first name and last name.",
    "evidence": "",
    "idx": 3867
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`assets`:`assets`)\nRETURN `assets`.`asset_id` AS `asset_id`, `assets`.`asset_details` AS `asset_details`, `assets`.`asset_make` AS `asset_make`, `assets`.`asset_model` AS `asset_model`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the asset id, details, make and model for every asset.",
    "evidence": "",
    "idx": 3868
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`t2`:`engineer_visits`)-[contacted_0:contacted]->(`t1`:`staff`)\nMATCH (`t2`:`engineer_visits`)-[performed_by_0:performed_by]->(`t3`:`maintenance_engineers`)\nWHERE `t1`.`staff_id` = `t2`.`contact_staff_id`\nAND `t2`.`engineer_id` = `t3`.`engineer_id`\nRETURN `t1`.`staff_name` AS `staff_name`, `t3`.`first_name` AS `first_name`, `t3`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which staff have contacted which engineers? List the staff name and the engineer first name and last name.",
    "evidence": "",
    "idx": 3870
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`assets`:`assets`)\nORDER BY `assets`.`asset_disposed_date` IS NULL DESC, `assets`.`asset_disposed_date`  \nRETURN `assets`.`asset_make` AS `asset_make`, `assets`.`asset_model` AS `asset_model`, `assets`.`asset_details` AS `asset_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the all the assets make, model, details by the disposed date ascendingly.",
    "evidence": "",
    "idx": 3872
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`parts`:`parts`)\nRETURN `parts`.`part_id` AS `part_id`, `parts`.`chargeable_amount` AS `chargeable_amount` ORDER BY `chargeable_amount` IS NULL DESC, `chargeable_amount`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which part has the least chargeable amount? List the part id and amount.",
    "evidence": "",
    "idx": 3873
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`t2`:`maintenance_contracts`)-[has_contract_with_0:has_contract_with]->(`t1`:`third_party_companies`)\nWHERE `t1`.`company_id` = `t2`.`maintenance_contract_company_id`\nORDER BY `t2`.`contract_start_date` IS NULL DESC, `t2`.`contract_start_date`  \nRETURN `t1`.`company_name` AS `company_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which company started the earliest the maintenance contract? Show the company name.",
    "evidence": "",
    "idx": 3874
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "MATCH (`t2`:`engineer_visits`)-[contacted_0:contacted]->(`t1`:`staff`)\nWHERE `t1`.`staff_id` = `t2`.`contact_staff_id`\nWITH `t1`.`staff_name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `staff_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many engineers did each staff contact? List both the contact staff name and number of engineers contacted.",
    "evidence": "",
    "idx": 3875
  },
  {
    "filename": "train_spider.json",
    "db_id": "assets_maintenance",
    "gql_statement": "WITH *, COLLECT { MATCH (`fault_log_sub0`:`fault_log`)\nRETURN `fault_log_sub0`.`asset_id` AS `asset_id`   } AS in_collect_0\nMATCH (`assets`:`assets`)\nWHERE NOT `assets`.`asset_id` IN in_collect_0\nRETURN `assets`.`asset_model` AS `asset_model`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which assets did not incur any fault log? List the asset model.",
    "evidence": "",
    "idx": 3876
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`station`:`station`)\nRETURN `station`.`local_authority` AS `local_authority`, `station`.`services` AS `services`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list the local authorities and services provided by all stations.",
    "evidence": "",
    "idx": 3877
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`train`:`train`)\nORDER BY `train`.`time` IS NULL DESC, `train`.`time`  \nRETURN `train`.`train_number` AS `train_number`, `train`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "show all train numbers and names ordered by their time from early to late.",
    "evidence": "",
    "idx": 3878
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`train`:`train`)\nWHERE `train`.`destination` = 'Chennai'\nRETURN `train`.`time` AS `time`, `train`.`train_number` AS `train_number` ORDER BY `time` IS NULL DESC, `time`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the times and numbers of all trains that go to Chennai, ordered by time.",
    "evidence": "",
    "idx": 3879
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`train`:`train`)\nWHERE `train`.`name` =~ '(?i)(?s).*Express.*'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many trains have 'Express' in their names?",
    "evidence": "",
    "idx": 3880
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`train`:`train`)\nWHERE `train`.`origin` = 'Chennai' AND `train`.`destination` = 'Guruvayur'\nRETURN `train`.`train_number` AS `train_number`, `train`.`time` AS `time`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number and time of the train that goes from Chennai to Guruvayur.",
    "evidence": "",
    "idx": 3881
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`train`:`train`)\nWITH `train`.`origin` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `origin`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of trains starting from each origin.",
    "evidence": "",
    "idx": 3882
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`t1`:`weekly_weather`)-[recorded_at_0:recorded_at]->(`t2`:`station`)\nWHERE `t1`.`station_id` = `t2`.`id`\nAND (`t2`.`network_name` = 'Amersham')\nRETURN MAX(`t1`.`low_temperature`) AS `_col_0`, avg(`t1`.`precipitation`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the maximum low temperature and average precipitation at the Amersham station.",
    "evidence": "",
    "idx": 3884
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`t1`:`station`)-[t2:route]->(`t3`:`train`)\nWHERE `t1`.`id` = `t2`.`station_id`\nAND `t2`.`train_id` = `t3`.`id`\nAND (`t1`.`local_authority` = 'Chiltern')\nRETURN `t3`.`name` AS `name`, `t3`.`time` AS `time`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find names and times of trains that run through stations for the local authority Chiltern.",
    "evidence": "",
    "idx": 3885
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`weekly_weather`:`weekly_weather`)\nRETURN min(`weekly_weather`.`low_temperature`) AS `_col_0`, MAX(`weekly_weather`.`wind_speed_mph`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "show the lowest low temperature and highest wind speed in miles per hour.",
    "evidence": "",
    "idx": 3887
  },
  {
    "filename": "train_spider.json",
    "db_id": "station_weather",
    "gql_statement": "MATCH (`train`:`train`)\nWITH `train`.`origin` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `origin`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the origins from which more than 1 train starts.",
    "evidence": "",
    "idx": 3888
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`professor`)-[works_in_0:works_in]->(`t2`:`department`)\nWHERE `t1`.`dept_code` = `t2`.`dept_code`\nAND (`t2`.`dept_name` = 'Accounting')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of professors in accounting department.",
    "evidence": "",
    "idx": 3889
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`professor`)-[works_in_0:works_in]->(`t2`:`department`)\nWHERE `t1`.`dept_code` = `t2`.`dept_code`\nAND (`t2`.`dept_name` = 'Accounting')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many professors are in the accounting dept?",
    "evidence": "",
    "idx": 3890
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`professor`)-[works_in_0:works_in]->(`t2`:`department`)\nMATCH (`t1`:`professor`)-[is_a_0:is_a]->(`t3`:`employee`)\nWHERE `t1`.`dept_code` = `t2`.`dept_code`\nAND `t1`.`emp_num` = `t3`.`emp_num`\nAND (`t2`.`dept_name` = 'Biology')\nRETURN `t3`.`emp_fname` AS `emp_fname`, `t3`.`emp_lname` AS `emp_lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first and last name of the professor in biology department?",
    "evidence": "",
    "idx": 3893
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`professor`)-[works_in_0:works_in]->(`t2`:`department`)\nMATCH (`t1`:`professor`)-[is_a_0:is_a]->(`t3`:`employee`)\nWHERE `t1`.`dept_code` = `t2`.`dept_code`\nAND `t1`.`emp_num` = `t3`.`emp_num`\nAND (`t2`.`dept_name` = 'Biology')\nRETURN `t3`.`emp_fname` AS `emp_fname`, `t3`.`emp_lname` AS `emp_lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first and last name of all biology professors?",
    "evidence": "",
    "idx": 3894
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`department`:`department`)\nWITH `department`.`school_code` AS _groupby_col_0, COUNT(DISTINCT `department`.`dept_address`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `school_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count different addresses of each school.",
    "evidence": "",
    "idx": 3908
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`department`:`department`)\nWITH `department`.`school_code` AS _groupby_col_0, COUNT(DISTINCT `department`.`dept_name`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `school_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of departments in each school.",
    "evidence": "",
    "idx": 3911
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`department`:`department`)\nWITH `department`.`school_code` AS _groupby_col_0, COUNT(DISTINCT `department`.`dept_name`) AS _groupby_col_1\nWHERE _groupby_col_1 < 5\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `school_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of different departments in each school whose number of different departments is less than 5.",
    "evidence": "",
    "idx": 3913
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`department`:`department`)\nWITH `department`.`school_code` AS _groupby_col_0, COUNT(DISTINCT `department`.`dept_name`) AS _groupby_col_1\nWHERE _groupby_col_1 < 5\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `school_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many different departments are there in each school that has less than 5 apartments?",
    "evidence": "",
    "idx": 3914
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`course`:`course`)\nWITH `course`.`dept_code` AS _groupby_col_0, sum(`course`.`crs_credit`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total credit does each department offer?",
    "evidence": "",
    "idx": 3917
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`course`:`course`)\nWITH `course`.`dept_code` AS _groupby_col_0, sum(`course`.`crs_credit`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many credits does the department offer?",
    "evidence": "",
    "idx": 3918
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`class`:`class`)\nWITH `class`.`class_room` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `class_room`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of classes offered for all class rooms that held at least 2 classes.",
    "evidence": "",
    "idx": 3919
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t2`:`course`)\nWHERE `t1`.`crs_code` = `t2`.`crs_code`\nWITH `t2`.`dept_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of classes in each department.",
    "evidence": "",
    "idx": 3921
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t2`:`course`)\nWHERE `t1`.`crs_code` = `t2`.`crs_code`\nWITH `t2`.`dept_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many classes are held in each department?",
    "evidence": "",
    "idx": 3922
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t2`:`course`)-[offered_by_0:offered_by]->(`t3`:`department`)\nWHERE `t1`.`crs_code` = `t2`.`crs_code`\nAND `t2`.`dept_code` = `t3`.`dept_code`\nWITH `t3`.`school_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `school_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of classes in each school.",
    "evidence": "",
    "idx": 3923
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWITH `employee`.`emp_jobcode` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `emp_jobcode`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the count and code of the job has most employees.",
    "evidence": "",
    "idx": 3927
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`professor`:`professor`)\nWHERE `professor`.`prof_high_degree` = 'Ph.D.'\nWITH `professor`.`dept_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of professors with a Ph.D. degree in each department.",
    "evidence": "",
    "idx": 3929
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`professor`:`professor`)\nWHERE `professor`.`prof_high_degree` = 'Ph.D.'\nWITH `professor`.`dept_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many professors have a Ph.D. in each department?",
    "evidence": "",
    "idx": 3930
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`dept_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students for each department.",
    "evidence": "",
    "idx": 3931
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`dept_code` AS _groupby_col_0, sum(`student`.`stu_hrs`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of hours have done for all students in each department.",
    "evidence": "",
    "idx": 3933
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`dept_code` AS _groupby_col_0, sum(`student`.`stu_hrs`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many hours do the students spend studying in each department?",
    "evidence": "",
    "idx": 3934
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`dept_code` AS _groupby_col_0, MAX(`student`.`stu_gpa`) AS _groupby_col_1, avg(`student`.`stu_gpa`) AS _groupby_col_2, min(`student`.`stu_gpa`) AS _groupby_col_3\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`, _groupby_col_3 AS `_col_2`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the max, average, and minimum gpa of all students in each department.",
    "evidence": "",
    "idx": 3935
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t2`:`course`)-[offered_by_0:offered_by]->(`t1`:`department`)\nWHERE `t1`.`dept_code` = `t2`.`dept_code`\nAND (`t1`.`dept_name` = 'Computer Info. Systems')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many courses are offered by the Computer Info. Systems department?",
    "evidence": "",
    "idx": 3945
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t2`:`course`)-[offered_by_0:offered_by]->(`t1`:`department`)\nWHERE `t1`.`dept_code` = `t2`.`dept_code`\nAND (`t1`.`dept_name` = 'Computer Info. Systems')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many courses does the department of Computer Information Systmes offer?",
    "evidence": "",
    "idx": 3946
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t2`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t1`:`course`)\nWHERE `t1`.`crs_code` = `t2`.`crs_code`\nWITH `t1`.`dept_code` AS _groupby_col_0, sum(`t1`.`crs_credit`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total credits of all classes offered by each department.",
    "evidence": "",
    "idx": 3949
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t2`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t1`:`course`)\nWHERE `t1`.`crs_code` = `t2`.`crs_code`\nWITH `t1`.`dept_code` AS _groupby_col_0, sum(`t1`.`crs_credit`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `dept_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the total number of credits offered by each department?",
    "evidence": "",
    "idx": 3950
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total number of employees.",
    "evidence": "",
    "idx": 3957
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`professor`:`professor`)\nWHERE `professor`.`prof_high_degree` = 'Ph.D.'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many professors do have a Ph.D. degree?",
    "evidence": "",
    "idx": 3959
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`professor`:`professor`)\nWHERE `professor`.`prof_high_degree` = 'Ph.D.'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of professors with a Ph.D. ?",
    "evidence": "",
    "idx": 3960
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH ()-[t2:enrolled_in]->(`t1`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t3`:`course`)-[offered_by_0:offered_by]->(`t4`:`department`)\nWHERE `t1`.`class_code` = `t2`.`class_code`\nAND `t1`.`crs_code` = `t3`.`crs_code`\nAND `t3`.`dept_code` = `t4`.`dept_code`\nAND (`t4`.`dept_name` = 'Accounting')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students are enrolled in the class taught by some professor from the accounting department?",
    "evidence": "",
    "idx": 3961
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH ()-[t2:enrolled_in]->(`t1`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t3`:`course`)-[offered_by_0:offered_by]->(`t4`:`department`)\nWHERE `t1`.`class_code` = `t2`.`class_code`\nAND `t1`.`crs_code` = `t3`.`crs_code`\nAND `t3`.`dept_code` = `t4`.`dept_code`\nAND (`t4`.`dept_name` = 'Accounting')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students are enrolled in some classes that are taught by an accounting professor?",
    "evidence": "",
    "idx": 3962
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`department`:`department`)\nRETURN `department`.`dept_name` AS `dept_name` ORDER BY `dept_name` IS NULL DESC, `dept_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "list names of all departments ordered by their names.",
    "evidence": "",
    "idx": 3963
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`class`:`class`)\nWHERE `class`.`class_room` = 'KLR209'\nRETURN `class`.`class_code` AS `class_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the codes of all courses that take place in room KLR209.",
    "evidence": "",
    "idx": 3965
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE `employee`.`emp_jobcode` = 'PROF'\nORDER BY `employee`.`emp_dob` IS NULL DESC, `employee`.`emp_dob`  \nRETURN `employee`.`emp_fname` AS `emp_fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the first name of all employees with job code PROF ordered by their date of birth.",
    "evidence": "",
    "idx": 3967
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`professor`)-[is_a_0:is_a]->(`t2`:`employee`)\nWHERE `t1`.`emp_num` = `t2`.`emp_num`\nRETURN `t2`.`emp_fname` AS `emp_fname`, `t1`.`prof_office` AS `prof_office` ORDER BY `t2`.`emp_fname` IS NULL DESC, `t2`.`emp_fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names and offices of all professors sorted by alphabetical order of their first name.",
    "evidence": "",
    "idx": 3969
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:enrolled_in]->()\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND (`t2`.`enroll_grade` = 'C')\nRETURN DISTINCT `t1`.`stu_fname` AS `stu_fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the first name of students who got grade C in any class?",
    "evidence": "",
    "idx": 3975
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:enrolled_in]->()\nWHERE `t1`.`stu_num` = `t2`.`stu_num`\nAND (`t2`.`enroll_grade` = 'C')\nRETURN DISTINCT `t1`.`stu_fname` AS `stu_fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names of all students who got a grade C in a class?",
    "evidence": "",
    "idx": 3976
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t2`:`professor`)-[is_a_0:is_a]->(`t1`:`employee`)\nWHERE `t1`.`emp_num` = `t2`.`emp_num`\nAND (`t2`.`prof_office` = 'DRE 102')\nRETURN `t1`.`emp_lname` AS `emp_lname`, `t1`.`emp_hiredate` AS `emp_hiredate`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last name and hire date of the professor who is in office DRE 102.",
    "evidence": "",
    "idx": 3981
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:enrolled_in]->(`t1`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t4`:`course`)\nWHERE `t1`.`class_code` = `t2`.`class_code`\nAND `t3`.`stu_num` = `t2`.`stu_num`\nAND `t4`.`crs_code` = `t1`.`crs_code`\nAND (`t3`.`stu_lname` = 'Smithson')\nRETURN `t4`.`crs_description` AS `crs_description`, `t4`.`crs_credit` AS `crs_credit`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the description and credit of the course which the student whose last name is Smithson took?",
    "evidence": "",
    "idx": 3985
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:enrolled_in]->(`t1`:`class`)-[belongs_to_course_0:belongs_to_course]->(`t4`:`course`)\nWHERE `t1`.`class_code` = `t2`.`class_code`\nAND `t3`.`stu_num` = `t2`.`stu_num`\nAND `t4`.`crs_code` = `t1`.`crs_code`\nAND (`t3`.`stu_lname` = 'Smithson')\nRETURN `t4`.`crs_description` AS `crs_description`, `t4`.`crs_credit` AS `crs_credit`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many credits is the course that the student with the last name Smithson took, and what is its description?",
    "evidence": "",
    "idx": 3986
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`professor`:`professor`)\nWHERE `professor`.`prof_high_degree` = 'Ph.D.' OR `professor`.`prof_high_degree` = 'MA'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many professors who has a either Ph.D. or MA degree?",
    "evidence": "",
    "idx": 3987
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_1",
    "gql_statement": "MATCH (`professor`:`professor`)\nWHERE `professor`.`prof_high_degree` = 'Ph.D.' OR `professor`.`prof_high_degree` = 'MA'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many professors attained either Ph.D. or Masters degrees?",
    "evidence": "",
    "idx": 3988
  }
]