[
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nMATCH (`t2`:`shipment`)-[handled_by_0:handled_by]->(`t3`:`driver`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nAND `t3`.`driver_id` = `t2`.`driver_id`\nAND (`t1`.`truck_id` = '3' AND `t2`.`ship_date` = '2016-09-19')\nRETURN `t3`.`first_name` AS `first_name`, `t3`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who was the driver of truck no.3 on 2016/9/19? Tell the full name.",
    "evidence": "truck no. 3 refers to truck_id = 3; on 2016/9/19 refers to ship_date = '2016-09-19'; full name refers to first_name, last_name",
    "idx": 4431
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`ship_id` = '1369')\nRETURN CASE WHEN `t2`.`population`=0 THEN NULL ELSE `t2`.`area` / `t2`.`population` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the population density of the city as the destination of shipment no.1369.",
    "evidence": "shipment no. 1369 refers to ship_id = 1369; population density refers to Divide (area, population)",
    "idx": 4432
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nMATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t3`:`customer`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND `t3`.`cust_id` = `t1`.`cust_id`\nAND (`t2`.`city_name` = 'Downey' AND CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2016' AND `t3`.`state` = 'CA')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the shipments for Downey, how many shipments were shipped to California in 2016?",
    "evidence": "\"Downey\" is the city_name; 'California' is the state, whose abbreviation is CA; in 2016 refers to year(ship_date) = 2016,",
    "idx": 4441
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`state` = 'TX'\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `customer`.`cust_type` = 'manufacturer' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Determine the percentage of manufacturers who are from Texas among all of Lorenzo's customers.",
    "evidence": "\"Texas\" refers to state = 'TX'; 'manufacturer' is the cust_type; percentage = Divide (Count(cust_id where state = 'TX'), Count(cust_id)) * 100",
    "idx": 4444
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t2`.`city_name` = 'San Mateo' AND CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2016')\nRETURN sum(`t1`.`weight`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the total weight of shipments transported to San Mateo, California, in 2016.",
    "evidence": "\"San Mateo\" is the city_name; in 2016 refers to Cast(ship_date as DATE) = 2016",
    "idx": 4445
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nAND (`t1`.`make` = 'Peterbilt' AND CASE WHEN `t2`.`ship_date` is not NULL THEN apoc.temporal.format(`t2`.`ship_date`,'yyyy') ELSE NULL END = '2016')\nORDER BY `t1`.`model_year` IS NULL ASC, `t1`.`model_year` DESC \nRETURN sum(`t2`.`weight`) AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the total weight of shipments transported in 2016 by the newest Peterbilt.",
    "evidence": "transported in 2016 refers to CAST(ship_date as DATE) = 2016; 'Peterbilt' is the make; newest refers to Max(model_year)",
    "idx": 4446
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nMATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t3`:`city`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND `t3`.`city_id` = `t1`.`city_id`\nAND (`t3`.`city_name` = 'Boston')\nRETURN `t1`.`weight` AS `weight`, `t2`.`cust_name` AS `cust_name` ORDER BY `t1`.`weight` IS NULL ASC, `t1`.`weight` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the maximum weight of the shipment carried to Boston? Name the customer of that shipment.",
    "evidence": "\"Boston\" is the city_name; maximum weight refers to Max(weight); customer refers to cust_name",
    "idx": 4447
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`ship_id` = '1002')\nRETURN `t2`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where was shipment no. 1002 headed?",
    "evidence": "shipment no. 1002 refers to ship_id = 1002; where shipment was headed refers to city_name",
    "idx": 4448
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nMATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t3`:`driver`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND `t3`.`driver_id` = `t1`.`driver_id`\nAND (`t2`.`city_name` = 'New York' AND `t1`.`ship_date` =~ '(?i)(?s)2016-02.*')\nRETURN `t3`.`first_name` AS `first_name`, `t3`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the full name of the driver who delivered a shipment to the city of New York in February 2016.",
    "evidence": "\"New York\" is the city_name; in February 2016 refers to ship_date LIKE '2016-02%'; full name refers to first_name, last_name",
    "idx": 4450
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nMATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t3`:`city`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND `t3`.`city_id` = `t1`.`city_id`\nAND (`t3`.`city_name` = 'Oak Park')\nRETURN `t2`.`cust_name` AS `cust_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the customer who sent the shipment to Oak Park.",
    "evidence": "\"Oak Park\" is the city_name; customer name refers to cust_name",
    "idx": 4451
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nMATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t3`:`driver`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND `t3`.`driver_id` = `t1`.`driver_id`\nAND (`t3`.`first_name` = 'Andrea' AND `t3`.`last_name` = 'Simons' AND `t2`.`city_name` = 'Huntsville' AND CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2016')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Determine the number of shipments delivered by Andrea Simons to Huntsville in 2016.",
    "evidence": "\"Huntsville\" is the city_name; in 2016 refers to Cast(ship_date AS DATE) = 2016; number of shipment refers to Count(ship_id)",
    "idx": 4452
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t2`.`cust_name` = 'Sunguard Window Tinting & Truck Accessories' AND CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2017')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`weight` >= 10000 THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all shipments placed by Sunguard Window Tinting & Truck Accessories in 2017, identify the percentage of shipments whose weight exceeded 10,000 pounds.",
    "evidence": "\"Sunguard Window Tinting & Truck Accessories\" is the cust_name; weight exceed 10,000 pounds refers to weight > = 10000; in 2017 refers to Cast(ship_date AS DATE) = 2017; percentage = Divide (Sum(weight > = 10000), Sum(weight)) * 100",
    "idx": 4454
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nMATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t3`:`customer`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND `t3`.`cust_id` = `t1`.`cust_id`\nAND (`t2`.`first_name` = 'Sue' AND `t2`.`last_name` = 'Newell')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t3`.`cust_name` = 'Autoware Inc' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `per`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all shipments delivered by Sue Newel, identify the percentage of shipments that were placed by Autoware Inc.",
    "evidence": "\"Autoware Inc\" is the cust_name; percentage = Divide (Count(ship_id where cust_name = 'Autoware Inc'), Count(ship_id)) * 100",
    "idx": 4455
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`shipment`)-[destined_to_1:destined_to]->(`t2_sub0`:`city`)\nWHERE `t1_sub0`.`city_id` = `t2_sub0`.`city_id`\nAND (`t2_sub0`.`state` = 'New Jersey')\nWITH `t2_sub0`.`city_id` AS _groupby_col_0, sum(`t1_sub0`.`weight`) AS _groupby_col_1\nWHERE _groupby_col_1 > 20000\nRETURN _groupby_col_0 AS `cityid`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cities which belong to New Jersey have transported weight greater than 20000?",
    "evidence": "\"New Jersey\" is the state; transported weight greater than 20000 refers to Sum(weight) > 20000",
    "idx": 4456
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[destined_to_0:destined_to]->(`t1`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`population` > 50000 AND CASE WHEN `t2`.`ship_date` is not NULL THEN apoc.temporal.format(`t2`.`ship_date`,'yyyy') ELSE NULL END = '2017')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many cities whose polulation is larger than 50000 pounds have shipment in 2017?",
    "evidence": "population is larger than 50000 refers to population > 50000",
    "idx": 4457
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nAND (`t1`.`make` = 'Peterbilt')\nRETURN `t2`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the weight of shipments transported by Peterbilt.",
    "evidence": "\"Peterbilt\" is the make",
    "idx": 4458
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nAND (`t2`.`ship_id` = '1003')\nRETURN `t1`.`model_year` AS `model_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the model year of the truck used in shipment id 1003?",
    "evidence": "shipment id 1003 refers to ship_id = 1003",
    "idx": 4459
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nAND (`t2`.`ship_id` = '1011')\nRETURN `t1`.`make` AS `make`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the brand of truck used in shipment id 1011?",
    "evidence": "shipment id 1011 refers to ship_id = 1011; brand of truck refers to make",
    "idx": 4460
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (`t1`.`ship_id` = '1055')\nRETURN `t2`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the state of driver who transported the shipment id 1055.",
    "evidence": "shipment id 1055 refers to ship_id = 1055",
    "idx": 4462
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (`t1`.`ship_date` = '2016-03-02')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the full name of driver who transported the items on 3/2/2016.",
    "evidence": "on 3/2/2016 refers to ship_date = '2016-02-03'; full name refers to first_name, last_name",
    "idx": 4463
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (`t1`.`ship_id` = '1088')\nRETURN `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the last name of driver who transported shipment id 1088?",
    "evidence": "shipment id 1088 refers to ship_id = 1088",
    "idx": 4466
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nAND (`t2`.`ship_id` = '1055')\nRETURN `t1`.`make` AS `make`, `t1`.`model_year` AS `model_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the brand and model of truck used in shipment id 1055?",
    "evidence": "shipment id 1055 refers to ship_id = 1055; brand refers to make; model refers to model_year",
    "idx": 4467
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nORDER BY `t1`.`weight` IS NULL DESC, `t1`.`weight`  \nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the driver that transported the lightest weight of shipment? Provide the full name of the driver.",
    "evidence": "lightest weight refers to Min(weight); full name refers to first_name, last_name",
    "idx": 4474
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[ordered_by_0:ordered_by]->(`t1`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (CASE WHEN `t2`.`ship_date` is not NULL THEN apoc.temporal.format(`t2`.`ship_date`,'yyyy') ELSE NULL END = '2016' AND `t1`.`state` = 'CA')\nRETURN COUNT(*) AS `per`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many shipments were shipped to customers living in California in year 2016?",
    "evidence": "living in California refers to state = 'CA'; in year 2016 refers to CAST(ship_date AS DATE) = 2016",
    "idx": 4475
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[ordered_by_0:ordered_by]->(`t1`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t2`.`ship_date` =~ '(?i)(?s)2017-02.*')\nRETURN `t1`.`cust_name` AS `cust_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the name of the customers that received a shipment in February 2017.",
    "evidence": "shipment in February 2017 refers to ship_date LIKE '2017-02-%'; name of customer refers to cust_name",
    "idx": 4477
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[destined_to_0:destined_to]->(`t1`:`city`)\nMATCH (`t2`:`shipment`)-[handled_by_0:handled_by]->(`t3`:`driver`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND `t3`.`driver_id` = `t2`.`driver_id`\nAND (`t3`.`first_name` = 'Zachery' AND `t3`.`last_name` = 'Hicks' AND `t1`.`city_name` = 'New York' AND CASE WHEN `t2`.`ship_date` is not NULL THEN apoc.temporal.format(`t2`.`ship_date`,'yyyy') ELSE NULL END = '2016')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many shipments did Zachery Hicks transport goods to New York in the year 2016?",
    "evidence": "\"New York\" is the city_name; in 2016 refers to CAST(ship_date AS DATE) = 2016",
    "idx": 4479
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nMATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t3`:`city`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND `t1`.`city_id` = `t3`.`city_id`\nAND (`t2`.`first_name` = 'Zachery' AND `t2`.`last_name` = 'Hicks')\nRETURN DISTINCT `t3`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the cities where Zachery Hicks transported goods.",
    "evidence": "city refers to city_name",
    "idx": 4482
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2017')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`first_name` = 'Zachery' AND `t2`.`last_name` = 'Hicks' THEN `t1`.`ship_id` ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average number of shipments that Zachery Hicks shipped in year 2017.",
    "evidence": "in year 2017 refers to CAST(ship_date AS DATE) = 2017; percentage = Divide (Count(ship_id where first_name = 'Zachery' AND last_name = 'Hicks'), Count(ship_id)) * 100",
    "idx": 4483
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2016')\nRETURN CASE WHEN sum(`t1`.`weight`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`first_name` = 'Zachery' AND `t2`.`last_name` = 'Hicks' THEN `t1`.`weight` ELSE 0 END)) * 100 / sum(`t1`.`weight`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of the weight of goods being transported by Zachery Hicks to California in year 2016.",
    "evidence": "\"California\" is the state; in 2016 refers to CAST (ship_date AS DATE) = 2016; percentage = Divide (Sum(weight where first_name = 'Zachery' AND last_name = 'Hicks'), Sum(weight)) * 100",
    "idx": 4484
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nMATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t3`:`driver`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND `t3`.`driver_id` = `t1`.`driver_id`\nORDER BY `t2`.`population` IS NULL DESC, `t2`.`population`  \nRETURN `t3`.`first_name` AS `first_name`, `t3`.`last_name` AS `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the drivers who shipped the shipments to the least populated city.",
    "evidence": "least populated city refers to Min(population); name refers to first_name, last_name",
    "idx": 4487
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nAND (`t2`.`ship_id` = '1233')\nRETURN `t1`.`model_year` AS `model_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What model year of truck delivered the ship ID 1233?",
    "evidence": "",
    "idx": 4489
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (`t2`.`first_name` = 'Maria' AND `t2`.`last_name` = 'Craft' AND CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2017')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the shipments delivered by Maria Craft, how many shipments were delivered in 2017?",
    "evidence": "delivered in 2017 refers to Cast(ship_date AS DATE) = 2017",
    "idx": 4491
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nAND (`t2`.`ship_id` = '1245')\nRETURN `t1`.`model_year` AS `model_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the truck's model year used to ship the ship ID 1245?",
    "evidence": "",
    "idx": 4492
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (`t1`.`ship_id` = '1127')\nRETURN `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where does the driver of ship ID 1127 live?",
    "evidence": "live refers to address",
    "idx": 4493
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t1`.`ship_id` = '1047')\nRETURN `t2`.`annual_revenue` AS `annual_revenue`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the annual revenue of the customer of ship ID 1047.",
    "evidence": "",
    "idx": 4494
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`ship_date` = '2017-01-16')\nRETURN `t2`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the destination city of the shipment shipped by January 16, 2017.",
    "evidence": "January 16, 2017 refers to ship_date = '2017-01-16'; city refers to city_name",
    "idx": 4496
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t1`.`ship_id` = '1147')\nRETURN `t2`.`cust_name` AS `cust_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the customer of ship ID 1147?",
    "evidence": "name of customer refers to cust_name",
    "idx": 4498
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nORDER BY `t2`.`population` IS NULL ASC, `t2`.`population` DESC \nRETURN `t1`.`ship_id` AS `ship_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the ship ID of shipments shipped to the most populated city.",
    "evidence": "most populated city refers to Max(population)",
    "idx": 4499
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (`t1`.`ship_date` = '2016-02-22')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the driver's name of the shipment shipped on February 22, 2016.",
    "evidence": "on February 22, 2016 refers to ship_date = '2016-02-22'; driver's name refers to first_name, last_name",
    "idx": 4500
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t2`.`annual_revenue` = 39448581)\nRETURN `t1`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the weight of the customer's shipment with annual revenue of 39448581.",
    "evidence": "",
    "idx": 4501
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t1`.`ship_id` = '1117')\nRETURN `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the customer's address for the shipment with ship ID 1117?",
    "evidence": "",
    "idx": 4502
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t2`.`state` = 'TX')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2017' THEN 1 ELSE 0 END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the shipments to a customer from Texas, what percentage of the shipments shipped in 2017?",
    "evidence": "\"Texas\" refers to state = 'TX'; shipped in 2017 refers to CAST(ship_date AS DATE) = 2017; percentage = Divide (Count (ship_id where CAST(ship_date AS DATE) = 2017), Count (ship_id)) * 100",
    "idx": 4503
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nRETURN sum(CASE  WHEN `t1`.`model_year` = '2005' THEN 1 ELSE 0 END) - sum(CASE  WHEN `t1`.`model_year` = '2006' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference between the number of shipments shipped by the truck with the model year 2005 and model year 2006.",
    "evidence": "\"2005\" and \"2006\" are both model_year of truck; difference = Subtract (Count (ship_id where model_year = 2005), Count(ship_id where model_year = 2006))",
    "idx": 4504
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "CALL(*) {\nMATCH (`shipment_sub0`:`shipment`)\nRETURN 95 * avg(`shipment_sub0`.`weight`) AS `_col_0`  \n}\nMATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (`t1`.`weight` * 100 > `_col_0`)\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the driver's name of the shipment with a weight greater than 95% of the average weight of all shipments.",
    "evidence": "weight greater than 95% of average weight refers to weight > Multiply (AVG(weight), 0.95); driver name refers to first_name, last_name",
    "idx": 4505
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`fl_date` = '2018/8/1'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many flights were there on 2018/8/1?",
    "evidence": "on 2018/8/1 refers to FL_DATE = '2018/8/1';",
    "idx": 4506
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`fl_date` = '2018/8/1' AND `airlines`.`origin` = 'JFK'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the flights on 2018/8/1, how many of them departed from an airport in New York?",
    "evidence": "on 2018/8/1 refers to FL_DATE = '2018/8/1'; departed from an airport in New York refers to ORIGIN = 'JFK';",
    "idx": 4507
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`fl_date` = '2018/8/1' AND `airlines`.`cancelled` = 1\nWITH `airlines`.`dest` AS _groupby_col_0\nRETURN _groupby_col_0 AS `dest`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the destination cities of all the flights that were cancelled on 2018/8/1.",
    "evidence": "destination cities refers to DEST; cancelled refers to CANCELLED = 1; on 2018/8/1 refers to FL_DATE = '2018/8/1';",
    "idx": 4508
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`airlines`:`airlines`)\nWHERE `airlines`.`cancellation_code` = 'A'\nWITH `airlines`.`fl_date` AS _groupby_col_0\nRETURN _groupby_col_0 AS `fl_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the dates of the flights that were cancelled due to the most serious reason.",
    "evidence": "dates of the flights refers to FL_DATE; cancelled refers to CANCELLED = 1; most serious reason refers to CANCELLATION_CODE = 'A';",
    "idx": 4509
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND (`t2`.`fl_date` = '2018/8/1' AND `t2`.`dep_delay` > 0)\nWITH `t1`.`description` AS _groupby_col_0\nRETURN _groupby_col_0 AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the departure airports of the flights on 2018/8/1 that were delayed.",
    "evidence": "departure airports refers ORIGIN; on 2018/8/1 refers to FL_DATE = '2018/8/1'; delayed refers to DEP_DELAY > 0;",
    "idx": 4510
  },
  {
    "filename": "train.json",
    "db_id": "airline",
    "gql_statement": "MATCH (`t2`:`airlines`)-[departs_from_0:departs_from]->(`t1`:`airports`)\nWHERE `t1`.`code` = `t2`.`origin`\nAND (`t2`.`fl_date` = '2018/8/1' AND `t1`.`description` = 'New York, NY: John F. Kennedy International')\nRETURN COUNT(`t1`.`code`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the flights on 2018/8/1, how many of them were scheduled to depart from John F. Kennedy International in New York?",
    "evidence": "on 2018/8/1 refers to FL_DATE = '2018/8/1'; depart from refers to ORIGIN; John F. Kennedy International in New York refers to Description = 'New York, NY: John F. Kennedy International';",
    "idx": 4511
  }
]