[
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t2`:`employees`)\nWHERE `t1`.`salesrepemployeenumber` = `t2`.`employeenumber`\nAND (`t1`.`customername` = 'Muscle Machine Inc')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the sales representitive of Muscle Machine Inc? Please give the employee's full name.",
    "evidence": "Sales representative refers to jobTitle = 'Sales Rep'; Muscle Machine Inc is name of customer;",
    "idx": 1080
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t2`:`employees`)\nWHERE `t1`.`salesrepemployeenumber` = `t2`.`employeenumber`\nAND (`t2`.`firstname` = 'Steve' AND `t2`.`lastname` = 'Patterson')\nRETURN `t1`.`customername` AS `customername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the customers that have Steve Patterson as their sales representitive.",
    "evidence": "Steve Patterson is an employee;",
    "idx": 1082
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t2`:`employees`)\nWHERE `t1`.`salesrepemployeenumber` = `t2`.`employeenumber`\nAND (`t2`.`firstname` = 'Leslie' AND `t2`.`lastname` = 'Jennings')\nORDER BY `t1`.`creditlimit` IS NULL ASC, `t1`.`creditlimit` DESC \nRETURN `t1`.`phone` AS `phone`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the phone numbers of the top 3 customers that have the highest credit limit and have Leslie Jennings as their sales representitive.",
    "evidence": "",
    "idx": 1084
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t`:`products`)\nWHERE `t`.`productline` = 'Classic Cars'\nRETURN `t`.`productname` AS `productname`, `t`.`msrp` - `t`.`buyprice` AS `_col_1` ORDER BY `t`.`msrp` - `t`.`buyprice` IS NULL ASC, `t`.`msrp` - `t`.`buyprice` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the product from the 'Classic Cars' production line that has the greatest expected profit.",
    "evidence": "The greatest expected profit refers to MAX(SUBTRACT(MSRP, buyPrice);",
    "idx": 1090
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[is_placed_by_0:is_placed_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t1`.`status` = 'In Process')\nRETURN `t2`.`customername` AS `customername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the name of customers who have orders that are still processing.",
    "evidence": "Still processing refers to status = 'In Process';",
    "idx": 1091
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "CALL(*) {\nMATCH (`employees_sub0`:`employees`)\nRETURN MAX(`employees_sub0`.`employeenumber`) AS `_col_0`  \n}\nMATCH (`t2`:`employees`)-[works_in_0:works_in]->(`t1`:`offices`)\nWHERE `t1`.`officecode` = `t2`.`officecode`\nAND (`t2`.`employeenumber` = `_col_0`)\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For the order has the most product ordered, name the customer who placed the order.",
    "evidence": "The largest order in terms of total price refers to MAX(SUM(MULTIPLY(quantityOrdered, priceEach)).",
    "idx": 1093
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[is_placed_by_0:is_placed_by]->(`t2`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t3`:`employees`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND `t2`.`salesrepemployeenumber` = `t3`.`employeenumber`\nAND (`t1`.`status` = 'Disputed')\nRETURN `t3`.`firstname` AS `firstname`, `t3`.`lastname` AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all customer names with orders that are disputed.",
    "evidence": "Orders that are disputed refer to status = 'Disputed'; the sales representative means employees; names refers to firstName, lastName.",
    "idx": 1094
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t2`:`employees`)-[works_in_0:works_in]->(`t1`:`offices`)\nWHERE `t1`.`officecode` = `t2`.`officecode`\nAND (`t1`.`country` = 'Japan')\nRETURN `t2`.`firstname` AS `firstname`, `t2`.`lastname` AS `lastname`, `t2`.`reportsto` AS `reportsto`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of employees in Japan office and who are they reporting to.",
    "evidence": "Japan is the name of the country; 'reportsTO' is the leader of the 'employeeNumber';",
    "idx": 1097
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t2`:`payments`)-[is_made_by_0:is_made_by]->(`t1`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (CASE WHEN `t2`.`paymentdate` is not NULL THEN apoc.temporal.format(`t2`.`paymentdate`,'yyyy') ELSE NULL END = '2004')\nRETURN CASE WHEN sum(`t2`.`amount`)=0 THEN NULL ELSE sum(CASE  WHEN `t1`.`customername` = 'Atelier graphique' THEN `t2`.`amount` ELSE 0 END) * 100 / sum(`t2`.`amount`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of the payment amount in 2004 was made by Atelier graphique?",
    "evidence": "DIVIDE(SUM(amount) where customerName = 'Atelier graphique'), (SUM(amount)) as percentage where year(paymentDate) = 2004;",
    "idx": 1098
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orderdetails`)\nMATCH (`t2`:`products`)\nWHERE `t1`.`productcode` = `t2`.`productcode`\nAND (`t1`.`ordernumber` = '10100')\nRETURN sum((`t1`.`priceeach` - `t2`.`buyprice`) * `t1`.`quantityordered`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the actual profit for order number 10100.",
    "evidence": "SUM(MULTIPLY(quantityOrdered (SUBTRACT (priceEach, buyPrice));",
    "idx": 1099
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t`:`payments`)\nWHERE `t`.`customernumber` = '103'\nRETURN sum(`t`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much did customer 103 pay in total?",
    "evidence": "Pay in total refers to SUM(amount);",
    "idx": 1100
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t`:`orderdetails`)\nWHERE `t`.`ordernumber` = '10100'\nRETURN sum(`t`.`priceeach` * `t`.`quantityordered`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total price of the order 10100?",
    "evidence": "SUM(MULTIPLY(quantityOrdered, priceEach)",
    "idx": 1101
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`products`)\nMATCH (`t2`:`orderdetails`)\nWHERE `t1`.`productcode` = `t2`.`productcode`\nORDER BY `t2`.`priceeach` IS NULL ASC, `t2`.`priceeach` DESC \nRETURN `t1`.`productname` AS `productname`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the top three product names with the highest unit price.",
    "evidence": "The highest unit price refers to MAX(priceEach)",
    "idx": 1102
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t2`:`customers`)-[is_assigned_to_0:is_assigned_to]->(`t1`:`employees`)\nWHERE `t1`.`employeenumber` = `t2`.`salesrepemployeenumber`\nAND (`t1`.`employeenumber` = '1370')\nORDER BY `t2`.`creditlimit` IS NULL ASC, `t2`.`creditlimit` DESC \nRETURN `t2`.`contactfirstname` AS `contactfirstname`, `t2`.`contactlastname` AS `contactlastname`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the customers of empolyee 1370, who has the highest credit limit?Please list the full name of the contact person.",
    "evidence": "Employee 1370 refers to employeeNumber = '1370';",
    "idx": 1103
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[is_placed_by_0:is_placed_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t2`.`creditlimit` = 45300)\nRETURN `t1`.`ordernumber` AS `ordernumber`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the order number of the customer whose credit card has a limit of 45300.",
    "evidence": "Credit card does not have a limit refers to creditLimit = 45300;",
    "idx": 1106
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`employees`)-[works_in_0:works_in]->(`t2`:`offices`)\nWHERE `t1`.`officecode` = `t2`.`officecode`\nAND (`t2`.`city` = 'NYC' AND `t1`.`jobtitle` = 'Sales Rep')\nRETURN `t1`.`lastname` AS `lastname`, `t1`.`firstname` AS `firstname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who are the sales representatives in New York City? List their full names.",
    "evidence": "New York City refers to city = 'NYC'; sales representative refers to jobTitle = 'Sales Rep';",
    "idx": 1107
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t1`:`payments`)-[is_made_by_0:is_made_by]->(`t2`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t1`.`checknumber` = 'GG31455')\nRETURN `t2`.`customername` AS `customername`, `t2`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the customer and list down the country with the check number GG31455.",
    "evidence": "",
    "idx": 1108
  },
  {
    "filename": "train.json",
    "db_id": "car_retails",
    "gql_statement": "MATCH (`t2`:`orders`)-[is_placed_by_0:is_placed_by]->(`t1`:`customers`)\nWHERE `t1`.`customernumber` = `t2`.`customernumber`\nAND (`t2`.`status` = 'Disputed')\nRETURN `t1`.`customername` AS `customername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the customer names with a disputed order status.",
    "evidence": "",
    "idx": 1110
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`county` = 'sonoma county'\nRETURN `geographic`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the cities in Sonoma County.",
    "evidence": "",
    "idx": 1115
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`region` = 'northern california'\nRETURN `geographic`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all cities in the Northern California Region.",
    "evidence": "",
    "idx": 1117
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE `location`.`city` = 'oakland' AND `location`.`street_name` = '11th street'\nRETURN `location`.`id_restaurant` AS `id_restaurant`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List by its ID number all restaurants on 11th Street in Oakland.",
    "evidence": "11th Street refers to street_name = '11th street'; Oakland refers to city = 'oakland'; ID number of restaurant refers to id_restaurant\n\n",
    "idx": 1118
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t2`.`label` = 'adelitas taqueria')\nRETURN `t1`.`street_name` AS `street_name`, `t1`.`street_num` AS `street_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate street and number of the Adelitas Taqueria Restaurants.",
    "evidence": "street refers to street_name; number refers to street_num; Adelitas Taqueria Restaurant refers to label = 'adelitas taqueria'",
    "idx": 1124
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`generalinfo`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t1`.`label` <> 'bakers square restaurant & pie shop')\nRETURN DISTINCT `t2`.`county` AS `county`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all counties where there is no Bakers Square Restaurant & Pie Shop.",
    "evidence": "no Bakers Square Restaurant & Pie Shop refers to label <> 'bakers square restaurant & pie shop'",
    "idx": 1127
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t2`.`county` = 'contra costa county')\nRETURN `t1`.`id_restaurant` AS `id_restaurant`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify all restaurants in Contra Costa County by id.",
    "evidence": "",
    "idx": 1130
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`generalinfo`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t2`.`county` = 'yolo county')\nRETURN `t1`.`id_restaurant` AS `id_restaurant`, `t1`.`label` AS `label`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify all the restaurants in Yolo County by their label.",
    "evidence": "",
    "idx": 1131
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t2`.`label` = 'aux delices vietnamese restaurant')\nRETURN DISTINCT `t1`.`street_num` AS `street_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the street numbers where Aux Delices Vietnamese Restaurant are located.",
    "evidence": "street numbers refers to street_num; Aux Delices Vietnamese Restaurant refers to label = 'aux delices vietnamese restaurant'",
    "idx": 1136
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`generalinfo`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t2`.`county` = 'marin county')\nRETURN `t1`.`id_restaurant` AS `id_restaurant`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify all the restaurants in Marin County by their id.",
    "evidence": "",
    "idx": 1137
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`generalinfo`)-[located_in_0:located_in]->(`t1`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t1`.`county` = 'santa cruz county')\nRETURN avg(`t2`.`review`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average rating of reviews for restaurants in Santa Cruz County.",
    "evidence": "average rating = divide(sum(review where county = 'santa cruz county'), count(id_restaurant where county = 'santa cruz county'))",
    "idx": 1139
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`generalinfo`:`generalinfo`)\nWHERE `generalinfo`.`food_type` = 'european'\nRETURN `generalinfo`.`label` AS `label`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all of the restaurants that serve European food.",
    "evidence": "restaurant refers to label; European food refers to food_type = 'european'",
    "idx": 1142
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`county` = 'unknown' AND `geographic`.`region` = 'unknown'\nRETURN `geographic`.`city` AS `city`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any five cities that have an unidentified county and region.",
    "evidence": "unidentified county and region refers to county = 'unknown' AND region = 'unknown'",
    "idx": 1145
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE `location`.`city` = 'Clayton'\nRETURN `location`.`street_name` AS `street_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all of the street names in Clayton City.",
    "evidence": "",
    "idx": 1147
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`location`)-[for_restaurant_0:for_restaurant]->(`t1`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t1`.`city` = 'Oakland' AND `t2`.`street_name` = '19th St')\nRETURN `t1`.`id_restaurant` AS `id_restaurant`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the restaurants that are located at \"19th St. Oakland\"?",
    "evidence": "restaurant refers to label; \"19th St. Oakland\" refers to street_name = '19th St' AND city = 'Oakland'",
    "idx": 1152
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`location`)-[for_restaurant_0:for_restaurant]->(`t1`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t2`.`street_num` = 106 AND `t2`.`street_name` = 'e 25th ave')\nRETURN `t1`.`food_type` AS `food_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What kind of restaurants can be found at \"106 E 25th Ave\"?",
    "evidence": "kind of restaurant refers to food_type; \"106 E 25th Ave\" refers to street_name = 'e 25th ave'",
    "idx": 1153
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)-[located_in_0:located_in]->(`t3`:`geographic`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND `t2`.`city` = `t3`.`city`\nAND (`t3`.`region` = 'unknown')\nRETURN `t2`.`label` AS `label`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please name any three restaurants that have an unidentified region.",
    "evidence": "restaurant name refers to label; unidentified region refers to region = 'unknown'",
    "idx": 1154
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`county` = 'san mateo county'\nRETURN `geographic`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List every city in San Mateo County.",
    "evidence": "",
    "idx": 1162
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`generalinfo`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t2`.`county` = 'marin county')\nRETURN `t1`.`label` AS `label`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide a list of restaurants from Marin county.",
    "evidence": "restaurant refers to label",
    "idx": 1167
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`location`)-[located_in_0:located_in]->(`t1`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t1`.`county` = 'alameda county')\nWITH `t2`.`street_name` AS _groupby_col_0, COUNT(`t2`.`id_restaurant`) AS _groupby_col_1\nWHERE _groupby_col_1 > 10\nRETURN _groupby_col_0 AS `street_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the streets with more than 10 restaurants in Alameda county.",
    "evidence": "street refers to street_name; more than 10 restaurants refers to count(id_restaurant) > 10",
    "idx": 1169
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`location`)-[located_in_0:located_in]->(`t1`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t1`.`region` = 'unknown')\nRETURN `t2`.`street_name` AS `street_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of the restaurant addresses from an unknown region.",
    "evidence": "restaurant address refers to street_num, street_name; unknown region refers to region = 'unknown'",
    "idx": 1171
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t1`.`street_name` = 'park st')\nRETURN `t2`.`label` AS `label`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all of the restaurants on Park St.",
    "evidence": "restaurant refers to label; Park St refers to street_name = 'park st'",
    "idx": 1176
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`generalinfo`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t1`.`food_type` = 'chinese')\nWITH `t1`.`id_restaurant` AS _groupby_col_0, avg(`t1`.`review`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the average reviews of Chinese restaurants for each county from highest to lowest.",
    "evidence": "Chinese restaurant refers to food_type = 'chinese'; average review refers to divide(sum(review), count(review))",
    "idx": 1178
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE `location`.`city` = 'San Francisco'\nRETURN `location`.`street_name` AS `street_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List street names in San Francisco city.",
    "evidence": "",
    "idx": 1179
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE `location`.`city` = 'Danville'\nRETURN `location`.`id_restaurant` AS `id_restaurant`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List restaurant ids located in Danville city.",
    "evidence": "",
    "idx": 1180
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`generalinfo`)\nMATCH (`t1`:`location`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t2`.`food_type` = 'American')\nRETURN `t1`.`street_name` AS `street_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate the street names of restaurants with food type is American.",
    "evidence": "",
    "idx": 1183
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`generalinfo`)-[located_in_0:located_in]->(`t2`:`geographic`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t2`.`county` = 'Santa Cruz county')\nRETURN `t1`.`label` AS `label`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate which labels have the city located in Santa Cruz.",
    "evidence": "Santa Cruz refers to county = 'Santa Cruz county'",
    "idx": 1184
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`location`)-[for_restaurant_0:for_restaurant]->(`t1`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t2`.`street_name` = 'Broadway' AND `t2`.`street_num` = 430)\nRETURN `t1`.`review` AS `review`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the review of the restaurant at 430, Broadway.",
    "evidence": "430 Broadway refers to street_num = 430 and street_name = 'Broadway'",
    "idx": 1185
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`location`)-[for_restaurant_0:for_restaurant]->(`t1`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nORDER BY `t1`.`review` IS NULL ASC, `t1`.`review` DESC \nRETURN `t2`.`street_num` AS `street_num`, `t2`.`street_name` AS `street_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the address of the restaurant with the most popular reviews.",
    "evidence": "address refers to street_num, street_name; the most popular review refers to max(review)",
    "idx": 1186
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`geographic`:`geographic`)\nRETURN CASE WHEN COUNT(`geographic`.`region`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `geographic`.`region` = 'Napa Valley' THEN 1 ELSE 0 END)) * 100 / COUNT(`geographic`.`region`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the percentage of restaurant in Napa Valley.",
    "evidence": "Napa Valley refers to region = 'Napa Valley'; percentage = divide(count(id_restaurant where region = 'Napa Valley'), count(id_restaurant)) * 100%",
    "idx": 1187
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`geographic`:`geographic`)\nWHERE `geographic`.`county` = 'unknown'\nRETURN `geographic`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the cities with unknown country.",
    "evidence": "unknown county refers to county = 'unknown'",
    "idx": 1189
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`location`:`location`)\nWHERE `location`.`city` = 'sunnyvale'\nRETURN `location`.`id_restaurant` AS `id_restaurant`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the restaurant ID of restaurants located in Sunnyvale.",
    "evidence": "Sunnyvale refers to city = 'sunnyvale'",
    "idx": 1191
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t2`.`city` = 'santa cruz' AND `t1`.`street_name` = 'ocean st')\nRETURN `t2`.`review` AS `review`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the review of the restaurant located in Ocean St., Santa Cruz.",
    "evidence": "Ocean St. refers to street_name = 'ocean st'; Santa Cruz refers to city = 'santa cruz'",
    "idx": 1194
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`location`)-[for_restaurant_0:for_restaurant]->(`t1`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t1`.`review` = 2.7 AND `t2`.`city` = 'oakland' AND `t1`.`food_type` = 'bar')\nRETURN `t2`.`street_num` AS `street_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the street number of a bar in Oakland with a 2.7 review.",
    "evidence": "street number refers to street_num; bar refers to food_type = 'bar'; Oakland refers to city = 'oakland'; 2.7 review refers to review = 2.7",
    "idx": 1195
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t2`.`label` = 'Tulocay winery' AND `t2`.`food_type` = 'winery')\nRETURN `t1`.`street_num` AS `street_num`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the listed winery, what is the street number of the winery named \"Tulocay Winery\"?",
    "evidence": "winery refers to food_type = 'winery'; street number refers to street_num; \"Tulocay Winery\" refers to label = 'Tulocay winery'",
    "idx": 1197
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t2`.`city` = 'hayward' AND `t1`.`street_name` = 'mission blvd')\nRETURN `t2`.`review` AS `review`, `t2`.`label` AS `label`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the review and label of the restaurants in Mission Blvd., Hayward.",
    "evidence": "Mission Blvd. refers to street_name = 'mission blvd'; Hayward refers to city = 'hayward'",
    "idx": 1198
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t2`.`label` = 'sanuki restaurant')\nRETURN `t2`.`city` AS `city`, `t1`.`street_num` AS `street_num`, `t1`.`street_name` AS `street_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full address of the restaurant named \"Sanuki Restaurant\"?",
    "evidence": "full address refers to city, street_num, street_name; restaurant named \"Sanuki Restaurant\" refers to label = 'sanuki restaurant'",
    "idx": 1203
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (`t1`.`street_num` = 22779 AND `t1`.`street_name` = '6th St' AND `t2`.`city` = 'hayward')\nRETURN `t2`.`food_type` AS `food_type`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the food type of the restaurant located in 22779 6th St., Hayward City.",
    "evidence": "22779 refers to street_num = 22779; 6th St. refers to street_name = '6th St'",
    "idx": 1204
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t1`:`location`)-[for_restaurant_0:for_restaurant]->(`t2`:`generalinfo`)\nWHERE `t1`.`id_restaurant` = `t2`.`id_restaurant`\nAND (1000 <= `t1`.`street_num` <= 2000)\nRETURN CASE WHEN COUNT(`t1`.`id_restaurant`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`food_type` = 'afghani' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`id_restaurant`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the restaurants located on the street number ranges from 1000 to 2000, what is the percentage of Afghani restaurants are there?",
    "evidence": "street number ranges from 1000 to 2000 refers to 1000 < = street_num < = 2000; Afghani restaurant refers to food_type = 'afghani'; percentage = divide(count(id_restaurant where food_type = 'afghani'), count(id_restaurant)) * 100%",
    "idx": 1206
  },
  {
    "filename": "train.json",
    "db_id": "restaurant",
    "gql_statement": "MATCH (`t2`:`generalinfo`)\nMATCH (`t1`:`location`)\nWHERE `t1`.`city` = `t2`.`city`\nAND (`t2`.`food_type` = 'pizza' AND `t1`.`city` = 'san jose')\nRETURN `t1`.`street_name` AS `street_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the streets where pizza-serving restaurants are found in San Jose.",
    "evidence": "street refers to street_name; pizza-serving restaurant refers to food_type = 'pizza'; San Jose refers to city = 'san jose'",
    "idx": 1215
  }
]