[
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[t1:has_dish]->(`t4`:`dish`)\nMATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t3`:`menu`)\nWHERE `t1`.`menu_page_id` = `t2`.`id`\nAND `t2`.`menu_id` = `t3`.`id`\nAND `t1`.`dish_id` = `t4`.`id`\nAND (`t3`.`name` = 'Zentral Theater Terrace')\nRETURN `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the dishes that appeared on the menu \"Zentral Theater Terrace\".",
    "evidence": "Zentral Theater Terrace is a name of menu;",
    "idx": 4314
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[t1:has_dish]->(`t4`:`dish`)\nMATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t3`:`menu`)\nWHERE `t1`.`menu_page_id` = `t2`.`id`\nAND `t2`.`menu_id` = `t3`.`id`\nAND `t1`.`dish_id` = `t4`.`id`\nAND (`t3`.`name` = 'Zentral Theater Terrace')\nORDER BY `t1`.`price` IS NULL ASC, `t1`.`price` DESC \nRETURN `t4`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which dish has the highest price on the menu \"Zentral Theater Terrace\"? Please give its name.",
    "evidence": "highest price refers to MAX(Price); Zentral Theater Terrace is a name of menu;",
    "idx": 4315
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[t1:has_dish]->()\nMATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t3`:`menu`)\nWHERE `t1`.`menu_page_id` = `t2`.`id`\nAND `t2`.`menu_id` = `t3`.`id`\nRETURN sum(CASE  WHEN `t3`.`name` = 'Zentral Theater Terrace' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many dishes are there on the menu \"Zentral Theater Terrace\"?",
    "evidence": "Zentral Theater Terrace is a name of menu;",
    "idx": 4316
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[t1:has_dish]->()\nMATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t3`:`menu`)\nWHERE `t1`.`menu_page_id` = `t2`.`id`\nAND `t2`.`menu_id` = `t3`.`id`\nRETURN sum(CASE  WHEN `t3`.`name` = 'Waldorf Astoria' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many dishes are there in total in the menus with the name \"Waldorf Astoria\"?",
    "evidence": "FALSE;",
    "idx": 4317
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[t1:has_dish]->(`t4`:`dish`)\nMATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t3`:`menu`)\nWHERE `t1`.`menu_page_id` = `t2`.`id`\nAND `t2`.`menu_id` = `t3`.`id`\nAND `t1`.`dish_id` = `t4`.`id`\nAND (`t4`.`name` = 'Clear green turtle' AND `t3`.`sponsor` IS NULL)\nRETURN `t2`.`menu_id` AS `menu_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the menus that are DIYs of the restaurant and have the dish \"Clear green turtle\".",
    "evidence": "IDs of the menus refers to menu_id; menus that are DIYs of the restaurant refers to sponsor is null; Clear green turtle is a name of dish;",
    "idx": 4318
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[t2:has_dish]->(`t3`:`dish`)\nWHERE `t1`.`id` = `t2`.`menu_page_id`\nAND `t2`.`dish_id` = `t3`.`id`\nAND (`t3`.`name` = 'Clear green turtle')\nRETURN avg(`t1`.`page_number`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average page number of the menus that have the dish \"Clear green turtle\"?",
    "evidence": "average page number = AVG(page_number); Clear green turtle is a name of dish;",
    "idx": 4319
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[t1:has_dish]->()\nMATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t3`:`menu`)\nWHERE `t1`.`menu_page_id` = `t2`.`id`\nAND `t2`.`menu_id` = `t3`.`id`\nAND (`t3`.`name` = 'Zentral Theater Terrace')\nRETURN CASE WHEN COUNT(`t1`.`price`)=0 THEN NULL ELSE sum(`t1`.`price`) / COUNT(`t1`.`price`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average price of the dishes on the menu \"Zentral Theater Terrace\"?",
    "evidence": "average price = AVG(price); Zentral Theater Terrace refers to menu;",
    "idx": 4320
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[t2:has_dish]->(`t3`:`dish`)\nWHERE `t1`.`id` = `t2`.`menu_page_id`\nAND `t2`.`dish_id` = `t3`.`id`\nAND (`t1`.`page_number` = 30)\nORDER BY `t1`.`full_height` IS NULL ASC, `t1`.`full_height` DESC, `t1`.`full_height` IS NULL DESC, `t1`.`full_height`  \nRETURN `t3`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the dishes included on page number 30 with the least in full height.",
    "evidence": "least in full height refers to MIN(full_height);",
    "idx": 4330
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[part_of_0:part_of]->(`t2`:`menu`)\nWHERE `t2`.`id` = `t1`.`menu_id`\nORDER BY `t2`.`page_count` IS NULL ASC, `t2`.`page_count` DESC \nRETURN `t1`.`page_number` AS `page_number`, `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the page IDs and name of the menu which had the highest page count.",
    "evidence": "page IDs refers to page_number; highest page count refers to MAX(page_count);",
    "idx": 4331
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[t1:has_dish]->(`t4`:`dish`)\nMATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t3`:`menu`)\nWHERE `t1`.`menu_page_id` = `t2`.`id`\nAND `t2`.`menu_id` = `t3`.`id`\nAND `t1`.`dish_id` = `t4`.`id`\nAND (`t4`.`name` = 'Fresh lobsters in every style')\nRETURN `t2`.`menu_id` AS `menu_id`, `t1`.`xpos` AS `xpos`, `t1`.`ypos` AS `ypos`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the numbers of the menu item which includes Fresh lobsters in every style and location where that dish was used on a menu.",
    "evidence": "Fresh lobsters in every style' is a name of dish; location where the dish was used on a menu = (xpos, ypos);",
    "idx": 4332
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[t1:has_dish]->(`t4`:`dish`)\nMATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t3`:`menu`)\nWHERE `t1`.`menu_page_id` = `t2`.`id`\nAND `t2`.`menu_id` = `t3`.`id`\nAND `t1`.`dish_id` = `t4`.`id`\nAND (`t3`.`sponsor` = 'CHAS.BRADLEY\\'S OYSTER & DINING ROOM' AND `t1`.`xpos` < 0.25 AND `t1`.`ypos` < 0.25)\nRETURN `t4`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the dishes that appeared at the left upper corner of the CHAS.BRADLEY'S OYSTER & DINING ROOM\"s sponsored menu.",
    "evidence": "appeared at the left upper corner refers to xpos < 0.25 and ypos < 0.25; CHAS.BRADLEY'S OYSTER & DINING ROOM refers to sponsor = 'CHAS.BRADLEY''S OYSTER & DINING ROOM';",
    "idx": 4333
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[t1:has_dish]->(`t4`:`dish`)\nMATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t3`:`menu`)\nWHERE `t1`.`menu_page_id` = `t2`.`id`\nAND `t2`.`menu_id` = `t3`.`id`\nAND `t1`.`dish_id` = `t4`.`id`\nAND (`t4`.`name` = 'Cerealine with Milk')\nRETURN `t3`.`name` AS `name`, `t3`.`event` AS `event`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the sponsor and event of the menu which includes Cerealine with Milk.",
    "evidence": "Cerealine with Milk is a name of dish;",
    "idx": 4334
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`menu`:`menu`)\nWHERE `menu`.`sponsor` = 'Noviomagus'\nRETURN `menu`.`physical_description` AS `physical_description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please describe the menu sponsored by Noviomagus physically.",
    "evidence": "describe the menu physically refers to physical_description; sponsored by Noviomagus refers to sponsor = 'Noviomagus';",
    "idx": 4339
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`menu`:`menu`)\nWHERE `menu`.`sponsor` = 'Norddeutscher Lloyd Bremen'\nRETURN `menu`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the locations of menu sponsored by Norddeutscher Lloyd Bremen.",
    "evidence": "sponsored by Norddeutscher Lloyd Bremen refers to sponsor = 'Norddeutscher Lloyd Bremen';",
    "idx": 4341
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[part_of_0:part_of]->(`t2`:`menu`)\nWHERE `t2`.`id` = `t1`.`menu_id`\nAND (`t2`.`location` = 'Manhattan Hotel')\nRETURN `t1`.`image_id` AS `image_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the image IDs for menu located at Manhattan Hotel.",
    "evidence": "located at Manhattan Hotel refers to location = 'Manhattan Hotel';",
    "idx": 4343
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[part_of_0:part_of]->(`t2`:`menu`)\nWHERE `t2`.`id` = `t1`.`menu_id`\nAND (`t2`.`name` = 'El Fuerte Del Palmar')\nRETURN `t1`.`full_height` AS `full_height`, `t1`.`full_width` AS `full_width`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the full height and width for menu called \"El Fuerte Del Palmar\".",
    "evidence": "width refers to full_width; El Fuerte Del Palmar is a name of menu;",
    "idx": 4344
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t1`:`menu`)\nWHERE `t1`.`id` = `t2`.`menu_id`\nAND (`t1`.`name` = 'The Biltmore' AND `t2`.`uuid` = 'c02c9a3b-6881-7080-e040-e00a180631aa')\nRETURN CASE  WHEN `t2`.`uuid` = 'c02c9a3b-6881-7080-e040-e00a180631aa' THEN 'yes' ELSE 'no' END AS `yn`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Is \"c02c9a3b-6881-7080-e040-e00a180631aa\" the uuid for menu called \"The Biltmore\"?",
    "evidence": "if 'c02c9a3b-6881-7080-e040-e00a180631aa' can be found in uuid, it means the 'c02c9a3b-6881-7080-e040-e00a180631aa' is the uuid for the menu called The Biltmore; if 'c02c9a3b-6881-7080-e040-e00a180631aa' can not be found in uuid, it means the 'c02c9a3b-6881-7080-e040-e00a180631aa' is not the uuid for the menu called The Biltmore; The Biltmore is a name of menu;",
    "idx": 4345
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[part_of_0:part_of]->(`t2`:`menu`)\nWHERE `t2`.`id` = `t1`.`menu_id`\nORDER BY `t1`.`full_height` IS NULL ASC, `t1`.`full_height` DESC \nRETURN `t2`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the name of menu with the longest full height.",
    "evidence": "longest full height refers to MAX(full_height);",
    "idx": 4346
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t1`:`menu`)\nMATCH (`t2`:`menupage`)-[t3:has_dish]->()\nWHERE `t1`.`id` = `t2`.`menu_id`\nAND `t2`.`id` = `t3`.`menu_page_id`\nAND (`t3`.`xpos` > 0.75 AND `t3`.`ypos` < 0.25)\nRETURN `t2`.`page_number` AS `page_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the page numbers for menu with dishes on the right upper corner.",
    "evidence": "on the right upper corner refers to xpos > 0.75 AND ypos < 0.25;",
    "idx": 4349
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t1`:`menu`)\nWHERE `t1`.`id` = `t2`.`menu_id`\nRETURN sum(CASE  WHEN `t2`.`uuid` = '510d47e4-2958-a3d9-e040-e00a18064a99' THEN `t1`.`dish_count` ELSE 0 END) - sum(CASE  WHEN `t2`.`uuid` = '510d47e4-295a-a3d9-e040-e00a18064a99' THEN `t1`.`dish_count` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total dish count for menu with uuid of \"510d47e4-2958-a3d9-e040-e00a18064a99\" & \"510d47e4-295a-a3d9-e040-e00a18064a99\".",
    "evidence": "total dish count for uuid of '510d47e4-2958-a3d9-e040-e00a18064a99' = SUM(dish_count WHERE uuid = '510d47e4-2958-a3d9-e040-e00a18064a99'); total dish count for uuid of '510d47e4-295a-a3d9-e040-e00a18064a99 = SUM(dish_count WHERE uuid = '510d47e4-295a-a3d9-e040-e00a18064a99');",
    "idx": 4354
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[t2:has_dish]->()\nWHERE `t1`.`id` = `t2`.`menu_page_id`\nAND (`t1`.`menu_id` = 12882)\nRETURN sum(`t2`.`price`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total price of items for menu with ID 12882.",
    "evidence": "total price = SUM(price);",
    "idx": 4355
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`dish`:`dish`)\nORDER BY `dish`.`highest_price` IS NULL ASC, `dish`.`highest_price` DESC \nRETURN `dish`.`name` AS `name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the top five dishes, by descending order, in terms of highest price.",
    "evidence": "highest price refers to MAX(highest_price);",
    "idx": 4356
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`menu`:`menu`)\nWITH `menu`.`name` AS _groupby_col_0\nORDER BY `menu`.`dish_count` IS NULL ASC, `menu`.`dish_count` DESC \nRETURN _groupby_col_0 AS `name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the top ten menus with the highest dish count.",
    "evidence": "highest dish count refers to MAX(dish_count);",
    "idx": 4359
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[part_of_0:part_of]->(`t2`:`menu`)\nWHERE `t2`.`id` = `t1`.`menu_id`\nAND (`t2`.`event` = '100TH ANNIVERSARY OF BIRTH OF DANIEL WEBSTER')\nRETURN `t1`.`image_id` AS `image_id`, `t1`.`full_height` AS `full_height`, `t1`.`full_width` AS `full_width`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the image ID, full height, and full width of the menu that were used in the \"100TH ANNIVERSARY OF BIRTH OF DANIEL WEBSTER\" event.",
    "evidence": "FALSE;",
    "idx": 4368
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[t2:has_dish]->(`t3`:`dish`)\nWHERE `t1`.`id` = `t2`.`menu_page_id`\nAND `t2`.`dish_id` = `t3`.`id`\nAND (`t3`.`name` = 'Baked Stuffed Mullet & Sauce Pomard')\nRETURN `t1`.`full_height` * `t1`.`full_width` AS `_col_0`, `t1`.`page_number` AS `page_number`, `t1`.`image_id` AS `image_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the image area of the page menu for the dish named \"Baked Stuffed Mullet & Sauce Pomard\". Please include the page number and image ID.",
    "evidence": "image area = MULTIPLY(full_height, full_width);",
    "idx": 4372
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t1`:`menu`)\nWHERE `t1`.`id` = `t2`.`menu_id`\nRETURN sum(CASE  WHEN `t1`.`name` = 'Emil Kuehn' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many pages are there in the \"Emil Kuehn\" menu?",
    "evidence": "Emil Kuehn is a name of menu;",
    "idx": 4377
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t1`:`menu`)\nWHERE `t1`.`id` = `t2`.`menu_id`\nAND (`t1`.`sponsor` = 'PACIFIC MAIL STEAMSHIP COMPANY')\nWITH `t2`.`menu_id` AS _groupby_col_0, COUNT(`t2`.`page_number`) AS _groupby_col_1, COUNT(*) AS _groupby_col_2\nWHERE _groupby_col_1 <= 2\nRETURN _groupby_col_2 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the menus sponsored by Pacific Mail Steamship Company, how many menus have no more than 2 pages?",
    "evidence": "sponsored by Pacific Mail Steamship Company refers to sponsor = 'PACIFIC MAIL STEAMSHIP COMPANY'; no more than 2 pages refers to COUNT(page_number) < = 2;",
    "idx": 4381
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`menu`:`menu`)\nWHERE `menu`.`sponsor` IS NULL\nRETURN `menu`.`id` AS `id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of all the menus that are DIYs of the restaurant.",
    "evidence": "menus that are DIYs of the restaurant refers to sponsor is null;",
    "idx": 4387
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`menu`:`menu`)\nWHERE `menu`.`name` = 'Zentral Theater Terrace'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many dishes are there on the menu \"Zentral Theater Terrace\"?",
    "evidence": "Zentral Theater Terrace is a name of menu;",
    "idx": 4391
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`menu`:`menu`)\nWHERE `menu`.`call_number` IS NULL AND CASE WHEN `menu`.`date` is not NULL THEN apoc.temporal.format(`menu`.`date`,'yyyy') ELSE NULL END < '1950'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the menus that did not support taking out or booking in advance, how many of them were created before 1950?",
    "evidence": "did not support taking out or booking in advance refers to call_number is null; created before 1950 refers to strftime('%Y', date) < '1950';",
    "idx": 4392
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t1`:`menu`)\nWHERE `t1`.`id` = `t2`.`menu_id`\nAND (`t1`.`name` = 'Zentral Theater Terrace' AND `t2`.`page_number` = 1)\nRETURN `t2`.`image_id` AS `image_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the image ID of page 1 of the menu \"Zentral Theater Terrace\"?",
    "evidence": "page 1 refers to page_number = 1; Zentral Theater Terrace is a name of menu;",
    "idx": 4393
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t1`:`menu`)\nWHERE `t1`.`id` = `t2`.`menu_id`\nAND (`t2`.`image_id` = 5189412)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "To which menu does the menu page image ID5189412 belong? Please give its name.",
    "evidence": "FALSE;",
    "idx": 4394
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t1`:`menu`)\nWHERE `t1`.`id` = `t2`.`menu_id`\nRETURN CASE  WHEN sum(CASE  WHEN `t1`.`name` = 'Zentral Theater Terrace' THEN `t2`.`full_width` ELSE 0 END) - sum(CASE  WHEN `t1`.`name` = 'Young\\'s Hotel' THEN `t2`.`full_width` ELSE 0 END) > 0 THEN 'Zentral Theater Terrace' ELSE 'Young\\'s Hotel' END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which menu page has a bigger width, page 1 of \"Zentral Theater Terrace\" or page 1 of \"Young's Hotel\"?",
    "evidence": "if SUM(full_width where page_number = 1 AND menu.name = 'Zentral Theater Terrace') > SUM(full_width where page_number = 1 AND menu.name = 'Young''s Hotel'), it means Zentral Theater Terrace menu page is bigger than Young's Hotel; if SUM(full_width WHERE page_number = 1 AND menu.name = 'Young''s Hotel') < SUM(full_width WHERE page_number = 1 AND menu.name = 'Zentral Theater Terrace'), it means Young's Hotel menu page is bigger than Zentral Theater Terrace;",
    "idx": 4395
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[t2:has_dish]->(`t3`:`dish`)\nWHERE `t1`.`id` = `t2`.`menu_page_id`\nAND `t2`.`dish_id` = `t3`.`id`\nAND (`t1`.`menu_id` = 12882 AND `t1`.`page_number` = 1)\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the dishes on page 1 of menu ID12882.",
    "evidence": "page 1 refers to page_number = 1;",
    "idx": 4399
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t1`:`menupage`)-[t2:has_dish]->(`t3`:`dish`)\nWHERE `t1`.`id` = `t2`.`menu_page_id`\nAND `t2`.`dish_id` = `t3`.`id`\nAND (`t3`.`name` = 'Chicken gumbo')\nRETURN `t1`.`page_number` AS `page_number`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the page numbers of all the menu pages on which the dish \"Chicken gumbo\" had appeared.",
    "evidence": "Chicken gumbo is a name of dish;",
    "idx": 4400
  },
  {
    "filename": "train.json",
    "db_id": "menu",
    "gql_statement": "MATCH (`t2`:`menupage`)-[part_of_0:part_of]->(`t1`:`menu`)\nWHERE `t1`.`id` = `t2`.`menu_id`\nAND (`t1`.`name` = 'Zentral Theater Terrace' AND `t2`.`page_number` = 1)\nRETURN `t2`.`full_height` * `t2`.`full_width` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much space does page 1 of the menu \"Zentral Theater Terrace\" cover?",
    "evidence": "how much space = MULTIPLY(full_height, full_width); Zentral Theater Terrace is a name of menu;",
    "idx": 4405
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[ordered_by_0:ordered_by]->(`t1`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t1`.`cust_name` = 'S K L Enterprises Inc' AND CASE WHEN `t2`.`ship_date` is not NULL THEN apoc.temporal.format(`t2`.`ship_date`,'yyyy') ELSE NULL END = '2017')\nRETURN COUNT(`t2`.`ship_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many shipments were ordered by S K L Enterprises Inc in 2017?",
    "evidence": "\"S K L Enterprises Inc\" is the cust_name; in 2017 refers to Cast(ship_date AS DATE) = 2017",
    "idx": 4407
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[ordered_by_0:ordered_by]->(`t1`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t1`.`cust_type` = 'retailer')\nRETURN `t2`.`ship_id` AS `ship_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of all the shipments made by a retailer customer.",
    "evidence": "\"retailer\" is the cust_type;  IDs of shipments refers to ship_id",
    "idx": 4411
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`shipment`)-[ordered_by_1:ordered_by]->(`t1_sub0`:`customer`)\nWHERE `t1_sub0`.`cust_id` = `t2_sub0`.`cust_id`\nAND (CASE WHEN `t2_sub0`.`ship_date` is not NULL THEN apoc.temporal.format(`t2_sub0`.`ship_date`,'yyyy') ELSE NULL END = '2017' AND `t1_sub0`.`annual_revenue` > 30000000)\nWITH `t1_sub0`.`cust_id` AS _groupby_col_0, COUNT(`t2_sub0`.`ship_id`) AS _groupby_col_1, COUNT(`t1_sub0`.`cust_id`) AS _groupby_col_2\nWHERE _groupby_col_1 >= 1\nRETURN _groupby_col_2 AS `countcusid`  \n}\nWITH *\nRETURN COUNT(`countcusid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the customers having at least one shipment in 2017, how many of them have an annual revenue of over 30000000?",
    "evidence": "shipment in 2017 refers to Cast(ship_date AS DATE) = 2017; annual revenue of over 30000000 refers to annual_revenue > 30000000",
    "idx": 4412
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2017' AND `t2`.`first_name` = 'Sue' AND `t2`.`last_name` = 'Newell')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many shipments in 2017 were done by Sue Newell?",
    "evidence": "in 2017 refers to Cast(ship_date AS DATE) = 2017",
    "idx": 4413
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (CASE WHEN `t1`.`ship_date` is not NULL THEN apoc.temporal.format(`t1`.`ship_date`,'yyyy') ELSE NULL END = '2017' AND `t2`.`state` = 'New Jersey')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the shipments in 2017, how many of them have the destination in New Jersey?",
    "evidence": "in 2017 refers to Cast(ship_date AS DATE) = 2017; 'New Jersey' is the state",
    "idx": 4414
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[ordered_by_0:ordered_by]->(`t1`:`customer`)\nMATCH (`t2`:`shipment`)-[destined_to_0:destined_to]->(`t3`:`city`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND `t3`.`city_id` = `t2`.`city_id`\nAND (`t1`.`cust_name` = 'S K L Enterprises Inc')\nRETURN DISTINCT `t3`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the destination cities of all the shipments ordered by S K L Enterprises Inc.",
    "evidence": "\"S K L Enterprises Inc\" is the cust_name; destination cities refers to city_name",
    "idx": 4417
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nAND (`t2`.`ship_id` = 1045)\nRETURN `t1`.`make` AS `make`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the headquarter of the truck which completed shipment no.1045.",
    "evidence": "shipment no. 1045 refers to ship_id = 1045; headquarter refers to if make = 'Peterbit', then 'Texax(TX)', if make = 'Mack', then 'North Carolina (NC)'; if make = 'Kenworth', then 'Washington (WA)'",
    "idx": 4420
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[transported_by_0:transported_by]->(`t1`:`truck`)\nWHERE `t1`.`truck_id` = `t2`.`truck_id`\nWITH `t1`.`model_year` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_0 IS NULL DESC, _groupby_col_0  \nRETURN _groupby_col_1 AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many shipments were delivered by the oldest truck model?",
    "evidence": "oldest truck model refers to Min(model_year)",
    "idx": 4421
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t2`:`shipment`)-[ordered_by_0:ordered_by]->(`t1`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t2`.`ship_id` = '1275')\nRETURN `t1`.`cust_name` AS `cust_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who was the customer of shipment no.1275? Give the customer's name.",
    "evidence": "shipment no. 1275 refers to ship_id = 1275; customer name refers to cust_name",
    "idx": 4422
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`ship_id` = '1701')\nRETURN `t2`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where was the destination city of shipment no.1701?",
    "evidence": "shipment no. 1701 refers to ship_id = 1701; destination city refers to city_name",
    "idx": 4423
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (`t1`.`ship_id` = '1021')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the driver of shipment no.1021.",
    "evidence": "shipment no. 1021 refers to ship_id = 1021; name refers to first_name, last_name",
    "idx": 4424
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[handled_by_0:handled_by]->(`t2`:`driver`)\nWHERE `t1`.`driver_id` = `t2`.`driver_id`\nAND (`t1`.`ship_date` = '2017-11-05')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the name of the driver who received the shipment on 2017/11/5.",
    "evidence": "shipment on 2017/11/5 refers to ship_date = '2017-11/05'; name refers to first_name, last_name",
    "idx": 4425
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`ship_id` = '1398')\nRETURN `t2`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the population of the city which was the destination of shipment no.1398.",
    "evidence": "shipment no. 1398 refers to ship_id = 1398",
    "idx": 4426
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t2`.`state` = 'SC')\nRETURN min(`t1`.`ship_date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the ship date of the first shipment to customers in South Carolina.",
    "evidence": "\"South Carolina\" refers to state = 'SC'; first shipment refers to Min(ship_date)",
    "idx": 4427
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[destined_to_0:destined_to]->(`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t1`.`ship_id` = '1346')\nRETURN `t2`.`area` AS `area`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the area of the destination city of shipment No.1346?",
    "evidence": "shipment no. 1346 refers to ship_id = 1346",
    "idx": 4429
  },
  {
    "filename": "train.json",
    "db_id": "shipping",
    "gql_statement": "MATCH (`t1`:`shipment`)-[ordered_by_0:ordered_by]->(`t2`:`customer`)\nWHERE `t1`.`cust_id` = `t2`.`cust_id`\nAND (`t2`.`cust_name` = 'U-haul Center Of N Syracuse' AND `t1`.`ship_date` = '2016-09-21')\nRETURN `t1`.`weight` AS `weight`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the weight of the shipment to U-haul Center Of N Syracuse on 2016/9/21.",
    "evidence": "\"U-haul Center Of N Syracuse\" is the cust_name; on 2016/9/21 refers to ship_date = '2016/09/21'",
    "idx": 4430
  }
]