[
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`pred_classes`)\nMATCH ()-[t2:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t2`.`obj1_sample_id` = 14 AND `t2`.`obj2_sample_id` = 14)\nRETURN `t1`.`pred_class` AS `pred_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the predicted relation classes of object sample no.14 in image no.1.",
    "evidence": "predicted relation classes refers to PRED_CLASS; object sample no.14 in image no.1 refers to OBJ1_SAMPLE_ID = 14 AND OBJ2_SAMPLE_ID = 14 and IMG_ID = 1",
    "idx": 5680
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`pred_classes`)\nMATCH ()-[t2:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t2`.`obj1_sample_id` <> `t2`.`obj2_sample_id`)\nRETURN sum(CASE  WHEN `t1`.`pred_class` = 'parked on' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many images have at least one pair of object samples with the relation \"parked on\"?",
    "evidence": "How many images have at least one pair of object samples with the relation \"parked on\" refers to count(IMG_ID) where OBJ1_SAMPLE_ID ! = OBJ2_SAMPLE_ID and PRED_CLASS = 'parked on'",
    "idx": 5681
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`pred_classes`)\nMATCH ()-[t2:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t1`.`pred_class` = 'parked on' AND `t2`.`obj1_sample_id` <> `t2`.`obj2_sample_id`)\nWITH `t2`.`img_id` AS _groupby_col_0, COUNT(`t2`.`img_id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `img_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the IDs of all the images with more than 2 pairs of object samples with the relation \"parked on\".",
    "evidence": "IDs of all the images refers to IMG_ID; relation \"parked on\" refers to PRED_CLASS = 'parked on'; more than 2 pairs refers to count(IMG_ID) where OBJ1_SAMPLE_ID ! = OBJ2_SAMPLE_ID",
    "idx": 5682
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`img_obj`)-[has_object_class_0:has_object_class]->(`t1`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`img_id` = 1)\nRETURN CASE WHEN COUNT(`t1`.`obj_class_id`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`obj_class` = 'man' THEN 1 ELSE NULL END)) * 100 / COUNT(`t1`.`obj_class_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of the object samples in the class of \"man\" in image no.1?",
    "evidence": "object samples refers to OBJ_SAMPLE_ID; class of \"man\" refers to OBJ_CLASS = 'man'; image no.1 refers to IMG_ID = 1; percentage = divide(count(OBJ_SAMPLE_ID)when OBJ_CLASS = 'man', count(OBJ_SAMPLE_ID)) as percentage",
    "idx": 5684
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`att_classes`:`att_classes`)\nRETURN COUNT(`att_classes`.`att_class_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the total number of the attribute classes.",
    "evidence": "attribute classes refers to ATT_CLASS",
    "idx": 5685
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`pred_classes`:`pred_classes`)\nRETURN COUNT(`pred_classes`.`pred_class_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the number of predicted classes.",
    "evidence": "predicted classes refers to PRED_CLASS",
    "idx": 5687
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`img_obj`)-[has_object_class_0:has_object_class]->(`t1`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`img_id` = 2324765 AND `t1`.`obj_class` = 'kite')\nRETURN `t2`.`x` AS `x`, `t2`.`y` AS `y`, `t2`.`w` AS `w`, `t2`.`h` AS `h`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the bounding box of the kite in image no.2324765.",
    "evidence": "bounding box refers to (x, y, W, H); kite refers to OBJ_CLASS = 'kite'; image no.2324765 refers to IMG_ID = 2324765",
    "idx": 5688
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`pred_classes`)\nMATCH ()-[t2:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t2`.`img_id` = 2345524 AND `t1`.`pred_class` = 'lying on' AND `t2`.`obj2_sample_id` = 1)\nRETURN `t2`.`obj1_sample_id` AS `obj1_sample_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the object number of the sample which has the relationship of \"lying on\" with object sample no.1 from image no.2345524.",
    "evidence": "object number of the sample refers to OBJ1_SAMPLE_ID; object sample no.1 from image no.2345524 refers to OBJ2_SAMPLE_ID = 1 and IMG_ID = 2345524",
    "idx": 5692
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`img_obj`)-[has_object_class_1:has_object_class]->(`t1_sub0`:`obj_classes`)\nWHERE `t1_sub0`.`obj_class_id` = `t2_sub0`.`obj_class_id`\nAND (`t1_sub0`.`obj_class` = 'suit')\nWITH `t2_sub0`.`img_id` AS _groupby_col_0\nRETURN _groupby_col_0 AS `img_id`  \n}\nWITH *\nRETURN COUNT(`img_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of images containing the object sample of \"suit\".",
    "evidence": "number of images refers to IMG_ID; object sample of \"suit\" refers to OBJ_CLASS = 'suit'",
    "idx": 5694
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t1:has_attribute]->(`t2`:`att_classes`)\nMATCH (`t3`:`img_obj`)-[has_object_class_0:has_object_class]->(`t4`:`obj_classes`)\nWHERE `t1`.`att_class_id` = `t2`.`att_class_id`\nAND `t1`.`img_id` = `t3`.`img_id`\nAND `t3`.`obj_class_id` = `t4`.`obj_class_id`\nAND (`t4`.`obj_class` = 'weeds' AND `t1`.`img_id` = 2377988)\nRETURN `t2`.`att_class` AS `att_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the attribute of the weeds in image no.2377988.",
    "evidence": "attribute of the weeds refers to OBJ_CLASS = 'weeds'; image no.2377988 refers to IMG_ID = 2377988",
    "idx": 5695
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t1:has_attribute]->(`t2`:`att_classes`)\nMATCH (`t3`:`img_obj`)-[has_object_class_0:has_object_class]->(`t4`:`obj_classes`)\nWHERE `t1`.`att_class_id` = `t2`.`att_class_id`\nAND `t1`.`img_id` = `t3`.`img_id`\nAND `t3`.`obj_class_id` = `t4`.`obj_class_id`\nAND (`t2`.`att_class` = 'blurry' AND `t1`.`img_id` = 22377993)\nRETURN `t4`.`obj_class_id` AS `obj_class_id`, `t4`.`obj_class` AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the object whose attribute is blurry in image no.2377993? Give the explanation about the object.",
    "evidence": "attribute is blurry refers to ATT_CLASS = 'blurry'; image no.2377993 refers to IMG_ID = 22377993; explanation about the object refers to OBJ_CLASS",
    "idx": 5696
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`img_obj`)-[has_object_class_0:has_object_class]->(`t1`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`img_id` = 2320341 AND `t2`.`obj_sample_id` = 10)\nRETURN `t1`.`obj_class` AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the object class of sample no.10 of image no.2320341.",
    "evidence": "object class refers to OBJ_CLASS; sample no.10 refers to OBJ_SAMPLE_ID = 10; image no.2320341 refers to IMG_ID = 2320341",
    "idx": 5698
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`img_obj`)-[has_object_class_0:has_object_class]->(`t1`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nRETURN CASE WHEN COUNT(CASE  WHEN `t1`.`obj_class` = 'tomato' THEN `t2`.`obj_sample_id` ELSE NULL END)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`obj_class` = 'broccoli' THEN `t2`.`obj_sample_id` ELSE NULL END)) / COUNT(CASE  WHEN `t1`.`obj_class` = 'tomato' THEN `t2`.`obj_sample_id` ELSE NULL END) END AS `times`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times is the number of images containing \"broccoli\" than \"tomato\"?",
    "evidence": "images refers to IMG_ID; \"broccoli\" refers to OBJ_CLASS = 'broccoli'; \"tomato\" refers to OBJ_CLASS = 'tomato' ; How many times = divide(count(OBJ_SAMPLE_ID) when OBJ_CLASS = 'broccoli', count(OBJ_SAMPLE_ID) when OBJ_CLASS = 'tomato')",
    "idx": 5699
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "CALL (*) {\nMATCH ()-[img_obj_att_sub0:has_attribute]->()\nWITH `img_obj_att_sub0`.`img_id` AS _groupby_col_0, COUNT(`img_obj_att_sub0`.`att_class_id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 25\nRETURN _groupby_col_0 AS `img_id`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many images have at least 25 attributes?",
    "evidence": "images refers to IMG_ID; have at least 25 attributes refers to count(ATT_CLASS_ID) > = 25",
    "idx": 5700
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[img_obj_att:has_attribute]->()\nWITH `img_obj_att`.`img_id` AS _groupby_col_0, COUNT(`img_obj_att`.`att_class_id`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many objects are there in the attribute class id with the highest number of objects?",
    "evidence": "objects refers to OBJ_SAMPLE_ID; attribute class id with the highest number of objects refers to max(COUNT(ATT_CLASS_ID))",
    "idx": 5702
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`att_classes`:`att_classes`)\nWHERE `att_classes`.`att_class` = 'very large'\nRETURN `att_classes`.`att_class_id` AS `att_class_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the corresponding classes for the \"very large bike\" attribute?",
    "evidence": "attribute refers to ATT_CLASS",
    "idx": 5704
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`img_obj`)-[has_object_class_0:has_object_class]->(`t1`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`x` = 0 AND `t2`.`y` = 0)\nWITH `t1`.`obj_class` AS _groupby_col_0\nRETURN _groupby_col_0 AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the explanations about object classes of all the images with an x and y coordinate of 0.",
    "evidence": "explanations about distinct object classes refers to OBJ_CLASS; images refers to IMG_ID; x and y coordinate of 0 refers to X = 0 AND Y = 0",
    "idx": 5712
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`pred_classes`)\nMATCH ()-[t1:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t1`.`obj1_sample_id` = `t1`.`obj2_sample_id`)\nWITH `t2`.`pred_class` AS _groupby_col_0\nRETURN _groupby_col_0 AS `pred_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the captions of all the self-relation relationship prediction classes?",
    "evidence": "self-relation relationship refers to OBJ1_SAMPLE_ID = OBJ2_SAMPLE_ID and PRED_CLASS; captions of prediction classes refers to PRED_CLASS",
    "idx": 5713
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`img_obj`)-[has_object_class_0:has_object_class]->(`t1`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`img_id` = 2222 AND `t1`.`obj_class` = 'feathers')\nRETURN `t2`.`x` AS `x`, `t2`.`y` AS `y`, `t2`.`h` AS `h`, `t2`.`w` AS `w`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give all the bounding boxes for image 2222 whose object classes are feathers.",
    "evidence": "bounding boxes refers to (x, y, W, H); image 2222 refers to IMG_ID = 2222; object classes are feathers refers to OBJ_CLASS = 'feathers'",
    "idx": 5714
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`pred_classes`)\nMATCH ()-[t1:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t1`.`obj1_sample_id` <> `t1`.`obj2_sample_id` AND `t2`.`pred_class` = 'on')\nRETURN COUNT(`t2`.`pred_class_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the objects that have multiple relations, how many images whose captions for the prediction class ids are \"on\"?",
    "evidence": "objects that have multiple relations refers to OBJ1_SAMPLE_ID ! = OBJ2_SAMPLE_ID; captions for the prediction class ids are \"on\" refers to PRED_CLASS = 'on'",
    "idx": 5715
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 3 AND `t2`.`obj_class` = 'keyboard')\nRETURN `t1`.`w` AS `w`, `t1`.`h` AS `h`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the dimensions of the bounding box that contains the keyboard that was spotted in image no. 3.",
    "evidence": "dimensions of the bounding box refers to (W, H); keyboard refers to OBJ_CLASS = 'keyboard'; image no. 3 refers to IMG_ID = 3",
    "idx": 5717
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 6 AND `t2`.`obj_class` = 'folk')\nRETURN `t1`.`x` AS `x`, `t1`.`y` AS `y`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the border's coordinates on the X and Y axes that enclose a folk in image no. 6.",
    "evidence": "coordinates on the X and Y axes refers to X and Y; folk refers to OBJ_CLASS = 'folk'; image no. 6 refers to IMG_ID = 6",
    "idx": 5718
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 285930 AND `t2`.`obj_class` = 'onion')\nRETURN `t1`.`x` AS `x`, `t1`.`y` AS `y`, `t1`.`w` AS `w`, `t1`.`h` AS `h`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Define the onion's bounding box on image no. 285930.",
    "evidence": "bounding box refers to (X, Y, W, H); onion refers to OBJ_CLASS = 'onion'; image no.285930 refers to IMG_ID = 285930",
    "idx": 5719
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t3:has_attribute]->(`t4`:`att_classes`)\nMATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND `t1`.`img_id` = `t3`.`img_id`\nAND `t3`.`att_class_id` = `t4`.`att_class_id`\nAND (`t2`.`obj_class` = 'wall' AND `t1`.`img_id` = 27)\nWITH `t4`.`att_class` AS _groupby_col_0\nRETURN _groupby_col_0 AS `att_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What attributes are used to describe the wall on image no. 27.",
    "evidence": "What attributes refers to ATT_CLASS; wall on image no. 27 refers to OBJ_CLASS = 'wall' and IMG_ID = 27",
    "idx": 5722
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t3:has_attribute]->(`t4`:`att_classes`)\nMATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND `t1`.`img_id` = `t3`.`img_id`\nAND `t3`.`att_class_id` = `t4`.`att_class_id`\nAND (`t4`.`att_class` = 'scattered' AND `t1`.`img_id` = 10)\nWITH `t2`.`obj_class` AS _groupby_col_0\nRETURN _groupby_col_0 AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the object element that is described as being scattered on image no. 10.",
    "evidence": "Name the object element refers to OBJ_CLASS; scattered refers to ATT_CLASS = 'scattered'; image no. 10 refers to IMG_ID = 10",
    "idx": 5723
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t3:has_attribute]->(`t4`:`att_classes`)\nMATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND `t1`.`img_id` = `t3`.`img_id`\nAND `t3`.`att_class_id` = `t4`.`att_class_id`\nAND (`t2`.`obj_class` = 'van' AND `t1`.`img_id` = 1)\nWITH `t4`.`att_class` AS _groupby_col_0\nRETURN _groupby_col_0 AS `att_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What colour is the van that can be spotted in image no. 1?",
    "evidence": "colour refers to ATT_CLASS; van refers to OBJ_CLASS = 'van'; image no. 1 refers to IMG_ID = 1",
    "idx": 5726
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`img_obj`:`img_obj`)\nWHERE `img_obj`.`img_id` = 42 AND `img_obj`.`obj_sample_id` = 7\nRETURN `img_obj`.`x` AS `x`, `img_obj`.`y` AS `y`, `img_obj`.`w` AS `w`, `img_obj`.`h` AS `h`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Define the bounding box of the object sample no. 7 on image no. 42.",
    "evidence": "bounding box of the object refers to (X, Y, W, H); sample no.7 on image no.42 refers to IMG_ID = 42 and OBJ_SAMPLE_ID = 7",
    "idx": 5730
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`obj_classes`:`obj_classes`)\nWHERE `obj_classes`.`obj_class_id` = 10\nRETURN `obj_classes`.`obj_class` AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the explanation about object class 10.",
    "evidence": "explanation about object class 10 refers to OBJ_CLASS where OBJ_CLASS_ID = 10;",
    "idx": 5733
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`x` = 422 AND `t1`.`y` = 63 AND `t1`.`w` = 77 AND `t1`.`h` = 363)\nRETURN `t2`.`obj_class` AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the object class of the image with a bounding (422, 63, 77, 363).",
    "evidence": "image with a bounding (422, 63, 77, 363) refers to OBJ_CLASS_ID where X = 422 and Y = 63 and W = 77 and H = 363;",
    "idx": 5734
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`img_obj`:`img_obj`)\nWHERE `img_obj`.`img_id` = 8\nRETURN `img_obj`.`x` AS `x`, `img_obj`.`y` AS `y`, `img_obj`.`w` AS `w`, `img_obj`.`h` AS `h`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the bounding box of the image 8.",
    "evidence": "bounding box refers to X, Y, W, H from IMG_OBJ; image 8 refers to IMG_ID = 8;",
    "idx": 5736
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 41)\nRETURN sum(CASE  WHEN `t2`.`obj_class` = 'kitchen' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the number of object samples in image no.41 which are in the class of \"kitchen\"?",
    "evidence": "object samples in the class of \"kitchen\" refer to OBJ_CLASS_ID where OBJ_CLASS = 'kitchen'; image no.41 refers to IMG_ID = 41 ;",
    "idx": 5738
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`obj_class` = 'paint')\nRETURN COUNT(DISTINCT `t1`.`img_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the image numbers that contain the \"paint\" object.",
    "evidence": "image numbers that contain the \"paint\" object refer to IMG_ID where OBJ_CLASS = 'paint';",
    "idx": 5739
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 1344 AND `t2`.`obj_class` = 'spoon')\nRETURN `t1`.`x` AS `x`, `t1`.`y` AS `y`, `t1`.`w` AS `w`, `t1`.`h` AS `h`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the bounding box of \"spoon\" in image id 1344?",
    "evidence": "the bounding box refers to X, Y, W, H from IMG_OBJ; image id 1344 refers to IMG_ID = 1344; \"spoon\" refers to OBJ_CLASS = 'spoon';",
    "idx": 5742
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t2`.`obj_class` = 'wood')\nRETURN COUNT(DISTINCT `t1`.`img_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many images include the \"wood\" objects?",
    "evidence": "images refer to IMG_ID; \"wood\" objects refer to OBJ_CLASS = 'wood';",
    "idx": 5744
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nORDER BY `t1`.`h` IS NULL ASC, `t1`.`h` DESC \nRETURN `t2`.`obj_class` AS `obj_class`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the object class of the image with tallest bounding box.",
    "evidence": "bounding box refers to X, Y, W, H from IMG_OBJ; tallest relates to the height of the bounding box which refers to MAX(H); object class refers to OBJ_CLASS;",
    "idx": 5745
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nRETURN CASE WHEN COUNT(`t2`.`obj_class`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`obj_class` = 'airplane' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`obj_class`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of \"airplane\" object class in the table.",
    "evidence": "DIVIDE(SUM(OBJ_SAMPLE_ID where OBJ_CLASS = 'airplane'), COUNT(OBJ_CLASS)) as percentage;",
    "idx": 5746
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nORDER BY `t1`.`h` IS NULL DESC, `t1`.`h`  \nRETURN `t2`.`obj_class` AS `obj_class`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the object class of the image with lowest bounding box.",
    "evidence": "bounding box refers to X, Y, W, H from IMG_OBJ; lowest relates to the height of the bounding box which refers to MIN(H);",
    "idx": 5749
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 250 AND `t2`.`obj_class` = 'kitchen')\nRETURN `t1`.`x` AS `x`, `t1`.`y` AS `y`, `t1`.`w` AS `w`, `t1`.`h` AS `h`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicating the bounding box of \"kitchen\" in image id 250.",
    "evidence": "bounding box refers to X, Y, W, H from IMG_OBJ; \"kitchen\" in image id 250 refers to OBJ_CLASS = 'kitchen' where IMG_ID = 250;",
    "idx": 5750
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`img_obj`:`img_obj`)\nWITH `img_obj`.`img_id` AS _groupby_col_0, COUNT(`img_obj`.`img_id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 20\nRETURN _groupby_col_0 AS `img_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which images have more than 20 object samples?",
    "evidence": "images have more than 20 object samples refer to IMG_ID where COUNT(OBJ_SAMPLE_ID) > 20;",
    "idx": 5751
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`img_obj`:`img_obj`)\nWHERE `img_obj`.`img_id` = 8\nORDER BY `img_obj`.`w` IS NULL ASC, `img_obj`.`w` DESC \nRETURN `img_obj`.`obj_sample_id` AS `obj_sample_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which object in image 8 is the widest? State its object sample ID.",
    "evidence": "widest relates to the width of the bounding\nbox of the object which refers to MAX(W); object in image 8 refers to OBJ_SAMPLE_ID where IMG_ID = 8;",
    "idx": 5752
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`img_obj`:`img_obj`)\nWHERE `img_obj`.`img_id` = 5 AND `img_obj`.`x` = 634 AND `img_obj`.`y` = 468\nRETURN `img_obj`.`obj_sample_id` AS `obj_sample_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the object in image 5 where the object with the coordinate of (634, 468).",
    "evidence": "object in image 5 refers to OBJ_SAMPLE_ID where IMG_ID = 5; coordinates of (634, 468) refer to X and Y coordinates of the bounding box in which X = 634 and Y = 468;",
    "idx": 5753
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`img_obj`:`img_obj`)\nRETURN CASE WHEN COUNT(DISTINCT `img_obj`.`img_id`)=0 THEN NULL ELSE toFloat(COUNT(`img_obj`.`obj_sample_id`)) / COUNT(DISTINCT `img_obj`.`img_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average of object samples for the image.",
    "evidence": "DIVIDE(COUNT(OBJ_SAMPLE_ID), COUNT(IMG_ID));",
    "idx": 5755
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 10)\nRETURN DISTINCT `t2`.`obj_class` AS `obj_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the object classes in image 10.",
    "evidence": "object classes refer to OBJ_CLASS; image 10 refers to IMG_ID = 10;",
    "idx": 5757
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH ()-[t2:has_attribute]->(`t1`:`att_classes`)\nMATCH (`t3`:`img_obj`)-[has_object_class_0:has_object_class]->(`t4`:`obj_classes`)\nWHERE `t1`.`att_class_id` = `t2`.`att_class_id`\nAND `t2`.`img_id` = `t3`.`img_id`\nAND `t3`.`obj_class_id` = `t4`.`obj_class_id`\nAND (`t3`.`img_id` = 1314 AND `t4`.`obj_class` = 'tip')\nRETURN `t1`.`att_class` AS `att_class`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List attributes for object class 'tip' In image 1314.",
    "evidence": "attributes for object refer to ATT_CLASS; class 'tip' in image 1314 refers to OBJ_CLASS = 'tip' where IMG_ID = 1314;",
    "idx": 5758
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nAND (`t1`.`img_id` = 1 AND `t2`.`obj_class` = 'van')\nRETURN `t1`.`h` AS `h`, `t1`.`w` AS `w`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the width and height of the object with the class of 'van' in image 1.",
    "evidence": "The bounding box's W and H abbreviations stand for the object's width and height respectively; class of 'van' in image 1 refers to OBJ_CLASS = 'van' where IMG_ID = 1;",
    "idx": 5762
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t3`:`img_obj`)\nMATCH ()-[t2:has_attribute]->(`t1`:`att_classes`)\nWHERE `t1`.`att_class_id` = `t2`.`att_class_id`\nAND `t2`.`img_id` = `t3`.`img_id`\nAND (`t3`.`img_id` = 1 AND `t1`.`att_class` = 'sparse')\nRETURN `t3`.`obj_sample_id` AS `obj_sample_id`, `t3`.`x` AS `x`, `t3`.`y` AS `y`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the coordinate of X and Y for the object with the attribute of 'sparse' in image 1.",
    "evidence": "coordinates of X and Y for the object refer to X and Y coordinates of the bounding box; attribute of 'sparse' in image 1 refers to IMG_ID = 1 where ATT_CLASS = 'sparse';",
    "idx": 5763
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t1`:`img_obj`)-[has_object_class_0:has_object_class]->(`t2`:`obj_classes`)\nWHERE `t1`.`obj_class_id` = `t2`.`obj_class_id`\nRETURN CASE WHEN COUNT(`t1`.`obj_sample_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`obj_class` = 'street lights' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`obj_sample_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of object samples that are related to street lights.",
    "evidence": "DIVIDE(COUNT(OBJ_SAMPLE_ID where OBJ_CLASS = 'street lights'), COUNT(OBJ_SAMPLE_ID)) as percentage;",
    "idx": 5764
  },
  {
    "filename": "train.json",
    "db_id": "image_and_language",
    "gql_statement": "MATCH (`t2`:`pred_classes`)\nMATCH ()-[t1:has_relationship]->()\nWHERE `t1`.`pred_class_id` = `t2`.`pred_class_id`\nAND (`t2`.`pred_class` = 'parked on')\nRETURN DISTINCT `t1`.`img_id` AS `img_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the image ID with a predicted class of \"parked on\"?",
    "evidence": "predicted class of \"parked on\" refers to PRED_CLASS = 'parked on';",
    "idx": 5770
  }
]