[
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`major` = 50\nRETURN `student`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last names of students with major 50.",
    "evidence": "",
    "idx": 5696
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`age` > 22\nRETURN `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first names of students with age above 22.",
    "evidence": "",
    "idx": 5698
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`sex` = 'M'\nRETURN `student`.`major` AS `major`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the major of each male student.",
    "evidence": "",
    "idx": 5701
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`sex` = 'F'\nRETURN avg(`student`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age of female students.",
    "evidence": "",
    "idx": 5703
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`major` = 600\nRETURN MAX(`student`.`age`) AS `_col_0`, min(`student`.`age`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Tell me the ages of the oldest and youngest students studying major 600.",
    "evidence": "",
    "idx": 5705
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`city_code` = 'BAL'\nRETURN `student`.`advisor` AS `advisor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who are the advisors for students that live in a city with city code \"BAL\"?",
    "evidence": "",
    "idx": 5706
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`city_code` = 'BAL'\nRETURN `student`.`advisor` AS `advisor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the advisors of the students whose city of residence has city code \"BAL\".",
    "evidence": "",
    "idx": 5707
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`class_president_vote`\nRETURN DISTINCT `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct last names of the students who have class president votes.",
    "evidence": "",
    "idx": 5716
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`class_president_vote`\nRETURN DISTINCT `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct last names of the students who have class president votes?",
    "evidence": "",
    "idx": 5717
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`class_senator_vote`\nRETURN DISTINCT `t1`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct first names of the students who have class senator votes.",
    "evidence": "",
    "idx": 5718
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`class_senator_vote`\nRETURN DISTINCT `t1`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct first names of the students who have class president votes?",
    "evidence": "",
    "idx": 5719
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`secretary_vote`\nAND (`t2`.`election_cycle` = 'Fall')\nRETURN DISTINCT `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct ages of students who have secretary votes in the fall election cycle.",
    "evidence": "",
    "idx": 5720
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`secretary_vote`\nAND (`t2`.`election_cycle` = 'Fall')\nRETURN DISTINCT `t1`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct ages of students who have secretary votes in the fall election cycle?",
    "evidence": "",
    "idx": 5721
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`treasurer_vote`\nAND (`t2`.`election_cycle` = 'Spring')\nRETURN DISTINCT `t1`.`advisor` AS `advisor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct Advisor of students who have treasurer votes in the spring election cycle.",
    "evidence": "",
    "idx": 5722
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`treasurer_vote`\nAND (`t2`.`election_cycle` = 'Spring')\nRETURN DISTINCT `t1`.`advisor` AS `advisor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who served as an advisor for students who have treasurer votes in the spring election cycle?",
    "evidence": "",
    "idx": 5723
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`treasurer_vote`\nRETURN DISTINCT `t1`.`major` AS `major`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the distinct majors of students who have treasurer votes.",
    "evidence": "",
    "idx": 5724
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`treasurer_vote`\nRETURN DISTINCT `t1`.`major` AS `major`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct majors that students with treasurer votes are studying?",
    "evidence": "",
    "idx": 5725
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`president_vote`\nAND (`t1`.`sex` = 'F')\nRETURN DISTINCT `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first and last names of all the female (sex is F) students who have president votes.",
    "evidence": "",
    "idx": 5726
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`president_vote`\nAND (`t1`.`sex` = 'F')\nRETURN DISTINCT `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first and last names of all the female students who have president votes?",
    "evidence": "",
    "idx": 5727
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`vice_president_vote`\nAND (`t1`.`age` = 18)\nRETURN DISTINCT `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the first and last name of all the students of age 18 who have vice president votes.",
    "evidence": "",
    "idx": 5728
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`vice_president_vote`\nAND (`t1`.`age` = 18)\nRETURN DISTINCT `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first names and last names of the students who are 18 years old and have vice president votes.",
    "evidence": "",
    "idx": 5729
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`class_senator_vote`\nAND (`t1`.`sex` = 'M' AND `t2`.`election_cycle` = 'Fall')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many male (sex is M) students have class senator votes in the fall election cycle?",
    "evidence": "",
    "idx": 5730
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`class_senator_vote`\nAND (`t1`.`sex` = 'M' AND `t2`.`election_cycle` = 'Fall')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of male students who had class senator votes in the fall election cycle.",
    "evidence": "",
    "idx": 5731
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`class_senator_vote`\nAND (`t1`.`city_code` = 'NYC' AND `t2`.`election_cycle` = 'Spring')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of students whose city code is NYC and who have class senator votes in the spring election cycle.",
    "evidence": "",
    "idx": 5732
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`class_senator_vote`\nAND (`t1`.`city_code` = 'NYC' AND `t2`.`election_cycle` = 'Spring')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which students live in the city with code \"NYC\" and have class senator votes in the spring election cycle? Count the numbers.",
    "evidence": "",
    "idx": 5733
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`secretary_vote`\nAND (`t1`.`city_code` = 'NYC' AND `t2`.`election_cycle` = 'Spring')\nRETURN avg(`t1`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age of students who live in the city with code \"NYC\" and have secretary votes in the spring election cycle.",
    "evidence": "",
    "idx": 5734
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`secretary_vote`\nAND (`t1`.`city_code` = 'NYC' AND `t2`.`election_cycle` = 'Spring')\nRETURN avg(`t1`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average age of students who have city code \"NYC\" and have secretary votes for the spring election cycle?",
    "evidence": "",
    "idx": 5735
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`secretary_vote`\nAND (`t1`.`sex` = 'F' AND `t2`.`election_cycle` = 'Spring')\nRETURN avg(`t1`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age of female (sex is F) students who have secretary votes in the spring election cycle.",
    "evidence": "",
    "idx": 5736
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`t1`:`student`)-[t2:voted_for]->()\nWHERE `t1`.`stuid` = `t2`.`secretary_vote`\nAND (`t1`.`sex` = 'F' AND `t2`.`election_cycle` = 'Spring')\nRETURN avg(`t1`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average age of the female students with secretary votes in the spring election cycle?",
    "evidence": "",
    "idx": 5737
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`advisor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `advisor`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each advisor, report the total number of students advised by him or her.",
    "evidence": "",
    "idx": 5738
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`advisor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `advisor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Report all advisors that advise more than 2 students.",
    "evidence": "",
    "idx": 5740
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`major` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 < 3\nRETURN _groupby_col_0 AS `major`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Report all majors that have less than 3 students.",
    "evidence": "",
    "idx": 5742
  },
  {
    "filename": "train_spider.json",
    "db_id": "voter_2",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`advisor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `advisor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Report the distinct advisors who have more than 2 students.",
    "evidence": "",
    "idx": 5746
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of products.",
    "evidence": "",
    "idx": 5749
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`ref_colors`:`ref_colors`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of colors.",
    "evidence": "",
    "idx": 5751
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`characteristics`:`characteristics`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of characteristics.",
    "evidence": "",
    "idx": 5753
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN `products`.`product_name` AS `product_name`, `products`.`typical_buying_price` AS `typical_buying_price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names and typical buying prices for all products.",
    "evidence": "",
    "idx": 5755
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`ref_colors`:`ref_colors`)\nRETURN `ref_colors`.`color_description` AS `color_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the description of all the colors.",
    "evidence": "",
    "idx": 5756
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`characteristics`:`characteristics`)\nRETURN DISTINCT `characteristics`.`characteristic_name` AS `characteristic_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all the product characteristics.",
    "evidence": "",
    "idx": 5758
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_category_code` = 'Spices'\nRETURN `products`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of products with category \"Spices\"?",
    "evidence": "",
    "idx": 5760
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_category_code` = 'Spices'\nRETURN `products`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of products in the category 'Spices'.",
    "evidence": "",
    "idx": 5761
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_color_0:has_color]->(`t2`:`ref_colors`)\nWHERE `t1`.`color_code` = `t2`.`color_code`\nAND (`t1`.`product_category_code` = 'Herbs')\nRETURN `t1`.`product_name` AS `product_name`, `t2`.`color_description` AS `color_description`, `t1`.`product_description` AS `product_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names, color descriptions and product descriptions of products with category \"Herbs\".",
    "evidence": "",
    "idx": 5762
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_color_0:has_color]->(`t2`:`ref_colors`)\nWHERE `t1`.`color_code` = `t2`.`color_code`\nAND (`t1`.`product_category_code` = 'Herbs')\nRETURN `t1`.`product_name` AS `product_name`, `t2`.`color_description` AS `color_description`, `t1`.`product_description` AS `product_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names, color descriptions, and product descriptions for products in the 'Herbs' category?",
    "evidence": "",
    "idx": 5763
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_category_code` = 'Seeds'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many products are there under the category \"Seeds\"?",
    "evidence": "",
    "idx": 5764
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_category_code` = 'Seeds'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of products in the category 'Seeds'.",
    "evidence": "",
    "idx": 5765
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_category_code` = 'Spices' AND `products`.`typical_buying_price` > 1000\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of products with category \"Spices\" and typically sold above 1000.",
    "evidence": "",
    "idx": 5766
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_category_code` = 'Spices' AND `products`.`typical_buying_price` > 1000\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many products are in the 'Spices' category and have a typical price of over 1000?",
    "evidence": "",
    "idx": 5767
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_name` = 'cumin'\nRETURN `products`.`product_category_code` AS `product_category_code`, `products`.`typical_buying_price` AS `typical_buying_price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the category and typical buying price  of the product with name \"cumin\"?",
    "evidence": "",
    "idx": 5768
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_name` = 'flax'\nRETURN `products`.`product_category_code` AS `product_category_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which category does the product named \"flax\" belong to?",
    "evidence": "",
    "idx": 5770
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_color_0:has_color]->(`t2`:`ref_colors`)\nWHERE `t1`.`color_code` = `t2`.`color_code`\nAND (`t2`.`color_description` = 'yellow')\nRETURN `t1`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the name of the products that have a color description 'yellow'.",
    "evidence": "",
    "idx": 5773
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t2`:`products`)-[has_category_0:has_category]->(`t1`:`ref_product_categories`)\nWHERE `t1`.`product_category_code` = `t2`.`product_category_code`\nAND (`t2`.`product_description` =~ '(?i)(?s).*t.*')\nRETURN `t1`.`product_category_description` AS `product_category_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the category descriptions of the products whose descriptions include letter 't'.",
    "evidence": "",
    "idx": 5774
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_color_0:has_color]->(`t2`:`ref_colors`)\nWHERE `t1`.`color_code` = `t2`.`color_code`\nAND (`t1`.`product_name` = 'catnip')\nRETURN `t2`.`color_description` AS `color_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the color description of the product with name \"catnip\"?",
    "evidence": "",
    "idx": 5776
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_color_0:has_color]->(`t2`:`ref_colors`)\nWHERE `t1`.`color_code` = `t2`.`color_code`\nAND (`t1`.`product_name` = 'chervil')\nRETURN `t1`.`color_code` AS `color_code`, `t2`.`color_description` AS `color_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the color code and description of the product named \"chervil\"?",
    "evidence": "",
    "idx": 5778
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_color_0:has_color]->(`t2`:`ref_colors`)\nWHERE `t1`.`color_code` = `t2`.`color_code`\nAND (`t2`.`color_description` = 'white')\nRETURN `t1`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the product names with the color description \"white\".",
    "evidence": "",
    "idx": 5780
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_color_0:has_color]->(`t2`:`ref_colors`)\nWHERE `t1`.`color_code` = `t2`.`color_code`\nAND (`t2`.`color_description` = 'white')\nRETURN `t1`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of products with 'white' as their color description?",
    "evidence": "",
    "idx": 5781
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[has_color_0:has_color]->(`t2`:`ref_colors`)\nWHERE `t1`.`color_code` = `t2`.`color_code`\nAND (`t2`.`color_description` = 'yellow')\nRETURN `t1`.`product_name` AS `product_name`, `t1`.`typical_buying_price` AS `typical_buying_price`, `t1`.`typical_selling_price` AS `typical_selling_price`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the name and typical buying and selling prices of the products that have color described as \"yellow\"?",
    "evidence": "",
    "idx": 5782
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t1`.`product_name` = 'sesame')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many characteristics does the product named \"sesame\" have?",
    "evidence": "",
    "idx": 5784
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->()\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND (`t1`.`product_name` = 'sesame')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of characteristics the product 'sesame' has.",
    "evidence": "",
    "idx": 5785
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t1`.`product_name` = 'sesame')\nRETURN COUNT(DISTINCT `t3`.`characteristic_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many distinct characteristic names does the product \"cumin\" have?",
    "evidence": "",
    "idx": 5786
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t1`.`product_name` = 'sesame')\nRETURN `t3`.`characteristic_name` AS `characteristic_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the characteristic names of product \"sesame\"?",
    "evidence": "",
    "idx": 5788
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t1`.`product_name` = 'cumin')\nRETURN `t3`.`characteristic_name` AS `characteristic_name`, `t3`.`characteristic_data_type` AS `characteristic_data_type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the characteristic names and data types of product \"cumin\".",
    "evidence": "",
    "idx": 5790
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t1`.`product_name` = 'cumin')\nRETURN `t3`.`characteristic_name` AS `characteristic_name`, `t3`.`characteristic_data_type` AS `characteristic_data_type`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and data types of the characteristics of the 'cumin' product?",
    "evidence": "",
    "idx": 5791
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t1`.`product_name` = 'sesame' AND `t3`.`characteristic_type_code` = 'Grade')\nRETURN `t3`.`characteristic_name` AS `characteristic_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all characteristics of product named \"sesame\" with type code \"Grade\".",
    "evidence": "",
    "idx": 5792
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t1`.`product_name` = 'sesame' AND `t3`.`characteristic_type_code` = 'Grade')\nRETURN `t3`.`characteristic_name` AS `characteristic_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the characteristics of the product 'sesame' that have the characteristic type code 'Grade'?",
    "evidence": "",
    "idx": 5793
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t1`.`product_name` = 'laurel')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many characteristics does the product named \"laurel\" have?",
    "evidence": "",
    "idx": 5794
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND (`t1`.`product_name` = 'flax')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of characteristics that the product \"flax\" has.",
    "evidence": "",
    "idx": 5796
  },
  {
    "filename": "train_spider.json",
    "db_id": "products_gen_characteristics",
    "gql_statement": "MATCH (`t1`:`products`)-[t2:has_characteristic]->(`t3`:`characteristics`)\nMATCH (`t1`:`products`)-[has_color_0:has_color]->(`t4`:`ref_colors`)\nWHERE `t1`.`product_id` = `t2`.`product_id`\nAND `t2`.`characteristic_id` = `t3`.`characteristic_id`\nAND `t1`.`color_code` = `t4`.`color_code`\nAND (`t4`.`color_description` = 'red' AND `t3`.`characteristic_name` = 'fast')\nRETURN `t1`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the products that have the color description \"red\" and have the characteristic name \"fast\".",
    "evidence": "",
    "idx": 5798
  }
]