[
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartment_buildings`:`apartment_buildings`)\nRETURN DISTINCT `apartment_buildings`.`building_description` AS `building_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me a list of all the distinct building descriptions.",
    "evidence": "",
    "idx": 2344
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartment_buildings`:`apartment_buildings`)\nWHERE `apartment_buildings`.`building_manager` = 'Emma'\nRETURN `apartment_buildings`.`building_short_name` AS `building_short_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the short names of the buildings managed by \"Emma\".",
    "evidence": "",
    "idx": 2345
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartment_buildings`:`apartment_buildings`)\nWHERE `apartment_buildings`.`building_manager` = 'Brenden'\nRETURN `apartment_buildings`.`building_address` AS `building_address`, `apartment_buildings`.`building_phone` AS `building_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the addresses and phones of all the buildings managed by \"Brenden\".",
    "evidence": "",
    "idx": 2347
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartment_buildings`:`apartment_buildings`)\nWHERE `apartment_buildings`.`building_full_name` =~ '(?i)(?s).*court.*'\nRETURN `apartment_buildings`.`building_full_name` AS `building_full_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the building full names that contain the word \"court\"?",
    "evidence": "",
    "idx": 2349
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nRETURN min(`apartments`.`bathroom_count`) AS `_col_0`, MAX(`apartments`.`bathroom_count`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the minimum and maximum bathroom count among all the apartments.",
    "evidence": "",
    "idx": 2352
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nRETURN avg(`apartments`.`bedroom_count`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average number of bedrooms of all apartments?",
    "evidence": "",
    "idx": 2353
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nRETURN avg(`apartments`.`bedroom_count`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average number of bedrooms of all the apartments.",
    "evidence": "",
    "idx": 2354
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nRETURN `apartments`.`apt_number` AS `apt_number`, `apartments`.`room_count` AS `room_count`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the apartment number and the number of rooms for each apartment.",
    "evidence": "",
    "idx": 2355
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nWHERE `apartments`.`apt_type_code` = 'Flat'\nRETURN `apartments`.`apt_number` AS `apt_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the apartment numbers of the apartments with type code \"Flat\".",
    "evidence": "",
    "idx": 2357
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nWHERE `apartments`.`apt_type_code` = 'Flat'\nRETURN `apartments`.`apt_number` AS `apt_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which apartments have type code \"Flat\"? Give me their apartment numbers.",
    "evidence": "",
    "idx": 2358
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`guests`:`guests`)\nRETURN `guests`.`guest_first_name` AS `guest_first_name`, `guests`.`guest_last_name` AS `guest_last_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the first names and last names of all guests",
    "evidence": "",
    "idx": 2359
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`guests`:`guests`)\nWHERE `guests`.`gender_code` = 'Male'\nRETURN `guests`.`date_of_birth` AS `date_of_birth`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the date of birth for all the guests with gender code \"Male\".",
    "evidence": "",
    "idx": 2361
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`guests`:`guests`)\nWHERE `guests`.`gender_code` = 'Male'\nRETURN `guests`.`date_of_birth` AS `date_of_birth`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are dates of birth of all the guests whose gender is \"Male\"?",
    "evidence": "",
    "idx": 2362
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH ()-[t1:books]->(`t2`:`apartments`)\nWHERE `t1`.`apt_id` = `t2`.`apt_id`\nRETURN `t2`.`apt_number` AS `apt_number`, `t1`.`booking_start_date` AS `booking_start_date`, `t1`.`booking_start_date` AS `booking_start_date_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the apartment number, start date, and end date of each apartment booking?",
    "evidence": "",
    "idx": 2364
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH ()-[t1:books]->(`t2`:`apartments`)\nWHERE `t1`.`apt_id` = `t2`.`apt_id`\nAND (`t2`.`bedroom_count` > 2)\nRETURN `t1`.`booking_start_date` AS `booking_start_date`, `t1`.`booking_start_date` AS `booking_start_date_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the booking start and end dates of the apartments with more than 2 bedrooms?",
    "evidence": "",
    "idx": 2365
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH ()-[t1:booked_by]->(`t2`:`guests`)\nWHERE `t1`.`guest_id` = `t2`.`guest_id`\nRETURN `t2`.`guest_first_name` AS `guest_first_name`, `t1`.`booking_start_date` AS `booking_start_date`, `t1`.`booking_start_date` AS `booking_start_date_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the guest first name, start date, and end date of each apartment booking?",
    "evidence": "",
    "idx": 2372
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`t1`:`apartment_facilities`)-[is_facility_of_0:is_facility_of]->(`t2`:`apartments`)\nWHERE `t1`.`apt_id` = `t2`.`apt_id`\nAND (`t2`.`bedroom_count` > 4)\nRETURN `t1`.`facility_code` AS `facility_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the facility codes of apartments with more than 4 bedrooms.",
    "evidence": "",
    "idx": 2375
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`t2`:`apartments`)-[located_in_0:located_in]->(`t1`:`apartment_buildings`)\nWHERE `t1`.`building_id` = `t2`.`building_id`\nAND (`t2`.`bathroom_count` > 2)\nRETURN `t1`.`building_address` AS `building_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the addresses of the buildings that have apartments with more than 2 bathrooms.",
    "evidence": "",
    "idx": 2377
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`t2`:`apartments`)-[located_in_0:located_in]->(`t1`:`apartment_buildings`)\nWHERE `t1`.`building_id` = `t2`.`building_id`\nAND (`t1`.`building_manager` = 'Kyle')\nRETURN `t2`.`apt_type_code` AS `apt_type_code`, `t2`.`apt_number` AS `apt_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the apartment type codes and apartment numbers in the buildings managed by \"Kyle\".",
    "evidence": "",
    "idx": 2379
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nORDER BY `apartments`.`room_count` IS NULL DESC, `apartments`.`room_count`  \nRETURN `apartments`.`apt_number` AS `apt_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return all the apartment numbers sorted by the room count in ascending order.",
    "evidence": "",
    "idx": 2383
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nORDER BY `apartments`.`room_count` IS NULL DESC, `apartments`.`room_count`  \nRETURN `apartments`.`apt_number` AS `apt_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort the apartment numbers in ascending order of room count.",
    "evidence": "",
    "idx": 2384
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nORDER BY `apartments`.`bedroom_count` IS NULL ASC, `apartments`.`bedroom_count` DESC \nRETURN `apartments`.`apt_number` AS `apt_number`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the apartment number with the largest number of bedrooms.",
    "evidence": "",
    "idx": 2385
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nWITH `apartments`.`apt_type_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `apt_type_code`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL DESC, `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the apartment type codes and the corresponding number of apartments sorted by the number of apartments in ascending order.",
    "evidence": "",
    "idx": 2387
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`apartments`:`apartments`)\nWITH `apartments`.`apt_type_code` AS _groupby_col_0, MAX(`apartments`.`room_count`) AS _groupby_col_1, min(`apartments`.`room_count`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `apt_type_code`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show each apartment type code, and the maximum and minimum number of rooms for each type.",
    "evidence": "",
    "idx": 2389
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "MATCH (`guests`:`guests`)\nWITH `guests`.`gender_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `gender_code`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show each gender code and the corresponding count of guests sorted by the count in descending order.",
    "evidence": "",
    "idx": 2391
  },
  {
    "filename": "train_spider.json",
    "db_id": "apartment_rentals",
    "gql_statement": "WITH *, COLLECT { MATCH (`apartment_facilities_sub0`:`apartment_facilities`)\nRETURN `apartment_facilities_sub0`.`apt_id` AS `apt_id`   } AS in_collect_0\nMATCH (`apartments`:`apartments`)\nWHERE NOT `apartments`.`apt_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of apartments that have no facility.",
    "evidence": "",
    "idx": 2394
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_injury",
    "gql_statement": "MATCH (`game`:`game`)\nORDER BY `game`.`home_team` IS NULL ASC, `game`.`home_team` DESC \nRETURN `game`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the dates of games by the home team name in descending order.",
    "evidence": "",
    "idx": 2396
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_injury",
    "gql_statement": "MATCH (`game`:`game`)\nRETURN `game`.`season` AS `season`, `game`.`home_team` AS `home_team`, `game`.`away_team` AS `away_team`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the season, home team, away team of all the games.",
    "evidence": "",
    "idx": 2397
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_injury",
    "gql_statement": "MATCH (`t3`:`injury_accident`)-[occurred_in_0:occurred_in]->(`t1`:`game`)-[played_at_0:played_at]->(`t2`:`stadium`)\nWHERE `t1`.`stadium_id` = `t2`.`id`\nAND `t1`.`id` = `t3`.`game_id`\nAND (`t3`.`injury` = 'Foot injury' OR `t3`.`injury` = 'Knee problem')\nRETURN `t1`.`season` AS `season`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "In which season and which stadium did any player have an injury of 'Foot injury' or 'Knee problem'?",
    "evidence": "",
    "idx": 2402
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_injury",
    "gql_statement": "MATCH (`stadium`:`stadium`)\nWHERE `stadium`.`name` =~ '(?i)(?s).*Bank.*'\nRETURN `stadium`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which stadium name contains the substring \"Bank\"?",
    "evidence": "",
    "idx": 2406
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_injury",
    "gql_statement": "MATCH (`t2`:`injury_accident`)-[occurred_in_0:occurred_in]->(`t1`:`game`)\nWHERE `t1`.`id` = `t2`.`game_id`\nORDER BY `t1`.`season` IS NULL ASC, `t1`.`season` DESC \nRETURN `t1`.`date` AS `date`, `t2`.`player` AS `player`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each injury accident, find the date of the game and the name of the injured player in the game, and sort the results in descending order of game season.",
    "evidence": "",
    "idx": 2408
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`t2`:`league`)-[in_country_0:in_country]->(`t1`:`country`)\nWHERE `t1`.`id` = `t2`.`country_id`\nRETURN `t1`.`name` AS `name`, `t2`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all country and league names.",
    "evidence": "",
    "idx": 2409
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`t2`:`league`)-[in_country_0:in_country]->(`t1`:`country`)\nWHERE `t1`.`id` = `t2`.`country_id`\nAND (`t1`.`name` = 'England')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many leagues are there in England?",
    "evidence": "",
    "idx": 2410
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`player`:`player`)\nRETURN avg(`player`.`weight`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average weight of all players?",
    "evidence": "",
    "idx": 2411
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`player`:`player`)\nRETURN MAX(`player`.`weight`) AS `_col_0`, min(`player`.`weight`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum and minimum height of all players?",
    "evidence": "",
    "idx": 2412
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "CALL(*) {\nMATCH (`player_attributes_sub0`:`player_attributes`)\nRETURN avg(`player_attributes_sub0`.`overall_rating`) AS `_col_0`  \n}\nMATCH (`t2`:`player_attributes`)-[belongs_to_player_0:belongs_to_player]->(`t1`:`player`)\nWHERE `t1`.`player_api_id` = `t2`.`player_api_id`\nAND (`t2`.`overall_rating` > `_col_0`)\nRETURN DISTINCT `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all player names who have an overall rating higher than the average.",
    "evidence": "",
    "idx": 2413
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "CALL(*) {\nMATCH (`player_attributes_sub0`:`player_attributes`)\nRETURN MAX(`player_attributes_sub0`.`overall_rating`) AS `_col_0`  \n}\nMATCH (`t2`:`player_attributes`)-[belongs_to_player_0:belongs_to_player]->(`t1`:`player`)\nWHERE `t1`.`player_api_id` = `t2`.`player_api_id`\nAND (`t2`.`dribbling` = `_col_0`)\nRETURN DISTINCT `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of players who have the best dribbling?",
    "evidence": "",
    "idx": 2414
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`t2`:`player_attributes`)-[belongs_to_player_0:belongs_to_player]->(`t1`:`player`)\nWHERE `t1`.`player_api_id` = `t2`.`player_api_id`\nAND (`t2`.`crossing` > 90 AND `t2`.`preferred_foot` = 'right')\nRETURN DISTINCT `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all players who have a crossing score higher than 90 and prefer their right foot.",
    "evidence": "",
    "idx": 2415
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`t2`:`player_attributes`)-[belongs_to_player_0:belongs_to_player]->(`t1`:`player`)\nWHERE `t1`.`player_api_id` = `t2`.`player_api_id`\nAND (`t2`.`preferred_foot` = 'left' AND `t2`.`overall_rating` >= 85 AND `t2`.`overall_rating` <= 90)\nRETURN DISTINCT `t1`.`player_name` AS `player_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of all left-footed players who have overall rating between 85 and 90.",
    "evidence": "",
    "idx": 2416
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`player_attributes`:`player_attributes`)\nWITH `player_attributes`.`preferred_foot` AS _groupby_col_0, avg(`player_attributes`.`overall_rating`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `preferred_foot`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average rating for right-footed players and left-footed players?",
    "evidence": "",
    "idx": 2417
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`player_attributes`:`player_attributes`)\nWHERE `player_attributes`.`overall_rating` > 80\nWITH `player_attributes`.`preferred_foot` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `preferred_foot`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Of all players with an overall rating greater than 80, how many are right-footed and left-footed?",
    "evidence": "",
    "idx": 2418
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`t2`:`player_attributes`)-[belongs_to_player_0:belongs_to_player]->(`t1`:`player`)\nWHERE `t1`.`player_api_id` = `t2`.`player_api_id`\nORDER BY `t2`.`overall_rating` IS NULL ASC, `t2`.`overall_rating` DESC \nRETURN DISTINCT `t1`.`player_name` AS `player_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who are the top 3 players in terms of overall rating?",
    "evidence": "",
    "idx": 2419
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_1",
    "gql_statement": "MATCH (`t2`:`player_attributes`)-[belongs_to_player_0:belongs_to_player]->(`t1`:`player`)\nWHERE `t1`.`player_api_id` = `t2`.`player_api_id`\nORDER BY `t2`.`potential` IS NULL ASC, `t2`.`potential` DESC \nRETURN DISTINCT `t1`.`player_name` AS `player_name`, `t1`.`birthday` AS `birthday`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names and birthdays of the top five players in terms of potential.",
    "evidence": "",
    "idx": 2420
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "MATCH (`performance`:`performance`)\nORDER BY `performance`.`attendance` IS NULL DESC, `performance`.`attendance`  \nRETURN `performance`.`host` AS `host`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the hosts of performances in ascending order of attendance.",
    "evidence": "",
    "idx": 2422
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "MATCH (`performance`:`performance`)\nWHERE `performance`.`location` = 'TD Garden' OR `performance`.`location` = 'Bell Centre'\nRETURN `performance`.`attendance` AS `attendance`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the attendances of the performances at location \"TD Garden\" or \"Bell Centre\"",
    "evidence": "",
    "idx": 2424
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "MATCH (`performance`:`performance`)\nRETURN avg(`performance`.`attendance`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average number of attendees for performances?",
    "evidence": "",
    "idx": 2425
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "MATCH (`performance`:`performance`)\nWITH `performance`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `location`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different locations and the number of performances at each location.",
    "evidence": "",
    "idx": 2427
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "MATCH (`performance`:`performance`)\nWITH `performance`.`location` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the locations that have at least two performances.",
    "evidence": "",
    "idx": 2428
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "MATCH (`t2`:`member`)-[t1:attended]->(`t3`:`performance`)\nWHERE `t1`.`member_id` = `t2`.`member_id`\nAND `t1`.`performance_id` = `t3`.`performance_id`\nRETURN `t2`.`name` AS `name`, `t3`.`location` AS `location`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of members and the location of the performances they attended.",
    "evidence": "",
    "idx": 2429
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "MATCH (`t2`:`member`)-[t1:attended]->(`t3`:`performance`)\nWHERE `t1`.`member_id` = `t2`.`member_id`\nAND `t1`.`performance_id` = `t3`.`performance_id`\nRETURN `t2`.`name` AS `name`, `t3`.`location` AS `location` ORDER BY `t2`.`name` IS NULL DESC, `t2`.`name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of members and the location of performances they attended in ascending alphabetical order of their names.",
    "evidence": "",
    "idx": 2430
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "MATCH (`t2`:`member`)-[t1:attended]->(`t3`:`performance`)\nWHERE `t1`.`member_id` = `t2`.`member_id`\nAND `t1`.`performance_id` = `t3`.`performance_id`\nAND (`t2`.`role` = 'Violin')\nRETURN `t3`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the dates of performances with attending members whose roles are \"Violin\".",
    "evidence": "",
    "idx": 2431
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "MATCH (`t2`:`member`)-[t1:attended]->(`t3`:`performance`)\nWHERE `t1`.`member_id` = `t2`.`member_id`\nAND `t1`.`performance_id` = `t3`.`performance_id`\nORDER BY `t3`.`attendance` IS NULL ASC, `t3`.`attendance` DESC \nRETURN `t2`.`name` AS `name`, `t3`.`date` AS `date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of members and the dates of performances they attended in descending order of attendance of the performances.",
    "evidence": "",
    "idx": 2432
  },
  {
    "filename": "train_spider.json",
    "db_id": "performance_attendance",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[member_attendance_sub0:attended]->()\nRETURN `member_attendance_sub0`.`member_id` AS `member_id`   } AS in_collect_0\nMATCH (`member`:`member`)\nWHERE NOT `member`.`member_id` IN in_collect_0\nRETURN `member`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of members who did not attend any performance.",
    "evidence": "",
    "idx": 2433
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`capacity` > 50\nRETURN DISTINCT `classroom`.`building` AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the buildings which have rooms with capacity more than 50.",
    "evidence": "",
    "idx": 2434
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`capacity` > 50\nRETURN DISTINCT `classroom`.`building` AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the distinct buildings with capacities of greater than 50?",
    "evidence": "",
    "idx": 2435
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`building` <> 'Lamberton'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of rooms that are not in the Lamberton building.",
    "evidence": "",
    "idx": 2436
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`building` <> 'Lamberton'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many classrooms are not in Lamberton?",
    "evidence": "",
    "idx": 2437
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`department_sub0`:`department`)\nRETURN avg(`department_sub0`.`budget`) AS `_col_0`  \n}\nMATCH (`department`:`department`)\nWHERE `department`.`budget` > `_col_0`\nRETURN `department`.`dept_name` AS `dept_name`, `department`.`building` AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name and building of the departments whose budget is more than the average budget?",
    "evidence": "",
    "idx": 2438
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "CALL(*) {\nMATCH (`department_sub0`:`department`)\nRETURN avg(`department_sub0`.`budget`) AS `_col_0`  \n}\nMATCH (`department`:`department`)\nWHERE `department`.`budget` > `_col_0`\nRETURN `department`.`dept_name` AS `dept_name`, `department`.`building` AS `building`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the name and building of the departments with greater than average budget.",
    "evidence": "",
    "idx": 2439
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`capacity` >= 50 AND `classroom`.`capacity` <= 100\nRETURN `classroom`.`building` AS `building`, `classroom`.`room_number` AS `room_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the room number of the rooms which can sit 50 to 100 students and their buildings.",
    "evidence": "",
    "idx": 2440
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`capacity` >= 50 AND `classroom`.`capacity` <= 100\nRETURN `classroom`.`building` AS `building`, `classroom`.`room_number` AS `room_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the room numbers and corresponding buildings for classrooms which can seat between 50 to 100 students?",
    "evidence": "",
    "idx": 2441
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`department`:`department`)\nORDER BY `department`.`budget` IS NULL ASC, `department`.`budget` DESC \nRETURN `department`.`dept_name` AS `dept_name`, `department`.`building` AS `building`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and building of the department with the highest budget.",
    "evidence": "",
    "idx": 2442
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`department`:`department`)\nORDER BY `department`.`budget` IS NULL ASC, `department`.`budget` DESC \nRETURN `department`.`dept_name` AS `dept_name`, `department`.`building` AS `building`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the department name and corresponding building for the department with the greatest budget?",
    "evidence": "",
    "idx": 2443
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`dept_name` = 'History'\nORDER BY `student`.`tot_cred` IS NULL ASC, `student`.`tot_cred` DESC \nRETURN `student`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of the student who has the highest total credits in the History department.",
    "evidence": "",
    "idx": 2444
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`building` = 'Lamberton'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many rooms does the Lamberton building have?",
    "evidence": "",
    "idx": 2446
  },
  {
    "filename": "train_spider.json",
    "db_id": "college_2",
    "gql_statement": "MATCH (`classroom`:`classroom`)\nWHERE `classroom`.`building` = 'Lamberton'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of classrooms in Lamberton.",
    "evidence": "",
    "idx": 2447
  }
]