[
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`fname` = 'Linda' AND `t3`.`lname` = 'Smith')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many clubs does \"Linda Smith\" belong to?",
    "evidence": "",
    "idx": 4755
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`fname` = 'Linda' AND `t3`.`lname` = 'Smith')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many clubs does \"Linda Smith\" have membership for?",
    "evidence": "",
    "idx": 4756
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`fname` = 'Tracy' AND `t3`.`lname` = 'Kim')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the number of clubs where \"Tracy Kim\" is a member.",
    "evidence": "",
    "idx": 4757
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`fname` = 'Tracy' AND `t3`.`lname` = 'Kim')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For how many clubs is \"Tracy Kim\" a member?",
    "evidence": "",
    "idx": 4758
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Bootup Baltimore' AND `t3`.`sex` = 'F')\nRETURN `t3`.`fname` AS `fname`, `t3`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the female members of club \"Bootup Baltimore\". Show the first name and last name.",
    "evidence": "",
    "idx": 4759
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Hopkins Student Enterprises' AND `t3`.`sex` = 'M')\nRETURN `t3`.`fname` AS `fname`, `t3`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the male members of club \"Hopkins Student Enterprises\". Show the first name and last name.",
    "evidence": "",
    "idx": 4761
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Bootup Baltimore' AND `t3`.`major` = '600')\nRETURN `t3`.`fname` AS `fname`, `t3`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all members of \"Bootup Baltimore\" whose major is \"600\". Show the first name and last name.",
    "evidence": "",
    "idx": 4763
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Tennis Club'\nRETURN `club`.`clubdesc` AS `clubdesc`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the description of the club named \"Tennis Club\"?",
    "evidence": "",
    "idx": 4765
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Tennis Club'\nRETURN `club`.`clubdesc` AS `clubdesc`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the description of the club called \"Tennis Club\".",
    "evidence": "",
    "idx": 4766
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Pen and Paper Gaming'\nRETURN `club`.`clubdesc` AS `clubdesc`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the description of the club \"Pen and Paper Gaming\".",
    "evidence": "",
    "idx": 4767
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Pen and Paper Gaming'\nRETURN `club`.`clubdesc` AS `clubdesc`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the description of the club \"Pen and Paper Gaming\"?",
    "evidence": "",
    "idx": 4768
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Tennis Club'\nRETURN `club`.`clublocation` AS `clublocation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the location of the club named \"Tennis Club\"?",
    "evidence": "",
    "idx": 4769
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Tennis Club'\nRETURN `club`.`clublocation` AS `clublocation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where us the club named \"Tennis Club\" located?",
    "evidence": "",
    "idx": 4770
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Pen and Paper Gaming'\nRETURN `club`.`clublocation` AS `clublocation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the location of the club \"Pen and Paper Gaming\".",
    "evidence": "",
    "idx": 4771
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Pen and Paper Gaming'\nRETURN `club`.`clublocation` AS `clublocation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where is the club \"Pen and Paper Gaming\" located?",
    "evidence": "",
    "idx": 4772
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Hopkins Student Enterprises'\nRETURN `club`.`clublocation` AS `clublocation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Where is the club \"Hopkins Student Enterprises\" located?",
    "evidence": "",
    "idx": 4773
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clubname` = 'Hopkins Student Enterprises'\nRETURN `club`.`clublocation` AS `clublocation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Tell me the location of the club \"Hopkins Student Enterprises\".",
    "evidence": "",
    "idx": 4774
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clublocation` = 'AKW'\nRETURN `club`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of all the clubs at \"AKW\".",
    "evidence": "",
    "idx": 4775
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clublocation` = 'AKW'\nRETURN `club`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which clubs are located at \"AKW\"? Return the club names.",
    "evidence": "",
    "idx": 4776
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clublocation` = 'HHH'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many clubs are located at \"HHH\"?",
    "evidence": "",
    "idx": 4777
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`club`:`club`)\nWHERE `club`.`clublocation` = 'HHH'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of clubs located at \"HHH\".",
    "evidence": "",
    "idx": 4778
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Bootup Baltimore' AND `t2`.`position` = 'President')\nRETURN `t3`.`fname` AS `fname`, `t3`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the first and last name of the president of the club \"Bootup Baltimore\"?",
    "evidence": "",
    "idx": 4779
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Hopkins Student Enterprises' AND `t2`.`position` = 'CTO')\nRETURN `t3`.`fname` AS `fname`, `t3`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Who is the \"CTO\" of club \"Hopkins Student Enterprises\"? Show the first name and last name.",
    "evidence": "",
    "idx": 4781
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Bootup Baltimore' AND `t3`.`age` > 18)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many members of \"Bootup Baltimore\" are older than 18?",
    "evidence": "",
    "idx": 4785
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`city_code` = 'BAL')\nRETURN DISTINCT `t1`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of all the clubs that have at least a member from the city with city code \"BAL\".",
    "evidence": "",
    "idx": 4789
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`city_code` = 'BAL')\nRETURN DISTINCT `t1`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which clubs have one or more members from the city with code \"BAL\"? Give me the names of the clubs.",
    "evidence": "",
    "idx": 4790
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`city_code` = 'HOU')\nRETURN DISTINCT `t1`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the clubs that have at least a member from the city with city code \"HOU\".",
    "evidence": "",
    "idx": 4791
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`city_code` = 'HOU')\nRETURN DISTINCT `t1`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which clubs have one or more members from the city with code \"HOU\"? Give me the names of the clubs.",
    "evidence": "",
    "idx": 4792
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`fname` = 'Eric' AND `t3`.`lname` = 'Tai')\nRETURN COUNT(DISTINCT `t1`.`clubname`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many clubs does the student named \"Eric Tai\" belong to?",
    "evidence": "",
    "idx": 4793
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`fname` = 'Davis' AND `t3`.`lname` = 'Steven')\nRETURN DISTINCT `t1`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the clubs having \"Davis Steven\" as a member.",
    "evidence": "",
    "idx": 4795
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`advisor` = 1121)\nRETURN DISTINCT `t1`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the clubs that have at least a member with advisor \"1121\".",
    "evidence": "",
    "idx": 4797
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t3`.`advisor` = 1121)\nRETURN DISTINCT `t1`.`clubname` AS `clubname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which clubs have one or more members whose advisor is \"1121\"?",
    "evidence": "",
    "idx": 4798
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Bootup Baltimore')\nRETURN avg(`t3`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average age of the members of the club \"Bootup Baltimore\"?",
    "evidence": "",
    "idx": 4799
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Bootup Baltimore')\nRETURN avg(`t3`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age of the members in the club \"Bootup Baltimore\".",
    "evidence": "",
    "idx": 4800
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Hopkins Student Enterprises')\nRETURN avg(`t3`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average age of members of the club \"Hopkins Student Enterprises\".",
    "evidence": "",
    "idx": 4801
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Tennis Club')\nRETURN avg(`t3`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Retrieve the average age of members of the club \"Tennis Club\".",
    "evidence": "",
    "idx": 4803
  },
  {
    "filename": "train_spider.json",
    "db_id": "club_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t2:member_of]->(`t1`:`club`)\nWHERE `t1`.`clubid` = `t2`.`clubid`\nAND `t2`.`stuid` = `t3`.`stuid`\nAND (`t1`.`clubname` = 'Tennis Club')\nRETURN avg(`t3`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Compute the average age of the members in the club \"Tennis Club\".",
    "evidence": "",
    "idx": 4804
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`grants`)-[awarded_to_0:awarded_to]->(`t2`:`organisations`)-[has_type_0:has_type]->(`t3`:`organisation_types`)\nWHERE `t1`.`organisation_id` = `t2`.`organisation_id`\nAND `t2`.`organisation_type` = `t3`.`organisation_type`\nAND (`t3`.`organisation_type_description` = 'Research')\nRETURN sum(`t1`.`grant_amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total grant amount of the organisations described as research?",
    "evidence": "",
    "idx": 4805
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`grants`)-[awarded_to_0:awarded_to]->(`t2`:`organisations`)-[has_type_0:has_type]->(`t3`:`organisation_types`)\nWHERE `t1`.`organisation_id` = `t2`.`organisation_id`\nAND `t2`.`organisation_type` = `t3`.`organisation_type`\nAND (`t3`.`organisation_type_description` = 'Research')\nRETURN sum(`t1`.`grant_amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of grant money for research?",
    "evidence": "",
    "idx": 4806
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`documents`)-[for_grant_0:for_grant]->(`t2`:`grants`)-[awarded_to_0:awarded_to]->(`t3`:`organisations`)-[has_type_0:has_type]->(`t4`:`organisation_types`)\nWHERE `t1`.`grant_id` = `t2`.`grant_id`\nAND `t2`.`organisation_id` = `t3`.`organisation_id`\nAND `t3`.`organisation_type` = `t4`.`organisation_type`\nAND (`t2`.`grant_amount` > 5000 AND `t4`.`organisation_type_description` = 'Research')\nRETURN `t1`.`sent_date` AS `sent_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find out the send dates of the documents with the grant amount of more than 5000 were granted by organisation type described",
    "evidence": "",
    "idx": 4807
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`documents`)-[has_type_0:has_type]->(`t2`:`document_types`)\nMATCH (`t1`:`documents`)-[for_grant_0:for_grant]->(`t3`:`grants`)\nWHERE `t1`.`document_type_code` = `t2`.`document_type_code`\nAND `t1`.`grant_id` = `t3`.`grant_id`\nAND (`t2`.`document_description` = 'Regular' OR `t3`.`grant_amount` > 100)\nRETURN `t1`.`response_received_date` AS `response_received_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the response received dates for the documents described as 'Regular' or granted with more than 100?",
    "evidence": "",
    "idx": 4809
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`documents`)-[has_type_0:has_type]->(`t2`:`document_types`)\nMATCH (`t1`:`documents`)-[for_grant_0:for_grant]->(`t3`:`grants`)\nWHERE `t1`.`document_type_code` = `t2`.`document_type_code`\nAND `t1`.`grant_id` = `t3`.`grant_id`\nAND (`t2`.`document_description` = 'Regular' OR `t3`.`grant_amount` > 100)\nRETURN `t1`.`response_received_date` AS `response_received_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the response received date for the document described as Regular that was granted more than 100 dollars?",
    "evidence": "",
    "idx": 4810
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "WITH *, COLLECT { MATCH (`project_staff_sub0`:`project_staff`)\nWHERE `project_staff_sub0`.`role_code` = 'researcher'\nRETURN `project_staff_sub0`.`project_id` AS `project_id`   } AS in_collect_0\nMATCH (`projects`:`projects`)\nWHERE NOT `projects`.`project_id` IN in_collect_0\nRETURN `projects`.`project_details` AS `project_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the project details of the projects which did not hire any staff for a researcher role.",
    "evidence": "",
    "idx": 4811
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "WITH *, COLLECT { MATCH (`project_staff_sub0`:`project_staff`)\nWHERE `project_staff_sub0`.`role_code` = 'researcher'\nRETURN `project_staff_sub0`.`project_id` AS `project_id`   } AS in_collect_0\nMATCH (`projects`:`projects`)\nWHERE NOT `projects`.`project_id` IN in_collect_0\nRETURN `projects`.`project_details` AS `project_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the details for all projects that did not hire any staff in a research role?",
    "evidence": "",
    "idx": 4812
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`project_staff`:`project_staff`)\nWHERE `project_staff`.`role_code` = 'researcher'\nRETURN `project_staff`.`date_from` AS `date_from`, `project_staff`.`date_to` AS `date_to`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When do all the researcher role staff start to work, and when do they stop working?",
    "evidence": "",
    "idx": 4813
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`project_staff`:`project_staff`)\nWHERE `project_staff`.`role_code` = 'researcher'\nRETURN `project_staff`.`date_from` AS `date_from`, `project_staff`.`date_to` AS `date_to`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "When did researchers start and stop working?",
    "evidence": "",
    "idx": 4814
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`grants`:`grants`)\nWITH `grants`.`organisation_id` AS _groupby_col_0, sum(`grants`.`grant_amount`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `organisation_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of grants given by each organisations? Also list the organisation id.",
    "evidence": "",
    "idx": 4817
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`grants`:`grants`)\nWITH `grants`.`organisation_id` AS _groupby_col_0, sum(`grants`.`grant_amount`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `organisation_id`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of grant money given to each organization and what is its id?",
    "evidence": "",
    "idx": 4818
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`projects`)-[t2:has_outcome]->(`t3`:`research_outcomes`)\nWHERE `t1`.`project_id` = `t2`.`project_id`\nAND `t2`.`outcome_code` = `t3`.`outcome_code`\nAND (`t3`.`outcome_description` =~ '(?i)(?s).*Published.*')\nRETURN `t1`.`project_details` AS `project_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the project details of the projects with the research outcome described with the substring 'Published'.",
    "evidence": "",
    "idx": 4819
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`project_staff`)-[works_on_0:works_on]->(`t2`:`projects`)\nWHERE `t1`.`project_id` = `t2`.`project_id`\nWITH `t1`.`project_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `project_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL DESC, `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many staff does each project has? List the project id and the number in an ascending order.",
    "evidence": "",
    "idx": 4821
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`staff_roles`:`staff_roles`)\nWHERE `staff_roles`.`role_code` = 'researcher'\nRETURN `staff_roles`.`role_description` AS `role_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the complete description of the researcher role.",
    "evidence": "",
    "idx": 4823
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[project_outcomes_sub0:has_outcome]->()\nRETURN `project_outcomes_sub0`.`project_id` AS `project_id`   } AS in_collect_0\nMATCH (`projects`:`projects`)\nWHERE NOT `projects`.`project_id` IN in_collect_0\nRETURN `projects`.`project_details` AS `project_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which projects have no outcome? List the project details.",
    "evidence": "",
    "idx": 4827
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[project_outcomes_sub0:has_outcome]->()\nRETURN `project_outcomes_sub0`.`project_id` AS `project_id`   } AS in_collect_0\nMATCH (`projects`:`projects`)\nWHERE NOT `projects`.`project_id` IN in_collect_0\nRETURN `projects`.`project_details` AS `project_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the details of the project with no outcomes?",
    "evidence": "",
    "idx": 4828
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`documents`:`documents`)\nWITH `documents`.`grant_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `grant_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many documents can one grant have at most? List the grant id and number.",
    "evidence": "",
    "idx": 4831
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t2`:`organisations`)-[has_type_0:has_type]->(`t1`:`organisation_types`)\nWHERE `t1`.`organisation_type` = `t2`.`organisation_type`\nAND (`t2`.`organisation_details` = 'quo')\nRETURN `t1`.`organisation_type_description` AS `organisation_type_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the organisation type description of the organisation detailed as 'quo'.",
    "evidence": "",
    "idx": 4833
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`organisations`)-[has_type_0:has_type]->(`t2`:`organisation_types`)\nWHERE `t1`.`organisation_type` = `t2`.`organisation_type`\nAND (`t2`.`organisation_type_description` = 'Sponsor')\nRETURN `t1`.`organisation_details` AS `organisation_details` ORDER BY `organisation_details` IS NULL DESC, `organisation_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are all the details of the organisations described as 'Sponsor'? Sort the result in an ascending order.",
    "evidence": "",
    "idx": 4835
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH ()-[project_outcomes:has_outcome]->()\nWHERE `project_outcomes`.`outcome_code` = 'Patent'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many Patent outcomes are generated from all the projects?",
    "evidence": "",
    "idx": 4837
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH ()-[project_outcomes:has_outcome]->()\nWHERE `project_outcomes`.`outcome_code` = 'Patent'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many patents outcomes were listed for all the projects?",
    "evidence": "",
    "idx": 4838
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`project_staff`:`project_staff`)\nWHERE `project_staff`.`role_code` = 'leader' OR `project_staff`.`date_from` < localdatetime('1989-04-24T23:51:54')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many project staff worked as leaders or started working before '1989-04-24 23:51:54'?",
    "evidence": "",
    "idx": 4839
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`project_staff`:`project_staff`)\nWHERE `project_staff`.`role_code` = 'leader' OR `project_staff`.`date_from` < localdatetime('1989-04-24T23:51:54')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many project members were leaders or started working before '1989-04-24 23:51:54'?",
    "evidence": "",
    "idx": 4840
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`projects`)-[t2:has_outcome]->()\nWHERE `t1`.`project_id` = `t2`.`project_id`\nWITH `t1`.`organisation_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `organisation_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the organisation id with the maximum outcome count, and the count.",
    "evidence": "",
    "idx": 4845
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "MATCH (`t1`:`projects`)-[t2:has_outcome]->()\nWHERE `t1`.`project_id` = `t2`.`project_id`\nWITH `t1`.`organisation_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `organisation_id`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the id of the organization with the maximum number of outcomes and how many outcomes are there?",
    "evidence": "",
    "idx": 4846
  },
  {
    "filename": "train_spider.json",
    "db_id": "tracking_grants_for_research",
    "gql_statement": "WITH *, COLLECT { MATCH (`projects_sub0`:`projects`)\nWITH `projects_sub0`.`organisation_id` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `organisation_id`  LIMIT 1\n} AS in_collect_0\nMATCH (`projects`:`projects`)\nWHERE `projects`.`organisation_id` IN in_collect_0\nRETURN `projects`.`project_details` AS `project_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the project details of the projects launched by the organisation",
    "evidence": "",
    "idx": 4847
  }
]