[
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nRETURN avg(longest_absense_from_school.`month`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average absence period of a student?",
    "evidence": "average refers to DIVIDE(SUM(month), COUNT(name))",
    "idx": 2269
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (unemployed_sub0@`unemployed`)\nRETURN collect(unemployed_sub0.`name`) AS `name` \n} \nMATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE NOT longest_absense_from_school.`name` IN in_collect_0\nRETURN avg(longest_absense_from_school.`month`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average of absence for an employed students?",
    "evidence": "average refers to DIVIDE(SUM(month), COUNT(name))",
    "idx": 2270
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`longest_absense_from_school`)\nMATCH (t2@`disabled`)\nWHERE t1.`name` = t2.`name`\nRETURN avg(t1.`month`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average absence period of a disabled student?",
    "evidence": "average refers to DIVIDE(SUM(month), COUNT(name))",
    "idx": 2271
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`name` = 'studenT113'\nRETURN enlist.`organ` AS `organ`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which organization does student 313 belong to?",
    "evidence": "organization refers to organ",
    "idx": 2272
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'fire_department'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students enlisted in the fire-department?",
    "evidence": "enlisted in the fire-department refers to organ = 'fire_department';",
    "idx": 2273
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` = 0\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students who have never been absent from school?",
    "evidence": "have never been absent refers to `month` = 0;",
    "idx": 2274
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` > 2\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students have been absent above 2 months?",
    "evidence": "absent above 2 months refers to month > 2;",
    "idx": 2275
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`unemployed`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`organ` = 'navy')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many unemployed students are enlisted in the navy organization?",
    "evidence": "enlisted in the navy organization refers to organ = 'navy';",
    "idx": 2279
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`unemployed`)\nMATCH (t1@`longest_absense_from_school`)\nWHERE t1.`name` = t2.`name`\nRETURN cast (sum(CASE WHEN t1.`month` > 5 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`month`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of unemployed students who have been absent for 5 months from school?",
    "evidence": "percentage refers to DIVIDE(COUNT(month > 5), COUNT(month))",
    "idx": 2285
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`longest_absense_from_school`)\nMATCH (t2@`disabled`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`month` = 3)\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many disabled students have been absent for 3 months from school?",
    "evidence": "have been absent for 3 months from school refers to month = 3",
    "idx": 2288
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (disabled@`disabled`)\nRETURN COUNT(disabled.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are disabled?",
    "evidence": "",
    "idx": 2291
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` > 6\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students have been absents for more than 6 months?",
    "evidence": "absents for more than 6 months refers to month > 6",
    "idx": 2292
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL {\nMATCH (longest_absense_from_school_sub0@`longest_absense_from_school`)\nRETURN MAX(longest_absense_from_school_sub0.`month`) AS `_col_0` \n}\nMATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` = _col_0\nRETURN longest_absense_from_school.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which students have absents the most?",
    "evidence": "absents the most refers to MAX(month)",
    "idx": 2293
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'army'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are enlisted in the army?",
    "evidence": "enlisted in the army refers to organ = 'army';",
    "idx": 2294
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enlist`)\nMATCH (t2@`disabled`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`organ` = 'marines')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students enlisted in marines, how many of them are disabled?",
    "evidence": "enlisted in marines refers to organ = 'marines';",
    "idx": 2297
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`no_payment_due`)\nMATCH (t1@`unemployed`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`bool` = 'pos')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many unemployed students still have payment due?",
    "evidence": "still have payment due refers to bool = 'pos'",
    "idx": 2298
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`longest_absense_from_school`)\nMATCH (t1@`male`)\nWHERE t1.`name` <> t2.`name`\nAND (t2.`month` = 0)\nRETURN t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which female students had never been absent?",
    "evidence": "had never been absent refers to month = 0",
    "idx": 2299
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`longest_absense_from_school`)\nMATCH (t1@`enrolled`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`school` = 'smc' AND t2.`month` = 7)\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many SMC's students that absent for 7 months?",
    "evidence": "SMC's students refers to school = 'smc'; absent for 7 months refers to month = 7",
    "idx": 2302
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` = 5\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students has the longest absense from school for 5 months?",
    "evidence": "absense from school for 5 month refers to month = 5",
    "idx": 2306
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'army'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are enlisted in the Army organization?",
    "evidence": "enlisted in the army refers to organ = 'army';",
    "idx": 2307
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enrolled@`enrolled`)\nWHERE enrolled.`school` = 'ucla'\nRETURN COUNT(enrolled.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are enrolled in UCLA school?",
    "evidence": "enrolled in UCLA refers to school = 'ucla';",
    "idx": 2308
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nORDER BY longest_absense_from_school.`month` DESC NULLS LAST \nRETURN longest_absense_from_school.`name` AS `name` \nLIMIT 5",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List at least 5 students who has the longest absense from schoool?",
    "evidence": "longest absense refers to MAX(month)",
    "idx": 2309
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` >= '2'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the students joined two organization?",
    "evidence": "joined two organization refers to COUNT(organ) > = 2",
    "idx": 2310
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'navy'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are enlisted in the Navy organization?",
    "evidence": "enlisted in the navy organization refers to organ = 'navy';",
    "idx": 2311
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`no_payment_due`)\nMATCH (t1@`male`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`bool` = 'neg')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many male stuents do not have payment due?",
    "evidence": "do not have payment due refers to bool = 'neg';",
    "idx": 2312
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enlist`)\nMATCH (t2@`enrolled`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`organ` = 'peace_corps' AND t2.`school` = 'ucsd')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are enlisted in the Peace Corps organization are enrolled in UCSD school?",
    "evidence": "enlisted in the Peace Corps refers to organ = 'peace_corps'; enrolled in UCSD school refers to school = 'ucsd';",
    "idx": 2313
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`no_payment_due`)\nMATCH (t1@`unemployed`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`bool` = 'neg')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the unemployed students, how many of them have no payment due?",
    "evidence": "have no payment due refers to bool = 'neg';\n\n",
    "idx": 2314
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (male_sub0@`male`)\nRETURN collect(male_sub0.`name`) AS `name` \n} \nMATCH (no_payment_due@`no_payment_due`)\nWHERE NOT no_payment_due.`name` IN in_collect_0\nRETURN COUNT(no_payment_due.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female students have no payment due?",
    "evidence": "have no payment due refers to bool = 'neg'; female students refers to name NOT in male table",
    "idx": 2315
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`unemployed`)\nMATCH (t1@`longest_absense_from_school`)\nWHERE t2.`name` = t1.`name`\nAND (t1.`month` = 0)\nRETURN COUNT(t2.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many unemployed students have never been absent?",
    "evidence": "never been absent refers to month = 0;",
    "idx": 2316
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (male_sub0@`male`)\nRETURN collect(male_sub0.`name`) AS `name` \n} \nMATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'navy' AND NOT enlist.`name` IN in_collect_0\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female students are enlisted in the Navy organization?",
    "evidence": "female students refers to enlist.name who are NOT in male.name; organization refers to organ; organ = 'navy';",
    "idx": 2318
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enlist`)\nMATCH (t2@`unemployed`)\nWHERE t2.`name` = t1.`name`\nAND (t1.`organ` = 'army')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many unemployed students are enlisted in the Army organization?",
    "evidence": "organization refers to organ; organ = 'army';",
    "idx": 2319
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`unemployed`)\nMATCH (t1@`no_payment_due`)\nWHERE t2.`name` = t1.`name`\nAND (t1.`bool` = 'pos')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many unemployed students have payment due?",
    "evidence": "have payment due refers to bool = 'pos';",
    "idx": 2320
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`no_payment_due`)\nMATCH (t2@`enlist`)\nWHERE t2.`name` = t1.`name`\nAND (t2.`organ` = 'peace_corps' AND t1.`bool` = 'pos')\nRETURN t1.`name` AS `name` \nLIMIT 5",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List at least 5 students who have payment due and are enlisted in Peace Corps organization?",
    "evidence": "have payment due refers to bool = 'pos'; organization refers to organ; organ = 'Peace Corps';",
    "idx": 2321
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (male_sub0@`male`)\nRETURN collect(male_sub0.`name`) AS `name` \n} \nMATCH (disabled@`disabled`)\nWHERE NOT disabled.`name` IN in_collect_0\nRETURN COUNT(disabled.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many disabled students are female?",
    "evidence": "female refers to disabled.name who are NOT in male.name;",
    "idx": 2322
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`disabled`)\nMATCH (t2@`no_payment_due`)\nWHERE t2.`name` = t1.`name`\nAND (t2.`bool` = 'pos')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many disabled students have payment due?",
    "evidence": "have payment due refers to bool = 'pos';",
    "idx": 2323
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'navy'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students enlisted in the navy?",
    "evidence": "navy refers to organ = 'navy';",
    "idx": 2325
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (no_payment_due@`no_payment_due`)\nRETURN cast (sum(CASE WHEN no_payment_due.`bool` = 'pos' THEN 1 ELSE 0 END) as float) / sum(CASE WHEN no_payment_due.`bool` = 'neg' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the ratio of students who have payment due and those who do not have payment due?",
    "evidence": "ratio =  DIVIDE(COUNT(name WHERE `bool` = 'pos'), COUNT(name WHERE `bool` = 'neg')); have payment due refers to `bool` = 'pos'; no payment due refers to `bool` = 'neg';",
    "idx": 2327
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`disabled`)\nOPTIONAL MATCH (t2@`longest_absense_from_school`)\nWHERE t2.`month` = 9\nAND t2.`name` = t1.`name`\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among students who have been absent for nine months, how many of them are disabled?",
    "evidence": "absent for 9 months refers to month = 9;",
    "idx": 2332
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`filed_for_bankrupcy`)\nMATCH (t1@`unemployed`)\nWHERE t2.`name` = t1.`name`\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many unemployed students filed for bankruptcy?",
    "evidence": "unemployed students who filed for bankruptcy refers to unemployed.name who are IN filed_for_bankrupcy.name;",
    "idx": 2338
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`unemployed`)\nMATCH (t1@`no_payment_due`)\nWHERE t2.`name` = t1.`name`\nAND (t1.`bool` = 'pos')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students with payment due, how many of them are unemployed?",
    "evidence": "with payment due refers to bool = 'pos';",
    "idx": 2340
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (filed_for_bankrupcy@`filed_for_bankrupcy`)\nRETURN COUNT(filed_for_bankrupcy.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are filed for bankruptcy?",
    "evidence": "",
    "idx": 2344
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enrolled@`enrolled`)\nWHERE enrolled.`school` = 'smc' AND enrolled.`month` = 1\nRETURN COUNT(enrolled.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are enrolled in smc during month 1?",
    "evidence": "smc refers to school = 'smc';",
    "idx": 2345
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'air_force'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students enlist in the air force organization?",
    "evidence": "organization refers to organ; organ = 'air_force';",
    "idx": 2346
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`name` = 'student168'\nRETURN enlist.`organ` AS `organ`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the organization enlisted by student168?",
    "evidence": "organization refers to organ; student168 is a name of student;",
    "idx": 2347
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nRETURN cast (((sum(CASE WHEN longest_absense_from_school.`month` = 0 THEN 1 ELSE 0 END) - sum(CASE WHEN longest_absense_from_school.`month` = 9 THEN 1 ELSE 0 END))) as float) * 100 / sum(CASE WHEN longest_absense_from_school.`month` = 0 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage difference between month 0 absence and month 9 absence?",
    "evidence": "percentage difference = CONCAT(DIVIDE(MULTIPLY(SUBTRACT(COUNT(name WHERE month = 0), COUNT(name WHERE month = 9)), 100), COUNT(name WHERE month = 0)),'%');",
    "idx": 2348
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`disabled`)\nMATCH (t2@`unemployed`)\nWHERE t2.`name` = t1.`name`\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students is disabled and unemployed at the same time?",
    "evidence": "students who are disabled and unemployed at the same time refers to disabled.name = unemployed.name;",
    "idx": 2349
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "LET in_collect_0 = VALUE { MATCH (male_sub0@`male`)\nRETURN collect(male_sub0.`name`) AS `name_1` \n} \nMATCH (enrolled@`enrolled`)\nWHERE enrolled.`school` IN ['occ', 'ulca'] AND NOT enrolled.`name` IN in_collect_0\nRETURN enrolled.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "List out female students that enrolled in occ school and ulca?",
    "evidence": "female students refers to enrolled.name who are NOT in male.name; occ school and ulca refers to school IN('occ', 'ulca');",
    "idx": 2351
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enlist`)\nMATCH (t2@`enrolled`)\nWHERE t2.`name` = t1.`name`\nAND (t1.`name` = 'student211')\nRETURN t2.`school` AS `school`, t1.`organ` AS `organ`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the school and organization enrolled by student211?",
    "evidence": "organization refers to organ; student211 is a name of student;",
    "idx": 2352
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`filed_for_bankrupcy`)\nOPTIONAL MATCH (t2@`male`)\nWHERE t2.`name` = t1.`name`\nRETURN COUNT(t2.`name`) - sum(CASE WHEN t2.`name` IS NULL THEN 1 ELSE 0 END) AS `num`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many male students filed for bankruptcy as compare to female students?",
    "evidence": "difference = SUBTRACT(COUNT(filed_for_bankrupcy.name who are In male.name), COUNT(filed_for_bankrupcy.name who are NOT in male.name)); male students are mentioned in male.name; female students refers to filed_for_bankrupy.name who are NOT in male.name;",
    "idx": 2353
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`longest_absense_from_school`)\nOPTIONAL MATCH (t2@`disabled`)\nWHERE t2.`name` = t1.`name`\nRETURN cast ((sum(CASE WHEN NOT t2.`name` IS NULL AND t1.`month` = 0 THEN 1 ELSE 0 END) - sum(CASE WHEN t2.`name` IS NULL AND t1.`month` = 0 THEN 1 ELSE 0 END)) as float) * 100 / COUNT(t1.`name`) AS `_col_0`, CASE WHEN sum(CASE WHEN NOT t2.`name` IS NULL AND t1.`month` = 0 THEN 1 ELSE 0 END) - sum(CASE WHEN t2.`name` IS NULL AND t1.`month` = 0 THEN 1 ELSE 0 END) > 0 THEN 'YES' ELSE 'NO' END AS `ishigh`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage difference between the attendence of disabled and non-disable students? Do the disable students show better attendance than non-disable students?",
    "evidence": "difference = MULTIPLY(DIVIDE(SUBTRACT(COUNT(longest_absense_from_school.name that is in disabled.name), COUNT(longest _absense_from_school.name that is NOT in disabled.name), longest _absense_from_school.name), 100)); IF COUNT(longest_absense_from_school.name that is in disabled.name) < COUNT(longest _absense_from_school.name that is NOT in disabled.name), it means, the disabled students have better attendance than non-disabled students; IF COUNT(longest_absense_from_school.name that is in disabled.name) > COUNT(longest _absense_from_school.name that is NOT in disabled.name), it means the disabled students do not have a better attendance than non-disabled students;",
    "idx": 2354
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (no_payment_due@`no_payment_due`)\nWHERE no_payment_due.`name` = 'student124'\nRETURN no_payment_due.`bool` AS `bool`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the status of payment of student 124?",
    "evidence": "status of payment is mentioned in no_payment_due; bool = 'pos' means the student has payment due; bool = 'neg' means the student has no payment due; student124 is a name of student;",
    "idx": 2358
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'air_force'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students in the Air Force?",
    "evidence": "Air Force refers to organ = 'air_force';",
    "idx": 2367
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` < 4\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students have been absent less than 4 months?",
    "evidence": "absent less than 4 months refers to month < 4;",
    "idx": 2368
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'air_force'\nRETURN COUNT(enlist.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students are enlisted to the air force?",
    "evidence": "Air Force refers to organ = 'air_force';",
    "idx": 2373
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` > 1\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students have absent from school?",
    "evidence": "have absent from school refers to month > 1;",
    "idx": 2374
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`filed_for_bankrupcy`)\nMATCH (t2@`enrolled`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`school` = 'occ')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students that filed for bankruptcy, how many of them have been enrolled in OCC?",
    "evidence": "OCC refers to school = 'occ';",
    "idx": 2377
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`disabled`)\nMATCH (t1@`male`)\nWHERE t1.`name` = t2.`name`\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many disabled students are male?",
    "evidence": "male students are mentioned in male.name;",
    "idx": 2378
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`unemployed`)\nMATCH (t1@`no_payment_due`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`name` = 'student110')\nRETURN t1.`bool` AS `bool`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the employment and payment status of student110?",
    "evidence": "employment status is mentioned in unemployment; unemployed.name = 'student110' means the student is unemployed; if 'student110' can not be found in unemployed.name, it means the student is employed; payment status is mentioned in no_payment_due; bool = 'pos' means the student has payment due; bool = 'neg' means the student has no payment due; student110 is a name of student;",
    "idx": 2381
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enrolled`)-[has_person_8_0:`has_person_8`]->(t2@`person`)\nOPTIONAL MATCH (t3@`male`)-[has_person_5_0:`has_person_5`]->(t2@`person`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`name` = 'student34') AND t2.`name` = t3.`name`\nRETURN t1.`school` AS `school`, CASE WHEN t3.`name` IS NULL THEN 'female' ELSE 'male' END AS `gender`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the school and gender of student34?",
    "evidence": "male.name = 'student34' means student34's gender is male; if 'student34' can't be found in 'male.name', it means student34 is female; student34 is a name of student;",
    "idx": 2383
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`longest_absense_from_school`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`month` = 1 AND t2.`organ` = 'air_force')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among students with 1 month of absenses, how many of them are enlisted in the air force department?",
    "evidence": "1 month of absences refers to month = 1; department refers to organ; organ = 'air_force';",
    "idx": 2385
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`male`)\nMATCH (t1@`enrolled`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`school` = 'occ')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many male students are enrolled at OCC?",
    "evidence": "male students are mentioned in male.name; OCC refers to school = 'occ';",
    "idx": 2386
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` = 0\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students have never been absent in school?",
    "evidence": "never been absent in school refers to month = 0;",
    "idx": 2387
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (enlist@`enlist`)\nWHERE enlist.`organ` = 'marines'\nRETURN enlist.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the students who joined the Marines?",
    "evidence": "Marines refers to organ = 'marines';",
    "idx": 2388
  }
]