[
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (twitter@`twitter`)\nWHERE twitter.`isreshare` = 'TRUE' AND twitter.`likes` > 100\nRETURN COUNT(DISTINCT twitter.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many reshared tweets have over 100 likes?",
    "evidence": "over 100 likes refers to Likes > 100; reshare tweet refers to IsReshare = 'TRUE'",
    "idx": 528
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t2.`gender` = 'Male' AND t1.`weekday` = 'Monday')\nRETURN COUNT(DISTINCT t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the total number of tweets sent by male users on Mondays?",
    "evidence": "male user refers to Gender = 'Male; 'Monday' is the Weekday; total number of tweet refers to Count (TweetID)",
    "idx": 529
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nORDER BY t1.`likes` DESC NULLS LAST \nRETURN t2.`gender` AS `gender` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the gender of the user who has posted the tweet that got the most likes?",
    "evidence": "tweet got the most likes refers to Max(Likes)",
    "idx": 530
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`lang` = 'fr' AND t2.`country` = 'Australia')\nRETURN COUNT(DISTINCT t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many tweets in French were posted from Australia?",
    "evidence": "\"French\" is the language and refers to Lang = 'fr'; 'Australia' is the Country",
    "idx": 532
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nMATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t3@`user`)\nWHERE t2.`locationid` = t1.`locationid`\nAND t3.`userid` = t1.`userid`\nAND (t2.`country` = 'Australia' AND t3.`gender` = 'Male' AND t1.`sentiment` > 0)\nRETURN COUNT(t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the tweets with a positive sentiment, how many of them were posted by male users in Australia?",
    "evidence": "tweet with positive sentiment refers to Sentiment > 0; male user refers to Gender = 'Male'; 'Australia' is the Country",
    "idx": 533
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t2.`gender` = 'Male')\nRETURN sum(CASE  WHEN t1.`sentiment` > 0 THEN 1 ELSE 0 END) - sum(CASE  WHEN t1.`sentiment` = 0 THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many more tweets with a positive sentiment than the tweets with a neutral sentiment were posted by male users?",
    "evidence": "positive sentiment tweet refers to Sentiment > 0; neutral sentiment refers to Sentiment = 0; male user refers to Gender = 'Male'; difference = Subtract (Count (TweetID where Sentiment > 0), Count (TweetID where Sentiment = 0))",
    "idx": 534
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nORDER BY t1.`retweetcount` DESC NULLS LAST \nRETURN t2.`city` AS `city` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From which city was the tweet with the most number of retweets posted?",
    "evidence": "tweet with most number of retweet post refers to Max(RetweetCount)",
    "idx": 535
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t2.`city` IN ['Bangkok', 'Chiang Mai'])\nRETURN sum(CASE  WHEN t2.`city` = 'Bangkok' THEN 1 ELSE 0 END) AS `bnum`, sum(CASE  WHEN t2.`city` = 'Chiang Mai' THEN 1 ELSE 0 END) AS `cnum`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From which city were more tweets posted, Bangkok or Chiang Mai?",
    "evidence": "\"Bangkok\" and \"Chiang Mai\" are both City",
    "idx": 536
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`day` = 31 AND t2.`state` = 'Santa' AND t2.`country` = 'Argentina')\nRETURN COUNT(t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the tweets posted from Santa Fe state in Argentina, how many of them were posted on 31st?",
    "evidence": "\"Sante Fe\" is the State; \"Argentina\" is the Country; posted on 31st refers to Day = 31",
    "idx": 537
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t2@`twitter`)-[posted_by_0:`posted_by`]->(t1@`user`)\nMATCH (t2@`twitter`)-[posted_from_0:`posted_from`]->(t3@`location`)\nWHERE t1.`userid` = t2.`userid`\nAND t2.`locationid` = t3.`locationid`\nAND (t3.`country` = 'Argentina' AND t1.`gender` = 'Male')\nORDER BY t2.`likes` DESC NULLS LAST \nRETURN t2.`text` AS `text` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among all the tweets sent by male users in Argentina, what is the text of the one with the most number of likes?",
    "evidence": "male user refers to Gender = 'Male'; 'Argentina' is the Country; most number of likes refers to Max(Likes)",
    "idx": 539
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_by_0:`posted_by`]->(t2@`user`)\nWHERE t1.`userid` = t2.`userid`\nAND (t2.`gender` = 'Male' AND t1.`weekday` = 'Monday')\nRETURN sum(t1.`likes`) / COUNT(t1.`tweetid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of likes for a tweet posted by a male user on Mondays?",
    "evidence": "male user refers to Gender = 'Male'; 'Monday' is the Weekday; average number of likes = Divide (Sum(Likes), Count(TweetID))",
    "idx": 540
  },
  {
    "filename": "train.json",
    "db_id": "social_media",
    "gql_statement": "MATCH (t1@`twitter`)-[posted_from_0:`posted_from`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t2.`city` IN ['Bangkok', 'Chiang Mai'])\nRETURN sum(CASE  WHEN t2.`city` = 'Bangkok' THEN t1.`likes` ELSE NULL END) / COUNT(CASE  WHEN t2.`city` = 'Bangkok' THEN 1 ELSE 0 END) AS `bnum`, sum(CASE  WHEN t2.`city` = 'Chiang Mai' THEN t1.`likes` ELSE NULL END) / COUNT(CASE  WHEN t2.`city` = 'Chiang Mai' THEN t1.`tweetid` ELSE NULL END) AS `cnum`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Tweets posted from which city has a higher number of average likes, Bangkok or Chiang Mai?",
    "evidence": "\"Bangkok\" and \"Chiang Mai\" are both City; average number of like = Divide (Sum(Likes), Count(TweetID))",
    "idx": 541
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (course@`course`)\nWHERE course.`name` = 'Intro to BlockChain' OR course.`name` = 'Computer Network'\nORDER BY course.`diff` DESC NULLS LAST \nRETURN course.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which course is more difficult, Intro to BlockChain or Computer Network?",
    "evidence": "diff refers to difficulty; diff is higher means the course is more difficult;",
    "idx": 542
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL {\nMATCH (prof_sub0@`prof`)\nWHERE prof_sub0.`first_name` = 'Zhihua' AND prof_sub0.`last_name` = 'Zhou'\nRETURN prof_sub0.`popularity` AS `popularity` \n}\nMATCH (prof@`prof`)\nWHERE prof.`popularity` > popularity\nRETURN COUNT(prof.`prof_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many professors are more popular than Zhou Zhihua?",
    "evidence": "higher popularity means the professor is more popular;",
    "idx": 544
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (student@`student`)\nWHERE student.`l_name` = 'Pryor' AND student.`f_name` = 'Kerry'\nRETURN student.`phone_number` AS `phone_number`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the phone number of Kerry Pryor?",
    "evidence": "",
    "idx": 545
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advised_by`]->(t2@`prof`)\nWHERE t1.`prof_id` = t2.`prof_id`\nAND (t2.`first_name` = 'Sauveur' AND t2.`last_name` = 'Skyme')\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many research assistants does Sauveur Skyme have?",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA;",
    "idx": 547
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advised_by`]->(t2@`prof`)\nWHERE t1.`prof_id` = t2.`prof_id`\nAND (t2.`first_name` = 'Ogdon' AND t1.`salary` = 'med' AND t2.`last_name` = 'Zywicki')\nRETURN COUNT(t1.`prof_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many research assistants of Ogdon Zywicki have an average salary?",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; average salary refers to salary = 'med';",
    "idx": 549
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`takes`]->(t3@`course`)\nWHERE t1.`student_id` = t2.`student_id`\nAND t2.`course_id` = t3.`course_id`\nAND ((t1.`f_name` = 'Laughton' OR t1.`f_name` = 'Willie') AND (t1.`l_name` = 'Antonio' OR t1.`l_name` = 'Rechert') AND t3.`name` = 'Machine Learning Theory')\nORDER BY t2.`sat` DESC NULLS LAST \nRETURN t1.`f_name` AS `f_name`, t1.`l_name` AS `l_name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which student is more satisfied with the course Machine Learning Theory, Willie Rechert or Laughton Antonio?",
    "evidence": "sat refers to student's satisfaction degree with the course; more satisfied refers to MAX(sat);",
    "idx": 553
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`takes`]->(t3@`course`)\nWHERE t1.`student_id` = t2.`student_id`\nAND t2.`course_id` = t3.`course_id`\nAND (t3.`name` = 'Machine Learning Theory' AND t1.`type` = 'UG')\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students who took the course Machine Learning Theory, how many of them are undergraduates?",
    "evidence": "UG is an abbreviated name of undergraduate student in which type = 'UG';",
    "idx": 554
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advised_by`]->(t2@`prof`)\nMATCH ()-[t1:`advises`]->(t3@`student`)\nWHERE t1.`prof_id` = t2.`prof_id`\nAND t1.`student_id` = t3.`student_id`\nAND (t2.`first_name` = 'Ogdon' AND t2.`last_name` = 'Zywicki')\nRETURN sum(t3.`gpa`) / COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average gpa of Ogdon Zywicki's research assistants?",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; prof_id refers to professor’s ID; GPA is an abbreviated name of Grade Point Average where average = AVG(gpa);",
    "idx": 556
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`takes`]->(t2@`course`)\nWHERE t1.`course_id` = t2.`course_id`\nAND (t2.`name` = 'Machine Learning Theory')\nRETURN cast (sum(t1.`sat`) as float) / COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average satisfying degree of the course Machine Learning Theory?",
    "evidence": "sat refers to student's satisfaction degree with the course;",
    "idx": 557
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`takes`]->(t2@`course`)\nWHERE t1.`course_id` = t2.`course_id`\nAND (t2.`diff` = 5)\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students took the hardest course?",
    "evidence": "diff refers to difficulty; diff is higher means the course is more difficult in which hardest difficulty is expressed as diff = 5;",
    "idx": 560
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`prof`)-[t2:`advises`]->(t3@`student`)\nWHERE t1.`prof_id` = t2.`prof_id`\nAND t2.`student_id` = t3.`student_id`\nAND (t3.`f_name` = 'Harrietta' AND t3.`l_name` = 'Lydford')\nRETURN t1.`popularity` AS `popularity`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the professor who is working with Harrietta Lydford, how is his popularity?",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; higher popularity means more popular; prof_id refers to professor’s ID;",
    "idx": 562
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`taken_by`]->(t2@`student`)\nWHERE t1.`student_id` = t2.`student_id`\nAND (t2.`f_name` = 'Alvera' AND t2.`l_name` = 'McQuillin')\nRETURN COUNT(t1.`course_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many courses does Alvera McQuillin take?",
    "evidence": "",
    "idx": 563
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advised_by`]->(t2@`prof`)\nMATCH ()-[t1:`advises`]->(t3@`student`)\nWHERE t1.`prof_id` = t2.`prof_id`\nAND t1.`student_id` = t3.`student_id`\nAND (t2.`first_name` = 'Ogdon' AND t2.`last_name` = 'Zywicki')\nRETURN cast (sum(CASE  WHEN t3.`type` = 'TPG' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of Professor Ogdon Zywicki's research assistants are taught postgraduate students?",
    "evidence": "research assistant refers to the student who serves for research where the abbreviation is RA; taught postgraduate student refers to type = 'TPG'; DIVIDE(COUNT(student_id where type = 'TPG' and first_name = 'Ogdon', last_name = 'Zywicki'), COUNT(first_name = 'Ogdon', last_name = 'Zywicki')) as percentage;",
    "idx": 568
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (course@`course`)\nWHERE course.`diff` = 5\nRETURN COUNT(course.`course_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many courses have the highest difficulty?",
    "evidence": "diff refers to difficulty; diff is higher means the course is more difficult in which highest difficulty is expessed as diff = 5;",
    "idx": 570
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (prof@`prof`)\nWHERE prof.`graduate_from` IN ['Brown University', 'Columbia University', 'Cornell University', 'Dartmouth College', 'Harvard University', 'Princeton University', 'University of Pennsylvania', 'Yale University']\nRETURN prof.`first_name` AS `first_name`, prof.`last_name` AS `last_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the full name of the professor who graduated from an Ivy League School?",
    "evidence": "Ivy League school is assembled by 8 universities: Brown University, Columbia University, Cornell University, Dartmouth College, Harvard University, Princeton University, University of Pennsylvania and Yale University;",
    "idx": 571
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL {\nMATCH (student_sub0@`student`)\nRETURN MAX(student_sub0.`intelligence`) AS `_col_0_1` \n}\nMATCH (student@`student`)\nWHERE student.`type` = 'UG' AND student.`intelligence` = _col_0_1\nRETURN COUNT(student.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students have the highest intelligence among those taking a bachelor's degree?",
    "evidence": "bachelor's degree is an undergraduate degree in which type = 'UG'; the highest intelligence refers to MAX(intelligence);",
    "idx": 572
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL {\nMATCH (prof_sub0@`prof`)\nRETURN MAX(prof_sub0.`popularity`) AS `_col_0_1` \n}\nMATCH (prof@`prof`)\nWHERE prof.`gender` = 'Female' AND prof.`popularity` = _col_0_1\nRETURN COUNT(prof.`prof_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the most popular professors, how many are females?",
    "evidence": "the most popular professors refers to prof_id where MAX(popularity); female refers to gender;",
    "idx": 573
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (student@`student`)\nWHERE student.`type` = 'RPG'\nRETURN COUNT(student.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many research postgraduate students are there?",
    "evidence": "research postgraduate student refers to type = 'RPG';",
    "idx": 574
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`course`)-[t2:`taken_by`]->()\nWHERE t1.`course_id` = t2.`course_id`\nAND (t2.`grade` = 'A' AND t1.`name` = 'Applied Deep Learning ')\nRETURN COUNT(t2.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students got an A in Applied Deep Learning?",
    "evidence": "A refers to an excellent grade in which grade = 'A' for the course;",
    "idx": 575
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advises`]->(t2@`student`)\nWHERE t1.`student_id` = t2.`student_id`\nAND (t1.`salary` = 'free')\nRETURN t2.`gpa` AS `gpa`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the GPAs of the unpaid Research Assistants?",
    "evidence": "Unpaid Research Assistants undertake their work without payment in which salary = 'free';",
    "idx": 576
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advised_by`]->(t2@`prof`)\nWHERE t1.`prof_id` = t2.`prof_id`\nAND (t2.`first_name` = 'Ogdon' AND t2.`last_name` = 'Zywicki')\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students does Ogdon Zywicki advise?",
    "evidence": "Ogdon Zywicki is a professor;",
    "idx": 577
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`takes`]->(t2@`course`)\nWHERE t1.`course_id` = t2.`course_id`\nAND (t1.`sat` = 5)\nRETURN DISTINCT t2.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the course with the highest satisfaction from students?",
    "evidence": "sat refers to student's satisfaction degree with the course where sat = 5 stands for the highest satisfaction;",
    "idx": 578
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`takes`]->(t3@`course`)\nWHERE t1.`student_id` = t2.`student_id`\nAND t2.`course_id` = t3.`course_id`\nAND (t2.`sat` = 1 AND t1.`intelligence` = 1)\nRETURN t3.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the courses that the students with the lowest intelligence are least satisfied with?",
    "evidence": "lower intelligence refers to intelligence = 1; sat refers to student's satisfaction degree with the course where least satisfaction refers to sat = 1;",
    "idx": 579
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`takes`]->(t2@`course`)\nWHERE t1.`course_id` = t2.`course_id`\nAND (t2.`diff` = 4)\nRETURN cast (COUNT(t1.`student_id`) as float) / COUNT(DISTINCT t2.`course_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of students who registered for the courses with a difficulty of 4?",
    "evidence": "diff refers to difficulty; DIVIDE(COUNT(student_id where diff = 4), COUNT(course_id where diff = 4));",
    "idx": 580
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`takes`]->()\nWHERE t1.`student_id` = t2.`student_id`\nAND (t2.`grade` IS NULL AND t1.`gpa` >= 3 AND t1.`gpa` <= 4)\nRETURN COUNT(t2.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students, who have a GPA between 3 to 4, failed a course?",
    "evidence": "GPA is an abbreviated name of Grade Point Average where GPA between 3 to 4 refers to gpa BETWEEN 3 AND 4; If grade is null or empty, it means that this student fails to pass this course;",
    "idx": 581
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`takes`]->()\nWHERE t1.`student_id` = t2.`student_id`\nAND (t2.`grade` = 'A' AND t1.`type` = 'UG')\nRETURN COUNT(t2.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students taking a bachelor's degree received an A in all of the courses that they took?",
    "evidence": "bachelor's degree is an undergraduate degree in which type = 'UG'; A refers to an excellent grade in which grade = 'A';",
    "idx": 582
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (prof@`prof`)\nRETURN cast (sum(CASE  WHEN prof.`gender` = 'Male' THEN 1 ELSE 0 END) as float) / sum(CASE  WHEN prof.`gender` = 'Female' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the male and female ratio among the professors?",
    "evidence": "DIVIDE(COUNT(prof_id where gender = 'Male'), COUNT(prof_id where gender = 'Female'));",
    "idx": 586
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (prof@`prof`)\nWHERE prof.`gender` = 'Female'\nRETURN COUNT(prof.`prof_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the professors are female?",
    "evidence": "female refers to gender = 'Female';",
    "idx": 598
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL {\nMATCH (course_sub0@`course`)\nRETURN MAX(course_sub0.`diff`) AS `_col_0` \n}\nMATCH (course@`course`)\nWHERE course.`diff` = _col_0\nRETURN course.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the most difficult course?",
    "evidence": "difficulty of a course refers to diff; most difficult course refers to MAX(diff);",
    "idx": 599
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (student@`student`)\nWHERE student.`gpa` >= 3.1 AND student.`gpa` <= 3.7 AND student.`type` = 'UG'\nRETURN COUNT(student.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students with a gpa of 3.1 to 3.7, how many of them are undergraduate students?",
    "evidence": "gpa of 3.1 to 3.7 refers to gpa BETWEEN 3.1 AND 3.7; undergraduate students refers to type = 'UG';",
    "idx": 600
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advises`]->(t2@`student`)\nWHERE t1.`student_id` = t2.`student_id`\nAND (t1.`salary` = 'high' AND t2.`gpa` > 3)\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students with high salary, what is total number of students with a GPA higher than 3?",
    "evidence": "high salary refers to salary = 'high'; GPA higher than 3 refers to gpa > 3;",
    "idx": 604
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`taken_by`]->(t2@`student`)\nWHERE t1.`student_id` = t2.`student_id`\nAND (t1.`grade` = 'B' AND t2.`intelligence` = 3)\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In students with a grade of B, how many of them have an intellegence level of 3?",
    "evidence": "",
    "idx": 607
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`takes`]->(t3@`course`)\nWHERE t1.`student_id` = t2.`student_id`\nAND t2.`course_id` = t3.`course_id`\nAND (t2.`grade` = 'A' AND t1.`intelligence` = 5)\nRETURN t3.`diff` AS `diff`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the difficulty of the course in which a student with level of intellengence of 5 got an A grade?",
    "evidence": "difficulty of the course refers to diff;",
    "idx": 608
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advised_by`]->(t2@`prof`)\nWHERE t1.`prof_id` = t2.`prof_id`\nAND (t1.`capability` = 5)\nORDER BY t2.`popularity` DESC NULLS LAST \nRETURN COUNT(t1.`student_id`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among professors with the highest popularity, how many of their students have research capability of 5?",
    "evidence": "highest popularity refers to MAX(popularity); research capability refers to capability; capability = 5;",
    "idx": 609
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`advised_by`]->()\nWHERE t1.`student_id` = t2.`student_id`\nAND (t1.`f_name` = 'Alvera' AND t1.`l_name` = 'McQuillin')\nRETURN t2.`capability` AS `capability`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the capability on research of the student named Alvera McQuillin?",
    "evidence": "capability on research refers to capability;",
    "idx": 611
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH (t1@`student`)-[t2:`takes`]->(t3@`course`)\nWHERE t1.`student_id` = t2.`student_id`\nAND t2.`course_id` = t3.`course_id`\nAND (t3.`credit` = 3 AND t1.`gpa` = 3.2)\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of courses with 3 credit, how many students have GPA of 3.2?",
    "evidence": "",
    "idx": 612
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advises`]->(t2@`student`)\nWHERE t1.`student_id` = t2.`student_id`\nAND (t2.`gpa` = 3.5 AND t1.`salary` = 'low')\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among students with low salary, how many of them have a gpa of 3.5?",
    "evidence": "low salary refers to salary = 'low';",
    "idx": 613
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advised_by`]->(t2@`prof`)\nWHERE t1.`prof_id` = t2.`prof_id`\nAND (t2.`teachingability` < 3)\nRETURN cast (sum(CASE  WHEN t1.`salary` = 'low' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`salary`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the professors with a teachability of 3 and below, what is the percentage of their student advisees with a low salary?",
    "evidence": "teachability < = 3; percentage = MULTIPLY(DIVIDE(COUNT(salary = 'low'), COUNT(salary)), 1.0);",
    "idx": 614
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL {\nMATCH (prof_sub0@`prof`)\nRETURN MAX(prof_sub0.`popularity`) AS `_col_0_1` \n}\nMATCH (prof@`prof`)\nWHERE prof.`popularity` = _col_0_1\nRETURN cast (sum(prof.`teachingability`) as float) / COUNT(prof.`prof_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average teaching ability of the most popular professors?",
    "evidence": "average = AVG(teachingability); most popular professor refers to MAX(popularity);",
    "idx": 615
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advises`]->(t2@`student`)\nWHERE t1.`student_id` = t2.`student_id`\nAND (t2.`gpa` < 2.5)\nRETURN cast (sum(t1.`capability`) as float) / COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average capability of students with less than a 2.5 GPA?",
    "evidence": "average capability = AVG(capability); gpa < 2.5;",
    "idx": 620
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t2:`takes`]->(t3@`course`)\nMATCH ()-[t1:`advises`]->()\nWHERE t2.`student_id` = t1.`student_id`\nAND t2.`course_id` = t3.`course_id`\nAND (t1.`salary` = 'high' AND t3.`name` = 'Computer Vision')\nRETURN COUNT(t1.`student_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the students with high salaries, how many took the computer vision course?",
    "evidence": "high salaries refers to salary = 'High';",
    "idx": 623
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "CALL {\nMATCH (student_sub0@`student`)\nRETURN MAX(student_sub0.`gpa`) AS `_col_0` \n}\nMATCH (student@`student`)\nWHERE student.`gpa` = _col_0\nRETURN student.`f_name` AS `f_name`, student.`l_name` AS `l_name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the first and last name of students with highest gpa?",
    "evidence": "first name refers of students refers to f_name; last name of students refers to l_name; highest gpa refers to MAX(gpa);",
    "idx": 624
  },
  {
    "filename": "train.json",
    "db_id": "cs_semester",
    "gql_statement": "MATCH ()-[t1:`advised_by`]->(t2@`prof`)\nWHERE t1.`prof_id` = t2.`prof_id`\nAND (t1.`salary` = 'high')\nORDER BY t2.`teachingability` DESC NULLS LAST \nRETURN COUNT(t1.`student_id`) AS `_col_0` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among professors with the highest teachability, how many of their students have high salary?",
    "evidence": "highest teachability refers to MAX(teachability); high salary refers to salary = 'high';",
    "idx": 625
  }
]