[
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "MATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND (t1.`phenotype` = 'Nucleic acid metabolism defects' AND t1.`motif` = 'PS00107')\nRETURN cast (sum(CASE WHEN t2.`expression_corr` > 0 THEN 1 ELSE 0 END) as float) * 100 / COUNT(t2.`geneid1`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Of the genes whose phenotype and motif are nucleic acid metabolism defects, PS00107, what percentage perform positive interaction with another gene?",
    "evidence": "Percentage of no interaction = [count(nucleic acid metabolism, PS00107, no interaction) / count(nucleic acid metabolism, PS00107) * 100%",
    "idx": 1189
  },
  {
    "filename": "train.json",
    "db_id": "genes",
    "gql_statement": "CALL {\nMATCH (t1_sub0@`genes`)-[t2_sub0:`interacts_with_1`]->()\nWHERE t1_sub0.`geneid` = t2_sub0.`geneid1`\nAND (t2_sub0.`expression_corr` < 0)\nRETURN COUNT(t1_sub0.`geneid`) AS `_col_0_1` \n}\nMATCH (t1@`genes`)-[t2:`interacts_with_1`]->()\nWHERE t1.`geneid` = t2.`geneid1`\nAND (t2.`expression_corr` < 0 AND t1.`essential` = 'Non-Essential')\nRETURN cast (COUNT(t1.`geneid`) as float) * 100 / _col_0_1 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which negatively correlated, genetically interacting genes are non-essential? What percentage do they represent with respect to those that are essential?",
    "evidence": "If the Expression_Corr value is negative then it's negatively correlated; Percentage of Essensity = [count(negatively correlated, genetical interaction, non-essential) / count(negatively correlated, genetical interaction, non-essential+negatively correlated, genetical interaction, essential)] * 100%",
    "idx": 1190
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t2.`sentiment_polarity` = '-1.0')\nRETURN DISTINCT t1.`app` AS `app`, t1.`category` AS `category`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name and category of the app with the highest amount of -1 sentiment polarity score?",
    "evidence": "highest amount of -1 sentiment polarity score refers to MAX(Count(Sentiment_Polarity = 1.0))",
    "idx": 1192
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (playstore@`playstore`)\nWHERE playstore.`rating` = 5\nRETURN COUNT(playstore.`app`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many apps have rating of 5?",
    "evidence": "FALSE;",
    "idx": 1193
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t1.`app` = '10 Best Foods for You' AND t2.`sentiment` = 'Neutral')\nRETURN COUNT(t2.`app`) AS `_col_0`, t1.`category` AS `category`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the users hold neutral attitude on \"10 Best Foods for You\" app and what category is this app?",
    "evidence": "neutral attitude refers to Sentiment = 'Neutral';",
    "idx": 1195
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t2.`sentiment_polarity` > '0')\nRETURN DISTINCT t1.`app` AS `app`, t1.`installs` AS `installs`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the apps that users pretty like this app and how many installs amount of these apps?",
    "evidence": "users pretty much likes the app refers to Sentiment_Polarity = 'Positive';",
    "idx": 1196
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t1.`category` = 'COMICS')\nRETURN avg(t1.`rating`) AS `_col_0`, COUNT(CASE  WHEN t2.`sentiment` = 'Positive' THEN 1 ELSE NULL END) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average rating of comic category apps? How many users hold positive attitude towards this app?",
    "evidence": "average rating = AVG(Rating where Category = 'COMICS'); number of users who hold a positive attitude towards the app refers to SUM(Sentiment = 'Positive');",
    "idx": 1198
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (playstore@`playstore`)\nWHERE playstore.`installs` = '5,000+'\nRETURN DISTINCT playstore.`app` AS `app`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the apps with only 5,000+ installs?",
    "evidence": "Installs = '5,000+';",
    "idx": 1202
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t1.`installs` = '100,000,000+' AND t2.`sentiment` = 'Negative')\nRETURN COUNT(t2.`sentiment`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many negative comments are there in all the apps with 100,000,000+ installs?",
    "evidence": "negative comment refers to Sentiment = 'Negative'; Installs = '100,000,000+';",
    "idx": 1204
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t1.`genres` = 'Weather' AND t2.`sentiment` = 'Neutral')\nRETURN COUNT(t2.`sentiment`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the number of neutral comments from all the weather apps?",
    "evidence": "neutral comments refers to Sentiment = 'Neutral'; weather app refers to Genre = 'Weather';",
    "idx": 1208
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t2.`translated_review` = 'nan')\nRETURN cast (COUNT(CASE  WHEN t1.`content rating` = 'Teen' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t1.`app`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of no comment reviews are from \"Teen\" content rating apps?",
    "evidence": "no comment refers to Translated_Review = 'nan'; percentage = DIVIDE((SUM(Content Rating = 'Teen')), COUNT(*));",
    "idx": 1209
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (playstore@`playstore`)\nWHERE playstore.`reviews` > 75000000 AND playstore.`content rating` = 'Teen'\nRETURN DISTINCT playstore.`app` AS `app`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which apps have been reviewed more than 75 000 000 times and the content is suitable for teenagers?",
    "evidence": "Reviews>75000000; suitable for teenagers refers to Content Rating = 'Teen';",
    "idx": 1211
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (playstore@`playstore`)\nWHERE playstore.`rating` = 5\nRETURN avg(playstore.`reviews`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average review number for application with 5 rating?",
    "evidence": "average review = AVG(Review); application refers to app; Rating = 5;",
    "idx": 1212
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (playstore@`playstore`)\nWHERE playstore.`type` = 'Free' AND playstore.`rating` >= 4.5\nRETURN cast (sum(CASE  WHEN CASE WHEN -4-1 < 0 THEN substring('Last Updated',length('Last Updated')+1+(-4-1),-1-(-4-1)) ELSE substring('Last Updated',-4-1, length('Last Updated')-(-4-1)) END > '2018' THEN 1 ELSE 0 END) as float) * 100 / COUNT(playstore.`app`) AS `per`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage for free application with a rating 4.5 and above have not been updated since 2018?",
    "evidence": "paid refers to Type = 'Paid'; application refers to App; Rating>4.5; Last Updated>'2018; percentage = DIVIDE(SUM(Genres = 'Mature 17+' and Rating>4.5 and substr(\"Last Updated\",-4,4)>'2018' )), (COUNT(App)) as percent;",
    "idx": 1214
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (playstore@`playstore`)\nWHERE playstore.`app` = 'Honkai Impact 3rd'\nRETURN DISTINCT playstore.`genres` AS `genres`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What genre does Honkai Impact 3rd belong to?",
    "evidence": "Honkai Impact 3rd is the App;",
    "idx": 1215
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (playstore@`playstore`)\nWHERE 'Content Rating' = 'Everyone 10+' AND playstore.`genres` = 'Arcade'\nRETURN avg(cast (playstore.`price` as float)) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average price of games belonging in the arcade genre which has a content rating of Everyone 10+?",
    "evidence": "average price = AVG(Price);",
    "idx": 1217
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t1.`app` = 'Browser 4G' AND t2.`sentiment_polarity` >= '0.5')\nRETURN t1.`size` AS `size`, COUNT(t1.`app`) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the size of Browser 4G and how many users have a pretty positive favorability on it?",
    "evidence": "Browser 4G is the App; pretty positive favorability refers to Sentiment_Polarity score = 0.5",
    "idx": 1218
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t1.`app` = 'Golf GPS Rangefinder: Golf Pad')\nRETURN avg(cast (t2.`sentiment_polarity` as float)) AS `_col_0`, t1.`rating` AS `rating`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the average sentiment polarity score of Golf GPS Rangefinder: Golf Pad and what is it's rating in the Google Play Store?",
    "evidence": "average sentiment polarity score = AVG(Sentiment_Polarity); Golf GPS Rangefinder: Golf Pad  is the App;",
    "idx": 1220
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t1.`content rating` = 'Teen' AND t1.`genres` = 'Role Playing')\nRETURN COUNT(t1.`app`) AS `_col_0`, avg(cast (t2.`sentiment_polarity` as float)) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the role playing game genre, how many are targeted to teens and what is their average sentiment polarity score?",
    "evidence": "targeted to teen refers to Content Rating = 'Teen'; average = AVG(Sentiment_Polarity);",
    "idx": 1223
  },
  {
    "filename": "train.json",
    "db_id": "app_store",
    "gql_statement": "MATCH (t2@`user_reviews`)-[written_for_0:`written_for`]->(t1@`playstore`)\nWHERE t1.`app` = t2.`app`\nAND (t1.`genres` = 'Racing')\nRETURN avg(t1.`rating`) AS `_col_0`, cast (COUNT(CASE  WHEN t2.`sentiment` = 'Positive' THEN 1 ELSE NULL END) as float) * 100 / COUNT(t2.`sentiment`) AS `_col_1`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average rating of Apps falling under the racing genre and what is the percentage ratio of positive sentiment reviews?",
    "evidence": "average rating = AVG(Rating); percentage = MULTIPLY(DIVIDE((SUM(Sentiment = 'Positive')), (COUNT(*)), 100));",
    "idx": 1224
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (store_locations@`store locations`)\nWHERE store_locations.`type` = 'City'\nRETURN avg(store_locations.`median income`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average median income for all City type of stores?",
    "evidence": "AVG(Median Income) where Type = 'City';",
    "idx": 1225
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`sales orders`)-[placed_by_0:`placed_by`]->(t1@`customers`)\nMATCH (t2@`sales orders`)-[contains_0:`contains`]->(t3@`products`)\nWHERE t2.`_customerid` = t1.`customerid`\nAND t3.`productid` = t2.`_productid`\nORDER BY t2.`unit cost` DESC NULLS LAST \nRETURN t2.`ordernumber` AS `ordernumber`, t1.`customer names` AS `customer names`, t2.`orderdate` AS `orderdate` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Name the most expensive ordered? Who, when was it ordered?",
    "evidence": "the most expensive refers to MAX(Unit Cost); who refers to Customer Names; when refers to OrderDate;",
    "idx": 1229
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (sales_orders@`sales orders`)\nRETURN sum(CASE WHEN sales_orders.`orderdate` = '5/31/18' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders have order date in 5/31/2018?",
    "evidence": "orders refer to OrderNumber;",
    "idx": 1241
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (sales_orders@`sales orders`)\nRETURN sum(CASE WHEN sales_orders.`order quantity` > 5 THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders placed were with more than 5 product quantities?",
    "evidence": "orders refer to OrderNumber; more than 5 product quantities refer to Order Quantity > 5;",
    "idx": 1242
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[contains_0:`contains`]->(t2@`products`)\nWHERE t2.`productid` = t1.`_productid`\nRETURN sum(CASE  WHEN like(t1.`orderdate`,'%/%/18') AND t2.`product name` = 'Furniture Cushions' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many furniture cushions orders which have date of order in 2018?",
    "evidence": "furniture cushions orders refer to OrderNumber where Product Name = 'Furniture Cushions'; date of order in 2018 refers to SUBSTR(OrderDate, -2) = '18'",
    "idx": 1243
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`sales orders`)-[placed_by_0:`placed_by`]->(t1@`customers`)\nWHERE t2.`_customerid` = t1.`customerid`\nRETURN sum(CASE  WHEN t1.`customer names` = 'Medsep Group' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders that Medsep Group had made?",
    "evidence": "Medsep Group is the name of the customer; orders refer to OrderNumber;",
    "idx": 1244
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[placed_by_0:`placed_by`]->(t2@`customers`)\nWHERE t2.`customerid` = t1.`_customerid`\nRETURN sum(CASE  WHEN t1.`order quantity` > 4 AND t2.`customer names` = 'Ei ' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the orders placed by Ei, how many orders have quantity greater than 4?",
    "evidence": "Ei is the name of the customer; orders have quantity greater than 4 refer to OrderNumber WHERE Order Quantity > 4;",
    "idx": 1245
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[placed_by_0:`placed_by`]->(t2@`customers`)\nWHERE t2.`customerid` = t1.`_customerid`\nRETURN sum(CASE  WHEN t1.`discount applied` = 0.05 AND t2.`customer names` = 'Pacific Ltd' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the orders placed by Pacific Ltd, how many orders have been applied 5% discount ?",
    "evidence": "orders by Pacific Ltd refer to OrderNumber where Customer Names = 'Pacific Ltd'; applied 5% discount refers to Discount Applied = 0.05;",
    "idx": 1246
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (store_locations@`store locations`)\nORDER BY store_locations.`population` DESC NULLS LAST \nRETURN store_locations.`city name` AS `city name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city has the largest population?",
    "evidence": "city has the largest population refers to City Name where MAX(Population);",
    "idx": 1248
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (store_locations@`store locations`)\nRETURN sum(CASE  WHEN store_locations.`state` = 'California' AND store_locations.`type` = 'CDP' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many CDP stores are there in California?",
    "evidence": "California is a state; CDP stores refer to StoreID where Type = 'CDP';",
    "idx": 1249
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t2@`store locations`)\nWHERE t2.`storeid` = t1.`_storeid`\nAND (like(t1.`orderdate`,'%/%/18'))\nRETURN cast (sum(CASE  WHEN t2.`county` = 'Orange County' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`ordernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of total orders from stores in Orange County in 2018?",
    "evidence": "DIVIDE(COUNT(OrderNumber where County = 'Orange County' and SUBSTR(OrderDate, -2) = '18'), COUNT(OrderNumber where SUBSTR(OrderDate, -2) = '18')) as percentage;",
    "idx": 1250
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t2@`store locations`)\nWHERE t2.`storeid` = t1.`_storeid`\nRETURN sum(CASE  WHEN t2.`county` = 'Maricopa County' AND like(t1.`orderdate`,'%/%/20') THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In 2020, what were the total orders of all stores in Maricopa County?",
    "evidence": "total orders refer to COUNT(OrderNumber); 2020 refers to SUBSTR(OrderDate, -2) = '20';",
    "idx": 1251
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t2@`store locations`)\nWHERE t2.`storeid` = t1.`_storeid`\nAND (t1.`ordernumber` = 'SO - 000115')\nRETURN t2.`latitude` AS `latitude`, t2.`longitude` AS `longitude`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the detailed position of the store which has order SO - 000115?",
    "evidence": "Latitude and Longitude coordinates can be used to identify the detailed position of stores; store refers to StoreID WHERE OrderNumber = 'SO - 000115';",
    "idx": 1252
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[placed_by_0:`placed_by`]->(t2@`customers`)\nWHERE t2.`customerid` = t1.`_customerid`\nRETURN sum(CASE  WHEN CASE WHEN -2-1 < 0 THEN substring(t1.`orderdate`,length(t1.`orderdate`)+1+(-2-1),-1-(-2-1)) ELSE substring(t1.`orderdate`,-2-1, length(t1.`orderdate`)-(-2-1)) END IN ['18', '19', '20'] AND t2.`customer names` = 'Medsep Group' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What were the total orders of Medsep Group from 2018 to 2020?",
    "evidence": "Medsep Group is the name of the customer; total orders refer to COUNT(OrderNumber); from 2018 to 2020 refers to SUBSTR(OrderDate, -2) IN ('18', '19', '20');",
    "idx": 1253
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (sales_team@`sales team`)\nRETURN sum(CASE  WHEN sales_team.`region` = 'Northeast' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales team were from Northeast?",
    "evidence": "Northeast is the name of the region;",
    "idx": 1254
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[handled_by_0:`handled_by`]->(t2@`sales team`)\nWHERE t2.`salesteamid` = t1.`_salesteamid`\nRETURN sum(CASE  WHEN t2.`sales team` = 'Adam Hernandez' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many products sold by Adam Hernandez?",
    "evidence": "products sold by Adam Hernandez refer to SUM(Order Quantity where Sales Team = 'Adam Hernandez');",
    "idx": 1256
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`sales orders`)-[placed_by_0:`placed_by`]->(t1@`customers`)\nWHERE t2.`_customerid` = t1.`customerid`\nRETURN sum(CASE  WHEN t1.`customer names` = 'Rochester Ltd' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders made by Rochester Ltd?",
    "evidence": "Rochester Ltd is the name of the customer; orders refer to OrderNumber;",
    "idx": 1257
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t2@`store locations`)\nWHERE t2.`storeid` = t1.`_storeid`\nRETURN sum(CASE  WHEN like(t1.`orderdate`,'5/%/18') AND t1.`sales channel` = 'Online' AND t2.`city name` = 'Norman' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many online sales were made in May 2018 where products were shipped from Norman?",
    "evidence": "online sales refer to OrderNumber where Sales Channel = 'Online'; May 2018 refers to OrderDate LIKE '5/%/18'; Norman is the name of the city;",
    "idx": 1260
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`sales orders`)-[contains_0:`contains`]->(t1@`products`)\nMATCH (t2@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t3@`store locations`)\nWHERE t2.`_productid` = t1.`productid`\nAND t3.`storeid` = t2.`_storeid`\nAND (t3.`county` = 'Maricopa County')\nORDER BY t2.`order quantity`  NULLS FIRST \nRETURN t1.`product name` AS `product name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the products sold in Maricopa County, which was the least sold?",
    "evidence": "the least sold product refers to Product Name where MIN(Order Quantity);",
    "idx": 1261
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`sales orders`)-[contains_0:`contains`]->(t1@`products`)\nMATCH (t2@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t3@`store locations`)\nWHERE t2.`_productid` = t1.`productid`\nAND t3.`storeid` = t2.`_storeid`\nAND (like(t2.`orderdate`,'%/%/18'))\nRETURN cast (sum(CASE  WHEN t3.`city name` = 'Burbank' THEN t2.`order quantity` ELSE 0 END) as float) * 100 / sum(t2.`order quantity`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Find the percentage of products that were shipped from Burbank in 2018?",
    "evidence": "DIVIDE(SUM(Order Quantity where City Name = 'Burbank' and SUBSTR(OrderDate, -2) = '18')), (SUM(Order Quantity where SUBSTR(OrderDate, -2) = '18')) as percentage;",
    "idx": 1264
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (sales_orders@`sales orders`)\nRETURN sum(CASE  WHEN sales_orders.`order quantity` = 1 AND sales_orders.`sales channel` = 'Distributor' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many orders through distributor were for the minimum quantity?",
    "evidence": "\"Distributor\" is the Sales Channel; minimum quantity refers to Min(Order Quantity)",
    "idx": 1271
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (store_locations@`store locations`)\nRETURN sum(CASE  WHEN store_locations.`population` < 3000000 AND store_locations.`type` = 'Borough' AND store_locations.`city name` = 'Brooklyn' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Borough-type stores located in the city of Brooklyn have a population of less than 3 million?",
    "evidence": "\"Brooklyn\" is the CityName; population of less than 3 million refers to Population < 3000000",
    "idx": 1272
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`sales orders`)-[placed_by_0:`placed_by`]->(t1@`customers`)\nMATCH (t2@`sales orders`)-[handled_by_0:`handled_by`]->(t3@`sales team`)\nWHERE t2.`_customerid` = t1.`customerid`\nAND t3.`salesteamid` = t2.`_salesteamid`\nAND (t1.`customer names` = 'Apotheca, Ltd')\nRETURN DISTINCT t3.`sales team` AS `sales team`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the sales teams that have served to customer Apotheca, Ltd?",
    "evidence": "name of sales team refers to Sales Team; 'Apotheca, Ltd' is the Customer Names",
    "idx": 1273
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t2@`store locations`)\nWHERE t2.`storeid` = t1.`_storeid`\nRETURN sum(CASE  WHEN t1.`procureddate` = '10/27/18' AND t2.`city name` = 'Orlando' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stores procured products on October 27, 2018, in the city of Oregon?",
    "evidence": "October 27, 2018 refers to ProcuredDate = '10/27/18'; 'Oregon' is the State",
    "idx": 1275
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`store locations`)-[located_in_0:`located_in`]->(t1@`regions`)\nWHERE t2.`statecode` = t1.`statecode`\nAND (t1.`region` = 'Northeast')\nRETURN COUNT(DISTINCT t2.`time zone`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many different time zones are there in the Northeast region?",
    "evidence": "",
    "idx": 1277
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`store locations`)-[located_in_0:`located_in`]->(t1@`regions`)\nWHERE t2.`statecode` = t1.`statecode`\nRETURN DISTINCT CASE  WHEN MAX(t2.`population`)<> 0 THEN t2.`type`  END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What type of store is most popular in the South?",
    "evidence": "in the South refers to Region = 'South'; type of store that is most popular refers to Max(Count(Type))",
    "idx": 1278
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[placed_by_0:`placed_by`]->(t2@`customers`)\nWHERE t2.`customerid` = t1.`_customerid`\nRETURN sum(CASE  WHEN t1.`sales channel` = 'Online' AND t2.`customer names` = 'Ole Group' AND like(t1.`orderdate`,'5/%/19') THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many online purchases did Ole Group make in May 2019?",
    "evidence": "\"Ole Group\" is the Customer Names; online purchase refers to Sales Channel = 'Online'; made in May 2019 refers to OrderDate LIKE '5/%/19'",
    "idx": 1279
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t2@`store locations`)\nWHERE t2.`storeid` = t1.`_storeid`\nRETURN sum(CASE  WHEN t1.`order quantity` = 1 AND t1.`sales channel` = 'Distributor' AND t2.`county` = 'Washtenaw County' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many stores with less need for products, and purchased through a distributor, are located in Washtenaw County?",
    "evidence": "less need for products refers to Order Quantity = 1; purchased through a distributor refers to Sales Channel = 'Distributor'; 'Harri County' is the County",
    "idx": 1280
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t2@`store locations`)\nWHERE t2.`storeid` = t1.`_storeid`\nAND (t1.`orderdate` = '4/4/20')\nRETURN cast (sum(CASE  WHEN t2.`state` = 'New York' THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`ordernumber`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What percentage of sell orders on 04/04/2020 were for the state of New York?",
    "evidence": "sales order on 04/04/2020 refers to OrderDate = '4/4/20'; 'New York' is  the City Name; percentage = Divide (Sum(OrderNumber where City Name = 'New York'), Count (OrderNumber)) * 100",
    "idx": 1281
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t1@`sales orders`)-[fulfilled_at_0:`fulfilled_at`]->(t2@`store locations`)\nWHERE t2.`storeid` = t1.`_storeid`\nAND (t1.`unit price` = '998.30')\nRETURN avg(t2.`land area`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average land area of ​​the cities in which stores that purchased products for a unit price of 998.30 are located?",
    "evidence": "average land area = Divide (Sum(Land Area), Count(Land Area))",
    "idx": 1282
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (t2@`store locations`)-[located_in_0:`located_in`]->(t1@`regions`)\nWHERE t2.`statecode` = t1.`statecode`\nAND (t2.`state` = 'New Hampshire' AND t2.`type` = 'City')\nRETURN avg(t2.`household income`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average household income in cities in the state of New Hampshire where there are stores of the type city?",
    "evidence": "\"New Hampshire\" is the State; average household income = AVG(Household Income)",
    "idx": 1283
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (sales_team@`sales team`)\nRETURN sum(CASE  WHEN sales_team.`region` = 'Midwest' THEN 1 ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many sales teams are there in the Midwest?",
    "evidence": "\"Midwest\" is the Region",
    "idx": 1284
  }
]