[
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`t3`:`course`)-[t2:taught_by]->(`t1`:`person`)\nWHERE `t1`.`p_id` = `t2`.`p_id`\nAND `t3`.`course_id` = `t2`.`course_id`\nAND (`t1`.`hasposition` = 'Faculty_eme' AND `t1`.`professor` = 1 AND `t3`.`courselevel` = 'Level_400')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Between the faculty employee professors, how many teaches high-level or harder undergraduate courses? Indicate each of the professors unique identifying number.",
    "evidence": "faculty employee professors refers to hasPosition = 'Faculty_eme' and professor = 1; high-level or harder undergraduate courses refers to courseLevel = 'Level_400'; professors unique identifying number refers to person.p_id",
    "idx": 748
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "CALL (*) {\nMATCH ()-[taughtby_sub0:taught_by]->()\nWITH `taughtby_sub0`.`course_id` AS _groupby_col_0, COUNT(`taughtby_sub0`.`course_id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 4\nRETURN _groupby_col_1 AS `_col_0`  \n}\nWITH *\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many courses were taught by more than 4 people?",
    "evidence": "courses refers to taughtBy.course_id; more than 4 people refers to count(taughtBy.p_id) > 4",
    "idx": 752
  },
  {
    "filename": "train.json",
    "db_id": "computer_student",
    "gql_statement": "MATCH (`course`:`course`)\nWHERE `course`.`courselevel` = 'Level_500'\nRETURN COUNT(`course`.`course_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total of professional courses available at the university? List out all the course id.",
    "evidence": "professional courses refers to courseLevel = 'Level_500'; course id refers to course.course_id",
    "idx": 753
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_keyword_0:has_keyword]->(`t2`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Refuge: Part 1')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the keywords of the episode \"Refuge: Part 1\".",
    "evidence": "episode \"Refuge: Part 1\" refers to title = 'Refuge: Part 1'",
    "idx": 757
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_keyword_0:has_keyword]->(`t2`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`keyword` = 'laundering money')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of the episode with the keyword \"laundering money\"?",
    "evidence": "keyword \"laundering money\" refers to keyword = 'laundering money'",
    "idx": 759
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_keyword_0:has_keyword]->(`t2`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`rating` > 8)\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the keywords for the episodes with a rating of over 8.",
    "evidence": "a rating of over 8 refers to rating > 8",
    "idx": 760
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_vote_0:has_vote]->(`t2`:`vote`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Cherished' AND `t2`.`stars` = 10)\nRETURN `t2`.`votes` AS `votes`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many 10-star votes were given to the episode titled \"Cherished\"?",
    "evidence": "10-star vote refers to stars = 10; titled \"Cherished\" refers to title = 'Cherished'",
    "idx": 761
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_vote_0:has_vote]->(`t2`:`vote`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Cherished')\nRETURN sum(`t2`.`votes`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many votes did the episode titled \"Cherished\" get in total?",
    "evidence": "titled \"Cherished\" refers to title = 'Cherished'",
    "idx": 762
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t3`:`person`)-[t2:worked_on]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t3`.`person_id` = `t2`.`person_id`\nAND (`t1`.`title` = 'Cherished' AND `t3`.`name` = 'Park Dietz' AND `t2`.`credited` = 'true')\nRETURN `t2`.`role` AS `role`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Park Dietz was credited in which role in the episode titled \"Cherished\"?",
    "evidence": "credited refers to credited = 'true'; titled \"Cherished\" refers to title = 'Cherished'",
    "idx": 764
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t3`:`person`)-[t2:worked_on]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t3`.`person_id` = `t2`.`person_id`\nAND (`t1`.`title` = 'Cherished' AND `t2`.`credited` = 'true' AND `t2`.`role` = 'technical advisor')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who was credited as \"technical advisor\" in the episode titled \"Cherished\"?",
    "evidence": "who refers to name; credited refers to credited = 'true'; as \"technical advisor\" refers to role = 'technical advisor'; titled \"Cherished\" refers to title = 'Cherished'",
    "idx": 766
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t3`:`person`)-[t2:worked_on]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t3`.`person_id` = `t2`.`person_id`\nAND (`t2`.`credited` = 'true' AND `t3`.`name` = 'Park Dietz')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of all the episodes in which Park Dietz was credited.",
    "evidence": "credited refers to credited = 'true'",
    "idx": 768
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t2`:`episode`)-[has_vote_0:has_vote]->(`t1`:`vote`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`stars` = 1)\nORDER BY `t1`.`votes` IS NULL ASC, `t1`.`votes` DESC \nRETURN `t2`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which episode got the most 1 star votes? Give its title.",
    "evidence": "the most refers to max(votes); 1 star refers to stars = '1'",
    "idx": 771
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:nominated_for]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t2`.`award_id` = 313)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who was nominated for award no.313? Give the full name.",
    "evidence": "award no.313 refers to award_id = '313'; full name refers to name",
    "idx": 777
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_vote_0:has_vote]->(`t2`:`vote`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`stars` = 9 AND `t1`.`title` = 'Sideshow')\nRETURN `t2`.`votes` AS `votes`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Display the number of 9-star votes the episode Sideshow received.",
    "evidence": "9-star vote refers to stars = '9'; episode Sideshow refers to title = 'Sideshow'",
    "idx": 779
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_keyword_0:has_keyword]->(`t2`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nRETURN CASE WHEN sum(CASE  WHEN `t1`.`title` = 'Shield' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`title` = 'Refuge: Part 1' THEN 1 ELSE 0 END)) / sum(CASE  WHEN `t1`.`title` = 'Shield' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many times is the number of keywords in \"Refuge: Part 1\" episode than \"Shield\" episode?",
    "evidence": "\"Refuge: Part 1\" episode refers to title = 'Refuge: Part 1'; \"Shield\" episode refers to title = 'Shield'; times = divide(count(keyword where title = 'Refuge: Part 1'), count(keyword where title = 'Shield'))",
    "idx": 780
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:nominated_for]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t2`.`result` = 'Winner')\nWITH `t1`.`person_id` AS _groupby_col_0, COUNT(`t2`.`award_id`) AS _groupby_col_1, COUNT(`t1`.`person_id`) AS _groupby_col_2\nWHERE _groupby_col_1 >= 3\nRETURN _groupby_col_2 AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many people have won at least 3 awards?",
    "evidence": "won refers to result = 'Winner'; at least 3 awards refers to count(result) > 3",
    "idx": 783
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_keyword_0:has_keyword]->(`t2`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t1`.`title` = 'Shield')\nRETURN `t2`.`keyword` AS `keyword`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the keywords of the \"Shield\" episode?",
    "evidence": "\"Shield\" episode refers to title = 'Shield'",
    "idx": 789
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH ()-[t2:nominated_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (CASE WHEN `t1`.`air_date` is not NULL THEN apoc.temporal.format(`t1`.`air_date`,'yyyy') ELSE NULL END = '1998' AND `t2`.`organization` = 'International Monitor Awards' AND `t2`.`result` = 'Winner')\nRETURN COUNT(`t1`.`episode_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the episodes that were aired in 1998, how many won an International Monitor Awards?",
    "evidence": "aired in 1998 refers to air_date like '1998%'; won refers to result = 'Winner'; International Monitor Awards refers to organization = 'International Monitor Awards'",
    "idx": 791
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "WITH *, COLLECT { MATCH (`t1_sub0`:`episode`)-[has_keyword_1:has_keyword]->(`t2_sub0`:`keyword`)\nWHERE `t1_sub0`.`episode_id` = `t2_sub0`.`episode_id`\nRETURN MAX(`t1_sub0`.`votes`) AS `_col_0`   } AS in_collect_0\nMATCH (`t1`:`episode`)-[has_keyword_0:has_keyword]->(`t2`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (NOT `t1`.`votes` IN in_collect_0)\nORDER BY `t1`.`votes` IS NULL ASC, `t1`.`votes` DESC \nRETURN `t2`.`keyword` AS `keyword`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the keywords of the episode which received the 2nd-highest number of votes?",
    "evidence": "the 2nd-highest number of votes refers to second max(votes)",
    "idx": 794
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t3`:`person`)-[t2:worked_on]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t3`.`person_id` = `t2`.`person_id`\nAND (`t1`.`title` = 'Flight' AND `t2`.`role` = 'Narrator')\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the narrator of the \"Flight\" episode?",
    "evidence": "who refers to name; narrator refers to role = 'Narrator'; the \"Flight\" episode refers to title = 'Flight'",
    "idx": 796
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t2`:`person`)-[t1:worked_on]->()\nWHERE `t2`.`person_id` = `t1`.`person_id`\nAND (`t1`.`category` = 'Cast')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of all the cast members in the series.",
    "evidence": "cast member refers to category = 'Cast'",
    "idx": 803
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t2`:`episode`)-[has_vote_0:has_vote]->(`t1`:`vote`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`stars` = 10 AND `t1`.`votes` = 72)\nRETURN `t2`.`title` AS `title`, `t2`.`summary` AS `summary`, `t2`.`air_date` AS `air_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the title, summary, and air date of the episode that garnered 72 10-star votes.",
    "evidence": "72 10-star votes refers to stars = 10 and votes = 72",
    "idx": 823
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t2`:`episode`)-[has_vote_0:has_vote]->(`t1`:`vote`)\nWHERE `t2`.`episode_id` = `t1`.`episode_id`\nAND (`t1`.`stars` = 6 AND `t2`.`episode` = 12)\nRETURN `t2`.`air_date` AS `air_date`, `t2`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many 6-star votes did episode 12 get? Please include the air date and rating.",
    "evidence": "6-star vote refers to stars = 6",
    "idx": 824
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:nominated_for]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t2`.`year` = 2000 AND `t2`.`award_category` = 'Edgar' AND `t2`.`award` = 'Best Television Episode')\nRETURN `t1`.`name` AS `name`, `t2`.`role` AS `role`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the winner of the Best Television Episode award for the Edgar category in 2000? Include his or her name and role.",
    "evidence": "the Best Television Episode award refers to award = 'Best Television Episode'; the Edgar category refers to award_category = 'Edgar'; in 2000 refers to year = 2000",
    "idx": 825
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:nominated_for]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t1`.`name` = 'Rene Balcer' AND `t2`.`result` = 'Winner')\nRETURN `t2`.`organization` AS `organization`, `t2`.`year` AS `year`, `t2`.`award` AS `award`, `t2`.`award_category` AS `award_category`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the organization, year, award, and award category in which Rene Balcer is the winner.",
    "evidence": "Rene Balcer refers to name = 'Rene Balcer'; the winner refers to result = 'Winner'",
    "idx": 826
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:nominated_for]->(`t3`:`episode`)\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND `t2`.`episode_id` = `t3`.`episode_id`\nAND (`t2`.`year` = 1999 AND `t2`.`award` = 'Outstanding Guest Actress in a Drama Series' AND `t2`.`organization` = 'Primetime Emmy Awards' AND `t1`.`name` = 'Julia Roberts' AND `t2`.`result` = 'Nominee')\nRETURN `t3`.`episode_id` AS `episode_id`, `t2`.`role` AS `role`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "On what episode did Julia Roberts win the \"Outstanding Guest Actress in a Drama Series\" award during the 1999 Primetime Emmy Awards? Tell me her role.",
    "evidence": "win refers to result = 'Winner'; the \"Outstanding Guest Actress in a Drama Series\" award refers to award = 'Outstanding Guest Actress in a Drama Series'; the 1999 refers to year = 1999; Primetime Emmy Awards refers to organization = 'Primetime Emmy Awards'",
    "idx": 828
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t3`:`person`)-[t2:worked_on]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t3`.`person_id` = `t2`.`person_id`\nAND (`t2`.`category` = 'Produced by' AND `t2`.`role` = 'producer' AND `t3`.`name` = 'Billy Fox')\nRETURN `t1`.`title` AS `title`, `t1`.`air_date` AS `air_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the titles and air dates of episodes that were produced by Billy Fox.",
    "evidence": "produced refers to role = 'producer'",
    "idx": 829
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t4`:`person`)-[t2:worked_on]->(`t3`:`episode`)\nMATCH ()-[t1:nominated_for]->()\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t2`.`episode_id` = `t3`.`episode_id`\nAND `t2`.`person_id` = `t4`.`person_id`\nAND (`t3`.`episode` = 2 AND `t4`.`birth_country` = 'USA')\nRETURN CASE WHEN COUNT(`t2`.`category`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`category` = 'Cast' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`category`) END AS `_col_0`, `t1`.`role` AS `role`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ratio of American casts on episode 2 of the series? Please include their roles.",
    "evidence": "American refers to birth_country = 'USA'; cast refers to category = 'Cast'; ratio = divide(count(person_id where birth_country = 'USA'), total(category)) where category = 'Cast'",
    "idx": 833
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t3`:`person`)-[t2:worked_on]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t3`.`person_id` = `t2`.`person_id`\nAND (`t1`.`episode` = 9)\nRETURN `t3`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out all the credit names for episode 9.",
    "evidence": "credit name refers to name",
    "idx": 836
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t3`:`person`)-[t2:nominated_for]->(`t1`:`episode`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t2`.`role` = 'director' AND `t2`.`result` = 'Winner')\nRETURN `t3`.`name` AS `name`, `t1`.`episode_id` AS `episode_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out director names that received an award along with the episode number.",
    "evidence": "director refers to role = 'director'; received an award refers to result = 'Winner'; episode number refers to episode",
    "idx": 838
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t2`:`person`)-[t1:nominated_for]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t1`.`result` = 'Winner' AND `t1`.`award` = 'Best Television Episode')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who played the role of a teleplay in the episode that won \"Best Television Episode\"?",
    "evidence": "the role of a teleplay refers to role = 'teleplay'; won refers to result = 'Winner'; \"Best Television Episode\" refers to award = 'Best Television Episode'",
    "idx": 849
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t2`:`person`)-[t1:nominated_for]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t1`.`role` = 'writer')\nRETURN `t2`.`birthdate` AS `birthdate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the date of birth of the actor who played the role of a \"writer\"?",
    "evidence": "date of birth refers to birthdate",
    "idx": 850
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:worked_on]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t1`.`person_id` = 'nm0007064' AND `t2`.`role` = 'Narrator' AND `t2`.`credited` = 'false')\nRETURN DISTINCT `t1`.`birth_place` AS `birth_place`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where is the place of birth of the actor with the number nm0007064 who has not been credited for playing the role of a \"Narrator\"?",
    "evidence": "place of birth refers to birth_place; actor with the number nm0007064 refers to person_id = 'nm007064'; has not been credited refers to credited = ''; the role of a \"Narrator\" refers to role = 'narrator'",
    "idx": 853
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_keyword_0:has_keyword]->(`t2`:`keyword`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`keyword` IN ['nun', 'priest'])\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which episode has the two keywords \"nun\" and \"priest\"?",
    "evidence": "episode refers to title; the two keywords \"nun\" and \"priest\" refers to keyword = 'nun' or keyword = 'priest';",
    "idx": 856
  },
  {
    "filename": "train.json",
    "db_id": "law_episode",
    "gql_statement": "MATCH (`t1`:`episode`)-[has_vote_0:has_vote]->(`t2`:`vote`)\nWHERE `t1`.`episode_id` = `t2`.`episode_id`\nAND (`t2`.`stars` = 10)\nRETURN `t1`.`title` AS `title`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any three episodes that were most enjoyed by the viewers.",
    "evidence": "episode refers to title; most enjoyed by the viewers refers to stars = 10",
    "idx": 858
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`date` = localdatetime('2008-03-11T00:00:00') AND `t2`.`description` = 'Body Height')\nRETURN `t2`.`value` AS `value`, `t2`.`units` AS `units`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "According to the observation on 2008/3/11, what was the height of Elly Koss?",
    "evidence": "2008/3/11 refers to date = '2008-03-11'; height refers to DESCRIPTION = 'Body Height' from observations;",
    "idx": 859
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`description` = 'Body Height')\nRETURN sum(CASE  WHEN CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy') ELSE NULL END = '2009' THEN `t2`.`value`  END) - sum(CASE  WHEN CASE WHEN `t2`.`date` is not NULL THEN apoc.temporal.format(`t2`.`date`,'yyyy') ELSE NULL END = '2008' THEN `t2`.`value`  END) AS `increase`, `t2`.`units` AS `units`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "By how much did Elly Koss's weight increase from the observation in 2008 to the observation in 2009?",
    "evidence": "SUBTRACT((DATE like '2009%'), (DATE like '2008%')) where DESCRIPTION = 'Body Weight';",
    "idx": 860
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`description` = 'Systolic Blood Pressure')\nRETURN `t2`.`value` AS `value`, `t2`.`units` AS `units` ORDER BY `t2`.`value` IS NULL ASC, `t2`.`value` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "During all the observations of Elly Koss, what was the highest Systolic Blood Pressure observed?",
    "evidence": "the highest Systolic Blood Pressure refers to MAX(DESCRIPTION = 'Systolic Blood Pressure') from observations;",
    "idx": 861
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`description` = 'Systolic Blood Pressure')\nRETURN COUNT(`t2`.`description`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how many times had Elly Koss have her Systolic Blood Pressure observed?",
    "evidence": "Systolic Blood Pressure refers to DESCRIPTION = 'Systolic Blood Pressure';",
    "idx": 862
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "CALL(*) {\nMATCH (`observations_sub0`:`observations`)\nWHERE `observations_sub0`.`description` = 'Systolic Blood Pressure'\nRETURN MAX(`observations_sub0`.`value`) AS `_col_0`  \n}\nMATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`value` = `_col_0`)\nRETURN `t1`.`first` AS `first`, `t1`.`last` AS `last`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "The highest Systolic Blood Pressure was observed in which patient? Please give his or her full name.",
    "evidence": "the highest Systolic Blood Pressure refers to MAX(DESCRIPTION = 'Systolic Blood Pressure') from observations; full name refers to first, last;",
    "idx": 863
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss')\nRETURN DISTINCT `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list all the medication that are prescribed to Elly Koss.",
    "evidence": "medication that are prescribed refers to DESCRIPTION from medications;",
    "idx": 864
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`description` =~ '(?i)(?s)Acetaminophen.*')\nRETURN `t2`.`reasondescription` AS `reasondescription`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Why did Elly Koss need to take Acetaminophen?",
    "evidence": "why need to take Acetaminophen refers to REASONDESCRIPTION  where DESCRIPTION like 'Acetaminophen%' from medications;",
    "idx": 865
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`reasondescription` = 'Streptococcal sore throat (disorder)')\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What medication did Elly Koss take when she had Streptococcal sore throat?",
    "evidence": "medication refers to DESCRIPTION from medications; Streptococcal sore throat refers to REASONDESCRIPTION like 'Streptococcal sore throat%';",
    "idx": 866
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`medications`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` =~ '(?i)(?s)Acetaminophen.*')\nRETURN DISTINCT `t1`.`first` AS `first`, `t1`.`last` AS `last`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the full names of all the patients who had been prescribed with Acetaminophen.",
    "evidence": "full name refers to first, last; prescribed with Acetaminophen refer to DESCRIPTION like 'Acetaminophen%' from medications;",
    "idx": 867
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`start` = localdatetime('2009-01-08T00:00:00'))\nRETURN `t2`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was the condition of Elly Koss on 2009/1/8?",
    "evidence": "condition on 2009/1/8 refers to DESCRIPTION from conditions where START = '2009-01-08';",
    "idx": 868
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`first` = 'Elly' AND `t1`.`last` = 'Koss' AND `t2`.`description` = 'Body Weight')\nRETURN avg(`t2`.`value`) AS `_col_0`, `t2`.`units` AS `units`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "According to all the observations of Elly Koss, what was her average weight?",
    "evidence": "DIVIDE(SUM(VALUE), COUNT(VALUE)) WHERE DESCRIPTION = 'Body Weight';",
    "idx": 869
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`conditions`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t2`.`description` = 'Cystitis')\nRETURN CASE WHEN COUNT(DISTINCT `t1`.`patient`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`marital` = 'M' THEN 1 ELSE 0 END)) * 100 / COUNT(DISTINCT `t1`.`patient`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all the patients who once had cystitis, what was the percentage of them being married?",
    "evidence": "DIVIDE(COUNT(marital = 'M'), COUNT(patient)) as percentage where DESCRIPTION = 'Cystitis';\n",
    "idx": 870
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`observations`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`prefix` = 'Mr.' AND `t1`.`first` = 'Vincent' AND `t1`.`last` = 'Wyman' AND `t2`.`date` = localdatetime('2010-08-02T00:00:00') AND `t2`.`description` = 'Body Height')\nRETURN `t2`.`description` AS `description`, `t2`.`value` AS `value`, `t2`.`units` AS `units`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the body height status of Mr. Vincent Wyman on 2010/8/2.",
    "evidence": "body height status refers to DESCRIPTION = 'Body Height' from observations; on 2010/8/2 refers to DATE = '2010-08-02';",
    "idx": 871
  },
  {
    "filename": "train.json",
    "db_id": "synthea",
    "gql_statement": "MATCH (`t2`:`careplans`)-[patient_0:patient]->(`t1`:`patients`)\nWHERE `t1`.`patient` = `t2`.`patient`\nAND (`t1`.`prefix` = 'Mrs.' AND `t1`.`first` = 'Norman' AND `t1`.`last` = 'Berge')\nRETURN COUNT(`t2`.`patient`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many care plans has Mrs. Norman Berge taken?",
    "evidence": "",
    "idx": 872
  }
]