[
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nOPTIONAL MATCH (`t2`:`station`)\nWHERE `t2`.`city` = 'Palo Alto'\nAND `t2`.`name` = `t1`.`start_station_name`\nRETURN CASE WHEN 3600=0 THEN NULL ELSE toFloat(sum(`t1`.`duration`)) / 3600 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total trip duration made within Palo Alto city? Convert the duration to hour.",
    "evidence": "total trip duration to hour = DIVIDE(SUM(duration), 3600);",
    "idx": 6969
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`trip`:`trip`)\nRETURN COUNT(CASE  WHEN `trip`.`subscription_type` = 'Subscriber' AND `trip`.`start_station_name` = 'Market at 4th' THEN `trip`.`id`  END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Count the number of subscribers who started their trips in Market at 4th.",
    "evidence": "subsscriber refers to subscription_type = subscriber; started their trips in refers to start_station_name; start_station_name = 'Market at 4th';",
    "idx": 6970
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`station`:`station`)\nWHERE `station`.`installation_date` = '12/31/2013' AND `station`.`city` = 'Mountain View'\nRETURN `station`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of the stations within Mountain View that were installed on 12/31/2013.",
    "evidence": "Mountain View refers to city = 'Mountain View'; installed on 12/31/2013 refers to installation_date = '12/31/2013';",
    "idx": 6971
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`station`:`station`)\nWHERE `station`.`name` = 'Townsend at 7th'\nRETURN `station`.`city` AS `city`, sum(`station`.`dock_count`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which city is Townsend at 7th Station located and how many bikes could it hold?",
    "evidence": "Townsend at 7th Station refers to city = 'Townsend at 7th Station'; number of bikes a station can hold refers to SUM(dock_count);",
    "idx": 6972
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t2`.`name` = 'Evelyn Park and Ride' AND `t1`.`start_station_name` = `t2`.`name` AND `t1`.`subscription_type` = 'Subscriber')\nRETURN sum(`t2`.`dock_count`) AS `_col_0`, COUNT(`t1`.`subscription_type`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many bikes could Evelyn Park and Ride hold and how many users who started on that station are subscribers?",
    "evidence": "number of bikes a station can hold refers to SUM(dock_count); Evelyn Park and Ride refers to name = 'Evelyn Park and Ride'; started on the station refers to start_station_name; subscribers refers to subscription_type = 'subscriber';",
    "idx": 6973
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t3`:`weather`)\nWHERE `t3`.`zip_code` = `t2`.`zip_code`\nAND (`t3`.`zip_code` = '94301' AND `t2`.`subscription_type` = 'Subscriber')\nRETURN COUNT(`t3`.`zip_code`) AS `_col_0`, `t3`.`max_temperature_f` AS `max_temperature_f` ORDER BY `t3`.`max_temperature_f` IS NULL ASC, `t3`.`max_temperature_f` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many subscribers are in the zip code of 94301 and what is the hottest temperature recorded on that zip code?",
    "evidence": "hottest temperature refers to MAX(max_temperature_f);",
    "idx": 6974
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nOPTIONAL MATCH (`t2`:`station`)\nWHERE `t2`.`city` = 'San Francisco'\nAND `t2`.`name` = `t1`.`start_station_name`\nRETURN CASE WHEN sum(CASE  WHEN `t1`.`subscription_type` = 'Subscriber' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`subscription_type` = 'Customer' THEN 1 ELSE 0 END)) * 100 / sum(CASE  WHEN `t1`.`subscription_type` = 'Subscriber' THEN 1 ELSE 0 END) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage ration of customers to subscribers that started their trips within the city of San Francisco?",
    "evidence": "customer refers to subscription_type = 'customer'; subscriber refers to subscription_type = 'subscriber'; started their trips within refers to start_station_id; percentage ratio = DIVIDE(SUM(subscription_type = 'Customer'), SUM(subscription_type = 'Subscriber')) as percentage;",
    "idx": 6975
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`trip`)\nMATCH (`t2`:`weather`)\nWHERE `t2`.`zip_code` = `t1`.`zip_code`\nAND (`t1`.`start_station_name` = 'Franklin at Maple' AND `t2`.`date` = '9/4/2013')\nRETURN min(`t1`.`duration`) AS `_col_0`, MAX(`t2`.`max_wind_speed_mph`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the shortest trip made starting from Franklin at Maple and what is the maximum wind speed at that date?",
    "evidence": "shortest trip refers to MIN(duration); starting from refers to start_station_name; start_station_name = 'Franklin at Maple'; maximum wind speed refers to max_wind_Speed_mph;",
    "idx": 6976
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t1`:`station`)\nMATCH (`t2`:`status`)\nWHERE `t2`.`station_id` = `t1`.`id`\nAND (`t2`.`time` = '2013/10/20 8:11:01' AND `t1`.`name` = 'San Jose Diridon Caltrain Station')\nRETURN sum(`t2`.`bikes_available`) AS `_col_0`, `t1`.`long` AS `long`, `t1`.`lat` AS `lat`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many bikes have been borrowed at San Jose Diridon Caltrain Station on the date and time of 10/20/2013 8:11:01 AM and indicate the station's coordinates.",
    "evidence": "number of bikes that have been borrowed refers to SUM(bikes_available); San Jose Diridon Caltrain Station refers to name = 'San Jose Diridon Caltrain Station'; station's coordinates refers to (lat, long);",
    "idx": 6977
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t1`.`id` = 585842)\nRETURN `t2`.`city` AS `city`, `t2`.`installation_date` AS `installation_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the city of the station that trip ID 585842 borrowed a bike and indicate when that station was first installed.",
    "evidence": "when the station was first installed refers to installation_date;",
    "idx": 6978
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t2`.`start_station_name` = `t1`.`name`\nAND (`t1`.`installation_date` = '8/16/2013' AND `t2`.`subscription_type` = 'Customer')\nRETURN COUNT(`t1`.`name`) AS `_col_0`, sum(CASE  WHEN `t2`.`subscription_type` = 'Customer' THEN 1 ELSE 0 END) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many stations were installed on the date of 8/16/2013 and how many users on those stations are classified as a customer?",
    "evidence": "installed on refers to installation_date; installation_date = '8/16/2013'; customers refers to subscription_type = customers;",
    "idx": 6979
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`trip`)\nMATCH (`t1`:`station`)\nWHERE `t2`.`end_station_name` = `t1`.`name`\nAND (`t2`.`start_station_name` = 'Market at 4th' AND `t2`.`end_date` = '8/29/2013 12:45')\nRETURN `t1`.`name` AS `name`, `t1`.`lat` AS `lat`, `t1`.`long` AS `long`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which station did the user who started at Market at 4th station ended their trip at the time of 12:45:00 PM and the date of 8/29/2013 and what is the location coordinates of the ending station?",
    "evidence": "started at refers to start_station_name; start_station_name = 'Market at 4th'; location coordinates refers to (lat, long);",
    "idx": 6980
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t1`.`end_station_name` = 'MLK Library' AND `t1`.`subscription_type` = 'Subscriber' AND `t2`.`dock_count` = 19)\nRETURN COUNT(`t1`.`id`) AS `_col_0`, `t2`.`dock_count` AS `dock_count`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many subscribers have ended their trip at MLK Library and how many docks does that station have?",
    "evidence": "subscribers refers to subscription_type = 'subscribers'; ended their trip at refers to end_station_name; end_station_name = 'MLK Library'; number of docks a station have refers to dock_count;",
    "idx": 6981
  },
  {
    "filename": "train.json",
    "db_id": "bike_share_1",
    "gql_statement": "MATCH (`t2`:`station`)\nMATCH (`t1`:`trip`)\nWHERE `t2`.`name` = `t1`.`start_station_name`\nAND (`t1`.`start_station_name` = 'Mountain View City Hall' AND `t1`.`subscription_type` = 'Subscriber' AND `t1`.`end_station_name` = 'Mountain View City Hall')\nRETURN avg(`t1`.`duration`) AS `_col_0`, `t2`.`installation_date` AS `installation_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average duration travelled by subscribers that both started and ended their trip in Mountain View City Hall and indicate the date when the station was first installed.",
    "evidence": "average duration = DIVIDE(SUM(duration), COUNT(id)); subscribers refers to subscription_type = 'subscriptions'; started and ended their trip at Mountain View City Hall refers to start_station_name = 'Mountain View City Hall' and end_station_name = 'Mountain View City Hall'; when the station was first installed refers to installation_date;",
    "idx": 6982
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`title` = 'ACADEMY DINOSAUR'\nRETURN `film`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the description of the film ACADEMY DINOSAUR?",
    "evidence": "\"ACADEMY DINOSAUR\" is the title of film",
    "idx": 6983
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rental_duration` > 6\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films have a rental duration of over 6 days?",
    "evidence": "rental duration of over 6 days refers to rental_duration > 6",
    "idx": 6984
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`release_year` = '2006' AND `film`.`rental_rate` = 2.99\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of the films that are released in 2006 and have a rental rate of $2.99.",
    "evidence": "released in 2006 refers to release_year = 2006; rental rate of $2.99 refers to rental_rate = 2.99",
    "idx": 6985
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nORDER BY `film`.`length` IS NULL ASC, `film`.`length` DESC \nRETURN `film`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which film has the longest duration of film screening? Please give its title.",
    "evidence": "longest duration of film refers to Max(length)",
    "idx": 6986
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`title` IN ['ACE GOLDFINGER', 'ACADEMY DINOSAUR']\nORDER BY `film`.`replacement_cost` IS NULL ASC, `film`.`replacement_cost` DESC \nRETURN `film`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which film has a higher replacement cost, ACE GOLDFINGER or ACADEMY DINOSAUR?",
    "evidence": "higher replacement cost refers to Max(replacement_cost); 'ACE GOLDFIINGER' and 'ACADEMY DINOSAUR' are both the title of film",
    "idx": 6987
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rating` = 'NC-17' AND `film`.`release_year` = '2006'\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the films that are released in 2006, how many of them are rated Adults Only in the Motion Picture Association Film Rating?",
    "evidence": "released in 2006 refers to release_year = 2006; rated Adults Only refers to rating = 'NC-17'",
    "idx": 6988
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rental_rate` = 2.99 AND `film`.`special_features` = 'Deleted Scenes'\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films with the rental rate of $2.99 have the special feature of \"Deleted Scenes\"?",
    "evidence": "rental rate of $2.99 refers to rental_rate = 2.99; film refers to title",
    "idx": 6989
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`film_sub0`:`film`)\nWITH `film_sub0`.`title` AS _groupby_col_0, COUNT(`film_sub0`.`special_features`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `title`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` > 2 IS NULL DESC, `num` > 2  \nRETURN `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of all the films that have more than 2 special features.",
    "evidence": "more than 2 special features refers to Count(special_features) > 2",
    "idx": 6990
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`staff`:`staff`)\nWHERE `staff`.`first_name` = 'Jon' AND `staff`.`last_name` = 'Stephens'\nRETURN `staff`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the email address of the staff Jon Stephens?",
    "evidence": "",
    "idx": 6991
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`staff`:`staff`)\nWHERE `staff`.`active` = 1\nRETURN `staff`.`first_name` AS `first_name`, `staff`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the full names of all the active staff.",
    "evidence": "full name refers to first_name, last_name; active staff refers to active = 1",
    "idx": 6992
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`film_sub0`:`film`)\nRETURN MAX(`film_sub0`.`replacement_cost`) AS `_col_0`  \n}\nMATCH (`film`:`film`)\nWHERE `film`.`replacement_cost` = `_col_0`\nRETURN DISTINCT `film`.`release_year` AS `release_year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which year was the film with the highest replacement cost released?",
    "evidence": "highest replacement_cost refers to Max (replacement_cost); year refers to release_year",
    "idx": 6993
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`film_sub0`:`film`)\nRETURN MAX(`film_sub0`.`replacement_cost`) AS `_col_0`  \n}\nMATCH (`film`:`film`)\nWHERE `film`.`replacement_cost` = `_col_0`\nRETURN `film`.`title` AS `title`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the titles of the top 3 films with the highest replacement cost.",
    "evidence": "highest replacement_cost refers to Max (replacement_cost); film refers to title",
    "idx": 6994
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t1`.`title` = 'ACADEMY DINOSAUR')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the language of the film ACADEMY DINOSAUR?",
    "evidence": "\"ACADEMY DINOSAUR\" is the title of film; language refers to language.name",
    "idx": 6995
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`name` = 'English')\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films are in English?",
    "evidence": "\"English\" is the name of language",
    "idx": 6996
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film_actor`)\nMATCH (`t2`:`film`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t2`.`title` = 'ACADEMY DINOSAUR')\nRETURN COUNT(`t1`.`actor_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many actors have starred in the film ACADEMY DINOSAUR?",
    "evidence": "\"ACADEMY DINOSAUR\" is the title of film",
    "idx": 6997
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`category`)\nMATCH (`t1`:`film_category`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nAND (`t2`.`name` = 'Horror')\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films are there under the category of \"Horror\"?",
    "evidence": "\"Horror\" is the name of category",
    "idx": 6998
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'RUTH' AND `t1`.`last_name` = 'MARTINEZ')\nRETURN COUNT(`t2`.`rental_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how many times has the customer RUTH MARTINEZ rented a film?",
    "evidence": "times of rented refers to Count(rental_id)",
    "idx": 6999
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'RUTH' AND `t1`.`last_name` = 'MARTINEZ' AND CASE WHEN `t2`.`return_date` is not NULL THEN apoc.temporal.format(`t2`.`return_date`,'MM') ELSE NULL END = '8' AND CASE WHEN `t2`.`return_date` is not NULL THEN apoc.temporal.format(`t2`.`return_date`,'yyyy') ELSE NULL END = '2005')\nRETURN COUNT(`t1`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films rented to the customer RUTH MARTINEZ were returned in August, 2005?",
    "evidence": "returned in August, 2005 refers to year(return_date) = 2005 and month (return_date) = 8",
    "idx": 7000
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`rental`)\nMATCH (`t1_sub0`:`customer`)\nWHERE `t1_sub0`.`customer_id` = `t2_sub0`.`customer_id`\nWITH `t1_sub0`.`first_name` AS _groupby_col_0, `t1_sub0`.`last_name` AS _groupby_col_1, COUNT(`t2_sub0`.`rental_id`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`, _groupby_col_2 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `first_name`, `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give the full name of the customer that have rented the most films.",
    "evidence": "full name refers to first_name, last_name; customer who rented the most film refers to Max(count(rental_id))",
    "idx": 7001
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`rental`)\nMATCH (`t1_sub0`:`customer`)\nWHERE `t1_sub0`.`customer_id` = `t2_sub0`.`customer_id`\nAND ((`t1_sub0`.`first_name` = 'RUTH' AND `t1_sub0`.`last_name` = 'MARTINEZ') OR (`t1_sub0`.`first_name` = 'LINDA' AND `t1_sub0`.`last_name` = 'WILLIAMS'))\nWITH `t1_sub0`.`first_name` AS _groupby_col_0, `t1_sub0`.`last_name` AS _groupby_col_1, COUNT(`t1_sub0`.`customer_id`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`, _groupby_col_2 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `first_name`, `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which customer has rented more movies, RUTH MARTINEZ or LINDA WILLIAMS?",
    "evidence": "rented more movie Max(Count(customer_id)); \"RUTH MARTINEZ\" and \"LINDA WILLIAMS\" are both full name of customer",
    "idx": 7002
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`first_name` = 'DIANE' AND `customer`.`last_name` = 'COLLINS'\nRETURN `customer`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is Diane Collins' email address?",
    "evidence": "",
    "idx": 7003
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`active` = 0\nRETURN COUNT(`customer`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of inactive customers.",
    "evidence": "inactive refers to active = 0",
    "idx": 7004
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`email` = 'JEREMY.HURTADO@sakilacustomer.org'\nRETURN `customer`.`first_name` AS `first_name`, `customer`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the owner of email address \"JEREMY.HURTADO@sakilacustomer.org\"? Give the full name.",
    "evidence": "\"JEREMY.HURTADO@sakilacustomer.org\" is the email; owner refers to customer; full name refers to first_name, last_name",
    "idx": 7005
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`address_id` = 65\nRETURN `address`.`postal_code` AS `postal_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the postal code for the address No.65.",
    "evidence": "address no. 65 refers to address_id = 65",
    "idx": 7006
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`district` = 'Nordrhein-Westfalen'\nRETURN COUNT(`address`.`address_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of addresses in the Nordrhein-Westfalen district.",
    "evidence": "number of address refers to address_id",
    "idx": 7007
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`address_id` = '72'\nRETURN `address`.`phone` AS `phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the phone number of address No.72?",
    "evidence": "address no. 72 refers to address_id = 72; phone number refers to phone",
    "idx": 7008
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`length` = '178'\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the number of films that are 178 minutes long.",
    "evidence": "178 min long refers to length = '178'",
    "idx": 7009
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`title` = 'UPRISING UPTOWN'\nRETURN `film`.`special_features` AS `special_features`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the special features of the film Uprising Uptown.",
    "evidence": "\"UPRISING UPTOWN\" is the title of film",
    "idx": 7010
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`title` = 'ARTIST COLDBLOODED'\nRETURN `film`.`description` AS `description`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the description of the film Artist Coldblooded?",
    "evidence": "\"ARTIST COLDBLOODED\" is the title of film",
    "idx": 7011
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`store`)\nMATCH (`t1`:`address`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`store_id` = 2)\nRETURN `t1`.`address` AS `address`, `t1`.`address2` AS `address2`, `t1`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the detailed address for store No.2.",
    "evidence": "store no. 22 refers to store_id = 2; detailed address refers to address, address2, district",
    "idx": 7012
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND (`t2`.`city` = 'Clarksville')\nRETURN `t1`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which continent is the mother country of Clarksville city in?",
    "evidence": "\"Clarksville\" is the city;",
    "idx": 7013
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film_actor`)\nMATCH (`t2`:`film`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t2`.`release_year` = '2006' AND `t2`.`rental_duration` = 7 AND `t2`.`rental_duration` = 4.99 AND `t2`.`length` = 98)\nRETURN COUNT(`t1`.`actor_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many actors played a role in the 2006 film whose rental duration is 7 days, rental rate is 4.99 and is 98 minutes duration?",
    "evidence": "in 2006 refers to release_year = 2006; 98 min duration refers to length = 98; number of actors refers to count(actor_id)",
    "idx": 7014
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film_actor`)\nMATCH (`t2`:`actor`)\nWHERE `t1`.`actor_id` = `t2`.`actor_id`\nAND (`t2`.`first_name` = 'DARYL' AND `t2`.`last_name` = 'WAHLBERG')\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films did actor Daryl Wahlberg appear in?",
    "evidence": "",
    "idx": 7015
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'SHERRI' AND `t1`.`last_name` = 'RHODES' AND `t2`.`rental_date` = localdatetime('2005-07-28T12:27:27'))\nRETURN `t2`.`return_date` AS `return_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Sherri Rhodes rented a film at 12:27:27 on 2005/7/28, when did she/he return that film?",
    "evidence": "rented at 12:27:27 on 2005/7/28 refers to rental_date = '2005-07-28 12:27:27'",
    "idx": 7016
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`staff`)\nMATCH (`t2`:`store`)\nWHERE `t1`.`store_id` = `t2`.`store_id`\nAND (`t2`.`store_id` = 1)\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the manager staff for store No.1.",
    "evidence": "store no. 1 refers to store_id = 1; name refers to first_name, last_name",
    "idx": 7017
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`store`)\nMATCH (`t1`:`address`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`store_id` = 1)\nRETURN `t1`.`address` AS `address`, `t1`.`address2` AS `address2`, `t1`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the address location of store No.1.",
    "evidence": "store no. 1 refers to store_id = 1; address location refers to address, address2, district",
    "idx": 7018
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`staff`)\nMATCH (`t1`:`address`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`first_name` = 'Jon' AND `t2`.`last_name` = 'Stephens')\nRETURN `t1`.`address` AS `address`, `t1`.`address2` AS `address2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where does the staff Jon Stephens live?",
    "evidence": "location refers to address, address2, district",
    "idx": 7019
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`address`)\nMATCH (`t2`:`city`)\nWHERE `t1`.`city_id` = `t2`.`city_id`\nAND (`t2`.`city` = 'Woodridge')\nRETURN COUNT(`t1`.`address_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many addresses are there in Woodridge city?",
    "evidence": "\"Woodridge\" is the city",
    "idx": 7020
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`address`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`first_name` = 'HEATHER' AND `t2`.`last_name` = 'MORRIS')\nRETURN `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the address location of Heather Morris.",
    "evidence": "address location refers to address",
    "idx": 7022
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`staff`)\nMATCH (`t1`:`address`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`address` = '1411 Lillydale Drive')\nRETURN `t2`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the email address of the person who lives in \"1411 Lillydale Drive\".",
    "evidence": "\"1411 Lillydate Drive\" is the address",
    "idx": 7023
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`rental`)\nWHERE `t1`.`rental_id` = `t2`.`rental_id`\nAND (`t2`.`rental_date` = localdatetime('2005-07-28T12:27:27') AND `t2`.`customer_id` = 297)\nRETURN `t1`.`amount` AS `amount`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much money did the customer No.297 pay for the rental which happened at 12:27:27 on 2005/7/28?",
    "evidence": "customer no. 297 refers to customer_id = 297; at 12:27:27 on 2005/7/28 refers to rental_date = '2005-07-28 12:27:27'; money pay for rent refers to amount",
    "idx": 7024
  }
]