[
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`nation`)-[in_region_0:in_region]->(`t2`:`region`)\nWHERE `t1`.`n_regionkey` = `t2`.`r_regionkey`\nAND (`t2`.`r_comment` = 'asymptotes sublate after the r')\nRETURN COUNT(`t1`.`n_nationkey`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many countries are there in the region whose comment description is \"asymptotes sublate after the r.\"",
    "evidence": "r_comment = 'asymptotes sublate after the r'; countries refer to n_nationkey;",
    "idx": 5002
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`customer`:`customer`)\nRETURN CASE WHEN COUNT(`customer`.`c_custkey`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `customer`.`c_acctbal` < 0 THEN 1 ELSE 0 END)) * 100 / COUNT(`customer`.`c_custkey`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of customers' accounts in debt.",
    "evidence": "DIVIDE(COUNT(c_custkey where c_acctbal < 0), COUNT(c_custkey)) as percentage;",
    "idx": 5008
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`part`:`part`)\nRETURN CASE WHEN COUNT(`part`.`p_partkey`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `part`.`p_mfgr` = 'Manufacturer#3' THEN 1 ELSE 0 END)) * 100 / COUNT(`part`.`p_partkey`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of manufactured parts by Manufacturer#3.",
    "evidence": "DIVIDE(COUNT(p_partkey where p_mfgr = 'Manufacturer#3'), COUNT(p_partkey)) as percentage;",
    "idx": 5010
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`part`:`part`)\nWHERE `part`.`p_type` = 'MEDIUM PLATED BRASS'\nRETURN `part`.`p_name` AS `p_name`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List any five parts name in Medium Plated Brass.",
    "evidence": "p_type = 'MEDIUM PLATED BRASS'; parts name refer to p_name;",
    "idx": 5011
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`nation`)-[in_region_0:in_region]->(`t2`:`region`)\nWHERE `t1`.`n_regionkey` = `t2`.`r_regionkey`\nAND (`t2`.`r_name` = 'AFRICA')\nRETURN `t1`.`n_name` AS `n_name`, `t1`.`n_nationkey` AS `n_nationkey`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the nation keys and names in Africa.",
    "evidence": "Africa refers to r_name = 'Africa';",
    "idx": 5014
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t2`.`c_name` = 'Customer#000000013')\nRETURN sum(`t1`.`o_totalprice`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total price of orders by Customer#000000013.",
    "evidence": "Customer#000000013 is the name of the customer which refers to c_name;",
    "idx": 5015
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t3`:`lineitem`)-[belongs_to_order_0:belongs_to_order]->(`t2`:`orders`)-[placed_by_0:placed_by]->(`t1`:`customer`)\nWHERE `t1`.`c_custkey` = `t2`.`o_custkey`\nAND `t2`.`o_orderkey` = `t3`.`l_orderkey`\nAND (`t1`.`c_name` = 'Customer#000021159')\nWITH `t3`.`l_linenumber` AS _groupby_col_0, COUNT(`t2`.`o_orderkey`) AS _groupby_col_1, sum(`t3`.`l_extendedprice` * (1 - `t3`.`l_discount`) * (1 + `t3`.`l_tax`)) AS _groupby_col_2\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_2 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many items did Customer#000021159 order? Calculate those items total charges.",
    "evidence": "items Customer#000021159 order refer to l_linenumber where c_name = 'Customer#000021159'; SUM(MULTIPLY(MULTIPLY(l_extendedprice, SUBTRACT(1, l_discount)), SUM(1, l_tax))) where c_name = 'Customer#000021159';",
    "idx": 5016
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t3`:`lineitem`)\nMATCH (`t1`:`part`)-[t2:supplied_by]->()\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND `t2`.`ps_partkey` = `t3`.`l_partkey` AND `t2`.`ps_suppkey` = `t3`.`l_suppkey`\nAND (`t1`.`p_name` = 'chocolate floral blue coral cyan')\nRETURN sum(`t3`.`l_extendedprice` * (1 - `t3`.`l_discount`) - `t2`.`ps_supplycost` * `t3`.`l_quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the total profit made by chocolate floral blue coral cyan.",
    "evidence": "SUBTRACT(MULTIPLY(l_extendedprice, (SUBTRACT(1, l_discount)), MULTIPLY(ps_supplycost, l_quantity))) where p_name = 'chocolate floral blue coral cyan';",
    "idx": 5017
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`supplier`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`s_nationkey` = `t2`.`n_nationkey`\nAND (`t1`.`s_acctbal` < 0)\nRETURN CASE WHEN COUNT(`t1`.`s_suppkey`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`n_name` = 'GERMANY' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`s_suppkey`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of suppliers in Germany.",
    "evidence": "DIVIDE(COUNT(s_suppkey where n_name = 'GERMANY'), COUNT(s_suppkey)) as percentage;",
    "idx": 5018
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->(`t3`:`supplier`)\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND `t2`.`ps_suppkey` = `t3`.`s_suppkey`\nAND (`t1`.`p_name` = 'smoke red pale saddle plum')\nRETURN `t3`.`s_name` AS `s_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the suppliers' names which supplied smoke red pale saddle plum.",
    "evidence": "p_name = 'smoke red pale saddle plum'; the suppliers' names refer to s_name;",
    "idx": 5019
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t3`:`lineitem`)\nMATCH ()-[t1:supplies]->(`t2`:`part`)\nWHERE `t1`.`ps_partkey` = `t2`.`p_partkey`\nAND `t1`.`ps_partkey` = `t3`.`l_partkey`\nAND (`t3`.`l_discount` = 0.1 AND `t3`.`l_shipdate` = localdatetime('1995-12-01T00:00:00') AND `t3`.`l_shipmode` = 'RAIL')\nRETURN `t2`.`p_name` AS `p_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the parts shipped by rail on 1st December, 1995, list part names with 10% discount.",
    "evidence": "shipped by rail on 1st December, 1995 refers to l_shipmode = 'RAIL' where l_shipdate = '1995-12-01'; part names with 10% discount refer to p_name where l_discount = 0.1;",
    "idx": 5021
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nWHERE CASE WHEN `lineitem`.`l_shipdate` is not NULL THEN apoc.temporal.format(`lineitem`.`l_shipdate`,'yyyy') ELSE NULL END = '1994'\nRETURN COUNT(`lineitem`.`l_orderkey`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were shipped in 1994?",
    "evidence": "orders shipped in 1994 refer to l_orderkey where year(l_shipdate) = 1994;",
    "idx": 5023
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`customer`:`customer`)\nORDER BY `customer`.`c_acctbal` IS NULL ASC, `customer`.`c_acctbal` DESC \nRETURN `customer`.`c_phone` AS `c_phone`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the phone number of the customer with the highest account balance.",
    "evidence": "phone number of the customer refers to c_phone; the highest account balance refers to MAX(c_acctbal);",
    "idx": 5026
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t2`.`c_mktsegment` = 'Furniture')\nRETURN `t1`.`o_comment` AS `o_comment`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the order comments for at least 5 orders made by customers in the furniture segment.",
    "evidence": "order comments refer to o_comment; c_mktsegment = 'Furniture';",
    "idx": 5030
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`nation`)-[in_region_0:in_region]->(`t2`:`region`)\nWHERE `t1`.`n_regionkey` = `t2`.`r_regionkey`\nAND (`t2`.`r_name` = 'ASIA')\nRETURN `t1`.`n_name` AS `n_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the countries that are located in Asia.",
    "evidence": "countries in Asia refer to n_name where r_name = 'ASIA';",
    "idx": 5031
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`nation`)-[in_region_0:in_region]->(`t2`:`region`)\nWHERE `t1`.`n_regionkey` = `t2`.`r_regionkey`\nAND (`t2`.`r_comment` = 'furiously express accounts wake sly')\nRETURN `t1`.`n_name` AS `n_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the countries that belong in the region with comment description \"furiously express accounts wake sly\".",
    "evidence": "r_comment = 'furiously express accounts wake sly';",
    "idx": 5032
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nORDER BY `t1`.`o_totalprice` IS NULL ASC, `t1`.`o_totalprice` DESC \nRETURN `t2`.`c_phone` AS `c_phone`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the phone number of the customer with the highest total price in an order.",
    "evidence": "phone number of the customer refers to c_phone; the highest total price refers to MAX(o_totalprice);",
    "idx": 5035
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`customer_sub0`:`customer`)\nRETURN avg(`customer_sub0`.`c_acctbal`) * 0.8 AS `avg_acctbal`  \n}\nMATCH (`t1`:`customer`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`c_nationkey` = `t2`.`n_nationkey`\nAND (`t1`.`c_acctbal` > `avg_acctbal`)\nRETURN `t2`.`n_name` AS `n_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the country name of the customers in the building marketing segment with an account balance greater than 80% of the average account balance of all customers.",
    "evidence": "country name refers to n_name; building marketing segment refers to c_mktsegment = 'BUILDING'; account balance greater than 80% of the average account balance of all customers refers to c_acctbal > MULTIPLY(AVG(c_acctbal), 0.8);",
    "idx": 5040
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`c_acctbal` > 9000\nRETURN `customer`.`c_name` AS `c_name`, `customer`.`c_phone` AS `c_phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name and phone number of the customers who have more than 9000 account balance.",
    "evidence": "the name of the customer refers to c_name; phone number of the customer refers to c_phone; have more than 9000 account balance refers to c_acctbal > 9000;",
    "idx": 5042
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`orders`:`orders`)\nWHERE `orders`.`o_totalprice` >= 200000 AND `orders`.`o_totalprice` <= 300000\nRETURN `orders`.`o_orderkey` AS `o_orderkey`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the order key of the orders with a total price between 200000 and 300000.",
    "evidence": "orders with a total price between 200000 and 300000 refer to o_totalprice between 200000 and 300000;",
    "idx": 5044
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL(*) {\nMATCH (`part_sub0`:`part`)\nRETURN avg(`part_sub0`.`p_retailprice`) AS `_col_0`  \n}\nMATCH (`part`:`part`)\nWHERE `part`.`p_retailprice` > `_col_0`\nRETURN `part`.`p_partkey` AS `p_partkey`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find and list the part key of the parts which has an above-average retail price.",
    "evidence": "part key of the parts which has an above-average retail price refer to p_partkey where p_retailprice > AVG(p_retailprice);",
    "idx": 5045
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`supplier`:`supplier`)\nRETURN `supplier`.`s_suppkey` AS `s_suppkey`, `supplier`.`s_acctbal` AS `s_acctbal` ORDER BY `s_acctbal` IS NULL ASC, `s_acctbal` DESC \nLIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the supply key of the top ten suppliers with the most account balance, and list the supply key along with the account balance in descending order of account balance.",
    "evidence": "supply key refers to s_suppkey; the most amount account balance refers to MAX(s_acctbal);",
    "idx": 5047
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL(*) {\nMATCH (`customer_sub0`:`customer`)\nRETURN avg(`customer_sub0`.`c_acctbal`) AS `_col_0`  \n}\nMATCH (`t1`:`customer`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`c_nationkey` = `t2`.`n_nationkey`\nAND (`t1`.`c_acctbal` > `_col_0`)\nRETURN `t1`.`c_name` AS `c_name`, `t1`.`c_phone` AS `c_phone` ORDER BY `t1`.`c_name` IS NULL DESC, `t1`.`c_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name and phone number of customers in India who have an above-average account balance.",
    "evidence": "name of customer refers to c_name; phone number of customer refers to c_phone; customers in India who have an above-average account balance refer to n_name = 'INDIA' and c_acctbal > AVG(c_acctbal);",
    "idx": 5049
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`supplier`)-[t2:supplies]->()\nWHERE `t1`.`s_suppkey` = `t2`.`ps_suppkey`\nAND (`t1`.`s_name` = 'Supplier#000000654')\nORDER BY `t2`.`ps_supplycost` IS NULL ASC, `t2`.`ps_supplycost` DESC \nRETURN `t2`.`ps_partkey` AS `ps_partkey`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In the parts supply by Supplier#000000654, list the top five parts with the most supply cost in descending order of supply cost.",
    "evidence": "Supplier#000000654 is the name of the supplier which refers to s_name; parts with the most supply cost refer to ps_partkey where MAX(ps_supplycost);",
    "idx": 5050
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`lineitem`)\nMATCH ()-[t1_sub0:supplies]->(`t3_sub0`:`part`)\nWHERE `t1_sub0`.`ps_suppkey` = `t2_sub0`.`l_suppkey`\nAND `t1_sub0`.`ps_partkey` = `t3_sub0`.`p_partkey`\nRETURN `t3_sub0`.`p_name` AS `p_name`, `t2_sub0`.`l_extendedprice` * (1 - `t2_sub0`.`l_discount`) - `t1_sub0`.`ps_supplycost` * `t2_sub0`.`l_quantity` AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `p_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the part which is most profitable.",
    "evidence": "profit can be calculated as SUBTRACT(MULTIPLY(l_extendedprice, (SUBTRACT(1, l_discount)), MULTIPLY(ps_supplycost, l_quantity))); part which is most profitable refers to p_name where MAX(profit);",
    "idx": 5052
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->()\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nORDER BY `t2`.`ps_availqty` IS NULL ASC, `t2`.`ps_availqty` DESC \nRETURN `t1`.`p_name` AS `p_name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of the top ten items with the most quantity available in the descending order of availability.",
    "evidence": "items with the most quantity available refer to p_name where MAX(ps_availqty);",
    "idx": 5054
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t3`:`lineitem`)\nMATCH (`t1`:`part`)-[t2:supplied_by]->()\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND `t2`.`ps_suppkey` = `t3`.`l_suppkey`\nRETURN (CASE WHEN sum(CASE WHEN `t3`.`l_shipmode` = 'SHIP' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t3`.`l_shipmode` = 'SHIP' THEN `t1`.`p_retailprice` ELSE 0 END)) / sum(CASE WHEN `t3`.`l_shipmode` = 'SHIP' THEN 1 ELSE 0 END) END) - (CASE WHEN sum(CASE WHEN `t3`.`l_shipmode` = 'AIR' THEN 1 ELSE 0 END)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t3`.`l_shipmode` = 'AIR' THEN `t1`.`p_retailprice` ELSE 0 END)) / sum(CASE WHEN `t3`.`l_shipmode` = 'AIR' THEN 1 ELSE 0 END) END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference in the average retail price of parts shipped via ship and air.",
    "evidence": "SUBTRACT(DIVIDE(SUM(p_retailprice where l_shipmode = 'SHIP'), COUNT(l_shipmode = 'SHIP')), DIVIDE(SUM(p_retailprice where l_shipmode = 'AIR'), COUNT(l_shipmode = 'AIR')));",
    "idx": 5055
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`lineitem`)-[belongs_to_order_0:belongs_to_order]->(`t1`:`orders`)\nWHERE `t1`.`o_orderkey` = `t2`.`l_orderkey`\nAND (`t1`.`o_orderpriority` = '5-LOW' AND `t2`.`l_shipmode` = 'TRUCK')\nRETURN (CASE WHEN 12=0 THEN NULL ELSE toFloat(sum(CASE WHEN CASE WHEN `t2`.`l_shipdate` is not NULL THEN apoc.temporal.format(`t2`.`l_shipdate`,'yyyy') ELSE NULL END = 1995 THEN 1 ELSE 0 END)) / 12 END) - (CASE WHEN 12=0 THEN NULL ELSE toFloat(sum(CASE WHEN CASE WHEN `t2`.`l_shipdate` is not NULL THEN apoc.temporal.format(`t2`.`l_shipdate`,'yyyy') ELSE NULL END = 1996 THEN 1 ELSE 0 END)) / 12 END) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the difference in the average number of low-priority orders shipped by truck in each month of 1995 and 1996.",
    "evidence": "SUBTRACT(DIVIDE(SUM(l_orderkey where year(l_shipdate) = 1995), 12), DIVIDE(SUM(l_orderkey where year(l_shipdate) = 1996), 12)) where o_orderpriority = '5-LOW';",
    "idx": 5059
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`c_acctbal` < 0\nRETURN `customer`.`c_custkey` AS `c_custkey`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List by their id all customers who have a debit balance in their accounts.",
    "evidence": "customers who have a debt balance refer to c_custkey where c_acctbal < 0;",
    "idx": 5060
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nORDER BY `lineitem`.`l_extendedprice` * (1 - `lineitem`.`l_discount`) IS NULL DESC, `lineitem`.`l_extendedprice` * (1 - `lineitem`.`l_discount`)  \nRETURN `lineitem`.`l_orderkey` AS `l_orderkey`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List by order number the 3 items with the lowest price after applying the discount.",
    "evidence": "order number refers to l_orderkey; the lowest price after applying the discount refers to MIN(MULTIPLY(l_extendedprice), SUBTRACT(1, l_discount));",
    "idx": 5061
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`orders`:`orders`)\nWHERE `orders`.`o_orderpriority` = '1-URGENT'\nWITH `orders`.`o_orderdate` AS _groupby_col_0, COUNT(`orders`.`o_orderkey`) AS _groupby_col_1\nORDER BY _groupby_col_0 IS NULL ASC, _groupby_col_0 DESC \nRETURN _groupby_col_1 AS `_col_0`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Of the orders with a lower delivery priority, how many have an urgent priority order?",
    "evidence": "an urgent priority order refers to o_orderkey where o_orderpriority = '1-URGENT'; earlier orderdate have higher priority in delivery; lower delivery priority refers to MAX(o_orderdate);",
    "idx": 5064
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->()\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND (`t2`.`ps_availqty` < 10)\nORDER BY `t2`.`ps_supplycost` IS NULL DESC, `t2`.`ps_supplycost`  \nRETURN `t1`.`p_name` AS `p_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the name of the product that is close to being sold out and that has the lowest cost price.",
    "evidence": "name of the product refers to p_name; close to being sold out refers to ps_availqty < 10; the lowest cost price refers to min(ps_supplycost)",
    "idx": 5071
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`lineitem`)\nMATCH ()-[t1:supplies]->(`t3`:`part`)\nWHERE `t1`.`ps_suppkey` = `t2`.`l_suppkey`\nAND `t1`.`ps_partkey` = `t3`.`p_partkey`\nAND (`t2`.`l_discount` = 0.0000)\nRETURN `t3`.`p_name` AS `p_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the name of the parts without discount.",
    "evidence": "name of the part refers to p_name; without discount refers to l_discount = 0.0000",
    "idx": 5073
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`lineitem`)\nMATCH ()-[t1:supplies]->(`t3`:`part`)\nWHERE `t1`.`ps_suppkey` = `t2`.`l_suppkey`\nAND `t1`.`ps_partkey` = `t3`.`p_partkey`\nAND (`t3`.`p_type` = 'PROMO BRUSHED STEEL')\nRETURN CASE WHEN COUNT(`t1`.`ps_partkey`)=0 THEN NULL ELSE sum(`t2`.`l_extendedprice` * (1 - `t2`.`l_discount`) - `t1`.`ps_supplycost` * `t2`.`l_quantity`) / COUNT(`t1`.`ps_partkey`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average profit of prom brushed steel products.",
    "evidence": "prom brushed steel refers to p_type = 'PROMO BRUSHED STEEL'; average profit = divide(sum(subtract(multiply(l_extendedprice, subtract(1, l_discount)), multiply(ps_supplycost, l_quantity))), count(ps_partkey))",
    "idx": 5076
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`c_custkey` = 3\nRETURN `customer`.`c_mktsegment` AS `c_mktsegment`, `customer`.`c_name` AS `c_name`, `customer`.`c_address` AS `c_address`, `customer`.`c_phone` AS `c_phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please state the segment, the name, the address, and the phone number of customer number 3.",
    "evidence": "segment refers to c_mktsegment; name refers to c_name; address refers to c_address; phone number refers to c_phone; customer number 3 refers to c_custkey = 3",
    "idx": 5078
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`lineitem`:`lineitem`)\nWHERE `lineitem`.`l_discount` = 0.1\nRETURN `lineitem`.`l_linenumber` AS `l_linenumber`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any three line item numbers that have 10% off.",
    "evidence": "line item number refers to l_linenumber; 10% off refers to l_discount = 0.1",
    "idx": 5079
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`orders`:`orders`)\nWHERE CASE WHEN `orders`.`o_orderdate` is not NULL THEN apoc.temporal.format(`orders`.`o_orderdate`,'yyyy') ELSE NULL END = '1998' AND `orders`.`o_totalprice` < 950\nRETURN COUNT(`orders`.`o_orderkey`) AS `countorders`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders in 1998 had a total price under 950?",
    "evidence": "1998 refers to year(o_orderdate) = '1998'; a total price under 950 refers to o_totalprice < 950",
    "idx": 5082
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`c_acctbal` < 0\nRETURN `customer`.`c_name` AS `c_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any three customers with debt.",
    "evidence": "customer refers to c_name; with debt refers to c_acctbal < 0",
    "idx": 5083
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->()\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND (`t2`.`ps_availqty` > 9998)\nRETURN `t1`.`p_name` AS `p_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please name any three parts that have an available quantity of more than 9998.",
    "evidence": "part name refers to p_name; an available quantity of more than 9998 refers to ps_availqty > 9998",
    "idx": 5087
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->()\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND (`t2`.`ps_supplycost` < 10 AND `t1`.`p_container` = 'WRAP BAG')\nRETURN `t1`.`p_name` AS `p_name`  LIMIT 2",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list any two parts that come with the wrap bag container and have a supply cost of under 10.",
    "evidence": "part name refers to p_name; wrap bag container refers to p_container = 'WRAP BAG'; supply cost of under 10 refers to ps_supplycost < 10",
    "idx": 5088
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`nation`)-[in_region_1:in_region]->(`t1_sub0`:`region`)\nWHERE `t1_sub0`.`r_regionkey` = `t2_sub0`.`n_regionkey`\nWITH `t1_sub0`.`r_name` AS _groupby_col_0, COUNT(`t2_sub0`.`n_name`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `r_name`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL DESC, `num`  \nRETURN `r_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which region has the lowest number of countries?",
    "evidence": "region refers to has r_name; the lowest number of countries refers to min(count(n_name))",
    "idx": 5091
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`orders`:`orders`)\nWHERE `orders`.`o_orderpriority` = '1-URGENT'\nRETURN `orders`.`o_orderdate` AS `o_orderdate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the dates of the urgent orders.",
    "evidence": "date refers to o_orderdate; urgent order refers to o_orderpriority = '1-URGENT'",
    "idx": 5097
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t2`:`nation`)-[in_region_0:in_region]->(`t1`:`region`)\nWHERE `t1`.`r_regionkey` = `t2`.`n_regionkey`\nAND (`t1`.`r_name` = 'EUROPE')\nRETURN `t2`.`n_name` AS `n_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the nations in Europe.",
    "evidence": "nation refers to n_name; Europe refers to r_name = 'EUROPE'",
    "idx": 5101
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`part`)-[t2:supplied_by]->()\nWHERE `t1`.`p_partkey` = `t2`.`ps_partkey`\nAND (`t1`.`p_name` = 'violet olive rose ivory sandy')\nRETURN `t2`.`ps_supplycost` AS `ps_supplycost`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the supply cost for the part \"violet olive rose ivory sandy\"?",
    "evidence": "supply cost refers to ps_supplycost; part \"violet olive rose ivory sandy\" refers to p_name = 'violet olive rose ivory sandy'",
    "idx": 5102
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`customer`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`c_nationkey` = `t2`.`n_nationkey`\nAND (`t2`.`n_name` = 'Ethiopia')\nRETURN `t1`.`c_phone` AS `c_phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the customers' phone numbers from Ethiopia.",
    "evidence": "phone number refers to c_phone; Ethiopia refers to n_name = 'Ethiopia'",
    "idx": 5103
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t2`.`c_phone` = '627-220-3983')\nRETURN sum(`t1`.`o_totalprice`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total price of all orders from the customer with the phone number \"627-220-3983\"?",
    "evidence": "total price = sum(o_totalprice); phone number \"627-220-3983\" refers to c_phone = '627-220-3983'",
    "idx": 5104
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`supplier`)-[located_in_0:located_in]->(`t2`:`nation`)\nWHERE `t1`.`s_nationkey` = `t2`.`n_nationkey`\nAND (`t1`.`s_acctbal` = 4393.04)\nRETURN `t2`.`n_name` AS `n_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which nation does the supplier with the account balance of \"4393.04\" belong to?",
    "evidence": "nation refers to n_name; account balance of \"4393.04\" refers to s_acctbal = 4393.04",
    "idx": 5106
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`customer`)-[located_in_1:located_in]->(`t1_sub0`:`nation`)-[in_region_1:in_region]->(`t3_sub0`:`region`)\nWHERE `t1_sub0`.`n_nationkey` = `t2_sub0`.`c_nationkey`\nAND `t1_sub0`.`n_regionkey` = `t3_sub0`.`r_regionkey`\nWITH `t3_sub0`.`r_name` AS _groupby_col_0, COUNT(`t2_sub0`.`c_custkey`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `r_name`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `r_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the region with the most customers?",
    "evidence": "region refers to r_name; the most customers refers to max(count(c_custkey))",
    "idx": 5107
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`t1`:`orders`)-[placed_by_0:placed_by]->(`t2`:`customer`)\nWHERE `t1`.`o_custkey` = `t2`.`c_custkey`\nAND (`t1`.`o_totalprice` > 300000)\nRETURN `t2`.`c_phone` AS `c_phone`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the phone number of the customer who placed orders with a total price of more than $300,000.",
    "evidence": "phone number refers to c_phone; a total price of more than $300,000 refers to o_totalprice > 300000",
    "idx": 5108
  },
  {
    "filename": "train.json",
    "db_id": "retails",
    "gql_statement": "MATCH (`orders`:`orders`)\nWHERE `orders`.`o_orderkey` = 32\nRETURN `orders`.`o_totalprice` AS `o_totalprice`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate the total price of order key 32.",
    "evidence": "total price refers to o_totalprice; order key 32 refers to o_orderkey = 32",
    "idx": 5113
  }
]