[
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "CALL {\nMATCH (longest_absense_from_school_sub0@`longest_absense_from_school`)\nRETURN MAX(longest_absense_from_school_sub0.`month`) AS `_col_0` \n}\nMATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` = _col_0\nRETURN longest_absense_from_school.`name` AS `name`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the name of the student with the longest duration of absence?",
    "evidence": "longest duration of absence refers to MAX(month);",
    "idx": 2390
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (longest_absense_from_school@`longest_absense_from_school`)\nWHERE longest_absense_from_school.`month` < 3\nRETURN COUNT(longest_absense_from_school.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many students have absences of no more than 3 months?",
    "evidence": "absences of no more than 3 months refers to month < 3;",
    "idx": 2391
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t2@`unemployed`)\nMATCH (t1@`no_payment_due`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`bool` = 'pos')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students that have a payment due, how many students are unemployed?",
    "evidence": "students that have a payment due refers to bool = 'pos';",
    "idx": 2392
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`enlist`)-[has_person_2_0:`has_person_2`]->(t2@`person`)\nOPTIONAL MATCH (t3@`male`)-[has_person_5_0:`has_person_5`]->(t2@`person`)\nWHERE t1.`name` = t2.`name`\nAND (t1.`organ` = 'army') AND t2.`name` = t3.`name`\nRETURN sum(CASE WHEN t3.`name` IS NULL THEN 1 ELSE 0 END) AS `result`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many female students have enlisted for the Army?",
    "evidence": "female students refers to enlist.name who are NOT in male.name; Army refers to organ = 'army';",
    "idx": 2393
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`disabled`)\nMATCH (t2@`longest_absense_from_school`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`month` = 0)\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many disabled students have zero absences?",
    "evidence": "zero absences refers to month = 0;",
    "idx": 2394
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`unemployed`)\nMATCH (t2@`disabled`)\nWHERE t1.`name` = t2.`name`\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many of the unemployed students are disabled?",
    "evidence": "",
    "idx": 2395
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`filed_for_bankrupcy`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nAND (t2.`organ` = 'marines')\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many bankrupt students are there in the Marines?",
    "evidence": "Marines refers to organ = 'marines';",
    "idx": 2397
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`disabled`)\nMATCH (t2@`filed_for_bankrupcy`)\nWHERE t1.`name` = t2.`name`\nRETURN COUNT(t1.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the students who filed for bankruptcy, how many students are disabled?",
    "evidence": "",
    "idx": 2398
  },
  {
    "filename": "train.json",
    "db_id": "student_loan",
    "gql_statement": "MATCH (t1@`longest_absense_from_school`)\nMATCH (t2@`enlist`)\nWHERE t1.`name` = t2.`name`\nORDER BY t1.`month` DESC NULLS LAST \nRETURN t1.`month` AS `month` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many months did a student in the Air Force miss school the most?",
    "evidence": "Air Force refers to organ = 'air_force'; number of months a student miss school the most refers to MAX(COUNT(month));",
    "idx": 2399
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (answer@`answer`)\nWHERE answer.`questionid` = 13 AND answer.`surveyid` >= 2016 AND answer.`surveyid` <= 2019\nRETURN answer.`surveyid` AS `surveyid`, COUNT(answer.`userid`) AS `_col_1` \nGROUP BY surveyid",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From 2016 to 2019, how many users each year were asked the question 13?",
    "evidence": "From 2016 to 2019 refer to SurveyID 2016 BETWEEN 2019; Question 13 refer to QuestionID",
    "idx": 2401
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t1.`surveyid` = 2018 AND t2.`questionid` = 1 AND t1.`answertext` >= '27' AND t1.`answertext` <= '35')\nRETURN t1.`userid` AS `userid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users, between the age 27 to 35, were surveyed in 2018?",
    "evidence": "Age 27 to 35 refer to AnswerText 27 BETWEEN 35 where questionid = 1; 2018 refer to SurveyID\n\n",
    "idx": 2402
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t2.`questionid` = 54 AND like(t1.`answertext`,'Yes'))\nRETURN COUNT(t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users believed that their productivity is ever affected by a mental health issue overall?",
    "evidence": "Users who believed that their productivity is affected by a mental health issues overall refers to AnswerText = 'Yes' where questionid = 54",
    "idx": 2403
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t2.`questionid` = 12)\nRETURN cast (sum(CASE  WHEN like(t1.`answertext`,'Yes') THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the percentage of the the users who would bring up a mental health issue with a potential employer in an interview?",
    "evidence": "Percentage = DIVIDE(SUM(AnswerText = 'Yes' Or AnswerText = 'Maybe'), COUNT(QuestionID = 12))* 100",
    "idx": 2404
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`question`)\nMATCH (t2@`answer`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t1.`questiontext` = 'What is your age?' AND t2.`surveyid` = 2014)\nORDER BY t2.`answertext` DESC NULLS LAST \nRETURN t2.`answertext` AS `answertext` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the oldest age of the users in 2014's survey?",
    "evidence": "what is your age? refer to QuestionText; 2014 refer to SurveyID; oldest age refers to MAX(AnswerText)\n\n",
    "idx": 2405
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`question`)\nMATCH (t2@`answer`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t1.`questiontext` = 'Do you think that discussing a physical health issue with your employer would have negative consequences?' AND like(t2.`answertext`,'Yes') AND t2.`surveyid` = 2014)\nRETURN t2.`userid` AS `userid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Please list the IDs of the users who answered \"Yes\" to the question \"Do you think that discussing a physical health issue with your employer would have negative consequences?\" in 2014's survey.",
    "evidence": "2014 refer to SurveyID; Question refer to questiontext; yes refer to AnswerText = 'Yes'\n\n",
    "idx": 2407
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t2@`survey`)\nMATCH (t1@`answer`)\nWHERE t1.`surveyid` = t2.`surveyid`\nAND (t2.`description` = 'mental health survey for 2014')\nRETURN COUNT(DISTINCT t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users participated in the mental health survey for 2014?",
    "evidence": "mental health survey for 2014 refers to SurveyID = 2014",
    "idx": 2408
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`question`)\nMATCH (t2@`answer`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t2.`surveyid` = 2018 AND t1.`questiontext` = 'What country do you live in?' AND t2.`answertext` = 'Canada')\nRETURN COUNT(t2.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users lived in Canada according to 2018's survey?",
    "evidence": "lived in Canada refers to AnswerText(QuestionID(3)) = 'Canada'",
    "idx": 2409
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`question`)\nMATCH (t2@`answer`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t2.`surveyid` = 2016 AND like(t1.`questiontext`,'Have you had a mental health disorder in the past?') AND t2.`answertext` = 'Yes')\nRETURN COUNT(t2.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "According to 2016's survey, what is the number of users with a mental health disorder in the past?",
    "evidence": "users with a mental health disorder in the past refers to AnswerText(QuestionID(32)) = 'Yes'",
    "idx": 2410
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`question`)\nMATCH (t2@`answer`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t2.`surveyid` IN [2016, 2017, 2018] AND like(t1.`questiontext`,'Have you had a mental health disorder in the past?') AND t2.`answertext` = 'Yes')\nRETURN COUNT(t2.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users answered \"Yes\" to the question \"Have you had a mental health disorder in the past?\" in 3 consecutive years starting from 2016?",
    "evidence": "question refers to questiontext; answered 'Yes' to question refers to AnswerText = 'Yes'; 3 consecutive years starting from 2016 refers to SurveyID = 2016 and SurveyID = 2017 and SurveyID = 2018",
    "idx": 2411
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (question@`question`)\nWHERE like(question.`questiontext`,'Would you bring up a physical health issue with a potential employer in an interview?')\nRETURN question.`questionid` AS `questionid`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Tell the question ID for \"Would you bring up a physical health issue with a potential employer in an interview?\".",
    "evidence": "",
    "idx": 2412
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (answer@`answer`)\nWHERE answer.`questionid` = 20\nRETURN MAX(answer.`userid`) - min(answer.`userid`) + 1 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users answered the question No.20?",
    "evidence": "question No.20 refers to QuestionID = 20",
    "idx": 2413
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (answer@`answer`)\nWHERE answer.`userid` = 5\nRETURN COUNT(answer.`questionid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many questions did user No.5 answer?",
    "evidence": "user No.5 refers to userID = 5",
    "idx": 2414
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t2.`questiontext` = 'Do you currently have a mental health disorder?' AND t1.`userid` = 2681)\nRETURN t1.`answertext` AS `answertext`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What answer did user No. 2681 give to the question \"Do you currently have a mental health disorder?\"?",
    "evidence": "question refers to questiontext; user No. 2681 refers to UserID = 2681\n\n",
    "idx": 2416
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (like(t2.`questiontext`,'Have you ever been diagnosed with a mental health disorder?') AND t1.`answertext` = 'Yes')\nRETURN COUNT(t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For all the users who have been asked \"Have you ever been diagnosed with a mental health disorder?\", how many of them said \"Yes\"?",
    "evidence": "have asked refers to questiontext; said 'Yes' refers to AnswerText = 'Yes'",
    "idx": 2421
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (like(t2.`questiontext`,'Overall, how much importance does your employer place on physical health?'))\nRETURN COUNT(t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many users answered the question \"Overall, how much importance does your employer place on physical health?\"?",
    "evidence": "question refers to questiontext",
    "idx": 2423
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (like(t2.`questiontext`,'Has your employer ever formally discussed mental health (for example, as part of a wellness campaign or other official communication)?'))\nRETURN cast (sum(CASE  WHEN like(t1.`answertext`,'Yes') THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What was the percentage for the answer of \"Yes\" was given to the question \"Has your employer ever formally discussed mental health (for example, as part of a wellness campaign or other official communication)?\"?",
    "evidence": "percentage = divide(count(QuestionID = 15& AnswerText = 'Yes'), count(QuestionID = 15))*100%",
    "idx": 2425
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t1.`questionid` = 32 AND t1.`surveyid` = 2016)\nRETURN cast (sum(CASE  WHEN like(t1.`answertext`,'Yes') THEN 1 ELSE 0 END) as float) * 100 / COUNT(t1.`surveyid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among respondents who participated in the survey in 2016, what percentage had a mental health disorder in the past?",
    "evidence": "respondents and 'users' are synonyms; percentage = divide(count(SurveyID = 2016& QuestionID = 32 & AnswerText = 'Yes'), count(SurveyID = 2016& QuestionID = 32))*100%",
    "idx": 2426
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t1.`questionid` = 1 AND t1.`surveyid` = 2016 AND t1.`answertext` <= '25')\nRETURN COUNT(DISTINCT t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many respondents younger than 25 years old did participate in the survey in 2016?",
    "evidence": "respondents' and 'users' are synonyms; younger than 25 years old refers to AnswerText(SurveyID = 2016& QuestionID = 1)< 25",
    "idx": 2427
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (answer@`answer`)\nWHERE answer.`surveyid` >= 2014 AND answer.`surveyid` <= 2019\nRETURN cast (COUNT(answer.`surveyid`) as float) / 5 AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the average number of respondents per survey between 2014 and 2019?",
    "evidence": "respondents and 'users' are synonyms; average number = avg(count(userID(SurveyID = 2014)), count(userID(SurveyID = 2019)))",
    "idx": 2428
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t1.`questionid` = 7 AND t1.`surveyid` = 2019 AND t1.`answertext` = '1')\nRETURN COUNT(t1.`userid`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many respondents who participated in the survey in 2019 have ever sought treatment for a mental health disorder from a mental health professional?",
    "evidence": "respondents' and 'users' are synonyms, have ever sought treatment for a mental health disorder from a mental health professional refers to AnswerText(SurveyID = 2019& QuestionID = 7) = 1",
    "idx": 2429
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (t1@`answer`)\nMATCH (t2@`question`)\nWHERE t1.`questionid` = t2.`questionid`\nAND (t1.`questionid` = 93 AND t1.`surveyid` = 2014 AND t1.`answertext` = 'Yes')\nRETURN COUNT(t1.`answertext`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many respondents who participated in the survey in 2014 work remotely at least 50% of the time?",
    "evidence": "respondents' and 'users' are synonyms; work remotely at least 50% of the time refers to AnswerText(SurveyID = 2014& QuestionID = 93) = 'Yes'",
    "idx": 2430
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (question@`question`)\nRETURN COUNT(question.`questiontext`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many questions were asked in the questionary for the mental health survey?",
    "evidence": "",
    "idx": 2431
  },
  {
    "filename": "train.json",
    "db_id": "mental_health_survey",
    "gql_statement": "MATCH (answer@`answer`)\nWHERE like(answer.`answertext`,'Substance Use Disorder')\nRETURN COUNT(answer.`answertext`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many respondents of the mental health survey were diagnosed with 'Substance Use Disorder'?",
    "evidence": "respondents' and 'users' are synonyms",
    "idx": 2432
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (revenue@`revenue`)\nRETURN sum(CASE  WHEN revenue.`year` = 1998 THEN revenue.`total` ELSE 0 END) - sum(CASE  WHEN revenue.`year` = 1997 THEN revenue.`total` ELSE 0 END) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much more total box office gross did the Walt Disney Company have in revenue in 1998 than in 1997?",
    "evidence": "SUBTRACT(SUM(Year = 1998), SUM(Year = 1997))",
    "idx": 2433
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (revenue@`revenue`)\nWHERE revenue.`year` = 1998\nRETURN CASE  WHEN 'Studio Entertainment[NI 1]' > 'Disney Media Networks' THEN 'Studio Entertainment[NI 1]' ELSE 'Disney Media Networks' END AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which segment did the Walt Disney Company earned a bigger revenue in 1998, Studio Entertainment or Disney Media Networks?",
    "evidence": "Studio Entertainment[NI 1]' > 'Disney Media Networks' where Year = 1998;",
    "idx": 2434
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (director@`director`)\nWHERE director.`name` = 'Pinocchio'\nRETURN director.`director` AS `director`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the director of the movie Pinocchio?",
    "evidence": "Pinocchio is the name of the movie;",
    "idx": 2435
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`director`)-[directed_0:`directed`]->(t1@`characters`)\nWHERE t1.`movie_title` = t2.`name`\nAND (t1.`song` = 'Once Upon a Dream')\nRETURN t2.`director` AS `director`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "The song \"Once Upon a Dream\" is associated with the movie directed by whom?",
    "evidence": "directed by whom refers to director; movie refers to movie_title;",
    "idx": 2437
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`movies_total_gross`)\nMATCH (t1@`director`)\nWHERE t1.`name` = t2.`movie_title`\nAND (t1.`director` = 'Wolfgang Reitherman')\nORDER BY t2.`total_gross` DESC NULLS LAST \nRETURN t2.`movie_title` AS `movie_title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the movies directed by Wolfgang Reitherman, which one of them was the most popular?",
    "evidence": "directed by Wolfgang Reitherman refers to director = 'Wolfgang Reitherman'; the most popular movie refers to MAX(total_gross);",
    "idx": 2439
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t1@`movies_total_gross`)-[gross_info_for_0:`gross_info_for`]->(t2@`characters`)\nWHERE t1.`movie_title` = t2.`movie_title`\nORDER BY t1.`total_gross` DESC NULLS LAST \nRETURN t2.`villian` AS `villian` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which character is the villain of the most popular movie?",
    "evidence": "the most popular movie refers to movie_title where MAX(total_gross);",
    "idx": 2441
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`movies_total_gross`)-[gross_info_for_0:`gross_info_for`]->(t1@`characters`)\nWHERE t2.`movie_title` = t1.`movie_title`\nAND (t1.`villian` = 'Commander Rourke')\nRETURN t2.`genre` AS `genre`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the genre of the movie whose villain is Commander Rourke?",
    "evidence": "FALSE;",
    "idx": 2442
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (characters@`characters`)\nWHERE characters.`hero` = 'Robin Hood'\nRETURN characters.`movie_title` AS `movie_title`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which movie is the character Robin Hood in?",
    "evidence": "Robin Hood is the main character of the movie which refers to hero = 'Robin Hood'; movie refers to movie_title;",
    "idx": 2444
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`movies_total_gross`)-[gross_info_for_0:`gross_info_for`]->(t1@`characters`)\nWHERE t2.`movie_title` = t1.`movie_title`\nAND (t2.`total_gross` = '$222,527,828')\nRETURN t1.`hero` AS `hero`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the hero character of the movie whose total gross was $222,527,828?",
    "evidence": "FALSE;",
    "idx": 2447
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`director`)-[directed_0:`directed`]->(t1@`characters`)\nWHERE t2.`name` = t1.`movie_title`\nAND (t2.`director` = 'Will Finn')\nRETURN t1.`hero` AS `hero`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the hero character of the Disney movie directed by Will Finn?",
    "evidence": "Will Finn refers to director = 'Will Finn';",
    "idx": 2448
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`voice-actors`)-[voiced_in_0:`voiced_in`]->(t1@`characters`)\nWHERE t2.`movie` = t1.`movie_title`\nAND (t1.`movie_title` = 'The Little Mermaid' AND t2.`character` = t1.`hero`)\nRETURN t2.`voice-actor` AS `voice-actor`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the voice actor of the hero character from the movie The Little Mermaid?",
    "evidence": "The Little Mermaid refers to movie_title = 'The Little Mermaid';",
    "idx": 2449
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`voice-actors`)-[voiced_in_0:`voiced_in`]->(t1@`characters`)\nWHERE t2.`movie` = t1.`movie_title`\nAND (t2.`character` = 'Hyacinth Hippo' AND t2.`voice-actor` = 'Tress MacNeille')\nRETURN t1.`release_date` AS `release_date`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "For the movie in which Tress MacNeille was the voice actor for its character \"Hyacinth Hippo\", what was the release date of that movie?",
    "evidence": "FALSE;",
    "idx": 2451
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t1@`director`)\nMATCH (t2@`movies_total_gross`)\nWHERE t2.`movie_title` = t1.`name`\nAND (t2.`genre` = 'Adventure' AND t2.`release_date` = 'Mar 30, 2007')\nRETURN t1.`director` AS `director`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the director of the adventure movie which was released on 2007/3/30?",
    "evidence": "released on 2007/3/30 refers to release_date = 'Mar 30, 2007'; adventure movie refers to genre = 'Adventure' ;",
    "idx": 2452
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`movies_total_gross`)-[gross_info_for_0:`gross_info_for`]->(t1@`characters`)\nWHERE t2.`movie_title` = t1.`movie_title`\nAND (t2.`genre` = 'Adventure' AND t1.`release_date` = '4-Mar-16')\nRETURN t1.`hero` AS `hero`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who is the hero character of the adventure movie which was released on 2016/3/4?",
    "evidence": "released on 2016/3/4 refers to release_date = '4-Mar-16'; adventure movie refers to genre = 'Adventure' ;",
    "idx": 2453
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (director@`director`)\nWHERE director.`director` = 'Wolfgang Reitherman'\nRETURN COUNT(director.`name`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many movies did Wolfgang Reitherman direct?",
    "evidence": "Wolfgang Reitherman refers director = 'Wolfgang Reitherman';",
    "idx": 2454
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (voice_actors@`voice-actors`)\nWHERE 'voice-actor' = 'Frank Welker'\nRETURN voice_actors.`character` AS `character`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the names of the characters voiced by Frank Welker?",
    "evidence": "Frank Welker refers to voice-actor = 'Frank Welker';",
    "idx": 2455
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t1@`movies_total_gross`)-[gross_info_for_0:`gross_info_for`]->(t2@`characters`)\nWHERE t2.`movie_title` = t1.`movie_title`\nAND (t2.`villian` = 'Turbo')\nRETURN t1.`mpaa_rating` AS `mpaa_rating`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the Motion Picture Association of America rating for the movie featuring a villain named Turbo?",
    "evidence": "The Motion Picture Association of America rating refers to MPAA_rating; villian = 'Turbo';",
    "idx": 2457
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`movies_total_gross`)\nMATCH (t1@`director`)\nWHERE t1.`name` = t2.`movie_title`\nAND (t1.`director` = 'Ron Clements' AND t2.`mpaa_rating` = 'PG' AND t2.`genre` = 'Adventure')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many PG adventure movies did Ron Clements direct?",
    "evidence": "Ron Clements refers to director = 'Ron Clements'; PG is an abbreviation for parental guidance and refers to MPAA_rating = 'PG'; adventure movie refers to genre = 'Adventure';",
    "idx": 2458
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (director@`director`)\nRETURN director.`director` AS `director`, COUNT(director.`name`) AS `_col_1` \nGROUP BY director\nORDER BY _col_1 DESC NULLS LAST \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which director has made the most movies?",
    "evidence": "the most movies refers to MAX(COUNT(name));",
    "idx": 2462
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (revenue@`revenue`)\nWHERE revenue.`year` >= 2000 AND revenue.`year` <= 2010\nORDER BY revenue.`studio entertainment[ni 1]` DESC NULLS LAST \nRETURN revenue.`year` AS `year` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "From 2000 to 2010, in which year did the studio entertainment segment make the most revenue?",
    "evidence": "From 2000 to 2010 refers to Year between 2000 and 2010; the most revenue refers to MAX(\"Studio Entertainment[NI 1]\");",
    "idx": 2463
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t1@`characters`)-[has_hero_0:`has_hero`]->(t2@`voice-actors`)\nWHERE t2.`character` = t1.`hero`\nAND (t2.`movie` = t1.`movie_title`)\nRETURN t2.`voice-actor` AS `voice-actor`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who are the voice actors for all the heroes?",
    "evidence": "FALSE;",
    "idx": 2464
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`voice-actors`)\nMATCH (t1@`movies_total_gross`)\nWHERE t1.`movie_title` = t2.`movie`\nAND (t1.`mpaa_rating` = 'PG')\nRETURN DISTINCT t2.`character` AS `character`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the characters in the PG movies?",
    "evidence": "PG is an abbreviation for parental guidance and refers to MPAA_rating = 'PG';",
    "idx": 2467
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`director`)\nMATCH (t1@`voice-actors`)\nWHERE t1.`movie` = t2.`name`\nRETURN t2.`director` AS `director`, COUNT(DISTINCT t1.`voice-actor`) AS `_col_1` \nGROUP BY director\nORDER BY _col_1 DESC NULLS LAST \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who directed the movie with the most voice actors?",
    "evidence": "who directed refers director;",
    "idx": 2468
  },
  {
    "filename": "train.json",
    "db_id": "disney",
    "gql_statement": "MATCH (t2@`voice-actors`)\nMATCH (t1@`movies_total_gross`)\nWHERE t1.`movie_title` = t2.`movie`\nAND (t1.`release_date` = 'Nov 24, 2010')\nRETURN t2.`voice-actor` AS `voice-actor`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Who are the voice actors in the movie that came out on 11/24/2010?",
    "evidence": "Came out on 11/24/2010 refers to release_date = 'Nov 24, 2010';",
    "idx": 2469
  }
]