[
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nMATCH (t3@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND t3.`ingredient_id` = t2.`ingredient_id`\nAND (t3.`category` = 'dairy' AND t1.`servings` > 10)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many dairy recipes can serve more than 10 people?",
    "evidence": "dairy recipes refers to category = 'dairy'; serve more than 10 people refers to servings > 10",
    "idx": 4366
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[has_nutrition_0:`has_nutrition`]->(t2@`nutrition`)\nWHERE t1.`recipe_id` = t2.`recipe_id`\nORDER BY t2.`calories` DESC NULLS LAST \nRETURN t1.`title` AS `title` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which recipe has the highest calories?",
    "evidence": "the highest calories refers to MAX(calories)",
    "idx": 4368
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t3@`nutrition`)\nMATCH ()-[t2:`uses`]->(t1@`ingredient`)\nWHERE t2.`ingredient_id` = t1.`ingredient_id`\nAND t3.`recipe_id` = t2.`recipe_id`\nAND (NOT like(t1.`category`,'%dairy%'))\nRETURN COUNT(t2.`recipe_id`) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many recipes are non-dairy?",
    "evidence": "non-dairy refers to category NOT LIKE '%dairy\"",
    "idx": 4369
  },
  {
    "filename": "train.json",
    "db_id": "cookbook",
    "gql_statement": "MATCH (t1@`recipe`)-[t2:`uses`]->()\nMATCH (t3@`ingredient`)-[t2:`used_in`]->()\nWHERE t1.`recipe_id` = t2.`recipe_id`\nAND t3.`ingredient_id` = t2.`ingredient_id`\nORDER BY t1.`cook_min` DESC NULLS LAST \nRETURN t3.`name` AS `name` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What ingredients does the longest cooking time recipe have?",
    "evidence": "the longest cooking time refers to MAX(cook_min)",
    "idx": 4372
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (employee@`employee`)\nWHERE employee.`performance` = 'Good'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many emplyees have a good job performance?",
    "evidence": "good job performance refers to performance = 'Good'",
    "idx": 4375
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (position@`position`)\nWHERE position.`positiontitle` = 'Regional Manager'\nRETURN position.`educationrequired` AS `educationrequired`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the required education for the position of regional manager?",
    "evidence": "required education refers to educationrequired; position of regional manager refers to  positiontitle = 'Regional Manager'",
    "idx": 4376
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (position@`position`)\nWHERE position.`positiontitle` = 'Account Representative' OR position.`positiontitle` = 'Trainee'\nORDER BY position.`minsalary`  NULLS FIRST \nRETURN position.`positiontitle` AS `positiontitle` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which position has a lower minimum salary, Account Representative or Trainee?",
    "evidence": "position of Account Representative refers to positiontitle = 'Account Representative'; position of Trainee refers to positiontitle = 'Trainee'; lower minimum salary refers to MIN(minsalary)",
    "idx": 4377
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[works_at_0:`works_at`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`lastname` = 'Adams' AND t1.`firstname` = 'Sandy')\nRETURN t2.`locationcity` AS `locationcity`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which city's office does Sandy Adams work at?",
    "evidence": "Sandy Adams is the fullname of an employee; full name = firstname, lastname; city refers to locationcity",
    "idx": 4378
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[works_at_0:`works_at`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t2.`state` = 'NY' AND t1.`performance` = 'Good')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the employees working at the office in New York, how many of them have a good job performance?",
    "evidence": "Sandy Adams is the fullname of an employee; full name = firstname, lastname; New York refers to state = 'NY'; good job performance refers to performance = 'Good';",
    "idx": 4379
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[works_at_0:`works_at`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`lastname` = 'Adams' AND t1.`firstname` = 'Sandy')\nRETURN t2.`officephone` AS `officephone`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the office phone number of the location at which Sandy Adams works?",
    "evidence": "Sandy Adams is the fullname of an employee; full name = firstname, lastname;",
    "idx": 4380
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[works_at_0:`works_at`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t2.`address` = '450 Peachtree Rd' AND t1.`gender` = 'M')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many male employees work at the address 450 Peachtree Rd?",
    "evidence": "male employees refers to gender = 'M'",
    "idx": 4381
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t2@`position`)\nWHERE t1.`positionid` = t2.`positionid`\nAND (t2.`positiontitle` = 'Account Representative')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many employees work as an Account Representative?",
    "evidence": "work as an Account Representative refers to positiontitle = 'Account Representative'",
    "idx": 4382
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[works_at_0:`works_at`]->(t2@`location`)\nMATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t3@`position`)\nWHERE t1.`locationid` = t2.`locationid`\nAND t3.`positionid` = t1.`positionid`\nAND (t3.`positiontitle` = 'Trainee' AND t2.`state` = 'NY')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Among the employees who are Trainees, how many of them work in New York?",
    "evidence": "Trainees is a position title; California refers to state = 'NY'",
    "idx": 4383
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t2@`position`)\nWHERE t1.`positionid` = t2.`positionid`\nAND ((t1.`lastname` = 'Adams' AND t1.`firstname` = 'Sandy') OR (t1.`lastname` = 'Rodriguez' AND t1.`firstname` = 'Jose'))\nORDER BY t2.`educationrequired` DESC NULLS LAST \nRETURN t1.`firstname` AS `firstname`, t1.`lastname` AS `lastname` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which employee's job position requires a higher education level, Jose Rodriguez or Sandy Adams?",
    "evidence": "Jose Rodriguez AND Sandy Adams are the fullname of employee; full name = firstname, lastname; higher education level refers to MAX(educationrequired)",
    "idx": 4385
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[works_at_0:`works_at`]->(t2@`location`)\nWHERE t1.`locationid` = t2.`locationid`\nAND (t1.`firstname` = 'Emily' AND t1.`lastname` = 'Wood')\nRETURN t2.`state` AS `state`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "In which state does Emily Wood work?",
    "evidence": "Emily Wood is the full name of an employee; full name = firstname, lastname;",
    "idx": 4390
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t2@`position`)\nWHERE t1.`positionid` = t2.`positionid`\nAND (t1.`firstname` = 'David' AND t1.`lastname` = 'Whitehead' AND t1.`gender` = 'M')\nRETURN t2.`educationrequired` AS `educationrequired`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the education required for David Whitehead to reach his current position?",
    "evidence": "David Whitehead is the full name of an employee; full name = firstname, lastname",
    "idx": 4391
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[works_at_0:`works_at`]->(t2@`location`)\nMATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t3@`position`)\nWHERE t1.`locationid` = t2.`locationid`\nAND t3.`positionid` = t1.`positionid`\nAND (t3.`positiontitle` = 'Account Representative' AND t2.`locationcity` = 'Chicago' AND t1.`performance` = 'Good')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many \"account representatives\" are there in Chicago with a good performance?",
    "evidence": "account representatives is a position title; Chicago refers to locationcity = 'Chicago'; good performance refers to performance = 'Good'",
    "idx": 4395
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t2@`position`)\nWHERE t1.`positionid` = t2.`positionid`\nAND (t1.`firstname` = 'Kenneth' AND t1.`lastname` = 'Charles')\nRETURN t2.`positiontitle` AS `positiontitle`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is Kenneth Charles's position title?",
    "evidence": "Kenneth Charles is the full name of an employee; full name = firstname, lastname",
    "idx": 4396
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t2@`position`)\nWHERE t1.`positionid` = t2.`positionid`\nAND (t1.`firstname` = 'Tracy' AND t1.`lastname` = 'Coulter')\nRETURN t2.`maxsalary` AS `maxsalary`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What is the max salary for 'Tracy Coulter' if he/she stays on his/her position?",
    "evidence": "Tracy Coulter is the full name of an employee; full name = firstname, lastname",
    "idx": 4398
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (employee@`employee`)\nORDER BY employee.`hiredate`  NULLS FIRST \nRETURN employee.`salary` AS `salary` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the salary of the first ever employee that was hired?",
    "evidence": "first-ever employee that was hired refers to MIN(hiredate)",
    "idx": 4399
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (position@`position`)\nORDER BY position.`educationrequired` DESC NULLS LAST \nRETURN position.`minsalary` AS `minsalary` \nLIMIT 1",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How much is the minimum salary given to the position with the most complex work?",
    "evidence": "most complex work refers to MAX(educationrequired); minimum salary refers to minsalary",
    "idx": 4400
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t2@`position`)\nWHERE t1.`positionid` = t2.`positionid`\nAND (t2.`positiontitle` = 'Regional Manager' AND t1.`gender` = 'M')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many male Regional Managers are there?",
    "evidence": "male refers to gender = 'M'; Regional Managers is a position title",
    "idx": 4401
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[works_at_0:`works_at`]->(t2@`location`)\nMATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t3@`position`)\nWHERE t1.`locationid` = t2.`locationid`\nAND t3.`positionid` = t1.`positionid`\nAND (t3.`positiontitle` = 'Account Representative' AND t1.`performance` = 'Good' AND t2.`state` = 'IL')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "How many Account Representatives are there in Illinois with satisfying performance?",
    "evidence": "Account Representatives is a position title; satisfying performance mostly refers togood performance",
    "idx": 4402
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (location@`location`)\nWHERE location.`zipcode` > 90000\nRETURN location.`locationcity` AS `locationcity`, location.`address` AS `address`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which city and address has zip code of above 90000?",
    "evidence": "zip code of above 90000 refers to zipcode > 90000; city refers to locationcity",
    "idx": 4405
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (position@`position`)\nWHERE position.`educationrequired` = '4 year degree'\nRETURN position.`positiontitle` AS `positiontitle`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "Which positions are suitable with 4 years degree education?",
    "evidence": "4 years degree education refers to educationrequired = '4 year degree'; positions refers to positiontitle",
    "idx": 4406
  },
  {
    "filename": "train.json",
    "db_id": "human_resources",
    "gql_statement": "MATCH (t1@`employee`)-[holds_position_0:`holds_position`]->(t2@`position`)\nWHERE t1.`positionid` = t2.`positionid`\nAND (t1.`firstname` = 'Bill' AND t1.`lastname` = 'Marlin')\nRETURN t2.`maxsalary` AS `maxsalary`, t2.`minsalary` AS `minsalary`, t2.`positiontitle` AS `positiontitle`",
    "gql_dialect": "nebula",
    "source": "bird_train",
    "nl_query": "What are the maximum and minimum salary range and position title of Bill Marlin?",
    "evidence": "Bill Marlin is the full name of an employee; full name = firstname, lastname; maximum salary refers to maxsalary; minimum salary refers to minsalary",
    "idx": 4410
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH ()-[t1:sells]->(`t2`:`titles`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND (CASE WHEN `t1`.`ord_date` is not NULL THEN apoc.temporal.format(`t1`.`ord_date`,'yyyy') ELSE NULL END = '1992')\nORDER BY `t1`.`qty` IS NULL ASC, `t1`.`qty` DESC \nRETURN `t2`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title with the most ordered quantity in year 1992?",
    "evidence": "total quantity refers to qty; most ordered quantity refers to order with the highest quantity where MAX(count(qty)); date refers to ord_date; year 1992 refers to YEAR(ord_date) = 1992",
    "idx": 1
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t2`:`roysched`)-[royalty_schedule_for_0:royalty_schedule_for]->(`t1`:`titles`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND (`t2`.`lorange` = 0 AND `t2`.`royalty` >= 10)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title that have at least 10% royalty without minimum range amount.",
    "evidence": "at least 10% royalty refers to royalty > = 10; minimum range is synonym for low range which refers to lorange; without minimum range amount refers to lorange <> 0",
    "idx": 3
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t2`:`roysched`)-[royalty_schedule_for_0:royalty_schedule_for]->(`t1`:`titles`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND (`t2`.`lorange` > 10000 AND `t2`.`hirange` < 50000 AND `t1`.`title_id` = 'BU2075')\nRETURN `t1`.`title` AS `title`, `t2`.`royalty` AS `royalty`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the title and royalty percentage for title ID BU2075 between 10000 to 50000 range.",
    "evidence": "lorange mean low range; hirange mean high range; range refers to between the low and high range; lorange>10000; hirange<12000",
    "idx": 4
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t2`:`roysched`)-[royalty_schedule_for_0:royalty_schedule_for]->(`t1`:`titles`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nORDER BY `t2`.`royalty` IS NULL ASC, `t2`.`royalty` DESC \nRETURN `t1`.`title` AS `title`, `t2`.`lorange` AS `lorange`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the titles with royalty percentage, which title has the greatest royalty percentage. State it's minimum range to enjoy this royalty percentage.",
    "evidence": "minimum range is synonym for low range which refers to lorange",
    "idx": 5
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (`t2`.`country` = 'USA')\nRETURN `t1`.`title` AS `title`, `t2`.`pub_name` AS `pub_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide a list of titles together with its publisher name for all publishers located in the USA.",
    "evidence": "publisher name refers to pub_name;",
    "idx": 6
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t2`:`roysched`)-[royalty_schedule_for_0:royalty_schedule_for]->(`t1`:`titles`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND (`t2`.`lorange` > 20000 AND `t2`.`hirange` < 20000)\nRETURN MAX(`t1`.`ytd_sales`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the royalty percentage for the most year to date sale title within the 20000 range.",
    "evidence": "most year to date sales refers to MAX(ytd_sales); range limit means high range which refers to hirange; the 20000 range refers to hirange<20000",
    "idx": 7
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (CASE WHEN `t1`.`pubdate` is not NULL THEN apoc.temporal.format(`t1`.`pubdate`,'yyyy') ELSE NULL END = '1991')\nRETURN `t1`.`title` AS `title`, `t1`.`notes` AS `notes`, `t2`.`pub_name` AS `pub_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all titles published in year 1991. Also provide notes details of the title and the publisher's name.",
    "evidence": "publisher name refers to pub_name; publication date refers to pubdate; published in year 1991 refers to YEAR(pubdate) = 1991",
    "idx": 8
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[t2:sold_at]->(`t3`:`stores`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND `t2`.`stor_id` = `t3`.`stor_id`\nAND (`t2`.`qty` > 20 AND `t3`.`state` = 'CA')\nRETURN `t1`.`title` AS `title`, `t2`.`qty` AS `qty`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all titles with sales of quantity more than 20 and store located in the CA state.",
    "evidence": "qty is abbreviation for quantity; sales of quantity more than 20 refers to qty>20; store refers to stor_name",
    "idx": 9
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t2`:`roysched`)-[royalty_schedule_for_0:royalty_schedule_for]->(`t1`:`titles`)-[published_by_0:published_by]->(`t3`:`publishers`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND `t1`.`pub_id` = `t3`.`pub_id`\nAND (`t1`.`title_id` = 'BU2075')\nRETURN `t1`.`title` AS `title`, `t3`.`pub_name` AS `pub_name`, `t2`.`lorange` AS `lorange`, `t2`.`hirange` AS `hirange`, `t2`.`royalty` AS `royalty`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the title and publisher for title ID BU 2075. Provide all the royalty percentage for all ranges.",
    "evidence": "name the publisher refers to pub_name",
    "idx": 10
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (`t1`.`pub_id` = '0877')\nWITH `t2`.`pub_name` AS _groupby_col_0, avg(`t1`.`ytd_sales`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `pub_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the publisher name for publisher ID 877? Calculate its average year to date sales.",
    "evidence": "publisher id refers to pub_id; publisher name refers to pub_name; average year to date sales = AVG(ytd_sales)",
    "idx": 12
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`employee`:`employee`)\nWHERE CASE WHEN `employee`.`hire_date` is not NULL THEN apoc.temporal.format(`employee`.`hire_date`,'yyyy') ELSE NULL END < '1990'\nRETURN `employee`.`fname` AS `fname`, `employee`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all employees who were hired before year 1990.",
    "evidence": "hired before year 1990 refers to YEAR(hire_date)<1990",
    "idx": 13
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`employee`:`employee`)\nORDER BY `employee`.`job_lvl` IS NULL DESC, `employee`.`job_lvl`  \nRETURN `employee`.`fname` AS `fname`, `employee`.`lname` AS `lname`, `employee`.`hire_date` AS `hire_date`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which employee has the lowest job level. State the first name, last name and when he /she was hired.",
    "evidence": "lowest job level refers to MIN(job_lvl)",
    "idx": 14
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`employee`)-[has_job_0:has_job]->(`t2`:`jobs`)\nWHERE `t1`.`job_id` = `t2`.`job_id`\nAND (`t1`.`job_lvl` = `t2`.`max_lvl`)\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all employees who are at the maximum level in their job designation.",
    "evidence": "maximum level in their job designation refers to job_lvl = MAX(max_lvl)",
    "idx": 15
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`employee`)-[has_job_0:has_job]->(`t2`:`jobs`)\nWHERE `t1`.`job_id` = `t2`.`job_id`\nAND (`t2`.`job_desc` = 'Chief Financial Officier')\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`, `t1`.`hire_date` AS `hire_date`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the Chief Executive Officer and when he/she was hired.",
    "evidence": "Chief Financial Offer is a job description which refers to job_desc",
    "idx": 16
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_for_0:works_for]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (`t2`.`country` <> 'USA')\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`, `t2`.`pub_name` AS `pub_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who are the employees working for publisher not located in USA? State the employee's name and publisher name.",
    "evidence": "not located at USA refers to country! = 'USA'",
    "idx": 17
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`employee`)-[works_for_0:works_for]->(`t2`:`publishers`)\nMATCH (`t1`:`employee`)-[has_job_0:has_job]->(`t3`:`jobs`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND `t1`.`job_id` = `t3`.`job_id`\nAND (`t2`.`pub_name` = 'GGG&G')\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`, `t3`.`job_desc` AS `job_desc`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all employees working for publisher 'GGG&G'. State their name and job description.",
    "evidence": "name = fname, lname; job description refers to job_desc; publisher refers pub_name",
    "idx": 18
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nRETURN DISTINCT `t2`.`pub_name` AS `pub_name`, `t1`.`type` AS `type` ORDER BY `t2`.`pub_name` IS NULL DESC, `t2`.`pub_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For each publisher, state the type of titles they published order by the publisher name.",
    "evidence": "publisher name refers to pub_name",
    "idx": 19
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (`t2`.`pub_name` = 'Binnet & Hardley')\nORDER BY `t1`.`price` IS NULL ASC, `t1`.`price` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the title with the highest price published by 'Binnet & Hardley'.",
    "evidence": "published by refers to pub_name",
    "idx": 20
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`employee`)-[has_job_0:has_job]->(`t2`:`jobs`)\nWHERE `t1`.`job_id` = `t2`.`job_id`\nAND (`t1`.`job_lvl` > 200)\nRETURN `t1`.`fname` AS `fname`, `t1`.`lname` AS `lname`, `t2`.`job_desc` AS `job_desc`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among all employees, who have job level greater than 200. State the employee name and job description.",
    "evidence": "job level greater than 200 refers to job_lvl>200; job description refers to job_desc",
    "idx": 21
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[t2:has_author]->(`t3`:`authors`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND `t2`.`au_id` = `t3`.`au_id`\nAND (`t1`.`type` = 'business')\nRETURN `t3`.`au_fname` AS `au_fname`, `t3`.`au_lname` AS `au_lname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all the authors for all business titles.",
    "evidence": "business title refers to title under business where type = 'business'",
    "idx": 22
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[t2:has_author]->(`t3`:`authors`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND `t2`.`au_id` = `t3`.`au_id`\nAND (`t3`.`contract` = '0')\nRETURN `t1`.`title_id` AS `title_id`, `t1`.`ytd_sales` AS `ytd_sales`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the titles and year to date sales by author who are not on contract.",
    "evidence": "year to date sales refers to ytd_sales; not on contract refers to contract = 0",
    "idx": 23
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[t2:has_author]->(`t3`:`authors`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND `t2`.`au_id` = `t3`.`au_id`\nAND (`t3`.`contract` = '0' AND `t3`.`state` = 'CA')\nORDER BY `t1`.`ytd_sales` IS NULL ASC, `t1`.`ytd_sales` DESC \nRETURN `t1`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all authors from CA who are not on contract, which title of his/hers has the most year to date sales.",
    "evidence": "year to date sales refers to ytd_sales; on contract refers to contract = 1",
    "idx": 24
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[t2:has_author]->(`t3`:`authors`)\nWHERE `t1`.`title_id` = `t2`.`title_id`\nAND `t2`.`au_id` = `t3`.`au_id`\nAND (`t1`.`title` = 'Sushi, Anyone?')\nRETURN `t3`.`au_fname` AS `au_fname`, `t3`.`au_lname` AS `au_lname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all the authors for 'Sushi, Anyone?'.",
    "evidence": "most year to date sales refers to MAX(ytd_sales); on contract refers to contract = 1; name of author = au_fname, au_lname",
    "idx": 25
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "CALL(*) {\nMATCH (`titles_sub0`:`titles`)\nRETURN avg(`titles_sub0`.`ytd_sales`) AS `_col_0`  \n}\nMATCH (`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (`t1`.`ytd_sales` > `_col_0`)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all titles which have year to date sales higher than the average order by pubisher name.",
    "evidence": "year to date sales refers to ytd_sales; average order = AVG(ytd_sales)",
    "idx": 27
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`employee`)-[has_job_0:has_job]->(`t2`:`jobs`)\nWHERE `t1`.`job_id` = `t2`.`job_id`\nAND (`t2`.`job_desc` = 'Managing Editor')\nRETURN `t1`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the first names of the employees who work as Managing Editor.",
    "evidence": "Managing Editor is a job description which refers to job_desc",
    "idx": 30
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[published_by_0:published_by]->(`t2`:`publishers`)\nWHERE `t1`.`pub_id` = `t2`.`pub_id`\nAND (`t1`.`title` = 'Life Without Fear')\nRETURN `t2`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which country is the publisher of the book \"Life Without Fear\" located?",
    "evidence": "Life Without Fear is book title",
    "idx": 35
  },
  {
    "filename": "train.json",
    "db_id": "book_publishing_company",
    "gql_statement": "MATCH (`t1`:`titles`)-[t2:sold_at]->()\nWHERE `t1`.`title_id` = `t2`.`title_id`\nORDER BY `t2`.`qty` IS NULL ASC, `t2`.`qty` DESC \nRETURN `t1`.`notes` AS `notes`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please give more detailed information about the first three books that sell the best.",
    "evidence": "qty is abbreviation for quantity; sells the best mean with the most sales quantity; MAX(qty)",
    "idx": 38
  }
]