[
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH ()-[tryout:tried_out_for]->()\nWHERE `tryout`.`decision` = 'yes'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students got accepted after the tryout?",
    "evidence": "",
    "idx": 5312
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH ()-[tryout:tried_out_for]->()\nWHERE `tryout`.`decision` = 'yes'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students received a yes from tryouts?",
    "evidence": "",
    "idx": 5313
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH ()-[tryout:tried_out_for]->()\nWHERE `tryout`.`ppos` = 'goalie'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students whose are playing the role of goalie?",
    "evidence": "",
    "idx": 5314
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH ()-[tryout:tried_out_for]->()\nWHERE `tryout`.`ppos` = 'goalie'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the number of students playing as a goalie?",
    "evidence": "",
    "idx": 5315
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`player`:`player`)\nRETURN avg(`player`.`hs`) AS `_col_0`, MAX(`player`.`hs`) AS `_col_1`, min(`player`.`hs`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the max, average and min training hours of all players.",
    "evidence": "",
    "idx": 5316
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`pname` =~ '(?i)(?s).*a.*'\nRETURN DISTINCT `player`.`pname` AS `pname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the players whose names contain letter 'a'.",
    "evidence": "",
    "idx": 5322
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`college`:`college`)\nWHERE `college`.`enr` > 10000 AND `college`.`state` = 'LA'\nRETURN `college`.`cname` AS `cname`, `college`.`enr` AS `enr`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, enrollment of the colleges whose size is bigger than 10000 and location is in state LA.",
    "evidence": "",
    "idx": 5324
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`college`:`college`)\nRETURN `college`.`cname` AS `cname`, `college`.`state` AS `state`, `college`.`enr` AS `enr` ORDER BY `college`.`enr` IS NULL DESC, `college`.`enr`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all information about college sorted by enrollment number in the ascending order.",
    "evidence": "",
    "idx": 5326
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`college`:`college`)\nRETURN `college`.`cname` AS `cname`, `college`.`state` AS `state`, `college`.`enr` AS `enr` ORDER BY `college`.`enr` IS NULL DESC, `college`.`enr`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What information do you have on colleges sorted by increasing enrollment numbers?",
    "evidence": "",
    "idx": 5327
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`college`:`college`)\nWHERE `college`.`enr` > 18000\nRETURN `college`.`cname` AS `cname` ORDER BY `cname` IS NULL DESC, `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of the colleges whose enrollment is greater 18000 sorted by the college's name.",
    "evidence": "",
    "idx": 5328
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`player`:`player`)\nWHERE `player`.`ycard` = 'yes'\nORDER BY `player`.`hs` IS NULL ASC, `player`.`hs` DESC \nRETURN `player`.`pname` AS `pname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of players whose card is yes in the descending order of training hours.",
    "evidence": "",
    "idx": 5330
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH ()-[tryout:tried_out_for]->()\nWITH `tryout`.`cname` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `cname` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many students participated in tryouts for each college by descennding count?",
    "evidence": "",
    "idx": 5335
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t2`:`player`)-[t1:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nWITH `t1`.`ppos` AS _groupby_col_0, min(`t2`.`hs`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `ppos`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is minimum hours of the students playing in different position?",
    "evidence": "",
    "idx": 5336
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t2`:`player`)-[t1:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nWITH `t1`.`ppos` AS _groupby_col_0, min(`t2`.`hs`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `ppos`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each position, what is the minimum time students spent practicing?",
    "evidence": "",
    "idx": 5337
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t2`.`decision` = 'yes')\nRETURN `t1`.`pname` AS `pname`, `t2`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and college of students whose decisions are yes in the tryout.",
    "evidence": "",
    "idx": 5344
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nRETURN `t1`.`pname` AS `pname` ORDER BY `t1`.`pname` IS NULL DESC, `t1`.`pname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of all students who were in the tryout sorted in alphabetic order.",
    "evidence": "",
    "idx": 5346
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t2`.`decision` = 'yes')\nRETURN `t1`.`pname` AS `pname`, `t1`.`hs` AS `hs`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and hours of the students whose tryout decision is yes.",
    "evidence": "",
    "idx": 5348
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t2`.`decision` = 'yes' AND `t2`.`ppos` = 'striker')\nRETURN `t1`.`pname` AS `pname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of the students who are in the position of striker and got a yes tryout decision.",
    "evidence": "",
    "idx": 5352
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t3`:`player`)-[t2:tried_out_for]->(`t1`:`college`)\nWHERE `t1`.`cname` = `t2`.`cname`\nAND `t2`.`pid` = `t3`.`pid`\nAND (`t3`.`pname` = 'Charles')\nRETURN `t1`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the state of the college which player Charles is attending.",
    "evidence": "",
    "idx": 5354
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t2`.`decision` = 'yes')\nRETURN avg(`t1`.`hs`) AS `_col_0`, MAX(`t1`.`hs`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average and maximum hours for the students whose tryout decision is yes.",
    "evidence": "",
    "idx": 5356
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t2`.`decision` = 'no')\nRETURN avg(`t1`.`hs`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the average hours for the students whose tryout decision is no.",
    "evidence": "",
    "idx": 5358
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t1`.`hs` > 1000)\nWITH `t2`.`ppos` AS _groupby_col_0, MAX(`t1`.`hs`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `ppos`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the maximum training hours for the students whose training hours is greater than 1000 in different positions?",
    "evidence": "",
    "idx": 5360
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t1`:`player`)-[t2:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t1`.`hs` > 1000)\nWITH `t2`.`ppos` AS _groupby_col_0, MAX(`t1`.`hs`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `ppos`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "For each position, what is the maximum number of  hours for students who spent more than 1000 hours training?",
    "evidence": "",
    "idx": 5361
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t2`:`player`)-[t1:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t2`.`pname` =~ '(?i)(?s)D.*')\nRETURN `t1`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which colleges do the tryout players whose name starts with letter D go to?",
    "evidence": "",
    "idx": 5362
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`t2`:`player`)-[t1:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t2`.`pname` =~ '(?i)(?s)D.*')\nRETURN `t1`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which colleges does each player with a name that starts with the letter D  who tried out go to?",
    "evidence": "",
    "idx": 5363
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "CALL(*) {\nMATCH (`college_sub0`:`college`)\nORDER BY `college_sub0`.`enr` IS NULL ASC, `college_sub0`.`enr` DESC \nRETURN `college_sub0`.`cname` AS `cname`  LIMIT 1\n}\nMATCH (`t2`:`player`)-[t1:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t1`.`cname` = `cname`)\nRETURN `t2`.`pname` AS `pname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the tryout players who are from the college with largest size.",
    "evidence": "",
    "idx": 5366
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "CALL(*) {\nMATCH (`college_sub0`:`college`)\nORDER BY `college_sub0`.`enr` IS NULL ASC, `college_sub0`.`enr` DESC \nRETURN `college_sub0`.`cname` AS `cname`  LIMIT 1\n}\nMATCH (`t2`:`player`)-[t1:tried_out_for]->()\nWHERE `t1`.`pid` = `t2`.`pid`\nAND (`t1`.`cname` = `cname`)\nRETURN `t2`.`pname` AS `pname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all tryout participants who are from the largest college?",
    "evidence": "",
    "idx": 5367
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "MATCH (`college`:`college`)\nWHERE `college`.`enr` < 13000 AND `college`.`state` = 'AZ'\nRETURN `college`.`cname` AS `cname`   \nUNION DISTINCT\nMATCH (`college`:`college`)\nWHERE `college`.`enr` > 15000 AND `college`.`state` = 'LA'\nRETURN `college`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the names of either colleges in LA with greater than 15000 size or in state AZ with less than 13000 enrollment.",
    "evidence": "",
    "idx": 5370
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "CALL(*) {\nMATCH (`college_sub0`:`college`)\nRETURN MAX(`college_sub0`.`enr`) AS `_col_0`  \n}\nMATCH (`college`:`college`)\nWHERE `college`.`enr` < `_col_0`\nRETURN DISTINCT `college`.`state` AS `state`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the states where have the colleges whose enrollments are less than the largest size.",
    "evidence": "",
    "idx": 5372
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "CALL(*) {\nMATCH (`college_sub0`:`college`)\nWHERE `college_sub0`.`state` = 'FL'\nRETURN min(`college_sub0`.`enr`) AS `_col_0`  \n}\nMATCH (`college`:`college`)\nWHERE `college`.`enr` > `_col_0`\nRETURN DISTINCT `college`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find names of colleges with enrollment greater than that of some (at least one) college in the FL state.",
    "evidence": "",
    "idx": 5374
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "CALL(*) {\nMATCH (`college_sub0`:`college`)\nWHERE `college_sub0`.`state` = 'FL'\nRETURN min(`college_sub0`.`enr`) AS `_col_0`  \n}\nMATCH (`college`:`college`)\nWHERE `college`.`enr` > `_col_0`\nRETURN DISTINCT `college`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the colleges that are larger than at least one college in Florida?",
    "evidence": "",
    "idx": 5375
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "CALL(*) {\nMATCH (`college_sub0`:`college`)\nWHERE `college_sub0`.`state` = 'FL'\nRETURN MAX(`college_sub0`.`enr`) AS `_col_0`  \n}\nMATCH (`college`:`college`)\nWHERE `college`.`enr` > `_col_0`\nRETURN `college`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find names of all colleges whose enrollment is greater than that of all colleges in the FL state.",
    "evidence": "",
    "idx": 5376
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "CALL(*) {\nMATCH (`college_sub0`:`college`)\nWHERE `college_sub0`.`state` = 'FL'\nRETURN MAX(`college_sub0`.`enr`) AS `_col_0`  \n}\nMATCH (`college`:`college`)\nWHERE `college`.`enr` > `_col_0`\nRETURN `college`.`cname` AS `cname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all colleges with a larger enrollment than the largest college in Florida?",
    "evidence": "",
    "idx": 5377
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[tryout:tried_out_for]->()\nWHERE `tryout`.`ppos` = 'goalie'\nRETURN `tryout`.`cname` AS `cname`   } AS in_collect_0\nMATCH (`college`:`college`)\nWHERE NOT `college`.`cname` IN in_collect_0\nRETURN sum(`college`.`enr`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of enrollment of schools that do not have any goalie player?",
    "evidence": "",
    "idx": 5378
  },
  {
    "filename": "train_spider.json",
    "db_id": "soccer_2",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[tryout:tried_out_for]->()\nWHERE `tryout`.`ppos` = 'goalie'\nRETURN `tryout`.`cname` AS `cname`   } AS in_collect_0\nMATCH (`college`:`college`)\nWHERE NOT `college`.`cname` IN in_collect_0\nRETURN sum(`college`.`enr`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of students enrolled in schools without any goalies?",
    "evidence": "",
    "idx": 5379
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`device`:`device`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of devices.",
    "evidence": "",
    "idx": 5385
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`device`:`device`)\nRETURN `device`.`carrier` AS `carrier` ORDER BY `carrier` IS NULL DESC, `carrier`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the carriers of devices in ascending alphabetical order.",
    "evidence": "",
    "idx": 5386
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`device`:`device`)\nWHERE `device`.`software_platform` <> 'Android'\nRETURN `device`.`carrier` AS `carrier`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the carriers of devices whose software platforms are not \"Android\"?",
    "evidence": "",
    "idx": 5388
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`device`:`device`)\nWHERE `device`.`software_platform` <> 'Android'\nRETURN `device`.`carrier` AS `carrier`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the device carriers that do not have Android as their software platform.",
    "evidence": "",
    "idx": 5389
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`shop`:`shop`)\nORDER BY `shop`.`open_year` IS NULL DESC, `shop`.`open_year`  \nRETURN `shop`.`shop_name` AS `shop_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names of shops, ordered by year of opening ascending.",
    "evidence": "",
    "idx": 5391
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`shop`:`shop`)\nRETURN `shop`.`shop_name` AS `shop_name`, `shop`.`location` AS `location` ORDER BY `shop_name` IS NULL DESC, `shop_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names and location of the shops in ascending alphabetical order of name.",
    "evidence": "",
    "idx": 5394
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`shop`:`shop`)\nRETURN `shop`.`shop_name` AS `shop_name`, `shop`.`location` AS `location` ORDER BY `shop_name` IS NULL DESC, `shop_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the names and locations of shops, ordered by name in alphabetical order.",
    "evidence": "",
    "idx": 5395
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`device`:`device`)\nRETURN COUNT(DISTINCT `device`.`software_platform`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different software platforms.",
    "evidence": "",
    "idx": 5397
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`shop`:`shop`)\nWHERE `shop`.`shop_name` = 'Apple'\nRETURN `shop`.`open_date` AS `open_date`, `shop`.`open_year` AS `open_year`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the open date of open year of the shop named \"Apple\".",
    "evidence": "",
    "idx": 5398
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`shop`:`shop`)\nORDER BY `shop`.`open_year` IS NULL ASC, `shop`.`open_year` DESC \nRETURN `shop`.`shop_name` AS `shop_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the name of the shop with the latest open year.",
    "evidence": "",
    "idx": 5400
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`t3`:`shop`)-[t1:stocks]->(`t2`:`device`)\nWHERE `t1`.`device_id` = `t2`.`device_id`\nAND `t1`.`shop_id` = `t3`.`shop_id`\nRETURN `t3`.`shop_name` AS `shop_name`, `t2`.`carrier` AS `carrier`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show names of shops and the carriers of devices they have in stock.",
    "evidence": "",
    "idx": 5402
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "MATCH (`device`:`device`)\nWITH `device`.`software_platform` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `software_platform`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show different software platforms and the corresponding number of devices using each.",
    "evidence": "",
    "idx": 5404
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[stock_sub0:stocks]->()\nRETURN `stock_sub0`.`shop_id` AS `shop_id`   } AS in_collect_0\nMATCH (`shop`:`shop`)\nWHERE NOT `shop`.`shop_id` IN in_collect_0\nRETURN `shop`.`shop_name` AS `shop_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of shops that have no devices in stock.",
    "evidence": "",
    "idx": 5406
  },
  {
    "filename": "train_spider.json",
    "db_id": "device",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[stock_sub0:stocks]->()\nRETURN `stock_sub0`.`device_id` AS `device_id`   } AS in_collect_0\nMATCH (`device`:`device`)\nWHERE NOT `device`.`device_id` IN in_collect_0\nRETURN `device`.`carrier` AS `carrier`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the carriers of devices that have no devices in stock.",
    "evidence": "",
    "idx": 5408
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`bookings`:`bookings`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the total number of bookings made.",
    "evidence": "",
    "idx": 5411
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`bookings`:`bookings`)\nRETURN `bookings`.`order_date` AS `order_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the order dates of all the bookings.",
    "evidence": "",
    "idx": 5412
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`bookings`:`bookings`)\nRETURN `bookings`.`planned_delivery_date` AS `planned_delivery_date`, `bookings`.`actual_delivery_date` AS `actual_delivery_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the planned delivery dates and actual delivery dates of bookings.",
    "evidence": "",
    "idx": 5414
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of customers recorded.",
    "evidence": "",
    "idx": 5417
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_name` = 'Harold'\nRETURN `customers`.`customer_phone` AS `customer_phone`, `customers`.`customer_email_address` AS `customer_email_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the phone number and email address of customer \"Harold\".",
    "evidence": "",
    "idx": 5419
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`drama_workshop_groups`:`drama_workshop_groups`)\nRETURN `drama_workshop_groups`.`store_name` AS `store_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the Store_Name of drama workshop groups.",
    "evidence": "",
    "idx": 5420
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nRETURN min(`invoices`.`order_quantity`) AS `_col_0`, avg(toFloat(`invoices`.`order_quantity`)) AS `_col_1`, MAX(`invoices`.`order_quantity`) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the minimum, average, maximum order quantity of all invoices.",
    "evidence": "",
    "idx": 5422
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nRETURN DISTINCT `invoices`.`payment_method_code` AS `payment_method_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show me the distinct payment method codes from the invoice record.",
    "evidence": "",
    "idx": 5425
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "CALL(*) {\nMATCH (`products_sub0`:`products`)\nRETURN avg(`products_sub0`.`product_price`) AS `_col_0`  \n}\nMATCH (`products`:`products`)\nWHERE `products`.`product_price` > `_col_0`\nRETURN DISTINCT `products`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all the distinct product names with price higher than the average.",
    "evidence": "",
    "idx": 5428
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`products`:`products`)\nORDER BY `products`.`product_price` IS NULL DESC, `products`.`product_price`  \nRETURN `products`.`product_name` AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort the names of products in ascending order of their price.",
    "evidence": "",
    "idx": 5433
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`performers`:`performers`)\nWHERE `performers`.`customer_name` = 'Ashley'\nRETURN `performers`.`customer_phone` AS `customer_phone`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the phone number of performer \"Ashley\".",
    "evidence": "",
    "idx": 5435
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`invoices`:`invoices`)\nWITH `invoices`.`payment_method_code` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `payment_method_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all payment method codes and the number of orders for each code.",
    "evidence": "",
    "idx": 5436
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t2`:`stores`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`store_name` = 'FJA Filming')\nRETURN `t1`.`city_town` AS `city_town`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which city is the address of the store named \"FJA Filming\" located in?",
    "evidence": "",
    "idx": 5438
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t2`:`stores`)-[has_address_0:has_address]->(`t1`:`addresses`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`marketing_region_code` = 'CA')\nRETURN `t1`.`state_county` AS `state_county`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the states or counties of the address of the stores with marketing region code \"CA\"?",
    "evidence": "",
    "idx": 5440
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t2`:`stores`)-[located_in_0:located_in]->(`t1`:`marketing_regions`)\nWHERE `t1`.`marketing_region_code` = `t2`.`marketing_region_code`\nAND (`t2`.`store_name` = 'Rob Dinning')\nRETURN `t1`.`marketing_region_name` AS `marketing_region_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the name of the marketing region the store Rob Dinning is located in.",
    "evidence": "",
    "idx": 5443
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t2`:`services`)-[of_type_0:of_type]->(`t1`:`ref_service_types`)\nWHERE `t1`.`service_type_code` = `t2`.`service_type_code`\nAND (`t2`.`product_price` > 100)\nRETURN `t1`.`service_type_description` AS `service_type_description`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me the descriptions of the service types that cost more than 100.",
    "evidence": "",
    "idx": 5445
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t2`:`services`)-[offered_by_0:offered_by]->(`t1`:`drama_workshop_groups`)\nWHERE `t1`.`workshop_group_id` = `t2`.`workshop_group_id`\nRETURN `t1`.`store_phone` AS `store_phone`, `t1`.`store_email_address` AS `store_email_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give me all the phone numbers and email addresses of the workshop groups where services are performed.",
    "evidence": "",
    "idx": 5447
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`t2`:`services`)-[offered_by_0:offered_by]->(`t1`:`drama_workshop_groups`)\nWHERE `t1`.`workshop_group_id` = `t2`.`workshop_group_id`\nAND (`t2`.`product_name` = 'film')\nRETURN `t1`.`store_phone` AS `store_phone`, `t1`.`store_email_address` AS `store_email_address`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of workshop groups in which services with product name \"film\" are performed?",
    "evidence": "",
    "idx": 5448
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`products`:`products`)\nWITH `products`.`product_name` AS _groupby_col_0, avg(`products`.`product_price`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `product_name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the different product names? What is the average product price for each of them?",
    "evidence": "",
    "idx": 5450
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Drama_Workshop_Groups",
    "gql_statement": "MATCH (`products`:`products`)\nWITH `products`.`product_name` AS _groupby_col_0, avg(`products`.`product_price`) AS _groupby_col_1\nWHERE _groupby_col_1 < 1000000\nRETURN _groupby_col_0 AS `product_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the product names whose average product price is below 1000000.",
    "evidence": "",
    "idx": 5453
  }
]