[
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[contains_1:contains]->(`t1_sub0`:`products`)\nMATCH (`t2_sub0`:`sales orders`)-[fulfilled_at_1:fulfilled_at]->(`t3_sub0`:`store locations`)\nWHERE `t2_sub0`.`_productid` = `t1_sub0`.`productid`\nAND `t3_sub0`.`storeid` = `t2_sub0`.`_storeid`\nRETURN DISTINCT CASE  WHEN `t3_sub0`.`time zone` = 'Pacific/Honolulu' AND `t2_sub0`.`sales channel` = 'Wholesale' THEN `t1_sub0`.`product name` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the products via wholesale channel of the store under Pacific/Honolulu time zone.",
    "evidence": "products refers to Product Name; via wholesale channel refers to Sales Channel = 'Wholesale'",
    "idx": 1955
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[contains_1:contains]->(`t1_sub0`:`products`)\nWHERE `t2_sub0`.`_productid` = `t1_sub0`.`productid`\nRETURN CASE WHEN `t2_sub0`.`orderdate` = '6/6/18' THEN `t2_sub0`.`ordernumber` ELSE NULL END AS `ordernumber`, CASE WHEN `t2_sub0`.`orderdate` = '6/6/18' THEN `t1_sub0`.`product name` ELSE NULL END AS `product name`  \n}\nWITH *\nWHERE NOT `ordernumber` IS NULL AND NOT `product name` IS NULL\nRETURN DISTINCT `ordernumber`, `product name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the order numbers and product names which were ordered on 6th June, 2018.",
    "evidence": "ordered on 6th June 2018 refers to OrderDate = '6/5/18'",
    "idx": 1956
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[placed_by_0:placed_by]->(`t2`:`customers`)\nWHERE `t2`.`customerid` = `t1`.`_customerid`\nAND ((`t1`.`orderdate` =~ '(?i)(?s).*/.*/18' AND `t2`.`customer names` = 'Weimei Corp') OR (`t1`.`orderdate` =~ '(?i)(?s).*/.*/19' AND `t2`.`customer names` = 'Weimei Corp') OR (`t1`.`orderdate` =~ '(?i)(?s).*/.*/20' AND `t2`.`customer names` = 'Weimei Corp'))\nRETURN CASE WHEN 3=0 THEN NULL ELSE COUNT(`t1`.`ordernumber`) / 3 END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find the average yearly order by customer Weimei Corp for 2018, 2019 and 2020.",
    "evidence": "\"Weimei Corp\" is the Customer Names; in 2018, 2019 and 2020 refers to SUBSTR (OrderDate, -2) IN ('18', '19', '20') : Average order = Divide (Count (OrderNumber), 3)",
    "idx": 1957
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[contains_0:contains]->(`t1`:`products`)\nWHERE `t2`.`_productid` = `t1`.`productid`\nAND (`t2`.`orderdate` =~ '(?i)(?s).*/.*/19')\nRETURN CASE WHEN 12=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`warehousecode` = 'WARE-NMK1003' THEN 1 ELSE 0 END)) / 12 END AS `_col_0`, CASE WHEN COUNT(`t2`.`ordernumber`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t2`.`warehousecode` = 'WARE-NMK1003' THEN 1 ELSE 0 END)) * 100 / COUNT(`t2`.`ordernumber`) END AS `_col_1`, COUNT(CASE  WHEN `t1`.`product name` = 'Floor Lamps' AND `t2`.`warehousecode` = 'WARE-NMK1003' THEN `t2`.`order quantity` ELSE NULL END) AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average monthly order and percentage of warehouse \"WARE-NMK1003\" in 2019. Among them, mention number of orders for floor lamps.",
    "evidence": "\"WARE-NMK1003\" is the WarehouseCode; in 2019 refers to SUBSTR(OrderDate, -2) = '19'; average = Divide (Count (OrderNumber where SUBSTR(OrderDate, -2) = '19'), 12); Percentage = Divide (Count(OrderNumber where WarehouseCode = 'WARE-NMK1003'), Count(OrderNumber)) * 100; 'Floor Lamps' is the Product Name; number of orders refers to Count(OrderNumber)",
    "idx": 1958
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`regions_sub0`:`regions`)\nRETURN CASE  WHEN `regions_sub0`.`region` = 'Midwest' THEN `regions_sub0`.`state` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN COUNT(DISTINCT `t`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many states are in the Midwest region?",
    "evidence": "",
    "idx": 1963
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[placed_by_1:placed_by]->(`t1_sub0`:`customers`)\nWHERE `t2_sub0`.`_customerid` = `t1_sub0`.`customerid`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`order quantity` = 3 AND `t2_sub0`.`orderdate` =~ '(?i)(?s)2/.*/18' THEN `t1_sub0`.`customer names`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the name of the customers who have placed an order of 3 units in February 2018.",
    "evidence": "name of customer refers to Customer Names; order of 3 unit refers to Order Quantity = 3; in February 2018 refers to OrderDate LIKE '2/%/18'",
    "idx": 1964
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t3_sub0`:`sales orders`)-[fulfilled_at_1:fulfilled_at]->(`t2_sub0`:`store locations`)-[located_in_1:located_in]->(`t1_sub0`:`regions`)\nWHERE `t2_sub0`.`statecode` = `t1_sub0`.`statecode`\nAND `t3_sub0`.`_storeid` = `t2_sub0`.`storeid`\nRETURN DISTINCT CASE  WHEN `t3_sub0`.`warehousecode` = 'WARE-UHY1004' THEN `t1_sub0`.`region`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which regions are the stores that have shipped products through the WARE-UHY1004 warehouse?",
    "evidence": "\"WARE-UHY1004\" is the WarehouseCode",
    "idx": 1966
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nMATCH (`t2`:`sales orders`)-[contains_0:contains]->(`t3`:`products`)\nWHERE `t2`.`_customerid` = `t1`.`customerid`\nAND `t3`.`productid` = `t2`.`_productid`\nAND (`t2`.`orderdate` = '10/21/18' AND `t2`.`deliverydate` = '11/21/19')\nRETURN `t3`.`product name` AS `product name`, `t1`.`customer names` AS `customer names`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Lists the name of the product and customer who placed an order on 10/21/18 and it was delivered on 11/21/19.",
    "evidence": "ordered on 10/21/18 refers to OrderDate = '10/21/18'; delivered on 11/21/19 refers to DeliveryDate = '11/21/19'; name of product refers to Product Name",
    "idx": 1967
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[fulfilled_at_0:fulfilled_at]->(`t2`:`store locations`)\nWHERE `t2`.`storeid` = `t1`.`_storeid`\nAND (`t2`.`state` = 'Colorado' AND `t2`.`land area` = 111039036)\nRETURN MAX(`t1`.`discount applied`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest discount applied by the store located in a city of the state of Colorado whose land area is 111039036.",
    "evidence": "highest discount applied refers to Max(Discount Applied)",
    "idx": 1969
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`sales orders`)-[fulfilled_at_1:fulfilled_at]->(`t2_sub0`:`store locations`)\nWHERE `t2_sub0`.`storeid` = `t1_sub0`.`_storeid`\nRETURN replace(`t1_sub0`.`unit price`,',','') AS `_col_0` ORDER BY replace(`t1_sub0`.`unit price`,',','') IS NULL ASC, replace(`t1_sub0`.`unit price`,',','') DESC \nLIMIT 1\n}\nMATCH (`t1`:`sales orders`)-[fulfilled_at_0:fulfilled_at]->(`t2`:`store locations`)\nWHERE `t2`.`storeid` = `t1`.`_storeid`\nAND (replace(`t1`.`unit price`,',','') = `_col_0`)\nORDER BY replace(`t1`.`unit price`,',','') IS NULL ASC, replace(`t1`.`unit price`,',','') DESC \nRETURN `t2`.`city name` AS `city name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which city is the store with the highest sales order unit price located?",
    "evidence": "highest sales order unit price refers to Max(Unit Price)",
    "idx": 1971
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL(*) {\nMATCH (`t1_sub0`:`sales orders`)-[handled_by_1:handled_by]->(`t2_sub0`:`sales team`)\nWHERE `t2_sub0`.`salesteamid` = `t1_sub0`.`_salesteamid`\nRETURN replace(`t1_sub0`.`unit price`,',','') AS `_col_0` ORDER BY replace(`t1_sub0`.`unit price`,',','') IS NULL ASC, replace(`t1_sub0`.`unit price`,',','') DESC \nLIMIT 1\n}\nMATCH (`t1`:`sales orders`)-[handled_by_0:handled_by]->(`t2`:`sales team`)\nWHERE `t2`.`salesteamid` = `t1`.`_salesteamid`\nAND (replace(`t1`.`unit price`,',','') = `_col_0`)\nORDER BY replace(`t1`.`unit price`,',','') IS NULL ASC, replace(`t1`.`unit price`,',','') DESC \nRETURN `t2`.`sales team` AS `sales team`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which sales team has the other with the highest unit price?",
    "evidence": "highest unit price refers to Max(Unit Price)",
    "idx": 1980
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[placed_by_0:placed_by]->(`t2`:`customers`)\nWHERE `t2`.`customerid` = `t1`.`_customerid`\nAND (`t2`.`customer names` = 'Elorac, Corp')\nRETURN DISTINCT `t1`.`ordernumber` AS `ordernumber`, `t1`.`warehousecode` AS `warehousecode`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide order number, warehouse code of customers Elorac, Corp.",
    "evidence": "\"Elorac, Corp\" is the Customer Names",
    "idx": 1983
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[placed_by_1:placed_by]->(`t1_sub0`:`customers`)\nMATCH (`t2_sub0`:`sales orders`)-[contains_1:contains]->(`t3_sub0`:`products`)\nWHERE `t2_sub0`.`_customerid` = `t1_sub0`.`customerid`\nAND `t3_sub0`.`productid` = `t2_sub0`.`_productid`\nRETURN DISTINCT CASE  WHEN `t3_sub0`.`product name` = 'Cocktail Glasses' AND `t2_sub0`.`sales channel` = 'Online' THEN `t1_sub0`.`customer names`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name of customers who have ordered Cocktail Glasses by online sales channel.",
    "evidence": "\"Cocktail Glasses\" is the Product Name; customer refers to Customer Names",
    "idx": 1984
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[fulfilled_at_0:fulfilled_at]->(`t2`:`store locations`)\nWHERE `t2`.`storeid` = `t1`.`_storeid`\nAND (`t2`.`state` = 'Arizona')\nORDER BY toFloat(`t1`.`unit price`) - toFloat(`t1`.`unit cost`) IS NULL ASC, toFloat(`t1`.`unit price`) - toFloat(`t1`.`unit cost`) DESC \nRETURN `t2`.`storeid` AS `storeid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which store in Arizona has the most net profit?",
    "evidence": "\"Arizona\" is the name of State; most net profit = Max(Subtract( Unit Price, Unit Cost))",
    "idx": 1985
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t1_sub0`:`sales orders`)-[fulfilled_at_1:fulfilled_at]->(`t2_sub0`:`store locations`)\nWHERE `t2_sub0`.`storeid` = `t1_sub0`.`_storeid`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`state` = 'California' AND `t1_sub0`.`sales channel` = 'In-Store' AND `t1_sub0`.`discount applied` = 0.2 THEN `t2_sub0`.`storeid`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate store id in the state of California that have been applied 20% discount in store.",
    "evidence": "\"California\" is the name of State; in store refers to Sales Channel = 'In-Store'; 20% discount refers to Discount Applied = '0.2'",
    "idx": 1987
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[placed_by_0:placed_by]->(`t1`:`customers`)\nWHERE `t2`.`_customerid` = `t1`.`customerid`\nAND (`t2`.`orderdate` =~ '(?i)(?s).*/.*/18' OR `t2`.`orderdate` =~ '(?i)(?s).*/.*/19' OR `t2`.`orderdate` =~ '(?i)(?s).*/.*/20')\nORDER BY `t2`.`order quantity` IS NULL ASC, `t2`.`order quantity` DESC \nRETURN `t1`.`customer names` AS `customer names`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of the customer with the most number of order quantity from 2018 to 2020.",
    "evidence": "name of customer refers to Customer Names; from 2018 to 2020 refers to OrderDate between '1/1/2018' and '31/12/2020'; most number of order quantity refers to Order Quantity = 8",
    "idx": 1988
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[contains_0:contains]->(`t1`:`products`)\nMATCH (`t2`:`sales orders`)-[fulfilled_at_0:fulfilled_at]->(`t3`:`store locations`)\nWHERE `t2`.`_productid` = `t1`.`productid`\nAND `t3`.`storeid` = `t2`.`_storeid`\nRETURN sum(CASE  WHEN `t1`.`product name` = 'Candles' THEN `t2`.`order quantity` ELSE 0 END) AS `_col_0`, CASE WHEN sum(`t2`.`order quantity`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `t1`.`product name` = 'Candles' THEN `t2`.`order quantity` ELSE 0 END)) * 100 / sum(`t2`.`order quantity`) END AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate total order quantity of product Candles and calculate the percentage of such product among all the orders.",
    "evidence": "total order quantity refers to Sum (Order Quantity); 'Candles' is the Products Name; percentage = Divide (Sum(Order Quantity where Product Name = 'Candles'), Sum(Order Quantity)) * 100",
    "idx": 1989
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`sales team_sub0`:`sales team`)\nRETURN DISTINCT CASE  WHEN `sales team_sub0`.`sales team` = 'Joshua Bennett' THEN `sales team_sub0`.`region` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which region is Joshua Bennet located in?",
    "evidence": "\"Joshua Bennett\" is the name of Sales Team",
    "idx": 1990
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL(*) {\nMATCH (`sales orders_sub0`:`sales orders`)\nRETURN replace(`sales orders_sub0`.`unit price`,',','') AS `_col_0` ORDER BY replace(`sales orders_sub0`.`unit price`,',','') IS NULL ASC, replace(`sales orders_sub0`.`unit price`,',','') DESC \nLIMIT 1\n}\nMATCH (`sales orders`:`sales orders`)\nWHERE replace(`sales orders`.`unit price`,',','') = `_col_0`\nORDER BY replace(`sales orders`.`unit price`,',','') IS NULL ASC, replace(`sales orders`.`unit price`,',','') DESC \nRETURN `sales orders`.`discount applied` AS `discount applied`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much is the discount applied to the order with the highest unit price?",
    "evidence": "highest unit price refers to Max(Unit Price)",
    "idx": 1993
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`store locations`)-[located_in_1:located_in]->(`t1_sub0`:`regions`)\nWHERE `t2_sub0`.`statecode` = `t1_sub0`.`statecode`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`median income` < 30000 THEN `t1_sub0`.`region`  END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In which region can you find the stores located in the state whose median income is no more than 30,000?",
    "evidence": "median income no more than 30,000 refers to Median Income < 30,000",
    "idx": 1994
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[placed_by_1:placed_by]->(`t1_sub0`:`customers`)\nWHERE `t2_sub0`.`_customerid` = `t1_sub0`.`customerid`\nRETURN `t1_sub0`.`customer names` AS `customer names`, toFloat(`t2_sub0`.`unit price`) - toFloat(`t2_sub0`.`unit cost`) AS `net profit`  \n}\nWITH *\nORDER BY `net profit` IS NULL ASC, `net profit` DESC \nRETURN `customer names`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the name of the customer who purchased the product with the highest net profiit?",
    "evidence": "highest net profit = Max(Subtract (Unit Price, Unit Cost)); name of customer refers to Customer Names",
    "idx": 1996
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[handled_by_0:handled_by]->(`t2`:`sales team`)\nWHERE `t2`.`salesteamid` = `t1`.`_salesteamid`\nAND (`t1`.`orderdate` =~ '(?i)(?s).*/.*/19' AND `t1`.`shipdate` =~ '(?i)(?s).*/.*/19')\nWITH `t2`.`sales team` AS _groupby_col_0, COUNT(`t1`.`ordernumber`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `sales team` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In 2019, how many orders were shipped by the sales team with the highest number of orders in the said year? Provide the name of the sales team.",
    "evidence": "shipped refers to ShipDate; in 2019 refers to shipped in 2019 refers to SUBSTR(ShipDate, -2) = '19'; order in the said year refers to SUBSTR(OrderDate, -2) = '19'; highest number of order refers to Max(Count(OrderNumber))",
    "idx": 1997
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t1`:`sales orders`)-[handled_by_0:handled_by]->(`t2`:`sales team`)\nWHERE `t2`.`salesteamid` = `t1`.`_salesteamid`\nAND (`t1`.`shipdate` =~ '(?i)(?s).*/.*/20')\nWITH `t2`.`sales team` AS _groupby_col_0, COUNT(`t1`.`ordernumber`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `sales team` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many orders were shipped by the sales team with the highest amount of shipped orders in 2020? Give the name of the said sales team.",
    "evidence": "shipped refers to ShipDate; in 2020 refers to SUBSTR(ShipDate, -2) = '20'; highest amount of shipped orders refers to Max(Count(OrderNumber))",
    "idx": 1998
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`sales orders`)-[contains_1:contains]->(`t1_sub0`:`products`)\nWHERE `t2_sub0`.`_productid` = `t1_sub0`.`productid`\nRETURN DISTINCT CASE  WHEN `t2_sub0`.`ordernumber` = 'SO - 0005951' THEN `t1_sub0`.`product name` ELSE NULL END AS `t`  \n}\nWITH *\nWHERE NOT `t` IS NULL\nRETURN `t`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the product that was registered in the sales order 'SO - 0005951'.",
    "evidence": "sales order 'SO - 0005951' refers to OrderNumber = 'SO - 0005951'; product refers to Product Name",
    "idx": 2000
  },
  {
    "filename": "train.json",
    "db_id": "regional_sales",
    "gql_statement": "MATCH (`t2`:`sales orders`)-[fulfilled_at_0:fulfilled_at]->(`t1`:`store locations`)\nMATCH (`t2`:`sales orders`)-[handled_by_0:handled_by]->(`t3`:`sales team`)\nWHERE `t2`.`_storeid` = `t1`.`storeid`\nAND `t3`.`salesteamid` = `t2`.`_salesteamid`\nAND (`t2`.`ordernumber` = 'SO - 0001004')\nRETURN `t3`.`sales team` AS `sales team`, `t1`.`city name` AS `city name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the store location and sales team who processed the sales order 'SO - 0001004'.",
    "evidence": "sales order 'SO - 0001004' refers to OrderNumber = 'SO - 0001004'; store location refers to City Name",
    "idx": 2001
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (`t1`:`matchs`)-[in_division_0:in_division]->(`t2`:`divisions`)\nWHERE `t1`.`div` = `t2`.`division`\nAND (`t2`.`country` = 'Italy')\nRETURN `t1`.`awayteam` AS `awayteam`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the names of any three away teams that competed in the Italian divisions.",
    "evidence": "Italian means belong to country = 'Italy\";",
    "idx": 2023
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (`matchs`:`matchs`)\nWHERE `matchs`.`date` = localdatetime('2009-10-10T00:00:00') AND `matchs`.`hometeam` = 'East Fife' AND `matchs`.`awayteam` = 'Dumbarton'\nRETURN CASE  WHEN `matchs`.`ftr` = 'H' THEN 'East Fife' ELSE 'Dumbarton' END AS `winner`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the winner of the game happened on 2009/10/10, between \"East Fife\" and \"Dumbarton\"?",
    "evidence": "2009/10/10 is a date; the winner refers to FTR = 'A'; East Fife and Dumbarton are name of teams where HomeTeam = 'East Fife'; AwayTeam = 'Dumbarton';",
    "idx": 2028
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (`matchs`:`matchs`)\nWHERE `matchs`.`fthg` + `matchs`.`ftag` > 10\nRETURN min(`matchs`.`date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When did the first match that score more than 10 goals happen?",
    "evidence": "score more than 10 goals refers to SUM(FTHG, FTAG)>10, which are short names for Final-time Home-team Goals and Final-time Away-team Goals; the first means the earliest and refers to MIN(Date);",
    "idx": 2030
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (`t1`:`matchs`)-[in_division_0:in_division]->(`t2`:`divisions`)\nWHERE `t1`.`div` = `t2`.`division`\nAND (`t1`.`season` = 2011 AND `t1`.`fthg` = 1 AND `t1`.`ftag` = 8)\nRETURN `t2`.`division` AS `division`, `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For a game had a score of 1-8 in the year of 2011, what division was that game in? Give the full name of the division.",
    "evidence": "2011 refers to season; a score of 1-8 refers to FTHG = '1' and FTAG = '8';",
    "idx": 2034
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "CALL(*) {\nMATCH (`matchs_sub0`:`matchs`)\nWHERE `matchs_sub0`.`fthg` = 5 AND `matchs_sub0`.`ftag` = 2 AND `matchs_sub0`.`hometeam` = 'Pro Vercelli' AND `matchs_sub0`.`awayteam` = 'Pescara'\nRETURN `matchs_sub0`.`date` AS `date`  \n}\nMATCH (`t1`:`matchs`)-[in_division_0:in_division]->(`t2`:`divisions`)\nWHERE `t1`.`div` = `t2`.`division`\nAND (`t2`.`name` = 'Scottish League One' AND `t1`.`date` = `date`)\nRETURN COUNT(`t1`.`date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Scottish League One games took place on the day that \"Pro Vercelli\" and \"Pescara\"had a 5-2 game?",
    "evidence": "Pro Vercelli and Pescara are names of teams; HomeTeam = 'Pro Vercelli'; AwayTeam = 'Pescara'; 5-2 is a score where FTHG = '5' and FTAG = '2'; Scottish League One is a name of division; games refer to Div;",
    "idx": 2036
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (`t1`:`matchs`)-[in_division_0:in_division]->(`t2`:`divisions`)\nWHERE `t1`.`div` = `t2`.`division`\nAND (`t2`.`country` = 'Greece' AND `t1`.`fthg` = 5 AND `t1`.`ftag` = 0)\nRETURN COUNT(`t1`.`div`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the number of games that ended up with 5-0 in Greece.",
    "evidence": "5-0 is a score where FTHG = '5' and FTAG = '0'; Greece is a name of country; games refer to Div;",
    "idx": 2037
  },
  {
    "filename": "train.json",
    "db_id": "european_football_1",
    "gql_statement": "MATCH (`t1`:`matchs`)-[in_division_0:in_division]->(`t2`:`divisions`)\nWHERE `t1`.`div` = `t2`.`division`\nAND (`t1`.`season` = 2021 AND `t1`.`ftr` = 'H' AND `t2`.`name` = 'Bundesliga')\nRETURN DISTINCT `t1`.`hometeam` AS `hometeam`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the home teams in the matches of the Bundesliga division that ended with a home victory in the 2021 season.",
    "evidence": "Bundesliga is the name of division; home victory refers to refer to FTR = 'H', where H stands for home victory;",
    "idx": 2049
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`teams`:`teams`)\nRETURN CASE WHEN `teams`.`won`=0 THEN NULL ELSE toFloat(`teams`.`homewon`) * 100 / `teams`.`won` END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the winning game from the team, what is the percentage of the winning was home game.",
    "evidence": "percentage of winning at the home = Divide(homeWon, won) * 100",
    "idx": 2054
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`teams`:`teams`)\nWHERE CASE WHEN `teams`.`games`=0 THEN NULL ELSE toFloat(`teams`.`lost`) * 100 / `teams`.`games` END > 75\nRETURN `teams`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team(s) has greater than 75% lost among all the games played.",
    "evidence": "greater than 75% lost refers to Divide(lost, games) > 0.75; team refers to tmID",
    "idx": 2055
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "CALL (*) {\nMATCH (`teams_sub0`:`teams`)\nWHERE `teams_sub0`.`year` = 2004\nRETURN `teams_sub0`.`year` AS `year`, `teams_sub0`.`lgid` AS `lgid`, `teams_sub0`.`tmid` AS `tmid`, `teams_sub0`.`franchid` AS `franchid`, `teams_sub0`.`confid` AS `confid`, `teams_sub0`.`divid` AS `divid`, `teams_sub0`.`rank` AS `rank`, `teams_sub0`.`confrank` AS `confrank`, `teams_sub0`.`playoff` AS `playoff`, `teams_sub0`.`name` AS `name`, `teams_sub0`.`o_fgm` AS `o_fgm`, `teams_sub0`.`o_ftm` AS `o_ftm`, `teams_sub0`.`o_pts` AS `o_pts`, `teams_sub0`.`d_pts` AS `d_pts`, `teams_sub0`.`homewon` AS `homewon`, `teams_sub0`.`homelost` AS `homelost`, `teams_sub0`.`awaywon` AS `awaywon`, `teams_sub0`.`awaylost` AS `awaylost`, `teams_sub0`.`won` AS `won`, `teams_sub0`.`lost` AS `lost`, `teams_sub0`.`games` AS `games`, `teams_sub0`.`arena` AS `arena`  \n}\nMATCH (`t1`:`teams`)\nWHERE `t1`.`tmid` = `tmid`\nAND (`t1`.`year` = 2005 AND `t1`.`won` > `won`)\nRETURN `t1`.`name` AS `name`, `t1`.`won` AS `won`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the team name and the total wins of the team in year 2005 which has greater winning from the previous year.",
    "evidence": "2005 refers to year = 2005 ; previous year refers to year = 2004; team with greater winning than previous year refers to Won where year = 2005 > Won where year = 2004; team name refers to tmID",
    "idx": 2056
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`teams`:`teams`)\nWHERE CASE WHEN `teams`.`games`=0 THEN NULL ELSE toFloat((`teams`.`homewon` - `teams`.`homelost`)) * 100 / `teams`.`games` END > 80\nRETURN `teams`.`name` AS `name`, `teams`.`o_pts` AS `o_pts`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For team who has more home won than home lost more than 80%, list the team name and the offense points.",
    "evidence": "home won than home lost more than 80% refers to Divide(Subtract(homeWon, homeLost), games) > 0.8; offense point refers to o_fgm",
    "idx": 2057
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`coaches`:`coaches`)\nWHERE `coaches`.`year` = 1950 AND `coaches`.`tmid` = 'BOS'\nRETURN `coaches`.`coachid` AS `coachid`, `coaches`.`won` AS `won`, `coaches`.`lost` AS `lost`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the coach for 'BOS' team in year 1950. List the coach ID together with the number of game won and lost.",
    "evidence": "'BOS' is the tmID; 1950 refers to year = 1950; number of game won refers to won; number of game lost refers to lost",
    "idx": 2059
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`coaches`:`coaches`)\nWHERE `coaches`.`year` >= 1970 AND `coaches`.`year` <= 1980\nORDER BY `coaches`.`stint` IS NULL ASC, `coaches`.`stint` DESC \nRETURN `coaches`.`coachid` AS `coachid`, `coaches`.`tmid` AS `tmid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the longest serving coach from year 1970 to 1980. List the coach ID and the team(s) he served.",
    "evidence": "1970 to 1980 refers to year between 1970 and 1980; longest serving coach Max(Count(coachID)); team(s) he served refers to tmID",
    "idx": 2060
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`coaches`)-[coaches_0:coaches]->(`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` = 2000 AND `t2`.`won` > 50)\nRETURN `t1`.`coachid` AS `coachid`, `t2`.`name` AS `name`, `t2`.`won` AS `won`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "In year 2000, who are the coaches with more than 50 games won. List the coachID, team name and number of game won at home game.",
    "evidence": "more than 50 games won refers to won > 50",
    "idx": 2061
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`coaches`)-[coaches_0:coaches]->(`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` >= 2000 AND `t1`.`year` <= 2010 AND `t2`.`lost` > `t2`.`won`)\nRETURN DISTINCT `t1`.`coachid` AS `coachid`, `t2`.`tmid` AS `tmid`, `t1`.`year` AS `year`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the coaches with more game lost than won from year 2000-2010. List the coach ID, team name and year.",
    "evidence": "from year 2000 to 2010 refers to year between 2000 and 2010; more game lost then won refers to lost > won",
    "idx": 2062
  },
  {
    "filename": "train.json",
    "db_id": "professional_basketball",
    "gql_statement": "MATCH (`t1`:`coaches`)-[coaches_0:coaches]->(`t2`:`teams`)\nWHERE `t1`.`tmid` = `t2`.`tmid` AND `t1`.`year` = `t2`.`year`\nAND (`t1`.`year` >= 1990 AND `t1`.`year` <= 1995 AND `t1`.`coachid` = 'adelmri01')\nRETURN `t2`.`name` AS `name`, `t1`.`year` AS `year`, `t2`.`o_pts` AS `o_pts`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which are the teams coached by 'adelmri01' from year 1990-1995. List the team name, year and offense point.",
    "evidence": "year 1990-1995 refers to year between 1990 and 1995; 'adelmri01' is the coachID; offense point refers to o_fgm",
    "idx": 2063
  }
]