[
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nWHERE `addresses`.`zip_postcode` =~ '(?i)(?s)4.*'\nRETURN `addresses`.`state_province_county` AS `state_province_county`, `addresses`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the state and country of all cities with post code starting with 4.",
    "evidence": "",
    "idx": 6213
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nWITH `addresses`.`country` AS _groupby_col_0, COUNT(`addresses`.`address_id`) AS _groupby_col_1\nWHERE _groupby_col_1 > 4\nRETURN _groupby_col_0 AS `country`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the countries having more than 4 addresses listed.",
    "evidence": "",
    "idx": 6215
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customer_contact_channels`:`customer_contact_channels`)\nWITH `customer_contact_channels`.`channel_code` AS _groupby_col_0, COUNT(`customer_contact_channels`.`customer_id`) AS _groupby_col_1\nWHERE _groupby_col_1 < 5\nRETURN _groupby_col_0 AS `channel_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the contact channel codes that were used less than 5 times.",
    "evidence": "",
    "idx": 6217
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t2`:`customer_contact_channels`)-[customer_0:customer]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`customer_name` = 'Tillman Ernser')\nRETURN DISTINCT `t2`.`channel_code` AS `channel_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which contact channel has been used by the customer with name \"Tillman Ernser\"?",
    "evidence": "",
    "idx": 6219
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t2`:`customer_contact_channels`)-[customer_0:customer]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`customer_name` = 'Tillman Ernser')\nRETURN MAX(`t2`.`active_to_date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the \"active to date\" of the latest contact channel used by \"Tillman Ernser\"?",
    "evidence": "",
    "idx": 6221
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customer_contact_channels`:`customer_contact_channels`)\nRETURN avg(duration.between(`customer_contact_channels`.`active_to_date`,`customer_contact_channels`.`active_from_date`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average time span of contact channels in the database?",
    "evidence": "",
    "idx": 6223
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "CALL(*) {\nMATCH (`customer_contact_channels_sub0`:`customer_contact_channels`)\nORDER BY (duration.between(`customer_contact_channels_sub0`.`active_to_date`,`customer_contact_channels_sub0`.`active_from_date`)) IS NULL ASC, (duration.between(`customer_contact_channels_sub0`.`active_to_date`,`customer_contact_channels_sub0`.`active_from_date`)) DESC \nRETURN duration.between(`customer_contact_channels_sub0`.`active_to_date`,`customer_contact_channels_sub0`.`active_from_date`) AS `_col_0`  LIMIT 1\n}\nMATCH (`customer_contact_channels`:`customer_contact_channels`)\nWHERE duration.between(`customer_contact_channels`.`active_to_date`,`customer_contact_channels`.`active_from_date`) = `_col_0`\nRETURN `customer_contact_channels`.`channel_code` AS `channel_code`, `customer_contact_channels`.`contact_number` AS `contact_number`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the channel code and contact number of the customer contact channel that was active for the longest time?",
    "evidence": "",
    "idx": 6225
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t2`:`customer_contact_channels`)-[customer_0:customer]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`channel_code` = 'Email')\nRETURN `t1`.`customer_name` AS `customer_name`, `t2`.`active_from_date` AS `active_from_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name and active date of the customer that use email as the contact channel.",
    "evidence": "",
    "idx": 6227
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t2`:`customer_contact_channels`)-[customer_0:customer]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`channel_code` = 'Email')\nRETURN `t1`.`customer_name` AS `customer_name`, `t2`.`active_from_date` AS `active_from_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the name and active date of the customers whose contact channel code is email?",
    "evidence": "",
    "idx": 6228
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t2`:`customer_orders`)-[customer_0:customer]->(`t1`:`customers`)\nMATCH (`t2`:`customer_orders`)-[t3:contains_product]->()\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`order_id` = `t3`.`order_id`\nAND (`t1`.`customer_name` = 'Rodrick Heaney')\nRETURN COUNT(DISTINCT `t3`.`product_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many types of products have Rodrick Heaney bought in total?",
    "evidence": "",
    "idx": 6229
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customer_orders`:`customer_orders`)\nWHERE `customer_orders`.`order_status` = 'Cancelled'\nRETURN COUNT(DISTINCT `customer_orders`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers have at least one order with status \"Cancelled\"?",
    "evidence": "",
    "idx": 6231
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customer_orders`:`customer_orders`)\nWHERE `customer_orders`.`order_details` = 'Second time'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many orders have detail \"Second time\"?",
    "evidence": "",
    "idx": 6233
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customer_orders`:`customer_orders`)\nWHERE `customer_orders`.`order_details` = 'Second time'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Tell me the number of orders with \"Second time\" as order detail.",
    "evidence": "",
    "idx": 6234
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t2`:`customer_orders`)-[customer_0:customer]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`order_status` = 'Delivered')\nRETURN `t1`.`customer_name` AS `customer_name`, `t2`.`order_date` AS `order_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the customer name and date of the orders that have the status \"Delivered\".",
    "evidence": "",
    "idx": 6235
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t1`:`customer_orders`)-[t2:contains_product]->()\nWHERE `t1`.`order_id` = `t2`.`order_id`\nAND (`t1`.`order_date` < '2018-03-17 07:13:53')\nRETURN sum(`t2`.`order_quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the total amount of products ordered before 2018-03-17 07:13:53.",
    "evidence": "",
    "idx": 6237
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t1`:`customer_orders`)-[t2:contains_product]->()\nWHERE `t1`.`order_id` = `t2`.`order_id`\nAND (`t1`.`order_date` < '2018-03-17 07:13:53')\nRETURN sum(`t2`.`order_quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total amount of products purchased before 2018-03-17 07:13:53?",
    "evidence": "",
    "idx": 6238
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t2`:`customer_orders`)-[customer_0:customer]->(`t1`:`customers`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nORDER BY `t2`.`order_date` IS NULL ASC, `t2`.`order_date` DESC \nRETURN `t1`.`customer_name` AS `customer_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the customer who made an order most recently.",
    "evidence": "",
    "idx": 6240
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nWHERE `addresses`.`city` = 'East Julianaside' AND `addresses`.`state_province_county` = 'Texas'\nRETURN `addresses`.`address_content` AS `address_content`   \nUNION DISTINCT\nMATCH (`addresses`:`addresses`)\nWHERE `addresses`.`city` = 'Gleasonmouth' AND `addresses`.`state_province_county` = 'Arizona'\nRETURN `addresses`.`address_content` AS `address_content`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find all the addresses in East Julianaside, Texas or in Gleasonmouth, Arizona.",
    "evidence": "",
    "idx": 6241
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`payment_method` <> 'Cash'\nRETURN `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of customers who did not pay with Cash.",
    "evidence": "",
    "idx": 6243
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`payment_method` <> 'Cash'\nRETURN `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the name of customers who do not use Cash as payment method.",
    "evidence": "",
    "idx": 6244
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`artist`:`artist`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of artists.",
    "evidence": "",
    "idx": 6246
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`artist`:`artist`)\nRETURN `artist`.`age` AS `age`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the age of all music artists.",
    "evidence": "",
    "idx": 6247
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`artist`:`artist`)\nRETURN avg(`artist`.`age`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the average age across all artists.",
    "evidence": "",
    "idx": 6250
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`artist`:`artist`)\nWHERE `artist`.`artist` = 'Triumfall'\nRETURN `artist`.`famous_title` AS `famous_title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the famous titles of the artist \"Triumfall\"?",
    "evidence": "",
    "idx": 6251
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`artist`:`artist`)\nWHERE `artist`.`artist` = 'Triumfall'\nRETURN `artist`.`famous_title` AS `famous_title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the famous titles of the artist called \"Triumfall\".",
    "evidence": "",
    "idx": 6252
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`artist`:`artist`)\nRETURN DISTINCT (`artist`.`famous_release_date`) AS `famous_release_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the distinct famous release dates for all artists.",
    "evidence": "",
    "idx": 6254
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`music_festival`:`music_festival`)\nRETURN `music_festival`.`date_of_ceremony` AS `date_of_ceremony`, `music_festival`.`result` AS `result`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the dates of ceremony and the results of all music festivals",
    "evidence": "",
    "idx": 6255
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`music_festival`:`music_festival`)\nWHERE `music_festival`.`result` = 'Awarded'\nRETURN `music_festival`.`category` AS `category`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the category of music festivals with result \"Awarded\"?",
    "evidence": "",
    "idx": 6257
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`music_festival`:`music_festival`)\nWHERE `music_festival`.`result` = 'Awarded'\nRETURN `music_festival`.`category` AS `category`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the categories of music festivals that have the result \"Awarded\".",
    "evidence": "",
    "idx": 6258
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`volume`:`volume`)\nRETURN MAX(`volume`.`weeks_on_top`) AS `_col_0`, min(`volume`.`weeks_on_top`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the maximum and minimum weeks on top across all volumes.",
    "evidence": "",
    "idx": 6260
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`volume`:`volume`)\nWHERE `volume`.`weeks_on_top` > 1\nRETURN `volume`.`song` AS `song`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the songs included in volumes that have more than 1 week on top.",
    "evidence": "",
    "idx": 6262
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`volume`:`volume`)\nRETURN `volume`.`song` AS `song` ORDER BY `song` IS NULL DESC, `song`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please list all songs in volumes in ascending alphabetical order.",
    "evidence": "",
    "idx": 6263
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`volume`:`volume`)\nRETURN COUNT(DISTINCT `volume`.`artist_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of distinct artists who have volumes.",
    "evidence": "",
    "idx": 6266
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`t1`:`music_festival`)-[features_volume_0:features_volume]->(`t2`:`volume`)\nWHERE `t1`.`volume` = `t2`.`volume_id`\nAND (`t2`.`weeks_on_top` > 2)\nRETURN `t1`.`date_of_ceremony` AS `date_of_ceremony`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the date of ceremony of the volumes that last more than 2 weeks on top.",
    "evidence": "",
    "idx": 6267
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`t1`:`music_festival`)-[features_volume_0:features_volume]->(`t2`:`volume`)\nWHERE `t1`.`volume` = `t2`.`volume_id`\nAND (`t1`.`result` = 'Nominated')\nRETURN `t2`.`song` AS `song`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the songs that have result \"nominated\" at music festivals.",
    "evidence": "",
    "idx": 6269
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`t2`:`volume`)-[by_artist_0:by_artist]->(`t1`:`artist`)\nWHERE `t1`.`artist_id` = `t2`.`artist_id`\nAND (`t1`.`artist` = 'Gorgoroth')\nRETURN `t2`.`issue_date` AS `issue_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the issue dates of volumes associated with the artist \"Gorgoroth\"?",
    "evidence": "",
    "idx": 6271
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`t2`:`volume`)-[by_artist_0:by_artist]->(`t1`:`artist`)\nWHERE `t1`.`artist_id` = `t2`.`artist_id`\nAND (`t1`.`artist` = 'Gorgoroth')\nRETURN `t2`.`issue_date` AS `issue_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the issue dates of volumes that are by the artist named Gorgoroth.",
    "evidence": "",
    "idx": 6272
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`t2`:`volume`)-[by_artist_0:by_artist]->(`t1`:`artist`)\nWHERE `t1`.`artist_id` = `t2`.`artist_id`\nAND (`t1`.`age` >= 32)\nRETURN `t2`.`song` AS `song`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return names of songs in volumes that are by artists that are at least 32 years old.",
    "evidence": "",
    "idx": 6274
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`t2`:`volume`)-[by_artist_0:by_artist]->(`t1`:`artist`)\nWHERE `t1`.`artist_id` = `t2`.`artist_id`\nAND (`t1`.`age` <= 25)\nRETURN avg(`t2`.`weeks_on_top`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the average number of weeks on top for volumes by artists that are at most 25 years old.",
    "evidence": "",
    "idx": 6276
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`t2`:`volume`)-[by_artist_0:by_artist]->(`t1`:`artist`)\nWHERE `t1`.`artist_id` = `t2`.`artist_id`\nAND (`t2`.`weeks_on_top` > 2)\nRETURN `t1`.`famous_title` AS `famous_title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the famous titles for artists that have volumes that lasted more than 2 weeks on top.",
    "evidence": "",
    "idx": 6278
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`artist`:`artist`)\nRETURN `artist`.`famous_title` AS `famous_title`, `artist`.`age` AS `age` ORDER BY `age` IS NULL ASC, `age` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please list the age and famous title of artists in descending order of age.",
    "evidence": "",
    "idx": 6279
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`artist`:`artist`)\nORDER BY `artist`.`age` IS NULL ASC, `artist`.`age` DESC \nRETURN `artist`.`famous_release_date` AS `famous_release_date`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the famous release date for the oldest artist.",
    "evidence": "",
    "idx": 6282
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`music_festival`:`music_festival`)\nWITH `music_festival`.`category` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `category`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the categories of the music festivals and the count.",
    "evidence": "",
    "idx": 6283
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`music_festival`:`music_festival`)\nWITH `music_festival`.`category` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `category`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the categories of the music festivals with count more than 1.",
    "evidence": "",
    "idx": 6285
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "WITH *, COLLECT { MATCH (`volume_sub0`:`volume`)\nRETURN `volume_sub0`.`artist_id` AS `artist_id`   } AS in_collect_0\nMATCH (`artist`:`artist`)\nWHERE NOT `artist`.`artist_id` IN in_collect_0\nRETURN `artist`.`famous_title` AS `famous_title`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the famous titles of artists that do not have any volume.",
    "evidence": "",
    "idx": 6289
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`music_festival`:`music_festival`)\nWHERE `music_festival`.`category` = 'Best Song' AND `music_festival`.`result` = 'Awarded'\nRETURN `music_festival`.`date_of_ceremony` AS `date_of_ceremony`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the date of ceremony of music festivals with category \"Best Song\" and result \"Awarded\"?",
    "evidence": "",
    "idx": 6291
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`volume`:`volume`)\nORDER BY `volume`.`weeks_on_top` IS NULL DESC, `volume`.`weeks_on_top`  \nRETURN `volume`.`issue_date` AS `issue_date`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the issue date of the volume that has spent the fewest weeks on top.",
    "evidence": "",
    "idx": 6294
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`volume`:`volume`)\nRETURN COUNT(DISTINCT `volume`.`artist_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of artists who have had volumes.",
    "evidence": "",
    "idx": 6296
  },
  {
    "filename": "train_spider.json",
    "db_id": "music_4",
    "gql_statement": "MATCH (`music_festival`:`music_festival`)\nWITH `music_festival`.`result` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `result`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Please show the results of music festivals and the number of music festivals that have had each, ordered by this count.",
    "evidence": "",
    "idx": 6297
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`roller_coaster`:`roller_coaster`)\nORDER BY `roller_coaster`.`length` IS NULL DESC, `roller_coaster`.`length`  \nRETURN `roller_coaster`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of roller coasters by ascending order of length.",
    "evidence": "",
    "idx": 6302
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`languages` <> 'German'\nRETURN `country`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the names of countries whose language is not \"German\".",
    "evidence": "",
    "idx": 6304
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`roller_coaster`:`roller_coaster`)\nWHERE `roller_coaster`.`length` > 3300 OR `roller_coaster`.`height` > 100\nRETURN `roller_coaster`.`status` AS `status`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the statuses of roller coasters longer than 3300 or higher than 100.",
    "evidence": "",
    "idx": 6305
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`roller_coaster`:`roller_coaster`)\nRETURN avg(toFloat(`roller_coaster`.`speed`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average speed of roller coasters?",
    "evidence": "",
    "idx": 6307
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`roller_coaster`:`roller_coaster`)\nWITH `roller_coaster`.`status` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `status`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the different statuses and the numbers of roller coasters for each status.",
    "evidence": "",
    "idx": 6308
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`roller_coaster`:`roller_coaster`)\nWITH `roller_coaster`.`status` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `status`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List the status shared by more than two roller coaster.",
    "evidence": "",
    "idx": 6309
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`roller_coaster`:`roller_coaster`)\nORDER BY `roller_coaster`.`speed` IS NULL ASC, `roller_coaster`.`speed` DESC \nRETURN `roller_coaster`.`park` AS `park`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the park of the roller coaster with the highest speed.",
    "evidence": "",
    "idx": 6310
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`t2`:`roller_coaster`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nRETURN `t2`.`name` AS `name`, `t1`.`name` AS `name_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of roller coasters and names of country they are in.",
    "evidence": "",
    "idx": 6311
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`t2`:`roller_coaster`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nWITH `t1`.`name` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 1\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of countries that have more than one roller coaster.",
    "evidence": "",
    "idx": 6312
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`t2`:`roller_coaster`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nORDER BY `t2`.`height` IS NULL ASC, `t2`.`height` DESC \nRETURN `t1`.`name` AS `name`, `t1`.`population` AS `population`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the name and population of the country that has the highest roller coaster.",
    "evidence": "",
    "idx": 6313
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "MATCH (`t2`:`roller_coaster`)-[located_in_0:located_in]->(`t1`:`country`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nWITH `t1`.`name` AS _groupby_col_0, avg(toFloat(`t2`.`speed`)) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the names of countries and the average speed of roller coasters from each country.",
    "evidence": "",
    "idx": 6314
  },
  {
    "filename": "train_spider.json",
    "db_id": "roller_coaster",
    "gql_statement": "WITH *, COLLECT { MATCH (`roller_coaster_sub0`:`roller_coaster`)\nWHERE `roller_coaster_sub0`.`length` > 3000\nRETURN `roller_coaster_sub0`.`country_id` AS `country_id`   } AS in_collect_0\nMATCH (`country`:`country`)\nWHERE NOT `country`.`country_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many countries do not have an roller coaster longer than 3000?",
    "evidence": "",
    "idx": 6315
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`captain`:`captain`)\nRETURN COUNT(DISTINCT `captain`.`rank`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of different ranks of captain.",
    "evidence": "",
    "idx": 6317
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`captain`:`captain`)\nWITH `captain`.`rank` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `rank`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of captains that have each rank.",
    "evidence": "",
    "idx": 6319
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`captain`:`captain`)\nWHERE `captain`.`age` < '50'\nWITH `captain`.`rank` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0`, _groupby_col_0 AS `rank`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of captains younger than 50 of each rank.",
    "evidence": "",
    "idx": 6321
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`captain`:`captain`)\nORDER BY `captain`.`age` IS NULL ASC, `captain`.`age` DESC \nRETURN `captain`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Sort all captain names by their ages from old to young.",
    "evidence": "",
    "idx": 6322
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`captain`:`captain`)\nRETURN `captain`.`name` AS `name`, `captain`.`class` AS `class`, `captain`.`rank` AS `rank`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name, class and rank of all captains.",
    "evidence": "",
    "idx": 6324
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`captain`:`captain`)\nWITH `captain`.`class` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 > 2\nRETURN _groupby_col_0 AS `class`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Give the classes that have more than two captains.",
    "evidence": "",
    "idx": 6327
  },
  {
    "filename": "train_spider.json",
    "db_id": "ship_1",
    "gql_statement": "MATCH (`captain`:`captain`)\nWHERE `captain`.`rank` = 'Midshipman' OR `captain`.`rank` = 'Lieutenant'\nRETURN `captain`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of captains whose rank are either Midshipman or Lieutenant.",
    "evidence": "",
    "idx": 6328
  }
]