[
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t1`.`title` =~ '(?i)(?s)Pirates of the Caribbean: At World.*s End' AND `t2`.`job` = 'Producer')\nRETURN `t3`.`person_name` AS `person_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the names of all the producers in the movie \"Pirates of the Caribbean: At World's End\".",
    "evidence": "names refers to person_name; producers refers to job = 'Producer'; \"Pirates of the Caribbean: At World's End\" refers to title = 'Pirates of the Caribbean: At World''s End'",
    "idx": 223
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`revenue` = 559852396\nRETURN `movie`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the name of the movie with a revenue of 559852396.",
    "evidence": "name of the movie refers to title; revenue of 559852396 refers to revenue = '559852396'",
    "idx": 229
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t3`.`person_name` = 'David Rubin' AND `t1`.`title` = 'Days of Thunder')\nRETURN `t2`.`job` AS `job`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What was David Rubin's job in the movie \"Days of Thunder\"?",
    "evidence": "\"Days of Thunder\" refers to title = 'Days of Thunder'",
    "idx": 230
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)\nMATCH (`t2`:`movie_keywords`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (`t1`.`title` = 'I Hope They Serve Beer in Hell')\nRETURN COUNT(`t2`.`keyword_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Show the total number of keywords of the movie \"I Hope They Serve Beer in Hell\".",
    "evidence": "\"I Hope They Serve Beer in Hell\" refers to title = 'I Hope They Serve Beer in Hell';",
    "idx": 232
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t2`:`movie_company`)\nMATCH (`t1`:`production_company`)\nWHERE `t1`.`company_id` = `t2`.`company_id`\nAND (`t1`.`company_name` = 'Paramount Animation')\nRETURN COUNT(`t2`.`movie_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the number of movies made by Paramount Animation.",
    "evidence": "Paramount Animation refers to company_name = 'Paramount Animation'",
    "idx": 234
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t3`:`gender`)\nMATCH (`t1`:`movie`)-[t2:has_cast]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`gender_id` = `t3`.`gender_id`\nAND (`t1`.`title` = 'Spider-Man 3' AND `t3`.`gender` = 'Female')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many female characters are there in the movie \"Spider-Man 3\"?",
    "evidence": "female characters refer to gender = 'Female'; \"Spider-Man 3\" refers to title = 'Spider-Man 3'",
    "idx": 235
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (`t1`.`title` = 'The Amityville Horror' AND `t2`.`job` = 'Producer')\nRETURN COUNT(`t2`.`person_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many producers does the movie \"The Amityville Horror\" have?",
    "evidence": "producers refers to job = 'Producer'; \"The Amityville Horror\" refers to title = 'The Amityville Horror'",
    "idx": 236
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`keyword`)\nMATCH (`t2`:`movie_keywords`)\nWHERE `t1`.`keyword_id` = `t2`.`keyword_id`\nAND (`t1`.`keyword_name` = 'saving the world')\nRETURN COUNT(`t2`.`movie_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the number of movies with \"saving the world\" as the keyword.",
    "evidence": "\"saving the world\" as the keyword refers to keyword_name = 'saving the world'",
    "idx": 237
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t3`.`person_name` = 'Jaume Collet-Serra' AND `t2`.`job` = 'Director')\nRETURN CASE WHEN COUNT(`t1`.`movie_id`)=0 THEN NULL ELSE toFloat(sum(`t1`.`budget`)) / COUNT(`t1`.`movie_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average budget of the movies directed by Jaume Collet-Serra.",
    "evidence": "directed by refers to job = 'Director'; average budget = AVG(budget)",
    "idx": 239
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t3`:`gender`)\nMATCH (`t1`:`movie`)-[t2:has_cast]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`gender_id` = `t3`.`gender_id`\nAND (`t1`.`title` = 'Bride Wars')\nRETURN CASE WHEN COUNT(`t3`.`gender`)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t3`.`gender` = 'Male' THEN 1 ELSE NULL END)) * 100 / COUNT(`t3`.`gender`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of male characters in the movie \"Bride Wars\"?",
    "evidence": "male refers to gender = 'Male'; \"Bride Wars\" refers to title = 'Bride Wars'; percentage = divide(sum(gender = 'Male'), count(gender)) * 100 as percentage",
    "idx": 240
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`movie_status` = 'Released'\nRETURN min(`movie`.`release_date`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "When was the first movie released?",
    "evidence": "when the first movie refers to release_date where min(release_date)",
    "idx": 243
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`movie`:`movie`)\nORDER BY `movie`.`popularity` IS NULL ASC, `movie`.`popularity` DESC \nRETURN `movie`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the title of the movie that is most-liked by a large number of people.",
    "evidence": "most-liked by a large number of people refers to max(popularity)",
    "idx": 245
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t3`:`gender`)\nMATCH (`t1`:`movie`)-[t2:has_cast]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`gender_id` = `t3`.`gender_id`\nAND (`t1`.`title` = 'Mr. Smith Goes to Washington' AND `t3`.`gender` = 'Female')\nRETURN COUNT(`t3`.`gender`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many female crews are in the movie \"Mr. Smith Goes to Washington\"?",
    "evidence": "female crews refers to gender = 'Female'; \"Mr. Smith Goes to Washington\" refers to title = 'Mr. Smith Goes to Washington'",
    "idx": 249
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_cast]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t3`.`person_name` = 'Quentin Tarantino' AND toInteger(CASE WHEN `t1`.`release_date` is not NULL THEN apoc.temporal.format(`t1`.`release_date`,'yyyy') ELSE NULL END) = 1995)\nRETURN COUNT(`t1`.`movie_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many movies released in 1995 did Quentin Tarantino appear in?",
    "evidence": "released in 1995 refers to release_date LIKE '1995%'",
    "idx": 252
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:acted_in]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t1`.`person_name` = 'Jim Carrey')\nRETURN `t2`.`movie_id` AS `movie_id`, `t2`.`character_name` AS `character_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tally the movie ID and character name in the movie starring Jim Carrey.",
    "evidence": "",
    "idx": 260
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t3`:`gender`)\nMATCH ()-[t1:has_cast]->(`t2`:`person`)\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND `t1`.`gender_id` = `t3`.`gender_id`\nAND (`t1`.`movie_id` = 1865 AND `t3`.`gender` = 'Female')\nRETURN `t2`.`person_name` AS `person_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the names of the female cast in Movie No. 1865.",
    "evidence": "female cast refers to gender = 'Female'; name of cast refers to person_name; Movie No. 1865 refers to movie_id = 1865",
    "idx": 261
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_cast]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t3`.`person_name` = 'Jim Carrey')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write me the titles of the movies starring Jim Carrey.",
    "evidence": "Jim Carrey is the person_name;",
    "idx": 262
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->(`t3`:`genre`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`genre_id` = `t3`.`genre_id`\nAND (`t3`.`genre_name` = 'Horror' AND `t1`.`vote_average` > 7)\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write the titles of horror films with a vote average of more than 7.",
    "evidence": "horror films refers to genre_name = 'Horror'; vote average of more than 7 refers to vote_average > 7",
    "idx": 264
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->(`t3`:`genre`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`genre_id` = `t3`.`genre_id`\nAND (`t1`.`revenue` > 120000000 AND `t1`.`release_date` >= localdatetime('2012-01-01T00:00:00') AND `t1`.`release_date` <= localdatetime('2015-12-31T00:00:00'))\nRETURN `t3`.`genre_name` AS `genre_name`, `t1`.`popularity` AS `popularity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Give the genre and popularity of movies whose revenue is at least 120,000,000 between 2012 and 2015.",
    "evidence": "genre refers to genre_name; revenue is at least 120,000,000 refers to revenue > = 120000000; between 2012 and 2015 refers to release_date BETWEEN '2012-01-01' AND '2015-12-31'",
    "idx": 265
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:produced_in]->(`t3`:`country`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`country_id` = `t3`.`country_id`\nORDER BY `t1`.`budget` IS NULL ASC, `t1`.`budget` DESC \nRETURN `t1`.`title` AS `title`, `t1`.`revenue` AS `revenue`, `t3`.`country_name` AS `country_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of the highest-budget film to date? Please include the revenue and name the country.",
    "evidence": "highest-budget film refers to max(budget); name the country refers to country_name",
    "idx": 267
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_language]->(`t3`:`language`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`language_id` = `t3`.`language_id`\nAND (`t3`.`language_name` = 'Latin' AND `t1`.`release_date` >= localdatetime('1990-01-01T00:00:00') AND `t1`.`release_date` <= localdatetime('1995-12-31T00:00:00'))\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the title of movies in Latin released between 1/01/1990 and 12/31/1995.",
    "evidence": "movies in Latin refers to language_name = 'Latin'; released between 1/01/1990 and 12/31/1995 refers to release_date BETWEEN '1990-01-01' AND '1995-12-31'",
    "idx": 268
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:produced_in]->(`t3`:`country`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`country_id` = `t3`.`country_id`\nAND (`t3`.`country_name` = 'United States of America' AND toInteger(CASE WHEN `t1`.`release_date` is not NULL THEN apoc.temporal.format(`t1`.`release_date`,'yyyy') ELSE NULL END) = 2006)\nRETURN avg(`t1`.`revenue`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average revenue of American movies in 2006?",
    "evidence": "American movies refers to country_name = 'United States of America'; in 2006 refers to release_date LIKE '2006%'; average revenue = AVG(revenue)",
    "idx": 269
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:produced_in]->(`t3`:`country`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`country_id` = `t3`.`country_id`\nAND (toInteger(CASE WHEN `t1`.`release_date` is not NULL THEN apoc.temporal.format(`t1`.`release_date`,'yyyy') ELSE NULL END) = 2016)\nRETURN avg(CASE  WHEN `t3`.`country_name` = 'United States of America' THEN `t1`.`revenue`  END) - avg(CASE  WHEN `t3`.`country_name` = 'India' THEN `t1`.`revenue`  END) AS `calculate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the 2016 gap between the average revenue for Indian and American films.",
    "evidence": "2016 refers to release_date LIKE '2016%'; Indian and American films refers to country_name = 'India' and country_name = 'United States of America'; gap between the average revenue refers to subtract(divide(sum(revenue), count(movie_id)) when country_name = 'United States of America', divide(sum(revenue), count(movie_id)) when country_name = 'India')",
    "idx": 270
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t2`:`gender`)\nMATCH ()-[t1:has_cast]->()\nWHERE `t1`.`gender_id` = `t2`.`gender_id`\nAND (`t1`.`character_name` = 'USAF Master Sgt. Epps')\nRETURN `t2`.`gender` AS `gender`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the gender of the character 'USAF Master Sgt. Epps?'",
    "evidence": "character 'USAF Master Sgt. Epps' refers to character_name = 'USAF Master Sgt. Epps'",
    "idx": 273
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:produced_in]->(`t3`:`country`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`country_id` = `t3`.`country_id`\nAND (`t3`.`country_name` = 'France')\nRETURN `t1`.`title` AS `title`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List 10 movie titles that were produced in France.",
    "evidence": "France refers to country_name = 'France'",
    "idx": 276
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t1`.`title` = 'Transformers' AND `t2`.`job` = 'Director')\nRETURN `t3`.`person_name` AS `person_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the director for the movie 'Transformers?'",
    "evidence": "the director refers to person_name where job = 'Director'; movie 'Transformers' refers to title = 'Transformers'",
    "idx": 277
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_crew]->(`t3`:`person`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`person_id` = `t3`.`person_id`\nAND (`t1`.`title` = 'Mad Max: Fury Road')\nRETURN `t3`.`person_name` AS `person_name`  LIMIT 10",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List 10 crews alongside their jobs who worked on the movie 'Mad Max: Fury Road.'",
    "evidence": "crews refers to person_name; movie 'Mad Max: Fury Road' refers to title = 'Mad Max: Fury Road'",
    "idx": 278
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t3`:`gender`)\nMATCH (`t1`:`movie`)-[t2:has_cast]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`gender_id` = `t3`.`gender_id`\nAND (`t1`.`title` = 'Iron Man')\nRETURN CASE WHEN COUNT(CASE  WHEN `t3`.`gender` = 'Female' THEN 1 ELSE NULL END)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t3`.`gender` = 'Male' THEN 1 ELSE NULL END)) / COUNT(CASE  WHEN `t3`.`gender` = 'Female' THEN 1 ELSE NULL END) END AS `ratio`, COUNT(CASE  WHEN `t3`.`gender` = 'Unspecified' THEN 1 ELSE NULL END) AS `ungenders`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ratio between male and female cast members of the movie 'Iron Man?' Count how many have unspecified genders.",
    "evidence": "male refers to gender = 'Male'; female refers to gender = 'Female'; movie 'Iron Man' refers to title = 'Iron Man'; ratio = divide(sum(gender = 'Female'), sum(gender = 'Male'))",
    "idx": 280
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE toInteger(CASE WHEN `movie`.`release_date` is not NULL THEN apoc.temporal.format(`movie`.`release_date`,'yyyy') ELSE NULL END) < 2000\nRETURN `movie`.`title` AS `title`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down five movie titles that were released before 2000.",
    "evidence": "released before 2000 refers to release_date < '2000-01-01'",
    "idx": 281
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)\nMATCH (`t2`:`movie_keywords`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (`t1`.`title` = 'Sin City')\nRETURN `t2`.`keyword_id` AS `keyword_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the keyword ID of the movie with the title of \"Sin City\"?",
    "evidence": "title of \"Sin City\" refers to title = 'Sin City'",
    "idx": 282
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (`t1`.`title` = 'The Dark Knight')\nRETURN `t2`.`genre_id` AS `genre_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the genre ID of the movie with the title of \"The Dark Knight\".",
    "evidence": "movie with the title of \"The Dark Knight\" refers to title = 'The Dark Knight'",
    "idx": 283
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->(`t3`:`genre`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`genre_id` = `t3`.`genre_id`\nAND (`t3`.`genre_name` = 'Thriller')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the movie titles within the genre of thriller.",
    "evidence": "genre of thriller refers to genre_name = 'Thriller'",
    "idx": 284
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->(`t3`:`genre`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`genre_id` = `t3`.`genre_id`\nAND (`t1`.`movie_status` = 'Rumored' AND `t3`.`genre_name` = 'Drama')\nRETURN `t1`.`title` AS `title`  LIMIT 5",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down five rumoured movie titles within the genre of Drama.",
    "evidence": "rumoured movie refers to movie_status = 'rumoured'; genre of Drama refers to genre_name = 'Drama'",
    "idx": 285
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->(`t3`:`genre`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`genre_id` = `t3`.`genre_id`\nAND (`t1`.`runtime` = 14)\nRETURN `t3`.`genre_name` AS `genre_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the genre of the movie title with a runtime of only 14 minutes.",
    "evidence": "genre refers to genre_name; runtime of only 14 minutes refers to runtime = 14",
    "idx": 287
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_genre]->()\nMATCH (`t3`:`genre`)-[t2:genre_of]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t3`.`genre_id` = `t2`.`genre_id`\nAND (`t1`.`tagline` = 'A long time ago in a galaxy far, far away...')\nRETURN `t3`.`genre_name` AS `genre_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the genre of a movie title with a tagline of \"A long time ago in a galaxy far, far away…\".",
    "evidence": "genre refers to genre_name; tagline of \"A long time ago in a galaxy far, far away…\" refers to tagline = 'A long time ago in a galaxy far, far away…'",
    "idx": 289
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:produced_in]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (`t1`.`title` =~ '(?i)(?s)Pirates of the Caribbean: Dead Man.*s Chest')\nRETURN `t2`.`country_id` AS `country_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the country ID of the movie with the title of \"Pirates of the Caribbean: Dead Man's Chest\"?",
    "evidence": "title of \"Pirates of the Caribbean: Dead Man's Chest\" refers to title = 'Pirates of the Caribbean: Dead Man''s Chest'",
    "idx": 290
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:produced_in]->(`t3`:`country`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`country_id` = `t3`.`country_id`\nAND (`t3`.`country_name` = 'Canada')\nRETURN `t1`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the movie titles that were produced in Canada.",
    "evidence": "produced in Canada refers to country_name = 'Canada'",
    "idx": 291
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`movie`:`movie`)\nORDER BY `movie`.`vote_count` IS NULL ASC, `movie`.`vote_count` DESC \nRETURN `movie`.`popularity` AS `popularity`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find out the popularity of the movies with the highest vote count.",
    "evidence": "highest vote count refers to max(vote_count)",
    "idx": 292
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t2`:`movie_company`)\nMATCH (`t1`:`movie`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (`t1`.`title` = 'Gladiator')\nRETURN `t2`.`company_id` AS `company_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the ID of the production company which produced the movie \"Gladiator\"?",
    "evidence": "ID of the production company refers to company_id; movie \"Gladiator\" refers to title = 'Gladiator'",
    "idx": 294
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t2`:`movie_company`)\nMATCH (`t1`:`movie`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (toInteger(CASE WHEN `t1`.`release_date` is not NULL THEN apoc.temporal.format(`t1`.`release_date`,'yyyy') ELSE NULL END) = 1916)\nRETURN `t2`.`company_id` AS `company_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the IDs of the production companies that released the movies in 1916.",
    "evidence": "IDs of the production companies refers to company_id; movies in 1916 refers to release_date LIKE '1916%'",
    "idx": 295
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_language]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND (`t1`.`title` = 'Walk the Line')\nRETURN `t2`.`language_id` AS `language_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the language ID of the movie \"Walk the Line\"?",
    "evidence": "movie \"Walk the Line\" refers to title = 'Walk the Line'",
    "idx": 296
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_language]->()\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nORDER BY `t1`.`popularity` IS NULL ASC, `t1`.`popularity` DESC \nRETURN `t2`.`language_id` AS `language_id`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Find out the language ID of the movie with the highest popularity.",
    "evidence": "highest popularity refers to max(popularity)",
    "idx": 297
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_language]->(`t3`:`language`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`language_id` = `t3`.`language_id`\nAND (`t1`.`title` =~ '(?i)(?s)C.*era una volta il West')\nRETURN `t3`.`language_name` AS `language_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Tell the language of the movie \"C'era una volta il West\".",
    "evidence": "language refers to language_name; movie \"C'era una volta il West\" refers to title = 'C''era una volta il West'",
    "idx": 298
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_language]->(`t3`:`language`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`language_id` = `t3`.`language_id`\nAND (`t3`.`language_name` = 'Polski')\nRETURN DISTINCT `t1`.`tagline` AS `tagline`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the tagline of the Polski movies.",
    "evidence": "Polski movies refers to language_name = 'Polski'",
    "idx": 300
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_language]->(`t3`:`language`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`language_id` = `t3`.`language_id`\nAND (`t3`.`language_name` = 'Bahasa indonesia')\nRETURN DISTINCT `t1`.`homepage` AS `homepage`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the homepage of the Bahasa Indonesia movies.",
    "evidence": "Bahasa Indonesia movies refers to language_name = 'Bahasa indonesia'",
    "idx": 301
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`movie`)-[t2:has_language]->(`t3`:`language`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`language_id` = `t3`.`language_id`\nRETURN sum(CASE  WHEN `t3`.`language_name` = 'English' THEN `t1`.`revenue` ELSE 0 END) - sum(CASE  WHEN `t3`.`language_name` = 'Latin' THEN `t1`.`revenue` ELSE 0 END) AS `difference`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Work out the difference in revenues made between the English and Latin movies.",
    "evidence": "English refers to language_name = 'English'; Latin refers to language_name = 'Latin'; difference in revenues = subtract(sum(movie_id) when language_name = 'English', sum(movie_id) when language_name = 'Latin')",
    "idx": 302
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "CALL (*) {\nMATCH ()-[movie_crew_sub0:has_crew]->()\nWITH `movie_crew_sub0`.`movie_id` AS _groupby_col_0, COUNT(`movie_crew_sub0`.`person_id`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `movie_id`, _groupby_col_1 AS `cd`  \n}\nWITH *\nRETURN CASE WHEN COUNT(`movie_id`)=0 THEN NULL ELSE toFloat(sum(`cd`)) / COUNT(`movie_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average number of crews for a movie?",
    "evidence": "average number of crews = divide(count(person_id), COUNT(movie_id))",
    "idx": 304
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`keyword`:`keyword`)\nWHERE `keyword`.`keyword_name` =~ '(?i)(?s).*christmas.*'\nRETURN `keyword`.`keyword_name` AS `keyword_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the keywords with \"christmas\" in them.",
    "evidence": "keywords with \"christmas\" in them refers to keyword_name LIKE '%christmas%'",
    "idx": 305
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`country`:`country`)\nWHERE `country`.`country_name` = 'Kyrgyz Republic'\nRETURN `country`.`country_iso_code` AS `country_iso_code`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the iso code of \"Kyrgyz Republic\"?",
    "evidence": "iso code refers to country_iso_code; \"Kyrgyz Republic\" refers to country_name = 'Kyrgyz Republic'",
    "idx": 307
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`movie`:`movie`)\nWHERE `movie`.`title` = 'The Pacifier'\nRETURN `movie`.`overview` AS `overview`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the overview for the movie \"The Pacifier\".",
    "evidence": "movie \"The Pacifier\" refers to title = 'The Pacifier'",
    "idx": 308
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t2`:`production_company`)\nMATCH (`t1`:`movie_company`)\nWHERE `t1`.`company_id` = `t2`.`company_id`\nAND (`t2`.`company_name` = 'Eddie Murphy Productions')\nRETURN COUNT(`t1`.`movie_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many movies were produced by \"Eddie Murphy Productions\"?",
    "evidence": "produced by \"Eddie Murphy Productions\" refers to company_name = 'Eddie Murphy Productions'",
    "idx": 309
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t1`:`person`)-[t2:acted_in]->()\nWHERE `t1`.`person_id` = `t2`.`person_id`\nAND (`t2`.`character_name` =~ '(?i)(?s).*captain.*')\nRETURN DISTINCT `t1`.`person_name` AS `person_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the actors who have played characters with \"captain\" in their names.",
    "evidence": "List all the actors refers to person_name; characters with \"captain\" in their names refers to character_name LIKE '%captain%';",
    "idx": 310
  },
  {
    "filename": "train.json",
    "db_id": "movies_4",
    "gql_statement": "MATCH (`t4`:`language_role`)\nMATCH (`t1`:`movie`)-[t2:has_language]->(`t3`:`language`)\nWHERE `t1`.`movie_id` = `t2`.`movie_id`\nAND `t2`.`language_id` = `t3`.`language_id`\nAND `t2`.`language_role_id` = `t4`.`role_id`\nAND (`t4`.`language_role` = 'Original' AND `t1`.`tagline` =~ '(?i)(?s)An offer you can.*t refuse.')\nRETURN `t3`.`language_name` AS `language_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the original language of the movie with the tagline \"An offer you can't refuse.\"?",
    "evidence": "language refers to language_name; original language refers to language_role = 'Original'",
    "idx": 312
  }
]