[
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t1`:`tourist_attractions`)-[t3:was_visited_by]->()\nMATCH (`t2`:`visitors`)-[t3:visited]->()\nWHERE `t1`.`tourist_attraction_id` = `t3`.`tourist_attraction_id` AND `t2`.`tourist_id` = `t3`.`tourist_id`\nAND (`t2`.`tourist_details` = 'Vincent' OR `t2`.`tourist_details` = 'Vivian')\nRETURN `t1`.`name` AS `name`, `t3`.`visit_date` AS `visit_date`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of the tourist attractions and the dates when the tourists named Vincent or Vivian visited there?",
    "evidence": "",
    "idx": 6101
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nWITH `hotels`.`star_rating_code` AS _groupby_col_0, avg(`hotels`.`price_range`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `star_rating_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average price of hotels for each star rating code.",
    "evidence": "",
    "idx": 6103
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nWITH `hotels`.`star_rating_code` AS _groupby_col_0, avg(`hotels`.`price_range`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `star_rating_code`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average price range of hotels for each each star rating code?",
    "evidence": "",
    "idx": 6104
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nWITH `hotels`.`pets_allowed_yn` AS _groupby_col_0, avg(`hotels`.`price_range`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `pets_allowed_yn`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average price of hotels for different pet policy.",
    "evidence": "",
    "idx": 6105
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nORDER BY `hotels`.`price_range` IS NULL DESC, `hotels`.`price_range`  \nRETURN `hotels`.`hotel_id` AS `hotel_id`, `hotels`.`star_rating_code` AS `star_rating_code`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the id and star rating of each hotel, ordered by its price from low to high.",
    "evidence": "",
    "idx": 6107
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nORDER BY `hotels`.`price_range` IS NULL ASC, `hotels`.`price_range` DESC \nRETURN `hotels`.`other_hotel_details` AS `other_hotel_details`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the details of the top 3 most expensive hotels.",
    "evidence": "",
    "idx": 6109
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nORDER BY `hotels`.`price_range` IS NULL DESC, `hotels`.`price_range`  \nRETURN `hotels`.`other_hotel_details` AS `other_hotel_details`, `hotels`.`star_rating_code` AS `star_rating_code`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the details and star ratings of the 3 least expensive hotels.",
    "evidence": "",
    "idx": 6111
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`hotels`:`hotels`)\nORDER BY `hotels`.`price_range` IS NULL DESC, `hotels`.`price_range`  \nRETURN `hotels`.`other_hotel_details` AS `other_hotel_details`, `hotels`.`star_rating_code` AS `star_rating_code`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the details and star ratings of the three hotels with the lowest price ranges?",
    "evidence": "",
    "idx": 6112
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`tourist_attractions`:`tourist_attractions`)\nWITH `tourist_attractions`.`how_to_get_there` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `how_to_get_there`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show different ways to get to attractions and the number of attractions that can be accessed in the corresponding way.",
    "evidence": "",
    "idx": 6113
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t2`:`tourist_attractions`)-[located_in_0:located_in]->(`t1`:`locations`)\nWHERE `t1`.`location_id` = `t2`.`location_id`\nAND (`t1`.`address` = '660 Shea Crescent' OR `t2`.`how_to_get_there` = 'walk')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of tourist attractions that can be reached by walk or is at address 660 Shea Crescent?",
    "evidence": "",
    "idx": 6115
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "MATCH (`t2`:`tourist_attractions`)-[located_in_0:located_in]->(`t1`:`locations`)\nWHERE `t1`.`location_id` = `t2`.`location_id`\nAND (`t1`.`address` = '254 Ottilie Junction' OR `t2`.`how_to_get_there` = 'bus')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of tourist attractions that can be reached by bus or is at address 254 Ottilie Junction?",
    "evidence": "",
    "idx": 6119
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[visits_sub0:visited]->()\nRETURN `visits_sub0`.`tourist_id` AS `tourist_id`   } AS in_collect_0\nMATCH (`visitors`:`visitors`)\nWHERE NOT `visitors`.`tourist_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many tourists did not make any visit?",
    "evidence": "",
    "idx": 6121
  },
  {
    "filename": "train_spider.json",
    "db_id": "cre_Theme_park",
    "gql_statement": "WITH *, COLLECT { MATCH ()-[visits_sub0:visited]->()\nRETURN `visits_sub0`.`tourist_id` AS `tourist_id`   } AS in_collect_0\nMATCH (`visitors`:`visitors`)\nWHERE NOT `visitors`.`tourist_id` IN in_collect_0\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of tourists who did not visit any place.",
    "evidence": "",
    "idx": 6122
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`video_games`:`video_games`)\nRETURN DISTINCT `video_games`.`gtype` AS `gtype`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all video game types.",
    "evidence": "",
    "idx": 6127
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`video_games`:`video_games`)\nRETURN `video_games`.`gname` AS `gname`, `video_games`.`gtype` AS `gtype` ORDER BY `gname` IS NULL DESC, `gname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all video games and their types in the order of their names.",
    "evidence": "",
    "idx": 6129
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`video_games`:`video_games`)\nWHERE `video_games`.`gtype` = 'Collectible card game'\nRETURN `video_games`.`gname` AS `gname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all video games with type Collectible card game.",
    "evidence": "",
    "idx": 6131
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`video_games`:`video_games`)\nWHERE `video_games`.`gname` = 'Call of Destiny'\nRETURN `video_games`.`gtype` AS `gtype`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the type of video game Call of Destiny.",
    "evidence": "",
    "idx": 6133
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`video_games`:`video_games`)\nWHERE `video_games`.`gtype` = 'Massively multiplayer online game'\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Count the number of video games with Massively multiplayer online game type .",
    "evidence": "",
    "idx": 6136
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`video_games`:`video_games`)\nWITH `video_games`.`gtype` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `gtype`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all video game types and the number of video games in each type.",
    "evidence": "",
    "idx": 6137
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`city_code` = 'CHI'\nRETURN `student`.`stuid` AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show ids for all students who live in CHI.",
    "evidence": "",
    "idx": 6139
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`advisor` = 1121\nRETURN `student`.`stuid` AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show ids for all students who have advisor 1121.",
    "evidence": "",
    "idx": 6141
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`student`:`student`)\nWHERE `student`.`major` = 600\nRETURN `student`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show first name for all students with major 600.",
    "evidence": "",
    "idx": 6143
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`major` AS _groupby_col_0, avg(`student`.`age`) AS _groupby_col_1, min(`student`.`age`) AS _groupby_col_2, MAX(`student`.`age`) AS _groupby_col_3\nRETURN _groupby_col_0 AS `major`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`, _groupby_col_3 AS `_col_3`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show the average, minimum, and maximum age for different majors.",
    "evidence": "",
    "idx": 6145
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`major` AS _groupby_col_0, avg(`student`.`age`) AS _groupby_col_1, min(`student`.`age`) AS _groupby_col_2, MAX(`student`.`age`) AS _groupby_col_3\nRETURN _groupby_col_0 AS `major`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`, _groupby_col_3 AS `_col_3`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the average, minimum, and max ages for each of the different majors?",
    "evidence": "",
    "idx": 6146
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`advisor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `advisor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all advisors who have at least two students.",
    "evidence": "",
    "idx": 6147
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`student`:`student`)\nWITH `student`.`advisor` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nWHERE _groupby_col_1 >= 2\nRETURN _groupby_col_0 AS `advisor`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the advisors",
    "evidence": "",
    "idx": 6148
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nWHERE `sportsinfo`.`onscholarship` = 'Y'\nRETURN `sportsinfo`.`stuid` AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List ids for all student who are on scholarship.",
    "evidence": "",
    "idx": 6153
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`t2`:`student`)-[has_sports_info_0:has_sports_info]->(`t1`:`sportsinfo`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t1`.`onscholarship` = 'Y')\nRETURN `t2`.`lname` AS `lname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show last names for all student who are on scholarship.",
    "evidence": "",
    "idx": 6155
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nRETURN sum(`sportsinfo`.`gamesplayed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many games are played for all students?",
    "evidence": "",
    "idx": 6157
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nRETURN sum(`sportsinfo`.`gamesplayed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of games played?",
    "evidence": "",
    "idx": 6158
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nWHERE `sportsinfo`.`sportname` = 'Football' AND `sportsinfo`.`onscholarship` = 'Y'\nRETURN sum(`sportsinfo`.`gamesplayed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many games are played for all football games by students on scholarship?",
    "evidence": "",
    "idx": 6159
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nWHERE `sportsinfo`.`sportname` = 'Football' AND `sportsinfo`.`onscholarship` = 'Y'\nRETURN sum(`sportsinfo`.`gamesplayed`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of all football games played by scholarship students?",
    "evidence": "",
    "idx": 6160
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nWITH `sportsinfo`.`sportname` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nRETURN _groupby_col_0 AS `sportname`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all sport name and the number of students.",
    "evidence": "",
    "idx": 6161
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nWITH `sportsinfo`.`stuid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, sum(`sportsinfo`.`gamesplayed`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `stuid`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all student IDs with the number of sports and total number of games played",
    "evidence": "",
    "idx": 6163
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nWITH `sportsinfo`.`stuid` AS _groupby_col_0, COUNT(*) AS _groupby_col_1, sum(`sportsinfo`.`gamesplayed`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `stuid`, _groupby_col_1 AS `_col_1`, _groupby_col_2 AS `_col_2`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of all students along with how many sports and games did they play?",
    "evidence": "",
    "idx": 6164
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nWITH `sportsinfo`.`stuid` AS _groupby_col_0, sum(`sportsinfo`.`hoursperweek`) AS _groupby_col_1\nWHERE _groupby_col_1 > 10\nRETURN _groupby_col_0 AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all student IDs with more than total 10 hours per week on all sports played.",
    "evidence": "",
    "idx": 6165
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`sportsinfo`:`sportsinfo`)\nWITH `sportsinfo`.`stuid` AS _groupby_col_0, sum(`sportsinfo`.`hoursperweek`) AS _groupby_col_1\nWHERE _groupby_col_1 > 10\nRETURN _groupby_col_0 AS `stuid`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the student IDs for everybody who worked for more than 10 hours per week on all sports?",
    "evidence": "",
    "idx": 6166
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`t2`:`student`)-[has_sports_info_0:has_sports_info]->(`t1`:`sportsinfo`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t2`.`fname` = 'David' AND `t2`.`lname` = 'Shieber')\nRETURN sum(`t1`.`hoursperweek`) AS `_col_0`, sum(`t1`.`gamesplayed`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show total hours per week and number of games played for student David Shieber.",
    "evidence": "",
    "idx": 6167
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`t2`:`student`)-[has_sports_info_0:has_sports_info]->(`t1`:`sportsinfo`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t2`.`fname` = 'David' AND `t2`.`lname` = 'Shieber')\nRETURN sum(`t1`.`hoursperweek`) AS `_col_0`, sum(`t1`.`gamesplayed`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of hours per work and number of games played by David Shieber?",
    "evidence": "",
    "idx": 6168
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`t2`:`student`)-[has_sports_info_0:has_sports_info]->(`t1`:`sportsinfo`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t2`.`age` < 20)\nRETURN sum(`t1`.`hoursperweek`) AS `_col_0`, sum(`t1`.`gamesplayed`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show total hours per week and number of games played for students under 20.",
    "evidence": "",
    "idx": 6169
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`t2`:`student`)-[has_sports_info_0:has_sports_info]->(`t1`:`sportsinfo`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t2`.`age` < 20)\nRETURN sum(`t1`.`hoursperweek`) AS `_col_0`, sum(`t1`.`gamesplayed`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the total number of hours per week and number of games played by students under 20?",
    "evidence": "",
    "idx": 6170
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH ()-[plays_games:plays]->()\nWITH `plays_games`.`gameid` AS _groupby_col_0, sum(`plays_games`.`hours_played`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `gameid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are ids and total number of hours played for each game?",
    "evidence": "",
    "idx": 6174
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH ()-[plays_games:plays]->()\nWITH `plays_games`.`stuid` AS _groupby_col_0, sum(`plays_games`.`hours_played`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `stuid`, _groupby_col_1 AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the ids of all students and number of hours played?",
    "evidence": "",
    "idx": 6176
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t1:plays]->(`t2`:`video_games`)\nWHERE `t1`.`gameid` = `t2`.`gameid`\nAND `t3`.`stuid` = `t1`.`stuid`\nAND (`t3`.`lname` = 'Smith' AND `t3`.`fname` = 'Linda')\nRETURN `t2`.`gname` AS `gname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Show all game names played by Linda Smith",
    "evidence": "",
    "idx": 6177
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`t3`:`student`)-[t1:plays]->(`t2`:`video_games`)\nWHERE `t1`.`gameid` = `t2`.`gameid`\nAND `t3`.`stuid` = `t1`.`stuid`\nAND (`t3`.`lname` = 'Smith' AND `t3`.`fname` = 'Linda')\nRETURN `t2`.`gname` AS `gname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of all games played by Linda Smith?",
    "evidence": "",
    "idx": 6178
  },
  {
    "filename": "train_spider.json",
    "db_id": "game_1",
    "gql_statement": "MATCH (`t2`:`student`)-[has_sports_info_0:has_sports_info]->(`t1`:`sportsinfo`)\nWHERE `t1`.`stuid` = `t2`.`stuid`\nAND (`t1`.`sportname` = 'Football' OR `t1`.`sportname` = 'Lacrosse')\nRETURN `t2`.`lname` AS `lname`, `t2`.`fname` AS `fname`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the last and first name of students who are playing Football or Lacrosse.",
    "evidence": "",
    "idx": 6179
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of all customers.",
    "evidence": "",
    "idx": 6181
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the total number of distinct customers.",
    "evidence": "",
    "idx": 6184
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH ()-[order_items:contains_product]->()\nRETURN avg(toFloat(`order_items`.`order_quantity`)) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the average amount of items ordered in each order?",
    "evidence": "",
    "idx": 6185
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`payment_method` = 'Cash'\nRETURN `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of customers who use payment method \"Cash\"?",
    "evidence": "",
    "idx": 6187
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`payment_method` = 'Cash'\nRETURN `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which customers use \"Cash\" for payment method? Return the customer names.",
    "evidence": "",
    "idx": 6188
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_id` >= 10 AND `customers`.`customer_id` <= 20\nRETURN `customers`.`date_became_customer` AS `date_became_customer`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the \"date became customers\" of the customers whose ID is between 10 and 20.",
    "evidence": "",
    "idx": 6189
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "CALL(*) {\nMATCH (`customers_sub0`:`customers`)\nWITH `customers_sub0`.`payment_method` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `payment_method`  LIMIT 1\n}\nMATCH (`customers`:`customers`)\nWHERE `customers`.`payment_method` = `payment_method`\nRETURN `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of customers using the most popular payment method?",
    "evidence": "",
    "idx": 6191
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "CALL(*) {\nMATCH (`customers_sub0`:`customers`)\nWITH `customers_sub0`.`payment_method` AS _groupby_col_0, COUNT(*) AS _groupby_col_1\nORDER BY _groupby_col_1 IS NULL ASC, _groupby_col_1 DESC \nRETURN _groupby_col_0 AS `payment_method`  LIMIT 1\n}\nMATCH (`customers`:`customers`)\nWHERE `customers`.`payment_method` = `payment_method`\nRETURN `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of the customers who use the most frequently used payment method.",
    "evidence": "",
    "idx": 6192
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nRETURN DISTINCT `customers`.`payment_method` AS `payment_method`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return all the distinct payment methods used by customers.",
    "evidence": "",
    "idx": 6194
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`products`:`products`)\nRETURN DISTINCT `products`.`product_details` AS `product_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Return the the details of all products.",
    "evidence": "",
    "idx": 6196
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_name` =~ '(?i)(?s).*Alex.*'\nRETURN `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of all customers whose name contains \"Alex\".",
    "evidence": "",
    "idx": 6197
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`customers`:`customers`)\nWHERE `customers`.`customer_name` =~ '(?i)(?s).*Alex.*'\nRETURN `customers`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Which customer's name contains \"Alex\"? Find the full name.",
    "evidence": "",
    "idx": 6198
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`products`:`products`)\nWHERE `products`.`product_details` =~ '(?i)(?s).*Latte.*' OR `products`.`product_details` =~ '(?i)(?s).*Americano.*'\nRETURN `products`.`product_details` AS `product_details`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the detail of products whose detail contains the word \"Latte\" or the word \"Americano\"",
    "evidence": "",
    "idx": 6199
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:has_address]->(`t3`:`addresses`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`address_id` = `t3`.`address_id`\nAND (`t1`.`customer_name` = 'Maudie Kertzmann')\nRETURN `t3`.`address_content` AS `address_content`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What is the address content of the customer named \"Maudie Kertzmann\"?",
    "evidence": "",
    "idx": 6201
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:has_address]->(`t3`:`addresses`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`address_id` = `t3`.`address_id`\nAND (`t3`.`city` = 'Lake Geovannyton')\nRETURN COUNT(*) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "How many customers are living in city \"Lake Geovannyton\"?",
    "evidence": "",
    "idx": 6203
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:has_address]->(`t3`:`addresses`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`address_id` = `t3`.`address_id`\nAND (`t3`.`state_province_county` = 'Colorado')\nRETURN `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the name of customers who are living in Colorado?",
    "evidence": "",
    "idx": 6205
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`t1`:`customers`)-[t2:has_address]->(`t3`:`addresses`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND `t2`.`address_id` = `t3`.`address_id`\nAND (`t3`.`state_province_county` = 'Colorado')\nRETURN `t1`.`customer_name` AS `customer_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the names of customers who live in Colorado state?",
    "evidence": "",
    "idx": 6206
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "WITH *, COLLECT { MATCH (`t1_sub0`:`customers`)-[t2_sub0:has_address]->(`t3_sub0`:`addresses`)\nWHERE `t1_sub0`.`customer_id` = `t2_sub0`.`customer_id`\nAND `t2_sub0`.`address_id` = `t3_sub0`.`address_id`\nRETURN DISTINCT `t3_sub0`.`city` AS `city_1`   } AS in_collect_0\nMATCH (`addresses`:`addresses`)\nWHERE NOT `addresses`.`city` IN in_collect_0\nRETURN `addresses`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the list of cities that no customer is living in.",
    "evidence": "",
    "idx": 6207
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "WITH *, COLLECT { MATCH (`t1_sub0`:`customers`)-[t2_sub0:has_address]->(`t3_sub0`:`addresses`)\nWHERE `t1_sub0`.`customer_id` = `t2_sub0`.`customer_id`\nAND `t2_sub0`.`address_id` = `t3_sub0`.`address_id`\nRETURN DISTINCT `t3_sub0`.`city` AS `city_1`   } AS in_collect_0\nMATCH (`addresses`:`addresses`)\nWHERE NOT `addresses`.`city` IN in_collect_0\nRETURN `addresses`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "What are the cities no customers live in?",
    "evidence": "",
    "idx": 6208
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nRETURN DISTINCT `addresses`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Retrieve the list of all cities.",
    "evidence": "",
    "idx": 6209
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nRETURN DISTINCT `addresses`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "List all the distinct cities",
    "evidence": "",
    "idx": 6210
  },
  {
    "filename": "train_spider.json",
    "db_id": "customers_and_addresses",
    "gql_statement": "MATCH (`addresses`:`addresses`)\nWHERE `addresses`.`zip_postcode` = 255\nRETURN `addresses`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "Find the city with post code 255.",
    "evidence": "",
    "idx": 6211
  }
]