[
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t2`.`playername` = 'Niklas Eckerblom')\nRETURN DISTINCT `t1`.`season` AS `season`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the seasons that Niklas Eckerblom played.",
    "evidence": "FALSE;",
    "idx": 5232
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t2`.`playername` = 'Matthias Trattnig')\nRETURN DISTINCT `t1`.`gametype` AS `gametype`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Mention the type of game that Matthias Trattnig played.",
    "evidence": "type of game refers to GAMETYPE;",
    "idx": 5233
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`season` = '1997-1998')\nRETURN DISTINCT `t2`.`nation` AS `nation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the nation of players who played for the 1997-1998 season .",
    "evidence": "players refers to PlayerName; 1997-1998 season refers to SEASON = '1997-1998';",
    "idx": 5234
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t2`:`playerinfo`)-[has_height_0:has_height]->(`t1`:`height_info`)\nWHERE `t1`.`height_id` = `t2`.`height`\nAND (`t1`.`height_in_inch` = '5\\'8\"')\nRETURN `t2`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List out the name of players who have a height of 5'8\".",
    "evidence": "name of players refers to PlayerName; height of 5'8\" refers to height_in_inch = '5''8\"';",
    "idx": 5237
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t2`:`playerinfo`)-[has_height_0:has_height]->(`t1`:`height_info`)\nWHERE `t1`.`height_id` = `t2`.`height`\nAND (`t1`.`height_in_cm` > 182 AND CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END = '1982')\nRETURN COUNT(`t2`.`eliteid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players were born in 1982 and have a height above 182cm?",
    "evidence": "born in 1982 refers to birthyear = 1982; height above 182cm refers to height_in_cm > 182 ;",
    "idx": 5238
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`season` = '2000-2001' AND `t1`.`team` = 'Avangard Omsk')\nRETURN DISTINCT `t2`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of all players in team Avangard Omsk in season 2000-2001.",
    "evidence": "names of the players refers to PlayerName; team Avangard Omsk refers to TEAM = 'Avangard Omsk'; 2000-2001 season refers to SEASON = '2000-2001';",
    "idx": 5242
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`season` = '2000-2001' AND `t1`.`team` = 'Avangard Omsk' AND `t1`.`gametype` = 'Playoffs')\nRETURN DISTINCT `t2`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of all players from Avangard Omsk that have played for playoffs in season 2000-2001.",
    "evidence": "names of the players refers to PlayerName; Avangard Omsk refers to TEAM = 'Avangard Omsk'; playoffs refers to GAMETYPE = 'Playoffs'; 2000-2001 season refers to SEASON = '2000-2001';",
    "idx": 5245
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t2`:`playerinfo`)-[has_weight_0:has_weight]->(`t1`:`weight_info`)\nWHERE `t1`.`weight_id` = `t2`.`weight`\nAND (`t1`.`weight_in_lbs` = 185 AND CASE WHEN `t2`.`birthdate` is not NULL THEN apoc.temporal.format(`t2`.`birthdate`,'yyyy') ELSE NULL END = '1980')\nRETURN COUNT(`t2`.`eliteid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many players who were born in 1980 weigh 185 in pounds?",
    "evidence": "born in 1980 refers to birthyear = 1980; weigh 185 in pounds refers to weight_in_lbs = 185;",
    "idx": 5247
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t1`.`season` = '2000-2001' AND `t1`.`league` = 'International' AND `t1`.`team` = 'Czech Republic (all)' AND `t1`.`g` = 0)\nRETURN `t2`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the names of all players from Avangard Omsk who played in the 2000-2001 season of the International league that have no goals in draft year.",
    "evidence": "names of the players refers to PlayerName; Avangard Omsk refers to TEAM = 'Avangard Omsk'; International league refers to LEAGUE = 'International'; no goals in draft year refers to G = 0; 2000-2001 season refers to SEASON = '2000-2001';",
    "idx": 5249
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t2`:`playerinfo`)-[has_weight_0:has_weight]->(`t1`:`weight_info`)\nWHERE `t1`.`weight_id` = `t2`.`weight`\nAND (`t2`.`overallby` = 'Arizona Coyotes')\nRETURN CASE WHEN COUNT(`t2`.`eliteid`)=0 THEN NULL ELSE toFloat(sum(`t1`.`weight_in_lbs`)) / COUNT(`t2`.`eliteid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average weight in pounds of all players drafted by Arizona Coyotes.",
    "evidence": "average weight in pounds = AVG(weight_in_lbs); weight in pounds refers to weight_in_lbs; players refers to PlayerName; drafted by Arizona Coyotes refers to overallby = 'Arizona Coyotes';",
    "idx": 5253
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t3`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t2`:`playerinfo`)-[has_height_0:has_height]->(`t1`:`height_info`)\nWHERE `t1`.`height_id` = `t2`.`height`\nAND `t2`.`eliteid` = `t3`.`eliteid`\nAND (`t3`.`team` = 'Acadie-Bathurst Titan' AND `t3`.`gametype` = 'Regular Season')\nRETURN CASE WHEN COUNT(`t2`.`eliteid`)=0 THEN NULL ELSE toFloat(sum(`t1`.`height_in_cm`)) / COUNT(`t2`.`eliteid`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the average height in centimeter of all players who played in Acadie-Bathurst Titan during regular season.",
    "evidence": "average height in centimeter = AVG(height_in_cm); height in centimeter refers to height_in_cm; players refers to PlayerName; Acadie-Bathurst Titan refers to TEAM = 'Acadie-Bathurst Titan'; regular season refers to GAMETYPE = 'Regular Season';",
    "idx": 5254
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t1`:`playerinfo`)-[has_height_0:has_height]->(`t2`:`height_info`)\nWHERE `t1`.`height` = `t2`.`height_id`\nAND (`t2`.`height_in_inch` > '5\\'9\"')\nRETURN `t1`.`playername` AS `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name of players who have a height over 5'9.",
    "evidence": "names of players refers to PlayerName; height over 5'9 refers to height_in_inch > '5''9\"';",
    "idx": 5257
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`seasonstatus`)-[belongs_to_player_1:belongs_to_player]->(`t1_sub0`:`playerinfo`)\nWHERE `t1_sub0`.`eliteid` = `t2_sub0`.`eliteid`\nAND (`t1_sub0`.`nation` = 'Sweden')\nWITH `t2_sub0`.`team` AS _groupby_col_0, COUNT(DISTINCT `t1_sub0`.`eliteid`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `team`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `team`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which team has the most Swedish?",
    "evidence": "Swedish refers to nation = 'Sweden'; team with the most Swedish refers to MAX(TEAM WHERE nation = 'Sweden');",
    "idx": 5259
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t2`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t1`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t2`.`team` = 'Rimouski Oceanic' AND `t2`.`gametype` = 'Playoffs')\nORDER BY `t2`.`g` IS NULL ASC, `t2`.`g` DESC \nRETURN `t1`.`playername` AS `playername`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the player who had the most goals for team Rimouski Oceanic in playoff.",
    "evidence": "name of the player refers to PlayerName; most goals refers to MAX(G); team Rimouski Oceanic refers to TEAM = 'Rimouski Oceanic'; playoff refers to GAMETYPE = 'Playoffs';",
    "idx": 5261
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`seasonstatus`)-[belongs_to_player_1:belongs_to_player]->(`t1_sub0`:`playerinfo`)\nWHERE `t1_sub0`.`eliteid` = `t2_sub0`.`eliteid`\nAND (`t2_sub0`.`team` = 'Plymouth Whalers')\nWITH `t1_sub0`.`nation` AS _groupby_col_0, COUNT(`t1_sub0`.`eliteid`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `nation`, _groupby_col_1 AS `_col_1` ORDER BY `_col_1` IS NULL ASC, `_col_1` DESC \nLIMIT 1\n}\nWITH *\nRETURN `nation`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country do most players of team Plymouth Whalers come from?",
    "evidence": "country and nation are synonyms; country where most players come from refers to MAX(COUNT(nation WHERE TEAM = 'Plymouth Whalers')); players refers to PlayerName; team Plymouth Whalers refers to TEAM = 'Plymouth Whalers';",
    "idx": 5262
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t2`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t1`:`playerinfo`)-[has_height_0:has_height]->(`t3`:`height_info`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND `t1`.`height` = `t3`.`height_id`\nAND (`t2`.`team` = 'Oshawa Generals')\nRETURN `t3`.`height_in_inch` AS `height_in_inch`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the height of all players from team Oshawa Generals in inches.",
    "evidence": "height in inches refers to height_in_inch; players refers to PlayerName; team Oshawa Generals refers to TEAM = 'Oshawa Generals';",
    "idx": 5264
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "CALL(*) {\nMATCH (`t2_sub0`:`seasonstatus`)-[belongs_to_player_2:belongs_to_player]->(`t1_sub0`:`playerinfo`)-[has_height_2:has_height]->(`t3_sub0`:`height_info`)\nWHERE `t1_sub0`.`eliteid` = `t2_sub0`.`eliteid`\nAND `t1_sub0`.`height` = `t3_sub0`.`height_id`\nAND (`t2_sub0`.`team` = 'USA U20')\nRETURN MAX(`t3_sub0`.`height_in_cm`) AS `_col_0`  \n}\nCALL (*) {\nMATCH (`t2_sub0`:`seasonstatus`)-[belongs_to_player_1:belongs_to_player]->(`t1_sub0`:`playerinfo`)-[has_height_1:has_height]->(`t3_sub0`:`height_info`)\nWHERE `t1_sub0`.`eliteid` = `t2_sub0`.`eliteid`\nAND `t1_sub0`.`height` = `t3_sub0`.`height_id`\nAND (`t2_sub0`.`team` = 'USA U20')\nRETURN `t1_sub0`.`playername` AS `playername`, `t3_sub0`.`height_in_cm` AS `height_in_cm` ORDER BY `t3_sub0`.`height_in_cm` IS NULL ASC, `t3_sub0`.`height_in_cm` DESC \n}\nWITH *\nWHERE `height_in_cm` = `_col_0`\nRETURN `playername`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the tallest player in team USA U20?",
    "evidence": "tallest refers to MAX(height_in_cm); \nplayer refers to PlayerName; team USA U20 refers to TEAM = 'USA U20';",
    "idx": 5266
  },
  {
    "filename": "train.json",
    "db_id": "ice_hockey_draft",
    "gql_statement": "MATCH (`t2`:`seasonstatus`)-[belongs_to_player_0:belongs_to_player]->(`t1`:`playerinfo`)\nWHERE `t1`.`eliteid` = `t2`.`eliteid`\nAND (`t2`.`league` = 'OHL')\nRETURN CASE WHEN COUNT(*)=0 THEN NULL ELSE toFloat(COUNT(CASE  WHEN `t1`.`nation` = 'Sweden' THEN `t2`.`pim` ELSE NULL END)) * 100 / COUNT(*) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of penalty minutes of Swedish players in OHL league among all players.",
    "evidence": "percentage = MULTIPLY(DIVIDE(SUM(PIM WHERE nation = 'Sweden'), COUNT(ELITEID) WHERE LEAGUE = 'OHL'), 100); Swedish refers to nation = 'Sweden'; players refers to PlayerName; OHL league refers to LEAGUE = 'OHL';",
    "idx": 5267
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productcosthistory`)-[cost_history_for_0:cost_history_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`productnumber` = 'CA-1098')\nRETURN avg(`t2`.`standardcost`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average standard cost of product number CA-1098?",
    "evidence": "Average cost = AVG(StandardCost)",
    "idx": 5268
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productcosthistory`)-[cost_history_for_0:cost_history_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`enddate` IS NULL)\nRETURN `t1`.`name` AS `name`, `t2`.`startdate` AS `startdate`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all the products, list the product name and its corresponding start date for the current standard cost.",
    "evidence": "The current standard cost refers to EndDate is NULL",
    "idx": 5269
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productcosthistory`)-[cost_history_for_0:cost_history_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`standardcost` - `t2`.`standardcost` > 80)\nWITH `t1`.`name` AS _groupby_col_0\nRETURN _groupby_col_0 AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the products whereby the standard cost is $80 more than previous standard cost in history.",
    "evidence": "SUBTRACT(product.StandardCost, CostHistory.StandardCost)>80",
    "idx": 5270
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`shoppingcartitem`)-[item_for_0:item_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`shoppingcartid` = '14951')\nRETURN `t1`.`name` AS `name`, `t2`.`quantity` AS `quantity`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name all products and total quantity for each item for shopping cart ID 14951.",
    "evidence": "",
    "idx": 5271
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`shoppingcartitem`)-[item_for_0:item_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`quantity` > 5)\nRETURN `t1`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the product name with more than 5 quantity in the shopping cart.",
    "evidence": "Product with more than 5 quantity refers to Quantity>5",
    "idx": 5272
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`transactionhistory`)-[transaction_for_0:transaction_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`class` = 'L' AND `t2`.`transactiontype` = 'P')\nRETURN DISTINCT `t1`.`name` AS `name` ORDER BY `t1`.`name` IS NULL DESC, `t1`.`name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For all the purchase order transactions, name all the products with low quality.",
    "evidence": "Low quality refers to the product's quality class, therefore Class = 'L'",
    "idx": 5273
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`transactionhistory`)-[transaction_for_0:transaction_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`quantity` > 10000)\nRETURN DISTINCT `t1`.`name` AS `name`, `t1`.`listprice` AS `listprice`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide all the transactions whereby the quantiy is more than 10,000 pieces. State the product name and the selling price.",
    "evidence": "Quantity more than 10,000 pieces refers to Quantity>10000; selling price refers to ListPrice",
    "idx": 5274
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`transactionhistory`)-[transaction_for_0:transaction_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`class` = 'H')\nORDER BY `t2`.`quantity` IS NULL DESC, `t2`.`quantity`  \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which is a high quality product but with the lowest transacted quantity?",
    "evidence": "High quality refers to the product's quality class, therefore Class = 'H'; the lowest transacted quantity refers to Quantity = 1",
    "idx": 5275
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`transactionhistory`)-[transaction_for_0:transaction_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`productline` = 'M')\nRETURN COUNT(`t2`.`transactionid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many transactions are there for product under the Mountain line?",
    "evidence": "The Mountain line refers to the product line, therefore ProductLine = 'M'",
    "idx": 5276
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`shoppingcartitem`)-[item_for_0:item_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`shoppingcartid` = '20621')\nRETURN sum((`t1`.`listprice` - `t1`.`standardcost`) * `t2`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How much would be the total sales profit for shopping cart ID 20621 ?",
    "evidence": "Sales profit = MULTIPLY(SUBTRACT(ListPrice, StandardCost; Quantity)), where ShoppingCartID = '20621'",
    "idx": 5277
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`class` = 'H'\nRETURN `product`.`name` AS `name`, `product`.`listprice` AS `listprice`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all product names that are high in quality. Please also state its selling price.",
    "evidence": "High quality refers to the product's quality class, therefore Class = 'H'",
    "idx": 5278
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`productreview`:`productreview`)\nWHERE `productreview`.`reviewername` =~ '(?i)(?s)J.*'\nRETURN `productreview`.`productid` AS `productid`, `productreview`.`rating` AS `rating`, `productreview`.`comments` AS `comments`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide details of review from reviewer whose name begin with letter 'J'. State the product ID, rating and comments.",
    "evidence": "reviewer whose name begin with letter 'J' = ReviewerName LIKE 'J%'",
    "idx": 5279
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productreview`)-[review_for_0:review_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nRETURN `t1`.`name` AS `name`, `t1`.`productline` AS `productline`, `t2`.`rating` AS `rating`, `t1`.`listprice` AS `listprice` ORDER BY `t2`.`rating` IS NULL DESC, `t2`.`rating`  \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "State the product name, product line, rating and the selling price of product with the lowest rating.",
    "evidence": "Product with the lowest rating refers to the rating\ngiven by the\nreviewer where Rating = 1",
    "idx": 5280
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`product`:`product`)\nWHERE `product`.`listprice` - `product`.`standardcost` > 100\nRETURN DISTINCT `product`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the profit of each products. List all products with more than $100 in profit.",
    "evidence": "Profit = AVG(SUBTRACT(ListPrice, StandardCost)>100",
    "idx": 5281
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productreview`)-[review_for_0:review_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`productline` = 'R')\nRETURN `t1`.`name` AS `name`, `t2`.`reviewername` AS `reviewername`, `t2`.`rating` AS `rating`, `t2`.`comments` AS `comments`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the product name, reviewer name, rating and comments for product under the road line.",
    "evidence": "The Road line refers to the product line, therefore ProductLine = 'R'",
    "idx": 5282
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productreview`)-[review_for_0:review_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`name` = 'HL Mountain Pedal')\nRETURN COUNT(`t1`.`productid`) AS `_col_0`, avg(`t2`.`rating`) AS `_col_1`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many people reviewed for product named HL Mountain Pedal? What is the average rating?",
    "evidence": "AVG(Rating) = DIVIDE(SUM(rating), COUNT(ReviewerName))",
    "idx": 5283
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:contains]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`productline` = 'T')\nRETURN sum(`t2`.`orderqty`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total ordered quantity for products under the 'Touring' line?",
    "evidence": "The Touring line refers to the product line, therefore ProductLine = 'T'",
    "idx": 5287
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[t2:contains]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`class` = 'L')\nORDER BY `t2`.`orderqty` * `t2`.`unitprice` IS NULL ASC, `t2`.`orderqty` * `t2`.`unitprice` DESC \nRETURN `t1`.`name` AS `name`, `t2`.`linetotal` AS `linetotal`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the low quality product, which product has the highest line total? List the product name and its line total?",
    "evidence": "Low quality refers to the product's quality class, therefore Class = 'L'",
    "idx": 5288
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)-[t2:supplied_by]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nORDER BY `t2`.`lastreceiptcost` - `t2`.`standardprice` IS NULL ASC, `t2`.`lastreceiptcost` - `t2`.`standardprice` DESC \nRETURN `t1`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which product has the highest profit on net? State the product name.",
    "evidence": "Profit on net = SUBTRACT(LastReceiptCost, StandardPrice)",
    "idx": 5289
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)-[t2:supplied_by]->()\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t2`.`minorderqty` = 100)\nRETURN DISTINCT `t1`.`name` AS `name` ORDER BY `t1`.`name` IS NULL ASC, `t1`.`name` DESC",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all products with minimum order quantity of 100 and order them by product name in descending order.",
    "evidence": "miinimum order quantity refers to MinOrderQty = 100",
    "idx": 5290
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`productreview`)-[review_for_0:review_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nORDER BY `t2`.`rating` IS NULL ASC, `t2`.`rating` DESC \nRETURN `t1`.`name` AS `name`, `t1`.`listprice` - `t1`.`standardcost` AS `_col_1`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the name and calculate its profit for product with the highest rating in review.",
    "evidence": "Profit = SUBTRACT(ListPrice, StandardCost); the highest rating in review refers to Rating = 5",
    "idx": 5291
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`transactionhistory`)-[transaction_for_0:transaction_for]->(`t1`:`product`)\nWHERE `t1`.`productid` = `t2`.`productid`\nAND (`t1`.`productid` = 827)\nRETURN sum((`t1`.`listprice` - `t1`.`standardcost`) * `t2`.`quantity`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total profit all transactions with product ID 827?",
    "evidence": "Profit = MULTIPLY(SUBTRACT(ListPrice, StandardCost) Quantity))",
    "idx": 5292
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`currencyrate`:`currencyrate`)\nORDER BY `currencyrate`.`averagerate` IS NULL ASC, `currencyrate`.`averagerate` DESC \nRETURN `currencyrate`.`fromcurrencycode` AS `fromcurrencycode`, `currencyrate`.`tocurrencycode` AS `tocurrencycode`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which currency pair's average exchange rate for the day is the highest?",
    "evidence": "currency pair refers to FromCurrencyCode/ToCurrencyCode",
    "idx": 5293
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH ()-[purchaseorderdetail:contains]->()\nORDER BY `purchaseorderdetail`.`unitprice` IS NULL ASC, `purchaseorderdetail`.`unitprice` DESC \nRETURN `purchaseorderdetail`.`orderqty` AS `orderqty`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many products with the highest unit price were ordered?",
    "evidence": "number of products refers to OrderQty",
    "idx": 5294
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`salesterritory`:`salesterritory`)\nWHERE `salesterritory`.`countryregioncode` = 'US' AND (`salesterritory`.`name` = 'Northwest' OR `salesterritory`.`name` = 'Southeast')\nORDER BY `salesterritory`.`saleslastyear` IS NULL ASC, `salesterritory`.`saleslastyear` DESC \nRETURN `salesterritory`.`name` AS `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Between Northwest and Southeast of the United States, which territory one recorded the highest amount of sales last year?",
    "evidence": "United States refers to CountryRegionCode = 'US';",
    "idx": 5295
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t3`:`document`)\nMATCH (`t2`:`employee`)-[is_a_0:is_a]->(`t1`:`person`)\nWHERE `t1`.`businessentityid` = `t2`.`businessentityid`\nAND `t3`.`owner` = `t2`.`businessentityid`\nAND (`t2`.`jobtitle` = 'Document Control Manager' AND `t3`.`documentlevel` = 1 AND `t3`.`status` = 2)\nWITH `t1`.`firstname` AS _groupby_col_0, `t1`.`middlename` AS _groupby_col_1, `t1`.`lastname` AS _groupby_col_2\nRETURN _groupby_col_0 AS `firstname`, _groupby_col_1 AS `middlename`, _groupby_col_2 AS `lastname`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the full name of the Document Control Manager who is in charge of all Level 1 approved documents?",
    "evidence": "full Name = FirstName+MiddleName+Last Name; approved document refers to Status = 2;",
    "idx": 5296
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`salesorderheader`)\nMATCH (`t2`:`salesperson`)\nWHERE `t1`.`salespersonid` = `t2`.`businessentityid`\nORDER BY `t1`.`subtotal` IS NULL ASC, `t1`.`subtotal` DESC \nRETURN `t1`.`customerid` AS `customerid`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which customer has the highest subtotal amount of sales orders whose assigned to the salesperson with the highest bonus?",
    "evidence": "highest subtotal amount of sales order refers to max(SubTotal);",
    "idx": 5297
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`specialoffer`)\nMATCH (`t2`:`salesorderdetail`)\nWHERE `t1`.`specialofferid` = `t2`.`specialofferid`\nAND (`t1`.`description` = 'Volume Discount 11 to 14' AND `t1`.`specialofferid` = 2 AND `t2`.`productid` = 716 AND `t2`.`salesorderid` = 46625)\nRETURN `t2`.`unitprice` * `t2`.`orderqty` AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the total price of Sales Order ID 46625 with Volume Discount 11 to 14 and Product ID 716?",
    "evidence": "total price = multiply(UnitPrice, OrderQty);",
    "idx": 5298
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t1`:`product`)\nMATCH (`t2`:`billofmaterials`)\nWHERE `t1`.`productid` = `t2`.`productassemblyid`\nAND (`t1`.`makeflag` = 1 AND `t1`.`daystomanufacture` = 1 AND `t2`.`bomlevel` = 4 AND `t1`.`reorderpoint` <= 600)\nRETURN COUNT(`t1`.`productid`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Of the products that has a reorder inventory point of no more than 600, how many manufactured in-house products that takes 1 day to manufacture with BOM Level 4 are there?",
    "evidence": "ReorderPoint<600; product is manufactured in-house refers to Makeflag = 1;",
    "idx": 5299
  },
  {
    "filename": "train.json",
    "db_id": "works_cycles",
    "gql_statement": "MATCH (`t2`:`salesperson`)-[assigned_to_0:assigned_to]->(`t1`:`salesterritory`)\nWHERE `t1`.`territoryid` = `t2`.`territoryid`\nAND (`t1`.`countryregioncode` = 'CA')\nORDER BY `t2`.`salesquota` IS NULL ASC, `t2`.`salesquota` DESC \nRETURN `t2`.`bonus` AS `bonus`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the highest amount of bonus earned by the sales person in Canada?",
    "evidence": "Canada is name of a sales territory",
    "idx": 5300
  }
]