[
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`customer`)\nMATCH (`t2`:`payment`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'CHRISTY' AND `t1`.`last_name` = 'VARGAS')\nRETURN avg(`t2`.`amount`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average amount of rent that Christy Vargas paid?",
    "evidence": "'Christy Vargas' is a full name of a customer; full name refers to first_name, last_name; average amount of rent refers to AVG(amount)",
    "idx": 7080
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`first_name` = 'Johnny'\nRETURN `actor`.`first_name` AS `first_name`, `actor`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the actors that have the same forename as Johnny? Please include in your answer the full names of these actors.",
    "evidence": "forename means first_name; full name refers to first_name, last_name",
    "idx": 7081
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`address`:`address`)\nWHERE `address`.`district` = 'Gansu'\nRETURN `address`.`address_id` AS `address_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the address numbers that are located in Gansu district?",
    "evidence": "address numbers refers to address_id;",
    "idx": 7082
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`category`:`category`)\nRETURN DISTINCT `category`.`name` AS `name`, `category`.`category_id` AS `category_id`, `category`.`last_update` AS `last_update`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list three types of film along with their IDs and the latest update.",
    "evidence": "types of film refers to the name of a category; IDs refers to category_id; latest update refers to last_update.",
    "idx": 7083
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`active` = 0\nRETURN `customer`.`first_name` AS `first_name`, `customer`.`last_name` AS `last_name`  LIMIT 3",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please list the full names of any three inactive customers.",
    "evidence": "full name refers to first_name, last_name; inactive customers refers to active = 0",
    "idx": 7084
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`title` = 'AIRPLANE SIERRA'\nRETURN CASE WHEN `film`.`rental_duration`=0 THEN NULL ELSE `film`.`rental_rate` / `film`.`rental_duration` END AS `result`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the rental price per day for Airplane Sierra?",
    "evidence": "rental price per day refers to DIVIDE(rental_price, rental_duration); 'Airplane Sierra' is a title of a film",
    "idx": 7085
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`store`)\nMATCH (`t1`:`address`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`store_id` = 2)\nRETURN `t1`.`address` AS `address`, `t1`.`address2` AS `address2`, `t1`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Where is store number 2 located?",
    "evidence": "store number 2 refers to store_id = 2; where is a store located refers to address, address2, district",
    "idx": 7086
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`address`)\nMATCH (`t1`:`city`)\nWHERE `t2`.`city_id` = `t1`.`city_id`\nAND (`t2`.`address` = '1623 Kingstown Drive')\nRETURN `t1`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which city does the address 1623 Kingstown Drive belong to?",
    "evidence": "",
    "idx": 7087
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND (`t1`.`country` = 'Algeria')\nRETURN `t2`.`city` AS `city`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please name three cities that belong to Algeria.",
    "evidence": "Algeria is a country",
    "idx": 7088
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`category`)\nMATCH (`t1`:`film_category`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nRETURN sum(CASE WHEN `t2`.`name` = 'Children' THEN 1 ELSE 0 END) - sum(CASE WHEN `t2`.`name` = 'Action' THEN 1 ELSE 0 END) AS `diff`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the difference between the number of children's films and action films?",
    "evidence": "'children' AND 'action' are names of a category; Calculation = SUBTRACT(AVG('children'), AVG('action'))",
    "idx": 7089
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`address`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`first_name` = 'Maria' AND `t1`.`last_name` = 'Miller')\nRETURN `t2`.`district` AS `district`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which district does Maria Miller live in?",
    "evidence": "'Maria Miller' is a name of a customer; full name refers to first_name, last_name",
    "idx": 7090
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`address`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`address` = '1795 Santiago de Compostela Way' AND `t1`.`active` = 1)\nRETURN `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the customer that is active and lives at 1795 Santiago de Compostela Way, Texas?",
    "evidence": "active refers to active = 1; '1795 Santiago de Compostela Way' is an address; Texas is a district; who refers to first_name, last_name",
    "idx": 7091
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`name` = 'English' AND `t1`.`length` > 50 AND `t1`.`replacement_cost` < 10.99)\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many English films have a duration of over 50 minutes and the cost of replacement are under 10.99?",
    "evidence": "English is a name of a language; duration of over 50 minutes refers to length > 50; cost of replacement are under 10.99 refers to replacement_cost < 10.99",
    "idx": 7092
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`category`)\nMATCH (`t1`:`film_category`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nRETURN CASE WHEN COUNT(`t1`.`film_id`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`name` = 'Documentary' THEN 1 ELSE 0 END)) * 100 / COUNT(`t1`.`film_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the percentage of documentary films?",
    "evidence": "documentary' is a name of a category; calculation = DIVIDE(SUM(name = 'Documentary'), COUNT(film_id)) * 100",
    "idx": 7093
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`name` = 'English' AND `t1`.`rating` = 'NC-17')\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films in English are for adults only?",
    "evidence": "English is a name of a language; for adults only refers to rating = 'NC-17'",
    "idx": 7094
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`film_sub0`:`film`)\nRETURN MAX(`film_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`film`:`film`)\nWHERE `film`.`length` = `_col_0`\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which film has the longest duration?",
    "evidence": "film refers to the title; the longest duration refers to MAX(length)",
    "idx": 7095
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`first_name` = 'Dan'\nRETURN COUNT(`actor`.`actor_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many of the actors are named \"Dan\"?",
    "evidence": "'Dan' is a first_name of an actor",
    "idx": 7096
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`special_features` =~ '(?i)(?s).*Behind the Scenes.*'\nRETURN `film`.`rating` AS `rating`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the ratings of the film featuring behind the scenes?",
    "evidence": "film featuring behind the scenes refers to special_features = 'Behind the Scenes'",
    "idx": 7097
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`rental`:`rental`)\nWITH `rental`.`customer_id` AS _groupby_col_0, COUNT(`rental`.`rental_id`) AS _groupby_col_1\nRETURN _groupby_col_1 AS `_col_0` ORDER BY `_col_0` IS NULL ASC, `_col_0` DESC \nLIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the largest number of films rented per customer?",
    "evidence": "the largest number of films refers to MAX(rental_id)",
    "idx": 7098
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film_text`:`film_text`)\nWHERE `film_text`.`description` =~ '(?i)(?s).*Lacklusture.*'\nRETURN `film_text`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List all the films with the word \"Lacklusture\" in their description.",
    "evidence": "films refers to title",
    "idx": 7099
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'FRANCIS' AND `t1`.`last_name` = 'SIKES')\nRETURN COUNT(`t1`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many films did a customer named Francis Sikes rent?",
    "evidence": "'Francis Sikes' is a full name of a customer; full name refers to first_name, last_name;",
    "idx": 7100
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`address`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`active` = 0)\nRETURN `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the addresses of the inactive customers?",
    "evidence": "inactive customers refers to active = 0;",
    "idx": 7101
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`category`)\nMATCH (`t1_sub0`:`film_category`)\nWHERE `t1_sub0`.`category_id` = `t2_sub0`.`category_id`\nWITH `t2_sub0`.`name` AS _groupby_col_0, COUNT(`t2_sub0`.`name`) AS _groupby_col_1\nRETURN _groupby_col_0 AS `name`, _groupby_col_1 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which category is the most common?",
    "evidence": "most common category refers to MAX(COUNT(category.name))",
    "idx": 7102
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`payment`)\nMATCH (`t1_sub0`:`customer`)\nWHERE `t1_sub0`.`customer_id` = `t2_sub0`.`customer_id`\nWITH `t1_sub0`.`first_name` AS _groupby_col_0, `t1_sub0`.`last_name` AS _groupby_col_1, sum(`t2_sub0`.`amount`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`, _groupby_col_2 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `first_name`, `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Who is the customer with the largest payment for rental films?",
    "evidence": "Who refers to first_name, last_name; the largest payment for rental refers to MAX(SUM(amount))",
    "idx": 7103
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`country`)\nMATCH (`t2`:`city`)\nWHERE `t1`.`country_id` = `t2`.`country_id`\nAND (`t2`.`city` = 'Sasebo')\nRETURN `t1`.`country` AS `country`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which country does Sasebo belong to?",
    "evidence": "'Sasebo' is a city",
    "idx": 7104
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`address`)\nMATCH (`t1`:`store`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nRETURN `t2`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the addresses for the stores?",
    "evidence": "",
    "idx": 7105
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL (*) {\nMATCH (`t2_sub0`:`actor`)\nMATCH (`t1_sub0`:`film_actor`)\nWHERE `t1_sub0`.`actor_id` = `t2_sub0`.`actor_id`\nWITH `t2_sub0`.`first_name` AS _groupby_col_0, `t2_sub0`.`last_name` AS _groupby_col_1, sum(`t1_sub0`.`film_id`) AS _groupby_col_2\nRETURN _groupby_col_0 AS `first_name`, _groupby_col_1 AS `last_name`, _groupby_col_2 AS `num`  \n}\nWITH *\nORDER BY `num` IS NULL ASC, `num` DESC \nRETURN `first_name`, `last_name`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which actor acted in the most films?",
    "evidence": "actor refers to first_name, last_name; the most film refers to MAX(SUM(film_id))",
    "idx": 7106
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`actor`:`actor`)\nWHERE `actor`.`actor_id` = 5\nRETURN `actor`.`first_name` AS `first_name`, `actor`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please indicate the full name of actor id 5.",
    "evidence": "full name refers to first_name, last_name",
    "idx": 7107
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film_category`:`film_category`)\nWHERE `film_category`.`category_id` = 11\nRETURN COUNT(`film_category`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many id movies have category id 11?",
    "evidence": "id movies refers to film_id",
    "idx": 7108
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`amount` > 10)\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List the full names of customers who have paid more than 10$.",
    "evidence": "full name refers to first_name, last_name; more than 10$ refers to amount > 10",
    "idx": 7109
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`address`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t2`.`first_name` = 'SUSAN' AND `t1`.`postal_code` = '77948')\nRETURN `t1`.`address` AS `address`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the address of the customer whose first name is SUSAN with the postal code 77948.",
    "evidence": "",
    "idx": 7110
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`address`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`address_id` = `t2`.`address_id`\nAND (`t1`.`address` = '692 Joliet Street')\nRETURN `t2`.`first_name` AS `first_name`, `t2`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Please provide the full name of the customer at 692 Joliet Street.",
    "evidence": "full name refers to first_name, last_name; 692 Joliet Street refers to address = '692 Joliet Street'",
    "idx": 7111
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nRETURN CASE WHEN sum(`t1`.`amount`)=0 THEN NULL ELSE toFloat(sum(CASE WHEN `t2`.`first_name` = 'MARGARET' AND `t2`.`last_name` = 'MOORE' THEN `t1`.`amount` ELSE 0 END)) * 100 / sum(`t1`.`amount`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Calculate the percentage of total payment of MARGARET MOORE customers.",
    "evidence": "percentage = divide(sum(amount where first_name = 'MARGARET' and last_name = 'MOORE'), sum(amount)) * 100%",
    "idx": 7112
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`release_year` = '2006'\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many film titles were released in 2006?",
    "evidence": "released in 2006 refers to release_year = 2006",
    "idx": 7113
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`film_id` >= 1 AND `film`.`film_id` <= 10\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down film titles from id 1 to 10.",
    "evidence": "id 1 to 10 refers to film_id BETWEEN 1 and 10",
    "idx": 7114
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`film_sub0`:`film`)\nRETURN MAX(`film_sub0`.`rental_duration`) AS `_col_0`  \n}\nMATCH (`film`:`film`)\nWHERE `film`.`rental_duration` = `_col_0`\nRETURN `film`.`film_id` AS `film_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all of the film IDs with highest rental duration.",
    "evidence": "highest rental duration refers to max(rental_duration)",
    "idx": 7115
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`film_sub0`:`film`)\nRETURN MAX(`film_sub0`.`rental_rate`) AS `_col_0`  \n}\nMATCH (`film`:`film`)\nWHERE `film`.`rental_rate` = `_col_0`\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Which film titles have the most expensive rental rate?",
    "evidence": "the most expensive rental rate refers to max(rental_rate)",
    "idx": 7116
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rating` = 'G'\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all of the film titles that are rated for general audiences.",
    "evidence": "rated for general audiences means rating = 'G'",
    "idx": 7117
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t1`.`title` = 'CHILL LUCK')\nRETURN `t2`.`name` AS `name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the language for film titled \"CHILL LUCK\"?",
    "evidence": "",
    "idx": 7118
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`name` = 'English' AND `t1`.`release_year` = '2006')\nRETURN DISTINCT `t1`.`last_update` AS `last_update`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What are the last updated date for English film titles that were released in 2006?",
    "evidence": "the last updated date refers to last_update; English is name of language; released in 2006 refers to release_year = 2006\n\n",
    "idx": 7119
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`language`)\nWHERE `t1`.`language_id` = `t2`.`language_id`\nAND (`t2`.`name` = 'Italian' AND `t1`.`special_features` = 'deleted scenes')\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many Italian film titles were special featured with deleted scenes?",
    "evidence": "Italian is name of language; special featured with deleted scenes refers to special_features = 'deleted scenes'",
    "idx": 7120
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'MARY' AND `t1`.`last_name` = 'SMITH')\nRETURN `t2`.`rental_id` AS `rental_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is Mary Smith's rental ID?",
    "evidence": "",
    "idx": 7121
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`staff_id` = 1)\nRETURN DISTINCT `t1`.`first_name` AS `first_name`, `t1`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down all of the customers' first name who were attended by staff with ID 1.",
    "evidence": "",
    "idx": 7122
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t2`.`staff_id` = 2)\nRETURN DISTINCT `t1`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down email address of customers who were attended by staff with ID 2.",
    "evidence": "email address refers to email",
    "idx": 7123
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film`)\nMATCH (`t2`:`film_actor`)\nWHERE `t1`.`film_id` = `t2`.`film_id`\nAND (`t1`.`title` = 'BOUND CHEAPER')\nRETURN `t2`.`actor_id` AS `actor_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "List down the actor IDs of film titled \"BOUND CHEAPER\".",
    "evidence": "",
    "idx": 7124
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'KAREN' AND `t1`.`last_name` = 'JACKSON')\nRETURN `t2`.`inventory_id` AS `inventory_id`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the inventory ID of Karen Jackson?",
    "evidence": "",
    "idx": 7125
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rating` = 'NC-17' AND `film`.`rental_duration` < 4\nRETURN COUNT(`film`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Among the adult films, how many of them have a rental duration of fewer than 4 days?",
    "evidence": "adult film refers to rating = 'NC-17'; rental duration of fewer than 4 days refers to rental_duration < 4",
    "idx": 7126
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`replacement_cost` = 29.99 AND `film`.`rating` = 'R' AND `film`.`length` = 71\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the title of the restricted film, whose length is 71 minutes and whose replacement cost is $29.99?",
    "evidence": "restricted means rating = 'R'; length is 71 minutes refers to length = 71; replacement cost is $29.99 refers to replacement_cost = 29.99",
    "idx": 7127
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`rental`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`rental_date` >= localdatetime('2005-05-25T07:37:47') AND `t1`.`rental_date` <= localdatetime('2005-05-26T10:06:49') AND `t2`.`active` = 1)\nRETURN `t2`.`email` AS `email`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Write down the email addresses of active customers who rented between 5/25/2005 at 7:37:47 PM and 5/26/2005 at 10:06:49 AM.",
    "evidence": "email address refers to email; active refers to active = 1; between 5/25/2005 at 7:37:47 PM and 5/26/2005 at 10:06:49 AM refers to rental_date between '2005-5-25 07:37:47' and '2005-5-26 10:06:49'",
    "idx": 7128
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`payment`)\nMATCH (`t2`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`payment_date` >= localdatetime('2005-05-30T03:43:54') AND `t1`.`payment_date` <= localdatetime('2005-07-31T10:08:29'))\nRETURN COUNT(`t1`.`customer_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "From 5/30/2005 at 3:43:54 AM to 7/31/2005 at 10:08:29 PM, how many times did Susan Wilson pay for film rentals?",
    "evidence": "from 5/30/2005 at 3:43:54 AM to 7/31/2005 at 10:08:29 PM refers to payment_date between '2005-05-30 03:43:54' and '2005-07-31 10:08:29'",
    "idx": 7129
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`rental`)\nMATCH (`t1`:`customer`)\nWHERE `t1`.`customer_id` = `t2`.`customer_id`\nAND (`t1`.`first_name` = 'Maria' AND `t1`.`last_name` = 'Miller')\nRETURN COUNT(`t2`.`rental_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the number of movies rented by Maria Miller.",
    "evidence": "",
    "idx": 7130
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t2`:`film_category`)\nMATCH (`t1`:`category`)\nWHERE `t1`.`category_id` = `t2`.`category_id`\nAND (`t1`.`name` = 'Action')\nRETURN COUNT(`t2`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Determine the number of action movies available for rent.",
    "evidence": "action movie refers to category.name = 'Action'",
    "idx": 7131
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`t1`:`film_actor`)\nMATCH (`t2`:`actor`)\nWHERE `t1`.`actor_id` = `t2`.`actor_id` AND `t2`.`first_name` = 'NICK' AND `t2`.`last_name` = 'STALLONE'\nRETURN COUNT(`t1`.`film_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the number of movies that starred Nick Stallone.",
    "evidence": "",
    "idx": 7132
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`film_sub0`:`film`)\nRETURN min(`film_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`film`:`film`)\nWHERE `film`.`length` = `_col_0`\nORDER BY `film`.`rental_duration` * `film`.`rental_rate` IS NULL ASC, `film`.`rental_duration` * `film`.`rental_rate` DESC \nRETURN `film`.`title` AS `title`  LIMIT 1",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Name the movie with the highest rental revenue among the shortest films.",
    "evidence": "movie name refers to title; the highest rental revenue refers to max(multiply(rental_duration, rental_rate)); the shortest film refers to min(length)",
    "idx": 7133
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rental_rate` = 4.99\nRETURN avg(`film`.`replacement_cost`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average replacement cost for the movies with a rental rate of 4.99?",
    "evidence": "a rental rate of 4.99 refers to rental_rate = 4.99; average replacement cost = avg(replacement_cost)",
    "idx": 7134
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`rating` = 'PG-13'\nRETURN avg(`film`.`rental_rate`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "What is the average rental rate for PG-13 rated movies?",
    "evidence": "PG-13 rated movie refers to rating = 'PG-13'; average rental rate = avg(rental_rate)",
    "idx": 7135
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`store_id` = 1\nRETURN CASE WHEN COUNT(`customer`.`customer_id`)=0 THEN NULL ELSE toFloat(sum(CASE  WHEN `customer`.`active` = 0 THEN 1 ELSE 0 END)) * 100 / COUNT(`customer`.`customer_id`) END AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Indicate the percentage of inactive customers at store no.1.",
    "evidence": "inactive refers to active = 0; store no.1 refers to store_id = 1; percentage = divide(count(customer_id where active = 0), count(customer_id)) * 100% where store_id = 1",
    "idx": 7136
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`film`:`film`)\nWHERE `film`.`title` = 'DIRTY ACE'\nRETURN `film`.`rental_duration` AS `rental_duration`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "For how long can you rent the movie 'Dirty Ace'?",
    "evidence": "length refers to rental_duration; 'Dirty Ace' refers to title = 'DIRTY ACE'",
    "idx": 7137
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`customer`:`customer`)\nWHERE `customer`.`email` = 'SHEILA.WELLS@sakilacustomer.org'\nRETURN `customer`.`first_name` AS `first_name`, `customer`.`last_name` AS `last_name`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Identify the full name of the customer, who has the following email address: SHEILA.WELLS@sakilacustomer.org.",
    "evidence": "full name refers to first_name, last_name",
    "idx": 7138
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "CALL(*) {\nMATCH (`film_sub0`:`film`)\nRETURN MAX(`film_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`film`:`film`)\nWHERE `film`.`length` = `_col_0`\nRETURN `film`.`title` AS `title`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "Provide the list of the longest movies. Arrange these titles in alphabetical order.",
    "evidence": "the longest refers to max(length)",
    "idx": 7139
  },
  {
    "filename": "train.json",
    "db_id": "movie_3",
    "gql_statement": "MATCH (`category`:`category`)\nRETURN COUNT(DISTINCT `category`.`category_id`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "bird_train",
    "nl_query": "How many film categories are there?",
    "evidence": "",
    "idx": 7140
  }
]