[
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'idaho'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers does idaho have",
    "evidence": "",
    "idx": 82
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'idaho'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers are there in idaho",
    "evidence": "",
    "idx": 83
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'idaho'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers run through idaho",
    "evidence": "",
    "idx": 84
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'idaho'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers are found in idaho",
    "evidence": "",
    "idx": 85
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'idaho'\nRETURN COUNT(`river`.`river_name`) AS `_col_0`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many rivers in idaho",
    "evidence": "",
    "idx": 86
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "name all the rivers in illinois",
    "evidence": "",
    "idx": 100
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "rivers in illinois",
    "evidence": "",
    "idx": 101
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are all the rivers in illinois",
    "evidence": "",
    "idx": 102
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the rivers in illinois",
    "evidence": "",
    "idx": 103
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what rivers are in illinois",
    "evidence": "",
    "idx": 104
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what rivers are there in illinois",
    "evidence": "",
    "idx": 105
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what rivers run through illinois",
    "evidence": "",
    "idx": 106
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what rivers flow through illinois",
    "evidence": "",
    "idx": 107
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what river flows through illinois",
    "evidence": "",
    "idx": 108
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the rivers in the state of illinois",
    "evidence": "",
    "idx": 109
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "name the rivers in illinois",
    "evidence": "",
    "idx": 110
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the rivers of illinois",
    "evidence": "",
    "idx": 111
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which rivers are in illinois",
    "evidence": "",
    "idx": 112
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which rivers flow through illinois",
    "evidence": "",
    "idx": 113
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the river that cross over illinois",
    "evidence": "",
    "idx": 114
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`river`:`river`)\nWHERE `river`.`traverse` = 'illinois'\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what river runs through illinois",
    "evidence": "",
    "idx": 115
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state is springfield in",
    "evidence": "",
    "idx": 116
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "where is springfield",
    "evidence": "",
    "idx": 117
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "springfield is in what state",
    "evidence": "",
    "idx": 118
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states have cities named springfield",
    "evidence": "",
    "idx": 119
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states have cities named springfield",
    "evidence": "",
    "idx": 120
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state is springfield in",
    "evidence": "",
    "idx": 121
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states have a city named springfield",
    "evidence": "",
    "idx": 122
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the city springfield",
    "evidence": "",
    "idx": 123
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states have towns named springfield",
    "evidence": "",
    "idx": 124
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state is springfield located in",
    "evidence": "",
    "idx": 125
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "in which state is springfield",
    "evidence": "",
    "idx": 126
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state is the city springfield located in",
    "evidence": "",
    "idx": 127
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'springfield'\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states in the united states have a city of springfield",
    "evidence": "",
    "idx": 128
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population of the state with the largest area",
    "evidence": "",
    "idx": 129
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population of the largest state",
    "evidence": "",
    "idx": 130
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people live in boulder",
    "evidence": "",
    "idx": 131
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population of boulder",
    "evidence": "",
    "idx": 132
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people lived in boulder",
    "evidence": "",
    "idx": 133
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "number of people in boulder",
    "evidence": "",
    "idx": 134
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population of boulder city",
    "evidence": "",
    "idx": 135
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how big is the city of boulder",
    "evidence": "",
    "idx": 136
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "population of boulder",
    "evidence": "",
    "idx": 137
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population in boulder",
    "evidence": "",
    "idx": 138
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "people in boulder",
    "evidence": "",
    "idx": 139
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many people in boulder",
    "evidence": "",
    "idx": 140
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many inhabitants does boulder have",
    "evidence": "",
    "idx": 141
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "number of citizens in boulder",
    "evidence": "",
    "idx": 142
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`city`:`city`)\nWHERE `city`.`city_name` = 'boulder'\nRETURN `city`.`population` AS `population`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how many citizens in boulder",
    "evidence": "",
    "idx": 143
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city`:`city`)\nWHERE `city`.`state_name` = 'alaska'\nRETURN min(`city`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0` AND `city`.`state_name` = 'alaska'\nRETURN `city`.`city_name` AS `city_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the smallest city in alaska",
    "evidence": "",
    "idx": 144
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states lie on the largest river in the united states",
    "evidence": "",
    "idx": 145
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states does the longest river run through",
    "evidence": "",
    "idx": 146
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the longest river",
    "evidence": "",
    "idx": 147
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what are the states through which the longest river runs",
    "evidence": "",
    "idx": 148
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`traverse` AS `traverse`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states does the longest river cross",
    "evidence": "",
    "idx": 149
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`density` AS `density`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population density of the state with the smallest area",
    "evidence": "",
    "idx": 150
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN min(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`density` AS `density`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the population density of the smallest state",
    "evidence": "",
    "idx": 151
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'colorado'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` > `highest_elevation`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states have points higher than the highest point in colorado",
    "evidence": "",
    "idx": 152
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'colorado'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` > `highest_elevation`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which states have points that are higher than the highest point in colorado",
    "evidence": "",
    "idx": 153
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'colorado'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`  \n}\nMATCH (`highlow`:`highlow`)\nWHERE `highlow`.`highest_elevation` > `highest_elevation`\nRETURN `highlow`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what states high point are higher than that of colorado",
    "evidence": "",
    "idx": 154
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'delaware'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest elevation in delaware",
    "evidence": "",
    "idx": 155
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'delaware'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how high is the highest point of delaware",
    "evidence": "",
    "idx": 156
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'delaware'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how tall is the highest point in delaware",
    "evidence": "",
    "idx": 157
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'delaware'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the highest point in delaware in meters",
    "evidence": "",
    "idx": 158
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "MATCH (`highlow`:`highlow`)\nWHERE `highlow`.`state_name` = 'delaware'\nRETURN `highlow`.`highest_elevation` AS `highest_elevation`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "how high is the highest point in delaware",
    "evidence": "",
    "idx": 159
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "give me the longest river that passes through the us",
    "evidence": "",
    "idx": 160
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which is the longest river in usa",
    "evidence": "",
    "idx": 161
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the longest river in america",
    "evidence": "",
    "idx": 162
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "name the longest river in us",
    "evidence": "",
    "idx": 163
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what river is the longest one in the united states",
    "evidence": "",
    "idx": 164
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the longest river in the us",
    "evidence": "",
    "idx": 165
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the longest river",
    "evidence": "",
    "idx": 166
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`river_sub0`:`river`)\nRETURN MAX(`river_sub0`.`length`) AS `_col_0`  \n}\nMATCH (`river`:`river`)\nWHERE `river`.`length` = `_col_0`\nRETURN `river`.`river_name` AS `river_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the longest river in the united states",
    "evidence": "",
    "idx": 167
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the city with the largest population",
    "evidence": "",
    "idx": 168
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the largest city",
    "evidence": "",
    "idx": 169
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "which state has the largest city",
    "evidence": "",
    "idx": 170
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`city_sub0`:`city`)\nRETURN MAX(`city_sub0`.`population`) AS `_col_0`  \n}\nMATCH (`city`:`city`)\nWHERE `city`.`population` = `_col_0`\nRETURN `city`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the city with the most population",
    "evidence": "",
    "idx": 171
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state is the biggest",
    "evidence": "",
    "idx": 172
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the state with the largest area",
    "evidence": "",
    "idx": 173
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what state has the largest area",
    "evidence": "",
    "idx": 174
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "what is the biggest state in continental us",
    "evidence": "",
    "idx": 175
  },
  {
    "filename": "train_others.json",
    "db_id": "geo",
    "gql_statement": "CALL(*) {\nMATCH (`state_sub0`:`state`)\nRETURN MAX(`state_sub0`.`area`) AS `_col_0`  \n}\nMATCH (`state`:`state`)\nWHERE `state`.`area` = `_col_0`\nRETURN `state`.`state_name` AS `state_name`",
    "gql_dialect": "cypher",
    "source": "spider_train",
    "nl_query": "state the state with the largest area",
    "evidence": "",
    "idx": 176
  }
]